{
  "key": "jlpt_n3_reading_04",
  "title": "A Samurai’s Dilemma in Modern Japan",
  "titleRomaji": "Gendai Nihon ni okeru samurai no jirenma",
  "titleJp": "現代日本における侍のジレンマ",
  "p_tag": "jlpt_n3",
  "s_tag": "story",
  "shortDescription": "A samurai mysteriously wakes up in present-day Japan and must navigate the complexities of modern life while adhering to the bushido code. The contrast between old and new could help students learn various cultural expressions and idiomatic usage.",
  "shortDescriptionRomaji": "Aru samurai ga gendai no Nihon ni fushigi ni mezame, bushidō ni shitagai nagara gendai seikatsu no fukuzatsusa o norikoeranakereba naranai. Furui mono to atarashii mono no taishō wa, gakusei-tachi ni samazama na bunka hyōgen ya kan'you-teki na tsukai kata o manabaseru tasuke to naru kamoshirenai.",
  "shortDescriptionJp": "ある侍が現代の日本に不思議に目覚め、武士道に従いながら現代生活の複雑さを乗り切らなければならない。古いものと新しいものの対比は、学生たちにさまざまな文化表現や慣用的な使い方を学ばせる助けとなるかもしれない。",
  "textAudio": "/audio/japanese/JLPT_N3_reading_04/JLPT_N3_jp_reading_04.mp3",
  "textAudio_1": "/audio/japanese/JLPT_N3_reading_04/JLPT_N3_jp_reading_04.mp3",
  "textAudioEn": "/audio/japanese/JLPT_N3_reading_04/JLPT_N3_en_reading_04.mp3",
  "textAudioEn_1": "/audio/japanese/JLPT_N3_reading_04/JLPT_N3_en_reading_04.mp3",
  "japaneseText": [
    "東京の中心部で、高い摩天楼と閃光するネオンライトの中、ある早朝、奇妙な光景が繰り広げられた。渋谷の交差点で、古代の侍の服を身にまとった男が立ち尽くし、場違いな石のように、彼を気にも留めない人々の波が彼の周りを潮のように流れていた。",
    "彼の名は武、戦国時代の侍で、何らかの運命のねじれにより、自らが未来に投げ込まれたと気づいた。巨大なテレビスクリーンが騒ぎ、車がクラクションを鳴らす中、武は剣を握りしめ、先祖たちの期待の重みを感じていた。彼は武士道、すなわち名誉、勇気、忠誠を何よりも重んじる侍の規範に従う男であった。彼にとって全く異質なこの世界で、どうやってこれらの価値を守り続けることができるだろうか？",
    "武の最初の挑戦は技術の形をとった。彼は皆が見入っているポケットサイズの装置に驚嘆し、自動ドアに初めて遭遇したときには、魔法使いの手品だと思い込み、戦いの準備をした。慎重な観察を通じて、これらは新時代の日常の便利さに過ぎないことを学んだ。",
    "「この国は奇妙な魔法に支配されている」と武はつぶやき、これらの技を習得するための心のメモを作成した。",
    "日が週に変わるにつれて、武は適応し始めた。彼は自身の武道に対する真摯なアプローチを評価してくれる道場で仕事を見つけ、彼の刀のスキルの実演は人々を引きつけた。子どもたちは驚きの眼差しで彼を見つめ、大人たちは彼の不動の規律と献身に敬意を表した。それでも彼は、かつての生活の単純さと目的に対する悲しみの念を感じた。",
    "社会的交流の複雑さをナビゲートすることは、別の障害となった。武は、侍の直言が現代の感受性にはしばしばあまりにも鋭すぎることを学んだ。彼は自分の言葉を和らげ、建前――真実ではなく、期待されることを言う微妙な芸術――を受け入れることを学ばなければならなかった。これは武士道が要求する正直さとは対照的であり、武は毎日この内なる葛藤に苦しんだ。",
    "しかし、名誉と忠誠に関する現代の解釈こそが、彼を真に試したものであった。今日の企業戦士は、人々よりも利益を重視すると見える会社に忠誠を誓った。武は、自分の時代の明確な忠誠――死ぬまで主君に仕える――を渇望した。彼は、彼のような古い侍にこの新しい世界での居場所があるのかと思い悩んだ。",
    "それでも、武が伝統的な袴を身にまといネオンで照らされた街を歩く中で、武士道は依然として導く光として機能することができると気づいた。彼は時間を超えた方法で武士道の原則を体現し始めた。彼は必要とする人々を守り、自分の信念に固執し、どんなに小さな任務でも名誉を見出した。",
    "結局、武は侍の精神が時間に縛られていないことを理解した。武士道の本質――誠実に生き、他者を尊重し、自己改善に励むこと――は普遍的である。そしておそらく、これが彼の現代日本での役割である：時を超えた価値があること、そして絶えず変化する世界においても、不変であることには名誉があるという生きた思い出となること。"
  ],
  "romanizedText": [
    "Tōkyō no chūshinbu de, takai matenrō to senkō suru neon raito no naka, aru sōchō, kimyō na kōkei ga kurihirogerareta. Shibuya no kōsaten de, kodai no samurai no fuku o mi ni matotta otoko ga tachi tsukushi, bachigai na ishi no yō ni, kare o ki ni mo tomenai hitobito no nami ga kare no mawari o shio no yō ni nagarete ita.",
    "Kare no na wa Takeshi, Sengoku jidai no samurai de, nanraka no unmei no nejire ni yori, mizukara ga mirai ni nagekomareta to kizuita. Kyodai na terebi sukurīn ga sawagi, kuruma ga kurakushon o narasu naka, Takeshi wa ken o nigiri shimete, senzo-tachi no kitai no omomi o kanjite ita. Kare wa bushidō, sunawachi meiyo, yūki, chūsei o nani yori mo omomuku samurai no kihan ni shitagau otoko de atta. Kare ni totte mattaku ijō na kono sekai de, dō yatte korera no kachi o mamori tsuzukeru koto ga dekiru darō ka?",
    "Takeshi no saisho no chōsen wa gijutsu no katachi o totta. Kare wa mina ga miitte iru poketto saizu no sōchi ni kyōtan shi, jidō doa ni hajimete sōgū shita toki ni wa, mahōtsukai no tejina da to omoi konde, tatakai no junbi o shita. Shinchōna kansatsu o tōshite, korera wa shinjidai no nichijō no benrisa ni suginai koto o mananda.",
    "'Kono kuni wa kimyō na mahō ni shihai sarete iru,' to Takeshi wa tsubuyaki, korera no waza o shūtoku suru tame no kokoro no memo o sakusei shita.",
    "Hibi ga shū ni kawaru ni tsurete, Takeshi wa tekiō shi hajimeta. Kare wa jishin no budō ni taisuru shinshi na apurōchi o hyōka shite kureru dōjō de shigoto o mitsuke, kare no katana no sukiru no jitsuen wa hitobito o hikitsuketa. Kodomo-tachi wa odoroki no manazashi de kare o mitsume, otona-tachi wa kare no fudō no kiritsu to kenshin ni keii o hyōshita. Soredemo kare wa, katsute no seikatsu no tanjun-sa to mokuteki ni taisuru kanashimi no nen o kanjita.",
    "Shakai-teki kōryū no fukuzatsusa o nabigēto suru koto wa, betsu no shōgai to natta. Takeshi wa, samurai no jikgen ga gendai no kanjusei ni wa shibashiba amari ni mo surudoi koto o mananda. Kare wa jibun no kotoba o yawarage, tatemae —— shinjitsu dewa naku, kitai sareru koto o iu bimyō na geijutsu —— o ukeire koto o manabanakereba naranakatta. Kore wa bushidō ga yōkyū suru shōjiki-sa to wa taishō-teki de ari, Takeshi wa mainichi kono uchinaru kattō ni kurushinda.",
    "Shikashi, meiyo to chūsei ni kansuru gendai no kaishaku koso ga, kare o shin ni tameshita mono de atta. Kyō no kigyō senshi wa, hitobito yori mo rieki o jūshi suru to mieru kaisha ni chūsei o chikatta. Takeshi wa, jibun no jidai no meikaku na chūsei —— shinu made shukun ni tsukaeru —— o katsubō shita. Kare wa, kare no yō na furui samurai ni kono atarashii sekai de no ibasho ga aru no ka to omoi nayanda.",
    "Soredemo, Takeshi ga dentō-teki na hakama o mi ni matotte neon de terasareta machi o aruku chū de, bushidō wa izen to shite michibiku hikari to shite kinō suru koto ga dekiru to kizuita. Kare wa jikan o koeta hōhō de bushidō no gensoku o tai-gen shi hajimeta. Kare wa hitsuyō to suru hitobito o mamori, jibun no shinnen ni kodawari, donna ni chiisa na ninmu demo meiyo o miidashita.",
    "Kekkyoku, Takeshi wa samurai no seishin ga jikan ni shibararete inai koto o rikai shita. Bushidō no honshitsu —— seijitsu ni iki, taisha o sonkei shi, jiko kaizen ni hagemu koto —— wa fukyū-teki de aru. Soshite osoraku, kore ga kare no gendai Nihon de no yakuwari de aru: Toki o koeta kachi ga aru koto, soshite taemanaku henka suru sekai ni oite mo, fuheng de aru koto ni wa meiyo ga aru to iu ikita omoide to naru koto."
  ],
  "englishTranslation": [
    "In the heart of Tokyo, amidst the towering skyscrapers and flashing neon lights, a peculiar scene unfolded one early morning. A man dressed in the garb of an ancient samurai stood bewildered at the crossing of Shibuya, the sea of people ebbing around him like a tide indifferent to an out-of-place rock.",
    "His name was Takeshi, a samurai from the Sengoku period, who, through some twist of fate, found himself catapulted into the future. As the giant television screens blared and cars honked, Takeshi clutched his sword, the weight of his ancestors' expectations heavy upon him. He was a man of bushido, the samurai code, which dictated honor, courage, and loyalty above all else. How could he uphold these values in a world so alien to him?",
    "Takeshi’s first challenge came in the form of technology. He marveled at the pocket-sized devices everyone seemed to be staring into, and when he first encountered an automatic door, he prepared himself for combat against what he believed to be a sorcerer's trick. He learned, through cautious observation, that these were but everyday conveniences of this new era.",
    "'Strange magic governs this land,' Takeshi muttered, drafting a mental note to master these arts.",
    "As days turned into weeks, Takeshi began to adapt. He found work at a dojo that appreciated his authentic approach to martial arts, and his demonstration of katana skills drew crowds. The children gazed at him with wide-eyed wonder, and adults respected his unwavering discipline and dedication. Yet, he felt a pang of sorrow for the simplicity and purpose of his former life.",
    "Navigating the complexities of social interactions posed another hurdle. Takeshi learned that the directness of a samurai’s speech was often too sharp for modern sensibilities. He had to temper his words, embrace the subtle art of tatemae—saying what was expected rather than what was true. This was in stark contrast to the honesty that bushido demanded, and Takeshi grappled with this inner conflict daily.",
    "However, it was the modern interpretations of honor and loyalty that truly tested him. The corporate warriors of today pledged allegiance to companies that seemed to value profit over people. Takeshi yearned for the clear-cut loyalty of his time, where one served their lord unto death. He wondered if there was a place in this new world for an old samurai like him.",
    "Yet, as Takeshi walked the neon-lit streets in his traditional hakama, he realized that bushido could still serve as a guiding light. He began to embody the principles of the code in ways that transcended time. He protected those in need, stood firm in his convictions, and found honor in every task, no matter how small.",
    "In the end, Takeshi came to see that the spirit of the samurai was not bound by time. The essence of bushido—living with integrity, respecting others, and committing to self-improvement—was universal. And perhaps, this was his role in modern Japan: to be a living reminder that some values are timeless, and even in a world that's constantly changing, there is honor in being steadfast."
  ],
  "readingVocabulary": [
    "摩天楼 (まてんろう) - Matenrō - Skyscraper",
    "閃光 (せんこう) - Senkō - Flashing light",
    "早朝 (そうちょう) - Sōchō - Early morning",
    "交差点 (こうさてん) - Kōsaten - Intersection",
    "戦国時代 (せんごくじだい) - Sengoku jidai - Warring States period (in Japan)",
    "運命のねじれ (うんめいのねじれ) - Unmei no nejire - Twist of fate",
    "武士道 (ぶしどう) - Bushidō - The way of the warrior/samurai",
    "異質 (いしつ) - Ishitsu - Different nature/alien",
    "驚嘆 (きょうたん) - Kyōtan - Astonishment",
    "魔法使い (まほうつかい) - Mahōtsukai - Magician/sorcerer",
    "心のメモ (こころのメモ) - Kokoro no memo - Mental note",
    "適応 (てきおう) - Tekiō - Adaptation",
    "武道 (ぶどう) - Budō - Martial arts",
    "真摯 (しんし) - Shinshi - Sincerity",
    "道場 (どうじょう) - Dōjō - Training hall for martial arts",
    "規律 (きりつ) - Kiritsu - Discipline",
    "献身 (けんしん) - Kenshin - Devotion",
    "単純さ (たんじゅんさ) - Tanjunsa - Simplicity",
    "社会的交流 (しゃかいてきこうりゅう) - Shakai-teki kōryū - Social interaction",
    "直言 (ちょくげん) - Chokugen - Frankness/directness",
    "建前 (たてまえ) - Tatemae - Facade or public face",
    "葛藤 (かっとう) - Kattō - Conflict/struggle",
    "解釈 (かいしゃく) - Kaishaku - Interpretation",
    "企業戦士 (きぎょうせんし) - Kigyō senshi - Corporate warrior",
    "忠誠 (ちゅうせい) - Chūsei - Loyalty",
    "伝統的 (でんとうてき) - Dentō-teki - Traditional",
    "袴 (はかま) - Hakama - Traditional Japanese trousers",
    "導く光 (みちびくひかり) - Michibiku hikari - Guiding light",
    "原則 (げんそく) - Gensoku - Principle",
    "普遍的 (ふへんてき) - Fuhen-teki - Universal"
  ],
  "readingVocabularyEn": [
    "Dilemma (ジレンマ) - 複雑な問題や選択に直面する状況。",
    "Amidst (真っ只中に) - いくつかの物事や人々に囲まれて。",
    "Towering (そびえ立つ) - 非常に高い。",
    "Peculiar (奇妙な) - 普通や一般的ではない、異常。",
    "Bewildered (当惑した) - 混乱している、困惑している。",
    "Ebbing (減退している) - 徐々に減少している。",
    "Indifferent (無関心な) - 関心や興味を示さない。",
    "Catapulted (打ち上げられた) - 突然または強力に送り出された。",
    "Clutched (握りしめた) - 強くつかむ。",
    "Ancestors (先祖たち) - 以前の世代の家族。",
    "Bushido (武士道) - 侍の道徳的な原則。",
    "Alien (異質な) - 違和感がある、よくなじまない。",
    "Marvelled (驚嘆した) - 強い驚きや関心を示す。",
    "Sorcerer (魔法使い) - 魔法を使う人。",
    "Cautious (慎重な) - 危険を避けるために注意深い。",
    "Authentic (本物の) - 本物、真実の、信頼できる。",
    "Unwavering (揺るぎない) - 固く、ぶれない。",
    "Dedication (献身) - 目標や任務に深くコミットしていること。",
    "Pang (悲痛) - 突然の鋭い感情。",
    "Hurdle (障害) - 困難、または乗り越えなければならない障壁。",
    "Directness (直言) - 直接的で率直なこと。",
    "Sensibilities (感受性) - 感じやすさ、繊細さ。",
    "Temper (和らげる) - 穏やかにする、抑える。",
    "Stark (際立った) - 明らかな、はっきりした。",
    "Grappled (取り組んだ) - 困難に直面し、それと戦う。",
    "Allegiance (忠誠) - 忠実さや支持。",
    "Yearned (渇望した) - 強く望む。",
    "Transcended (超越した) - 限界を超える。",
    "Convictions (信念) - 強い信じること。",
    "Steadfast (不動の) - 固く、しっかりとした。"
  ],
  "readingGrammar": [
    "立ち尽くし - This is a form of the verb 立ち尽くす, which means 'to stand stock still' or 'to be at a loss'. The し ending indicates the conjunctive form, which is used to connect clauses. In this case, it suggests the man is standing still while something else is happening around him.",
    "投げ込まれた - This is the passive form of the verb 投げ込む (to throw into). The passive form indicates that the subject, 武 (Takeshi), was thrown into the future, rather than him doing the throwing. It suggests an action that was done to him, which aligns with the text's mention of 'fate's twist'.",
    "握りしめ - This is the conjunctive form of the verb 握りしめる, which means 'to grip tightly.' This form is used to connect this action to another clause, indicating a continuous or simultaneous action.",
    "重んじる - This verb means 'to esteem' or 'to respect'. It's not particularly complex, but the way it's used here to refer to the values of 武士道 (bushido) might be complex for learners.",
    "守り続ける - This is a verb phrase combining 守る (to protect) and 続ける (to continue). When put together, it means 'to continue protecting' or 'to uphold'. It's a common grammatical structure to indicate ongoing action or effort.",
    "驚嘆し - This is the conjunctive form of the verb 驚嘆する, which means 'to marvel' or 'to be astonished'. The し ending here connects this verb to another action or state that follows in the text.",
    "初めて遭遇した - 初めて means 'for the first time,' and 遭遇した is the past tense of 遭遇する, which means 'to encounter.' The grammar point is straightforward but can be difficult for learners to grasp in terms of sentence positioning.",
    "見入っている - This is the ている form of 見入る, which means 'to gaze' or 'to be absorbed in watching something.' This form indicates a continuous action or a state of being.",
    "学ばなければならなかった - This construction is a combination of 学ぶ (to learn), なければならない (must/have to), and the past tense. It indicates an obligation or something that had to be learned in the past.",
    "見出した - This is the past tense of 見出す, which means 'to find' or 'to discover.' In this text, it refers to finding honor in even the smallest of tasks, which is part of the narrative of adapting bushido to modern life."
  ],
  "readingGrammarEn": [
    "Unfolded (展開した) - これは動詞 unfold の過去形で、何かが展開される、または開かれるという意味です。「a peculiar scene unfolded」では、「奇妙な光景が展開した」という意味になります。",
    "Dressed in (着ている) - これは動詞 dress の現在分詞形で、特定の服装をしている状態を表します。「A man dressed in the garb」で、「特定の服装をした男性」という意味です。",
    "Clutched (握りしめた) - これは動詞 clutch の過去形で、強く握りしめる行為を表します。「Takeshi clutched his sword」とあるように、「武士が剣を強く握りしめた」と訳せます。",
    "Marveled at (驚嘆した) - これは動詞 marvel の過去形で、何かに深く感動したり驚嘆したりする様子を示します。「He marveled at the pocket-sized devices」とあるので、「彼は手のひらサイズのデバイスに驚嘆した」となります。",
    "Encountered (遭遇した) - これは動詞 encounter の過去形で、何かに偶然出くわすことを意味します。「when he first encountered an automatic door」という文では、「彼が初めて自動ドアに遭遇した時」という意味です。",
    "Gazed at (じっと見た) - これは動詞 gaze の過去形で、長い間じっと見つめることを意味します。「The children gazed at him」という文では、「子供たちは彼をじっと見た」と訳せます。",
    "Pledged allegiance to (忠誠を誓った) - pledge は「誓う」という動詞で、allegiance は「忠誠」という名詞です。pledged allegiance to で「〜に忠誠を誓う」というフレーズになります。「corporate warriors of today pledged allegiance to companies」とあるので、「今日の企業戦士たちは会社に忠誠を誓った」と訳せます。",
    "Protected (守った) - これは動詞 protect の過去形で、何かを守る行為を表します。「He protected those in need」とあるので、「彼は困っている人々を守った」となります。",
    "Stood firm (固く立った) - stand は「立つ」という動詞で、firm は「しっかりと」という副詞です。stood firm で「しっかりと立つ」または「断固としている」という意味になります。「stood firm in his convictions」とあるので、「彼は自分の信念にしっかりと立った」と訳せます。",
    "Came to see (理解するようになった) - come to は「〜するようになる」というフレーズで、see はここでは「理解する」という意味の動詞です。「Takeshi came to see that the spirit of the samurai was not bound by time」とあるので、「武士の精神は時間に縛られていないことを武士は理解するようになった」と訳せます。"
  ],
  "sentencePayload": [
    {
      "japanese": "東京の中心部で、高い摩天楼と閃光するネオンライトの中、ある早朝、奇妙な光景が繰り広げられた。",
      "romanization": "Tōkyō no chūshinbu de, takai matenrō to senkō suru neon raito no naka, aru sōchō, kimyō na kōkei ga kurihirogerareta.",
      "translation": "In the heart of Tokyo, amidst the towering skyscrapers and flashing neon lights, a peculiar scene unfolded one early morning.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_01.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_01.mp3"
    },
    {
      "japanese": "渋谷の交差点で、古代の侍の服を身にまとった男が立ち尽くし、場違いな石のように、彼を気にも留めない人々の波が彼の周りを潮のように流れていた。",
      "romanization": "Shibuya no kōsaten de, kodai no samurai no fuku o mi ni matotta otoko ga tachi tsukushi, bachigai na ishi no yō ni, kare o ki ni mo tomenai hitobito no nami ga kare no mawari o shio no yō ni nagarete ita.",
      "translation": "At the crossing of Shibuya, a man dressed in the garb of an ancient samurai stood bewildered, the sea of people ebbing around him like a tide indifferent to an out-of-place rock.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_02.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_02.mp3"
    },
    {
      "japanese": "彼の名は武、戦国時代の侍で、何らかの運命のねじれにより、自らが未来に投げ込まれたと気づいた。",
      "romanization": "Kare no na wa Takeshi, Sengoku jidai no samurai de, nanraka no unmei no nejire ni yori, mizukara ga mirai ni nagekomareta to kizuita.",
      "translation": "His name was Takeshi, a samurai from the Sengoku period, who, through some twist of fate, found himself catapulted into the future.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_03.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_03.mp3"
    },
    {
      "japanese": "巨大なテレビスクリーンが騒ぎ、車がクラクションを鳴らす中、武は剣を握りしめ、先祖たちの期待の重みを感じていた。",
      "romanization": "Kyodai na terebi sukurīn ga sawagi, kuruma ga kurakushon o narasu naka, Takeshi wa ken o nigiri shimete, senzo-tachi no kitai no omomi o kanjite ita.",
      "translation": "As the giant television screens blared and cars honked, Takeshi clutched his sword, the weight of his ancestors' expectations heavy upon him.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_04.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_04.mp3"
    },
    {
      "japanese": "彼は武士道、すなわち名誉、勇気、忠誠を何よりも重んじる侍の規範に従う男であった。",
      "romanization": "Kare wa bushidō, sunawachi meiyo, yūki, chūsei o nani yori mo omomuku samurai no kihan ni shitagau otoko de atta.",
      "translation": "He was a man of bushido, the samurai code, which dictated honor, courage, and loyalty above all else.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_05.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_05.mp3"
    },
    {
      "japanese": "彼にとって全く異質なこの世界で、どうやってこれらの価値を守り続けることができるだろうか？",
      "romanization": "Kare ni totte mattaku ijō na kono sekai de, dō yatte korera no kachi o mamori tsuzukeru koto ga dekiru darō ka?",
      "translation": "How could he uphold these values in a world so alien to him?",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_06.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_06.mp3"
    },
    {
      "japanese": "武の最初の挑戦は技術の形をとった。",
      "romanization": "Takeshi no saisho no chōsen wa gijutsu no katachi o totta.",
      "translation": "Takeshi’s first challenge came in the form of technology.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_07.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_07.mp3"
    },
    {
      "japanese": "彼は皆が見入っているポケットサイズの装置に驚嘆し、自動ドアに初めて遭遇したときには、魔法使いの手品だと思い込み、戦いの準備をした。",
      "romanization": "Kare wa mina ga miitte iru poketto saizu no sōchi ni kyōtan shi, jidō doa ni hajimete sōgū shita toki ni wa, mahōtsukai no tejina da to omoi konde, tatakai no junbi o shita.",
      "translation": "He marveled at the pocket-sized devices everyone seemed to be staring into, and when he first encountered an automatic door, he prepared himself for combat against what he believed to be a sorcerer's trick.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_08.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_08.mp3"
    },
    {
      "japanese": "慎重な観察を通じて、これらは新時代の日常の便利さに過ぎないことを学んだ。",
      "romanization": "Shinchōna kansatsu o tōshite, korera wa shinjidai no nichijō no benrisa ni suginai koto o mananda.",
      "translation": "He learned, through cautious observation, that these were but everyday conveniences of this new era.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_09.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_09.mp3"
    },
    {
      "japanese": "「この国は奇妙な魔法に支配されている」と武はつぶやき、これらの技を習得するための心のメモを作成した。",
      "romanization": "'Kono kuni wa kimyō na mahō ni shihai sarete iru,' to Takeshi wa tsubuyaki, korera no waza o shūtoku suru tame no kokoro no memo o sakusei shita.",
      "translation": "'Strange magic governs this land,' Takeshi muttered, drafting a mental note to master these arts.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_10.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_10.mp3"
    },
    {
      "japanese": "日が週に変わるにつれて、武は適応し始めた。",
      "romanization": "Hibi ga shū ni kawaru ni tsurete, Takeshi wa tekiō shi hajimeta.",
      "translation": "As days turned into weeks, Takeshi began to adapt.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_11.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_11.mp3"
    },
    {
      "japanese": "彼は自身の武道に対する真摯なアプローチを評価してくれる道場で仕事を見つけ、彼の刀のスキルの実演は人々を引きつけた。",
      "romanization": "Kare wa jishin no budō ni taisuru shinshi na apurōchi o hyōka shite kureru dōjō de shigoto o mitsuke, kare no katana no sukiru no jitsuen wa hitobito o hikitsuketa.",
      "translation": "He found work at a dojo that appreciated his authentic approach to martial arts, and his demonstration of katana skills drew crowds.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_12.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_12.mp3"
    },
    {
      "japanese": "子どもたちは驚きの眼差しで彼を見つめ、大人たちは彼の不動の規律と献身に敬意を表した。",
      "romanization": "Kodomo-tachi wa odoroki no manazashi de kare o mitsume, otona-tachi wa kare no fudō no kiritsu to kenshin ni keii o hyōshita.",
      "translation": "The children gazed at him with wide-eyed wonder, and adults respected his unwavering discipline and dedication.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_13.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_13.mp3"
    },
    {
      "japanese": "それでも彼は、かつての生活の単純さと目的に対する悲しみの念を感じた。",
      "romanization": "Soredemo kare wa, katsute no seikatsu no tanjun-sa to mokuteki ni taisuru kanashimi no nen o kanjita.",
      "translation": "Yet, he felt a pang of sorrow for the simplicity and purpose of his former life.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_14.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_14.mp3"
    },
    {
      "japanese": "社会的交流の複雑さをナビゲートすることは、別の障害となった。",
      "romanization": "Shakai-teki kōryū no fukuzatsusa o nabigēto suru koto wa, betsu no shōgai to natta.",
      "translation": "Navigating the complexities of social interactions posed another hurdle.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_15.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_15.mp3"
    },
    {
      "japanese": "武は、侍の直言が現代の感受性にはしばしばあまりにも鋭すぎることを学んだ。",
      "romanization": "Takeshi wa, samurai no jikgen ga gendai no kanjusei ni wa shibashiba amari ni mo surudoi koto o mananda.",
      "translation": "Takeshi learned that the directness of a samurai’s speech was often too sharp for modern sensibilities.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_16.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_16.mp3"
    },
    {
      "japanese": "彼は自分の言葉を和らげ、建前——真実ではなく、期待されることを言う微妙な芸術——を受け入れることを学ばなければならなかった。",
      "romanization": "Kare wa jibun no kotoba o yawarage, tatemae —— shinjitsu dewa naku, kitai sareru koto o iu bimyō na geijutsu —— o ukeire koto o manabanakereba naranakatta.",
      "translation": "He had to temper his words, embrace the subtle art of tatemae—saying what was expected rather than what was true.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_17.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_17.mp3"
    },
    {
      "japanese": "これは武士道が要求する正直さとは対照的であり、武は毎日この内なる葛藤に苦しんだ。",
      "romanization": "Kore wa bushidō ga yōkyū suru shōjiki-sa to wa taishō-teki de ari, Takeshi wa mainichi kono uchinaru kattō ni kurushinda.",
      "translation": "This was in stark contrast to the honesty that bushido demanded, and Takeshi grappled with this inner conflict daily.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_18.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_18.mp3"
    },
    {
      "japanese": "しかし、名誉と忠誠に関する現代の解釈こそが、彼を真に試したものであった。",
      "romanization": "Shikashi, meiyo to chūsei ni kansuru gendai no kaishaku koso ga, kare o shin ni tameshita mono de atta.",
      "translation": "However, it was the modern interpretations of honor and loyalty that truly tested him.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_19.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_19.mp3"
    },
    {
      "japanese": "今日の企業戦士は、人々よりも利益を重視すると見える会社に忠誠を誓った。",
      "romanization": "Kyō no kigyō senshi wa, hitobito yori mo rieki o jūshi suru to mieru kaisha ni chūsei o chikatta.",
      "translation": "The corporate warriors of today pledged allegiance to companies that seemed to value profit over people.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_20.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_20.mp3"
    },
    {
      "japanese": "武は、自分の時代の明確な忠誠——死ぬまで主君に仕える——を渇望した。",
      "romanization": "Takeshi wa, jibun no jidai no meikaku na chūsei —— shinu made shukun ni tsukaeru —— o katsubō shita.",
      "translation": "Takeshi yearned for the clear-cut loyalty of his time, where one served their lord unto death.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_21.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_21.mp3"
    },
    {
      "japanese": "彼は、彼のような古い侍にこの新しい世界での居場所があるのかと思い悩んだ。",
      "romanization": "Kare wa, kare no yō na furui samurai ni kono atarashii sekai de no ibasho ga aru no ka to omoi nayanda.",
      "translation": "He wondered if there was a place in this new world for an old samurai like him.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_22.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_22.mp3"
    },
    {
      "japanese": "それでも、武が伝統的な袴を身にまといネオンで照らされた街を歩く中で、武士道は依然として導く光として機能することができると気づいた。",
      "romanization": "Soredemo, Takeshi ga dentō-teki na hakama o mi ni matotte neon de terasareta machi o aruku chū de, bushidō wa izen to shite michibiku hikari to shite kinō suru koto ga dekiru to kizuita.",
      "translation": "Yet, as Takeshi walked the neon-lit streets in his traditional hakama, he realized that bushido could still serve as a guiding light.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_23.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_23.mp3"
    },
    {
      "japanese": "彼は時間を超えた方法で武士道の原則を体現し始めた。",
      "romanization": "Kare wa jikan o koeta hōhō de bushidō no gensoku o tai-gen shi hajimeta.",
      "translation": "He began to embody the principles of the code in ways that transcended time.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_24.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_24.mp3"
    },
    {
      "japanese": "彼は必要とする人々を守り、自分の信念に固執し、どんなに小さな任務でも名誉を見出した。",
      "romanization": "Kare wa hitsuyō to suru hitobito o mamori, jibun no shinnen ni kodawari, donna ni chiisa na ninmu demo meiyo o miidashita.",
      "translation": "He protected those in need, stood firm in his convictions, and found honor in every task, no matter how small.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_25.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_25.mp3"
    },
    {
      "japanese": "結局、武は侍の精神が時間に縛られていないことを理解した。",
      "romanization": "Kekkyoku, Takeshi wa samurai no seishin ga jikan ni shibararete inai koto o rikai shita.",
      "translation": "In the end, Takeshi came to see that the spirit of the samurai was not bound by time.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_26.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_26.mp3"
    },
    {
      "japanese": "武士道の本質——誠実に生き、他者を尊重し、自己改善に励むこと——は普遍的である。",
      "romanization": "Bushidō no honshitsu —— seijitsu ni iki, taisha o sonkei shi, jiko kaizen ni hagemu koto —— wa fukyū-teki de aru.",
      "translation": "The essence of bushido—living with integrity, respecting others, and committing to self-improvement—was universal.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_27.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_27.mp3"
    },
    {
      "japanese": "そしておそらく、これが彼の現代日本での役割である：時を超えた価値があること、そして絶えず変化する世界においても、不変であることには名誉があるという生きた思い出となること。",
      "romanization": "Soshite osoraku, kore ga kare no gendai Nihon de no yakuwari de aru: Toki o koeta kachi ga aru koto, soshite taemanaku henka suru sekai ni oite mo, fuheng de aru koto ni wa meiyo ga aru to iu ikita omoide to naru koto.",
      "translation": "And perhaps, this was his role in modern Japan: to be a living reminder that some values are timeless, and even in a world that's constantly changing, there is honor in being steadfast.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_04/r_jp_28.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_04/r_en_28.mp3"
    }
  ]
}
