{
  "key": "jlpt_n3_reading_05",
  "title": "The Ninja's Day Off",
  "titleRomaji": "Ninja no Kyūjitsu",
  "titleJp": "忍者の休日",
  "p_tag": "jlpt_n3",
  "s_tag": "story",
  "shortDescription": "A comedic tale of a ninja who, on his day off, decides to tour modern Japan while trying to remain incognito, encountering various language mishaps along the way.",
  "shortDescriptionRomaji": "Kyūjitsu o mukaeta ninja ga, gendai no Nihon o kankō shiyō to kimeta komedī-fū no monogatari. Kare wa shokumen o kakushi nagara, tochū de samazama na gengo no shippai ni sōgū shimasu.",
  "shortDescriptionJp": "休日を迎えた忍者が、現代の日本を観光しようと決めたコメディー風の物語。彼は身分を隠しながら、途中で様々な言語の失敗に遭遇します。",
  "textAudio": "/audio/japanese/JLPT_N3_reading_05/JLPT_N3_jp_reading_05.mp3",
  "textAudio_1": "/audio/japanese/JLPT_N3_reading_05/JLPT_N3_jp_reading_05.mp3",
  "textAudioEn": "/audio/japanese/JLPT_N3_reading_05/JLPT_N3_en_reading_05.mp3",
  "textAudioEn_1": "/audio/japanese/JLPT_N3_reading_05/JLPT_N3_en_reading_05.mp3",
  "japaneseText": [
    "京都の広がる街で、古代の寺院が現代のブティックと肩を並べる中、影に身を隠した姿が歩いていました。それは、忍術と戦闘の技に長けた伊賀流の忍者、ヒロシでした。しかし今日は任務や訓練の日ではなく、待ちに待った彼の休日でした。ヒロシは、自分の本当の身分を秘密にしながら、現代の日本を探検することを決心していました。彼はシンプルなフード付きのスウェットとジーンズを着て、一見ただの人間の姿でいました。",
    "最初の立ち寄り先は、流行のカフェでした。手信号や秘密のコードという無声の言語に慣れているヒロシは、外国語のようなコーヒーブレンドのメニューに戸惑いました。彼は試みるように「一つ、カプチーノ？」と言ってみましたが、その言葉は彼の舌にも、泡をトッピングした飲み物が彼の目に見えるほどに奇妙でした。バリスタは彼の正式なお辞儀に面白がりながら、笑顔でカップを手渡しました。ヒロシは不器用に微笑みを返し、彼の本能は何となくカバーを失ったと叫んでいました。",
    "次に、ヒロシは新幹線、日本の高速列車の驚異を体験することにしました。切符売り場に近づくと、様々な選択肢が彼に襲いかかりました。彼は躊躇いながらタッチスクリーンを触り、大きなビープ音が鳴ったときには、半分それが爆発することを期待して飛び退きました。子供が見ていて、ヒロシが機械をもてあそぶのを笑っていました。最終的に、特にどこへ行くわけでもないチケットを手に握りしめ、ヒロシは列車に乗り込み、忍者でさえ走るよりも速く駆け抜ける風景に驚きました。",
    "静けさを求めて、ヒロシは公共の庭園を訪れました。彼は鯉の池や楓の木を賞賛し、周りの静かな美しさと親近感を感じました。しかし、ここにも現代性が侵入していました。一行の観光客が彼にスマートフォンを手渡し、写真を撮ってほしいと頼みました。ヒロシはそれを手裏剣のように持ち、正しい使い方を示すまで観光客の一人が優しく取り戻すまで、手でそれを回しました。出来上がった写真は斜めで、笑顔よりも空が多く写っていましたが、観光客たちは笑って感謝し、彼の本当の職業には気づきませんでした。",
    "日が暮れるにつれ、ヒロシはアーケードにいました。ここでは、ティーンエイジャーたちが仮想現実ゲームで戦っていました。好奇心から、彼はVRヘッドセットをかぶり、自分のステルス攻撃が効かないデジタルの敵に対して手を振り回す自分を発見しました。ゲームから出た彼は、髪は乱れ、眼鏡は斜めになっており、見ているゲーマーたちを楽しませました。",
    "ヒロシの休日は、コミカルなミスアドベンチャーの連続で、それぞれの出会いが彼を現代生活の複雑さと奇妙さにますます戸惑わせました。しかし、笑いと軽い恥ずかしさの下には、彼が影から守っているのと同じくらい美しく愛らしい日本を発見しました。",
    "夜が訪れると、ヒロシは隠れ里に戻りました。彼の心はその日の冒険によって軽くなっていました。彼は、変装と秘密の守り手である忍者でさえ、場違いで時代遅れの単純な混乱の中に喜びを見出すことができると気づきました。そしておそらく、彼は次の休日を楽しみにしていました。再び現代生活という絶えず広がる巻物の中の観光客になるために。"
  ],
  "romanizedText": [
    "Kyōto no hirogaru machi de, kodai no tera ga gendai no butikku to kata o narabe ru naka, kage ni mi o kakushita sugata ga aruite imashita. Sore wa, ninjutsu to sentō no waza ni taketa Iga-ryū no ninja, Hiroshi deshita. Shikashi kyō wa ninmu ya kunren no hi de wa naku, machi ni matta kare no kyūjitsu deshita. Hiroshi wa, jibun no hontō no shokumen o himitsu ni shinagara, gendai no Nihon o tanken suru koto o kesshin shimashita. Kare wa shinpuru na fūdo-tsuki no suetto to jīnzu o kite, ichigen tada no ningen no sugata de imashita.",
    "Saisho no tachiyori-saki wa, ryūkō no kafe deshita. Teshingo ya himitsu no kōdo to iu musei no gengo ni narete iru Hiroshi wa, gaikokugo no yō na kōhī burendo no menyū ni tomadoi mashita. Kare wa tameshi yō ni 'hitotsu, kapuchīno?' to itte mimashita ga, sono kotoba wa kare no shita ni mo, awa o toppingu shita nomimono ga kare no me ni mieru hodo ni kimyō deshita. Barisuta wa kare no seishiki na ojigi ni omoshirogari nagara, egao de kappu o te watashimashita. Hiroshi wa bukiyō ni hohoemi o kaeshi, kare no honnō wa nan to naku kabā o ushinatta to sakebi mashita.",
    "Tsugi ni, Hiroshi wa shinkansen, Nihon no kōsoku ressha no kyōi o taiken suru koto ni shimashita. Kippu-uriba ni chikazuku to, samazama na sentakushi ga kare ni osoi kakarimashita. Kare wa chūchōi nagara tacchi sukuriin o sawari, ōkina bīpu on ga natta toki ni wa, hanbun sore ga bakuhatsu suru koto o kitai shite tobi norimashita. Kodomo ga mite ite, Hiroshi ga kikai o moteasobu no o waratte imashita. Saishūteki ni, toku ni doko e iku wake de mo nai chiketto o te ni nigirishimete, Hiroshi wa ressha ni norikomi, ninja de sae hashiru yori mo hayaku kake nukeru fūkei ni odoroki mashita.",
    "Seikessa o motomete, Hiroshi wa kōkyō no teien o otozuremashita. Kare wa koi no ike ya kaede no ki o shōsan shi, mawari no shizukana utsukushisa to shinkin-kan o kanjimashita. Shikashi, koko ni mo genda-sei ga shin'nyū shiteimashita. Ikko no kankōkyaku ga kare ni sumātofon o tewatashi, shashin o totte hoshii to tanomimashita. Hiroshi wa sore o shuriken no yō ni mochi, tadashii tsukaikata o shimesu made kankōkyaku no hitori ga yasashiku torimodoshu made, te de sore o mawashimashita. Dekiagatta shashin wa naname de, egao yori mo sora ga ōku utsutteimashita ga, kankōkyaku-tachi wa waratte kansha shi, kare no hontō no shokugyō ni wa kidzukimasen deshita.",
    "Hi ga kureru ni tsure, Hiroshi wa ākēdo ni imashita. Koko de wa, tīneijā-tachi ga kasō genjitsu gēmu de tatakatteimashita. Kōkishin kara, kare wa VR heddosetto o kaburi, jibun no suterusu kōgeki ga kikanai dejitaru no teki ni tai shite te o furimawasu jibun o hakken shimashita. Gēmu kara deta kare wa, kami wa midare, megane wa naname ni natte ori, mite iru gēmā-tachi o tanoshimaseteimashita.",
    "Hiroshi no kyūjitsu wa, komikaru na misuadobenchā no renzoku de, sorezore no deai ga kare o gendai seikatsu no fukuzatsu-sa to kimyō-sa ni masumasu tomadowasemashita. Shikashi, warai to karui hazukashisa no shita ni wa, kare ga kage kara mamotte iru no to onaji kurai utsukushiku aiarashii Nihon o hakken shimashita.",
    "Yoru ga otozureru to, Hiroshi wa kakurezato ni modorimashita. Kare no kokoro wa sono hi no bōken ni yotte karuku natteimashita. Kare wa, hensō to himitsu no mamorite de aru ninja de sae, bachigai de jidai okure no tanjun na konran no naka ni yorokobi o miidasu koto ga dekiru to kizukimashita. Soshite osoraku, kare wa tsugi no kyūjitsu o tanoshimi ni shiteimashita. Futatabi gendai seikatsu to iu taezu hirogaru makimono no naka no kankōkyaku ni naru tame ni."
  ],
  "englishTranslation": [
    "In the sprawling city of Kyoto, where ancient temples brush shoulders with modern boutiques, there roamed a figure cloaked in shadows. This was Hiroshi, a ninja of the Iga clan, known for his stealth and prowess in combat. But today was not a day for missions or training; it was his much-anticipated day off. Hiroshi was determined to explore modern Japan while keeping his true identity a secret. He donned a simple hoodie and jeans—a ninja in plain sight.",
    "His first stop was a trendy café. Hiroshi, accustomed to the silent language of hand signals and secret codes, found himself baffled by the menu's array of foreign-sounding coffee blends. 'One... cappuccino?' he ventured, the word feeling as strange on his tongue as the foam-topped drink looked to his eyes. The barista, bemused by his formal bowing, handed him the cup with a smile that Hiroshi returned awkwardly, his instincts screaming that he had somehow blown his cover.",
    "Next, Hiroshi decided to experience the high-speed marvel of the shinkansen, Japan's bullet train. As he approached the ticket machine, a flurry of options bombarded him. He poked at the touchscreen with tentative fingers, jumping back when it beeped loudly, half-expecting it to explode. A child watched, giggling, as Hiroshi fumbled with the machine. Finally, with a ticket to nowhere in particular clutched in his hand, Hiroshi boarded the train and marveled at the landscape that zipped by faster than even a ninja could run.",
    "Eager for tranquility, Hiroshi visited a public garden. He admired the koi ponds and maple trees, feeling a kinship with the quiet beauty around him. Yet, even here, modernity intruded. A group of tourists asked him to take their photo, handing him a smartphone. Hiroshi held the device as if it were a shuriken, turning it over in his hands until one of the tourists gently took it back and showed him the correct way. The resulting photo was askew, with more sky than smiling faces, but the tourists laughed and thanked him, none the wiser to his true profession.",
    "As the day waned, Hiroshi found himself at an arcade, where teenagers battled in virtual reality games. Curious, he donned a VR headset, only to find himself flailing against digital enemies that were immune to his stealth attacks. He emerged from the game with his hair askew and glasses askance, much to the amusement of the onlooking gamers.",
    "Hiroshi's day off was a series of comic misadventures, each encounter leaving him more bemused by the complexities and oddities of contemporary life. Yet, beneath the laughter and the mild embarrassments, he discovered a Japan that was as beautiful and endearing as the one he protected from the shadows.",
    "As night fell, Hiroshi returned to his hidden village, his spirit lightened by the day's escapades. He realized that even a ninja, master of disguise and keeper of secrets, could find joy in the simple confusion of being out of place and time. And perhaps, just perhaps, he looked forward to his next day off, to once again become a tourist in the ever-unfolding scroll of modern life."
  ],
  "readingVocabulary": [
    "忍術 (にんじゅつ) - Ninjutsu - Ninja techniques",
    "戦闘 (せんとう) - Sentō - Combat",
    "長けた (たけた) - Taketa - Excelled, skilled",
    "伊賀流 (いがりゅう) - Iga-ryū - Iga style (a school of ninjutsu)",
    "決心 (けっしん) - Kesshin - Determination",
    "探検 (たんけん) - Tanken - Exploration",
    "無声 (むせい) - Musei - Silent",
    "戸惑い (とまどい) - Tomadoi - Bewilderment, confusion",
    "泡 (あわ) - Awa - Foam",
    "正式 (せいしき) - Seishiki - Formal",
    "お辞儀 (おじぎ) - Ojigi - Bow",
    "高速列車 (こうそくれっしゃ) - Kōsoku ressha - High-speed train",
    "驚異 (きょうい) - Kyōi - Marvel, wonder",
    "切符売り場 (きっぷうりば) - Kippu uriba - Ticket counter",
    "襲いかかる (おそいかかる) - Osoi kakaru - To attack, to assail",
    "躊躇う (ためらう) - Tamerau - To hesitate",
    "手裏剣 (しゅりけん) - Shuriken - Ninja star",
    "観光客 (かんこうきゃく) - Kankōkyaku - Tourist",
    "斜め (ななめ) - Naname - Diagonal, slanted",
    "撮影 (さつえい) - Satsuei - Photography, filming",
    "仮想現実 (かそうげんじつ) - Kasō genjitsu - Virtual reality",
    "ステルス (すてるす) - Suterusu - Stealth",
    "敵 (てき) - Teki - Enemy",
    "乱れる (みだれる) - Midareru - To be disordered, disheveled",
    "眼鏡 (めがね) - Megane - Glasses",
    "ゲーマー (げーまー) - Gēmā - Gamer",
    "ミスアドベンチャー (みすあどべんちゃー) - Misuadobenchā - Misadventure",
    "複雑さ (ふくざつさ) - Fukuzatsusa - Complexity",
    "恥ずかしさ (はずかしさ) - Hazukashisa - Embarrassment",
    "変装 (へんそう) - Hensō - Disguise"
  ],
  "readingVocabularyEn": [
    "sprawling (広がる) - 京都のような広がる都市。",
    "ancient (古代の) - 古代の寺院。",
    "modern (現代の) - 現代のブティック。",
    "cloaked (隠れた) - 影に隠れた姿。",
    "stealth (隠密) - 彼の隠密と戦闘の技。",
    "prowess (優れた技術) - 戦闘における優れた技術。",
    "anticipated (待ち望まれた) - 待ち望まれた休日。",
    "identity (身分) - 真の身分。",
    "hoodie (フード付きのスウェット) - シンプルなフード付きのスウェット。",
    "trendy (流行の) - 流行のカフェ。",
    "baffled (当惑した) - メニューに当惑した。",
    "foreign-sounding (外国語のような) - 外国語のようなコーヒーブレンド。",
    "ventured (冒険した) - 「一つ、カプチーノ？」と冒険して言った。",
    "bemused (困惑した) - 彼の正式なお辞儀に困惑したバリスタ。",
    "awkwardly (不器用に) - 不器用に微笑を返した。",
    "flurry (一斉に) - 一斉に彼に襲いかかる選択肢。",
    "tentative (試みの) - 試みの指でタッチスクリーンを触った。",
    "marveled (驚嘆した) - 風景に驚嘆した。",
    "tranquility (静けさ) - 静けさを求めて。",
    "admired (賞賛した) - 鯉の池や楓の木を賞賛した。",
    "modernity (現代性) - ここにも現代性が侵入していた。",
    "smartphone (スマートフォン) - スマートフォンを手渡された。",
    "askew (斜めの) - 斜めの写真。",
    "arcade (ゲームセンター) - ゲームセンターにいた。",
    "virtual reality (仮想現実) - 仮想現実ゲームで戦った。",
    "immune (免疫がある) - 彼の隠密攻撃に免疫があるデジタルの敵。",
    "misadventures (災難) - コミカルな災難の連続。",
    "bemused (当惑した) - 現代生活の複雑さにますます当惑した。",
    "escapades (冒険) - その日の冒険によって心が軽くなった。",
    "disguise (変装) - 変装と秘密を守る忍者。"
  ],
  "readingGrammar": [
    "〜と肩を並べる (〜とかたをならべる) - 'to be on par with' or 'to stand shoulder to shoulder with.' This expression is used to show that two things are at the same level or are happening side by side.",
    "影に身を隠した (かげにみをかくした) - 'hid oneself in the shadows.' This phrase combines '影に' (in the shadows) and '身を隠す' (to hide oneself), illustrating how someone is concealing their presence, a common ninja reference.",
    "〜しながら (〜しながら) - 'while doing.' This grammar point indicates doing something concurrently with another action. In this case, '秘密にしながら' means keeping it a secret while doing other activities.",
    "〜ことを決心していました (〜ことをけっしんしていました) - 'had decided to.' This construction expresses a firm decision made in the past about an action.",
    "〜ように言ってみました (〜ようにいってみました) - 'tried to say.' The phrase 'ように' means 'in such a way that,' and '言ってみる' means 'try to say.' Together, they indicate an attempt at speaking.",
    "〜ときには (〜ときには) - 'when... at times.' This pattern is used to refer to what happens in particular moments or situations. It's a conditional phrase indicating something that occurs under certain circumstances.",
    "〜を期待して (〜をきたいして) - 'expecting that.' This is used to express the speaker's anticipation or expectation of something.",
    "〜に襲いかかりました (〜におそいかかりました) - 'attacked.' This phrase combines 'に' (toward) with '襲いかかる' (to attack), indicating a sudden or aggressive action towards someone or something.",
    "〜を賞賛し (〜をしょうさんし) - 'praised' or 'admired.' This is a verb form used to describe the act of expressing admiration or praise for something.",
    "〜に気づきました (〜にきづきました) - 'realized' or 'noticed.' The verb '気づく' in past tense indicates the realization or recognition of something that had previously not been in the speaker's awareness."
  ],
  "readingGrammarEn": [
    "'where ancient temples brush shoulders with modern boutiques' - この文では 'where' は関係副詞として使われており、場所を説明しています。「古代の寺院が現代のブティックと肩を並べる場所」という意味です。",
    "'roamed a figure' - この 'roamed' は過去形で、主語 'a figure' が動いていた行動を示しています。「ある人影が歩き回っていた」という意味です。",
    "'was known for' - 'be known for' は「〜で知られている」という意味の受動態の表現です。「彼は隠密と戦闘の技で知られていた」という意味になります。",
    "'was determined to' - 'be determined to' は「〜することを決意している」という意味です。「ヒロシは現代の日本を探検することを決意していた」という意味になります。",
    "'donned a simple hoodie and jeans' - 'donned' は「着る」という意味の少し古風な表現で、ここでは過去形で使われています。「シンプルなフード付きのスウェットとジーンズを着た」という意味です。",
    "'found himself baffled by' - 'find oneself + 形容詞' は「〜という状態に気づく」という意味で、ここでは 'baffled'（当惑した）と共に使われています。「メニューに当惑していると気づいた」という意味です。",
    "'he ventured' - 'venture' は「思い切って〜する」という意味で、過去形で「彼は思い切って言ってみた」という意味になります。",
    "'as if it were a shuriken' - 'as if' は「まるで〜であるかのように」という意味で、仮定法を作るために使われます。「まるでそれが手裏剣であるかのように」という意味です。",
    "'was askew' - 'askew' は「斜めに」という意味の形容詞で、ここでは 'was' と共に使われています。「写真が斜めだった」という意味です。",
    "'none the wiser to his true profession' - 'none the wiser' は「それでもまだ何も知らない」という意味の表現で、'to his true profession' は彼の本当の職業に関することを指しています。「彼の本当の職業についてまだ何も知らない」という意味です。"
  ],
  "sentencePayload": [
    {
      "japanese": "京都の広がる街で、古代の寺院が現代のブティックと肩を並べる中、影に身を隠した姿が歩いていました。",
      "romanization": "Kyōto no hirogaru machi de, kodai no tera ga gendai no butikku to kata o narabe ru naka, kage ni mi o kakushita sugata ga aruite imashita.",
      "translation": "In the sprawling city of Kyoto, where ancient temples brush shoulders with modern boutiques, there roamed a figure cloaked in shadows.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_01.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_01.mp3"
    },
    {
      "japanese": "それは、忍術と戦闘の技に長けた伊賀流の忍者、ヒロシでした。",
      "romanization": "Sore wa, ninjutsu to sentō no waza ni taketa Iga-ryū no ninja, Hiroshi deshita.",
      "translation": "This was Hiroshi, a ninja of the Iga clan, known for his stealth and prowess in combat.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_02.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_02.mp3"
    },
    {
      "japanese": "しかし今日は任務や訓練の日ではなく、待ちに待った彼の休日でした。",
      "romanization": "Shikashi kyō wa ninmu ya kunren no hi de wa naku, machi ni matta kare no kyūjitsu deshita.",
      "translation": "But today was not a day for missions or training; it was his much-anticipated day off.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_03.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_03.mp3"
    },
    {
      "japanese": "ヒロシは、自分の本当の身分を秘密にしながら、現代の日本を探検することを決心していました。",
      "romanization": "Hiroshi wa, jibun no hontō no shokumen o himitsu ni shinagara, gendai no Nihon o tanken suru koto o kesshin shimashita.",
      "translation": "Hiroshi was determined to explore modern Japan while keeping his true identity a secret.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_04.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_04.mp3"
    },
    {
      "japanese": "彼はシンプルなフード付きのスウェットとジーンズを着て、一見ただの人間の姿でいました。",
      "romanization": "Kare wa shinpuru na fūdo-tsuki no suetto to jīnzu o kite, ichigen tada no ningen no sugata de imashita.",
      "translation": "He donned a simple hoodie and jeans—a ninja in plain sight.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_05.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_05.mp3"
    },
    {
      "japanese": "最初の立ち寄り先は、流行のカフェでした。",
      "romanization": "Saisho no tachiyori-saki wa, ryūkō no kafe deshita.",
      "translation": "His first stop was a trendy café.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_06.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_06.mp3"
    },
    {
      "japanese": "手信号や秘密のコードという無声の言語に慣れているヒロシは、外国語のようなコーヒーブレンドのメニューに戸惑いました。",
      "romanization": "Teshingo ya himitsu no kōdo to iu musei no gengo ni narete iru Hiroshi wa, gaikokugo no yō na kōhī burendo no menyū ni tomadoi mashita.",
      "translation": "Hiroshi, accustomed to the silent language of hand signals and secret codes, found himself baffled by the menu's array of foreign-sounding coffee blends.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_07.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_07.mp3"
    },
    {
      "japanese": "彼は試みるように「一つ、カプチーノ？」と言ってみましたが、その言葉は彼の舌にも、泡をトッピングした飲み物が彼の目に見えるほどに奇妙でした。",
      "romanization": "Kare wa tameshi yō ni 'hitotsu, kapuchīno?' to itte mimashita ga, sono kotoba wa kare no shita ni mo, awa o toppingu shita nomimono ga kare no me ni mieru hodo ni kimyō deshita.",
      "translation": "'One... cappuccino?' he ventured, the word feeling as strange on his tongue as the foam-topped drink looked to his eyes.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_08.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_08.mp3"
    },
    {
      "japanese": "バリスタは彼の正式なお辞儀に面白がりながら、笑顔でカップを手渡しました。",
      "romanization": "Barisuta wa kare no seishiki na ojigi ni omoshirogari nagara, egao de kappu o te watashimashita.",
      "translation": "The barista, bemused by his formal bowing, handed him the cup with a smile.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_09.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_09.mp3"
    },
    {
      "japanese": "ヒロシは不器用に微笑みを返し、彼の本能は何となくカバーを失ったと叫んでいました。",
      "romanization": "Hiroshi wa bukiyō ni hohoemi o kaeshi, kare no honnō wa nan to naku kabā o ushinatta to sakebi mashita.",
      "translation": "Hiroshi returned the smile awkwardly, his instincts screaming that he had somehow blown his cover.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_10.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_10.mp3"
    },
    {
      "japanese": "次に、ヒロシは新幹線、日本の高速列車の驚異を体験することにしました。",
      "romanization": "Tsugi ni, Hiroshi wa shinkansen, Nihon no kōsoku ressha no kyōi o taiken suru koto ni shimashita.",
      "translation": "Next, Hiroshi decided to experience the high-speed marvel of the shinkansen, Japan's bullet train.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_11.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_11.mp3"
    },
    {
      "japanese": "切符売り場に近づくと、様々な選択肢が彼に襲いかかりました。",
      "romanization": "Kippu-uriba ni chikazuku to, samazama na sentakushi ga kare ni osoi kakarimashita.",
      "translation": "As he approached the ticket machine, a flurry of options bombarded him.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_12.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_12.mp3"
    },
    {
      "japanese": "彼は躊躇いながらタッチスクリーンを触り、大きなビープ音が鳴ったときには、半分それが爆発することを期待して飛び退きました。",
      "romanization": "Kare wa chūchōi nagara tacchi sukuriin o sawari, ōkina bīpu on ga natta toki ni wa, hanbun sore ga bakuhatsu suru koto o kitai shite tobi norimashita.",
      "translation": "He poked at the touchscreen with tentative fingers, jumping back when it beeped loudly, half-expecting it to explode.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_13.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_13.mp3"
    },
    {
      "japanese": "子供が見ていて、ヒロシが機械をもてあそぶのを笑っていました。",
      "romanization": "Kodomo ga mite ite, Hiroshi ga kikai o moteasobu no o waratte imashita.",
      "translation": "A child watched, giggling, as Hiroshi fumbled with the machine.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_14.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_14.mp3"
    },
    {
      "japanese": "最終的に、特にどこへ行くわけでもないチケットを手に握りしめ、ヒロシは列車に乗り込み、忍者でさえ走るよりも速く駆け抜ける風景に驚きました。",
      "romanization": "Saishūteki ni, toku ni doko e iku wake de mo nai chiketto o te ni nigirishimete, Hiroshi wa ressha ni norikomi, ninja de sae hashiru yori mo hayaku kake nukeru fūkei ni odoroki mashita.",
      "translation": "Finally, with a ticket to nowhere in particular clutched in his hand, Hiroshi boarded the train and marveled at the landscape that zipped by faster than even a ninja could run.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_15.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_15.mp3"
    },
    {
      "japanese": "静けさを求めて、ヒロシは公共の庭園を訪れました。",
      "romanization": "Seikessa o motomete, Hiroshi wa kōkyō no teien o otozuremashita.",
      "translation": "Eager for tranquility, Hiroshi visited a public garden.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_16.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_16.mp3"
    },
    {
      "japanese": "彼は鯉の池や楓の木を賞賛し、周りの静かな美しさと親近感を感じました。",
      "romanization": "Kare wa koi no ike ya kaede no ki o shōsan shi, mawari no shizukana utsukushisa to shinkin-kan o kanjimashita.",
      "translation": "He admired the koi ponds and maple trees, feeling a kinship with the quiet beauty around him.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_17.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_17.mp3"
    },
    {
      "japanese": "しかし、ここにも現代性が侵入していました。",
      "romanization": "Shikashi, koko ni mo genda-sei ga shin'nyū shiteimashita.",
      "translation": "Yet, even here, modernity intruded.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_18.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_18.mp3"
    },
    {
      "japanese": "一行の観光客が彼にスマートフォンを手渡し、写真を撮ってほしいと頼みました。",
      "romanization": "Ikko no kankōkyaku ga kare ni sumātofon o tewatashi, shashin o totte hoshii to tanomimashita.",
      "translation": "A group of tourists asked him to take their photo, handing him a smartphone.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_19.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_19.mp3"
    },
    {
      "japanese": "ヒロシはそれを手裏剣のように持ち、正しい使い方を示すまで観光客の一人が優しく取り戻すまで、手でそれを回しました。",
      "romanization": "Hiroshi wa sore o shuriken no yō ni mochi, tadashii tsukaikata o shimesu made kankōkyaku no hitori ga yasashiku torimodoshu made, te de sore o mawashimashita.",
      "translation": "Hiroshi held the device as if it were a shuriken, turning it over in his hands until one of the tourists gently took it back and showed him the correct way.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_20.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_20.mp3"
    },
    {
      "japanese": "出来上がった写真は斜めで、笑顔よりも空が多く写っていましたが、観光客たちは笑って感謝し、彼の本当の職業には気づきませんでした。",
      "romanization": "Dekiagatta shashin wa naname de, egao yori mo sora ga ōku utsutteimashita ga, kankōkyaku-tachi wa waratte kansha shi, kare no hontō no shokugyō ni wa kidzukimasen deshita.",
      "translation": "The resulting photo was askew, with more sky than smiling faces, but the tourists laughed and thanked him, none the wiser to his true profession.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_21.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_21.mp3"
    },
    {
      "japanese": "日が暮れるにつれ、ヒロシはアーケードにいました。",
      "romanization": "Hi ga kureru ni tsure, Hiroshi wa ākēdo ni imashita.",
      "translation": "As the day waned, Hiroshi found himself at an arcade.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_22.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_22.mp3"
    },
    {
      "japanese": "ここでは、ティーンエイジャーたちが仮想現実ゲームで戦っていました。",
      "romanization": "Koko de wa, tīneijā-tachi ga kasō genjitsu gēmu de tatakatteimashita.",
      "translation": "Here, teenagers battled in virtual reality games.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_23.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_23.mp3"
    },
    {
      "japanese": "好奇心から、彼はVRヘッドセットをかぶり、自分のステルス攻撃が効かないデジタルの敵に対して手を振り回す自分を発見しました。",
      "romanization": "Kōkishin kara, kare wa VR heddosetto o kaburi, jibun no suterusu kōgeki ga kikanai dejitaru no teki ni tai shite te o furimawasu jibun o hakken shimashita.",
      "translation": "Curious, he donned a VR headset, only to find himself flailing against digital enemies that were immune to his stealth attacks.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_24.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_24.mp3"
    },
    {
      "japanese": "ゲームから出た彼は、髪は乱れ、眼鏡は斜めになっており、見ているゲーマーたちを楽しませました。",
      "romanization": "Gēmu kara deta kare wa, kami wa midare, megane wa naname ni natte ori, mite iru gēmā-tachi o tanoshimaseteimashita.",
      "translation": "He emerged from the game with his hair askew and glasses askance, much to the amusement of the onlooking gamers.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_25.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_25.mp3"
    },
    {
      "japanese": "ヒロシの休日は、コミカルなミスアドベンチャーの連続で、それぞれの出会いが彼を現代生活の複雑さと奇妙さにますます戸惑わせました。",
      "romanization": "Hiroshi no kyūjitsu wa, komikaru na misuadobenchā no renzoku de, sorezore no deai ga kare o gendai seikatsu no fukuzatsu-sa to kimyō-sa ni masumasu tomadowasemashita.",
      "translation": "Hiroshi's day off was a series of comic misadventures, each encounter leaving him more bemused by the complexities and oddities of contemporary life.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_26.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_26.mp3"
    },
    {
      "japanese": "しかし、笑いと軽い恥ずかしさの下には、彼が影から守っているのと同じくらい美しく愛らしい日本を発見しました。",
      "romanization": "Shikashi, warai to karui hazukashisa no shita ni wa, kare ga kage kara mamotte iru no to onaji kurai utsukushiku aiarashii Nihon o hakken shimashita.",
      "translation": "Yet, beneath the laughter and the mild embarrassments, he discovered a Japan that was as beautiful and endearing as the one he protected from the shadows.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_27.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_27.mp3"
    },
    {
      "japanese": "夜が訪れると、ヒロシは隠れ里に戻りました。",
      "romanization": "Yoru ga otozureru to, Hiroshi wa kakurezato ni modorimashita.",
      "translation": "As night fell, Hiroshi returned to his hidden village.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_28.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_28.mp3"
    },
    {
      "japanese": "彼の心はその日の冒険によって軽くなっていました。",
      "romanization": "Kare no kokoro wa sono hi no bōken ni yotte karuku natteimashita.",
      "translation": "His spirit lightened by the day's escapades.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_29.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_29.mp3"
    },
    {
      "japanese": "彼は、変装と秘密の守り手である忍者でさえ、場違いで時代遅れの単純な混乱の中に喜びを見出すことができると気づきました。",
      "romanization": "Kare wa, hensō to himitsu no mamorite de aru ninja de sae, bachigai de jidai okure no tanjun na konran no naka ni yorokobi o miidasu koto ga dekiru to kizukimashita.",
      "translation": "He realized that even a ninja, master of disguise and keeper of secrets, could find joy in the simple confusion of being out of place and time.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_30.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_30.mp3"
    },
    {
      "japanese": "そしておそらく、彼は次の休日を楽しみにしていました。",
      "romanization": "Soshite osoraku, kare wa tsugi no kyūjitsu o tanoshimi ni shiteimashita.",
      "translation": "And perhaps, just perhaps, he looked forward to his next day off.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_31.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_31.mp3"
    },
    {
      "japanese": "再び現代生活という絶えず広がる巻物の中の観光客になるために。",
      "romanization": "Futatabi gendai seikatsu to iu taezu hirogaru makimono no naka no kankōkyaku ni naru tame ni.",
      "translation": "To once again become a tourist in the ever-unfolding scroll of modern life.",
      "audioPath": "/audio/japanese/JLPT_N3_reading_05/r_jp_32.mp3",
      "audioPathEn": "/audio/japanese/JLPT_N3_reading_05/r_en_32.mp3"
    }
  ]
}
