[
  {
    "japanese": "2137年、地球はほとんどの天然資源を使い果たし。",
    "romanization": "2137-nen, Chikyū wa hotondo no tennen shigen o tsukaihatashi.",
    "translation": "In 2137, Earth had exhausted most of its natural resources.",
    "audioPath": "/audio/japanese/reading_1/r_1.mp3"
  },
  {
    "japanese": "人類を宇宙の空間での救済を探るように駆り立てました。",
    "romanization": "Jinrui o uchū no kūkan de no kyūsai o saguru yō ni karitatemashita.",
    "translation": "It compelled humanity to probe the void of space in search of salvation.",
    "audioPath": "/audio/japanese/reading_1/r_2.mp3"
  },
  {
    "japanese": "スターシップAeolisは、生命の潜在的な兆候を示している最近発見された太陽系外惑星、Zephyriaを調査するために銀河の外縁に派遣されました。",
    "romanization": "Sutāshippu Aeolis wa, seimei no senzai-tekina chōkō o shimeshite iru saikin hakken sareta taiyōkeigai wakusei, Zephyria o chōsa suru tame ni ginga no gaien ni haken saremashita.",
    "translation": "Starship Aeolis was dispatched to the outer edges of the galaxy to investigate Zephyria, a recently discovered exoplanet showing potential signs of life.",
    "audioPath": "/audio/japanese/reading_1/r_3.mp3"
  },
  {
    "japanese": "このミッションには、資源だけでなく、新しい家としての潜在的な可能性もかかっていました。",
    "romanization": "Kono misshon ni wa, shigen dake de naku, atarashī ie toshite no senzai-tekina kanōsei mo kakatte imashita.",
    "translation": "This mission was not just about resources, but also about the potential of a new home.",
    "audioPath": "/audio/japanese/reading_1/r_4.mp3"
  },
  {
    "japanese": "AeolisがZephyriaに接近すると、初期のスキャンは有望な絵を描きました：広大な海、密な森、そして地球の大気と驚くほど似ている。",
    "romanization": "Aeolis ga Zephyria ni sekkin suru to, shoki no sukan wa yūbōna e o egakimashita: kōdana umi, mitsuna mori, soshite chikyū no taiki to odoroku hodo nite iru.",
    "translation": "As Aeolis approached Zephyria, the initial scans painted a promising picture: vast seas, dense forests, and an atmosphere strikingly similar to Earth's.",
    "audioPath": "/audio/japanese/reading_1/r_5.mp3"
  },
  {
    "japanese": "しかし、一つの異常が乗組員の興味を引きました - 巨大な単一のモノリス構造、対称的で鋭い、空を突き刺すように。",
    "romanization": "Shikashi, hitotsu no ijō ga norikumiin no kyōmi o hikimashita - kyodai na tan'itsu no monorisu kōzō, taishōteki de surudoi, sora o tsukisasu yō ni.",
    "translation": "However, one anomaly caught the crew's interest - a massive singular monolithic structure, symmetrical and sharp, piercing the sky.",
    "audioPath": "/audio/japanese/reading_1/r_6.mp3"
  },
  {
    "japanese": "これは自然に形成されるものではなく、明らかに何者かの手によって作られました。",
    "romanization": "Kore wa shizen ni keisei sareru mono de wa naku, akiraka ni nanimono ka no te ni yotte tsukuraremashita.",
    "translation": "This was not something formed naturally, but clearly crafted by someone or something.",
    "audioPath": "/audio/japanese/reading_1/r_7.mp3"
  },
  {
    "japanese": "探査隊は近づいて詳細を調査することを決定しました。",
    "romanization": "Tansa-tai wa chikazuite shōsai o chōsa suru koto o kettei shimashita.",
    "translation": "The exploration team decided to approach and investigate in detail.",
    "audioPath": "/audio/japanese/reading_1/r_8.mp3"
  },
  {
    "japanese": "彼らがモノリスの基盤に到達すると、古代の文字が刻まれているのを発見しました。",
    "romanization": "Karera ga monorisu no kiban ni tōtatsu suru to, kodai no moji ga kizamarete iru no o hakken shimashita.",
    "translation": "Upon reaching the base of the monolith, they discovered ancient characters engraved on it.",
    "audioPath": "/audio/japanese/reading_1/r_9.mp3"
  },
  {
    "japanese": "これらの文字は、地球上のどの言語とも一致しませんでした。",
    "romanization": "Korera no moji wa, Chikyū-jō no dono gengo tomo icchi shimasendeshita.",
    "translation": "These characters did not match any language known on Earth.",
    "audioPath": "/audio/japanese/reading_1/r_10.mp3"
  }
]
