[
  {
    "title": "~게 되다 [ge doeda] (End up doing)",
    "short_explanation": "Used to express events or actions that occur unintentionally or as a result of another event or circumstance.",
    "long_explanation": "'~게 되다 [ge doeda]' is a grammar point in Korean used to indicate outcomes that are primarily out of the speaker's control, often unexpected or resulted due to certain circumstances or events. It conveys the sense of 'end up doing' or 'come to do' in English. It is used to express a change or transition, the result of an event, or to describe the inevitable outcome of a certain situation.",
    "formation": "Verb Stem + 게 되다",
    "examples": [
      {
        "kr": "시험 공부를 하다가 잠이 들어서 결국은 벼락치기를 하게 되었어요.",
        "romaji": "Siheom gongbureul hadaga jami deureoseo gyeolgugeun byeorakchigireul hage doeeotseoyo.",
        "en": "I fell asleep while studying for the exam, and ended up cramming at the last minute.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_doeda_End_up_doing_20231230_시험_공부를_하다가_잠이_들어서_결국은_벼락치기를_하게_되었어요.mp3"
      },
      {
        "kr": "팀원들이 모두 바빠서 저 혼자 발표 준비를 다 하게 되었어요.",
        "romaji": "Timweondeuli modu bappaseo jeo honja balpyo junbireul da hage doeeotseoyo.",
        "en": "All team members were busy, so I ended up preparing the presentation all by myself.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_doeda_End_up_doing_20231230_팀원들이_모두_바빠서_저_혼자_발표_준비를_다_하게_되었어요.mp3"
      },
      {
        "kr": "지갑을 잃어버려서 엄마에게 돈을 빌려야 하게 되었어요.",
        "romaji": "Jigabeul ilheobeoryeoseo eommaege doneul billyeoya hage doeeotseoyo.",
        "en": "I lost my wallet, so I ended up having to borrow money from my mother.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_doeda_End_up_doing_20231230_지갑을_잃어버려서_엄마에게_돈을_빌려야_하게_되었어요.mp3"
      },
      {
        "kr": "티켓이 매진되어 결국은 그 콘서트를 보지 못하게 되었어요.",
        "romaji": "Tiket-i maejin doeeo gyeolgug-eun geu konsoteu leul boji mothage doeeotseoyo.",
        "en": "The tickets sold out, so I ended up not being able to see that concert.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_doeda_End_up_doing_20231230_티켓이_매진되어_결국은_그_콘서트를_보지_못하게_되었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~게 하다 [ge hada] (Make/let someone do)",
    "short_explanation": "This is a way to indicate that you are making or allowing someone else do something.",
    "long_explanation": "`~게 하다 [ge hada]` is a Korean grammar form used to express that someone is making or allowing someone else to do something. This structure often indicates a persuading, ordering, permitting, or causing action to happen. In English, it's similar to the expressions 'make someone do something' or 'let someone do something'.",
    "formation": "Verb Stem + 게 + 하다",
    "examples": [
      {
        "kr": "엄마는 저를 매일 한 시간 동안 피아노를 연습하게 했어요.",
        "romaji": "Eommaneun jeoreul maeil han shigan dongan pianoreul yeonseuphage haesseoyo.",
        "en": "My mother made me practice the piano for an hour every day.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make/let_someone_do_20231230_엄마는_저를_매일_한_시간_동안_피아노를_연습하게_했어요.mp3"
      },
      {
        "kr": "선생님은 학생들이 공부하게 했는데, 그것이 좋은 성적을 받을 수 있는 유일한 방법이라고 생각했어요.",
        "romaji": "Seonsaengnimeun hagsaengdeul-i gongbu hage haessneunde, geugeos-i joheun seongjeog-eul bad-eul su issneun yuilhan bangbeob-ilago saeng-gaghaess-eoyo.",
        "en": "The teacher made the students study, thinking that it was the only way to get good grades.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make/let_someone_do_20231230_선생님은_학생들이_공부하게_했는데_그것이_좋은_성적을_받을_수_있는_유일한_방법이라고_생각했어요.mp3"
      },
      {
        "kr": "아버지는 저를 이 일에 대해 생각하게 했습니다, 이 일은 중요한 결정을 필요로 하고 있었습니다.",
        "romaji": "Abeojineun jeoreul i ire daehae saenggakhage haessseubnida, i ireun jung-yohan gyeoljeong-eul piryo-ro hago isseossseubnida.",
        "en": "My father made me think about this matter, it required an important decision.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make/let_someone_do_20231230_아버지는_저를_이_일에_대해_생각하게_했습니다_이_일은_중요한_결정을_필요로_하고_있었습니다.mp3"
      },
      {
        "kr": "나는 내 친구에게 서울에 간다고 말하게 했습니다, 그는 그 정보를 알아야 했습니다.",
        "romaji": "Naneun nae chingu-ege seoul-e gandago mal hage haessseubnida, geuneun geu jeongbo-reul al-a-ya haessseubnida.",
        "en": "I made my friend say that he is going to Seoul, he needed to know that information.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make/let_someone_do_20231230_나는_내_친구에게_서울에_간다고_말하게_했습니다_그는_그_정보를_알아야_했습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~고 싶다 [go sipda] (Want to do)",
    "short_explanation": "Used to express a desire or a wish.",
    "long_explanation": "'~고 싶다 [go sipda]' is a grammatical form used to express a person's desire or wish to do something in the Korean language. It's often used when you are expressing that you want to do an action and is typically used with verbs. It is the equivalent of 'I want to ~' or 'I would like to ~' in English. Note that this form is often personal and should be used primarily in situations where you are expressing your own desires, not the desires of others.",
    "formation": "Verb stem + 고 싶다",
    "examples": [
      {
        "kr": "저는 한국어를 듣고 싶어요, 그러니까 한국어 노래를 틀어주세요.",
        "romaji": "Jeoneun hangug-eo leul deudgo sip-eoyo, geuleonikka hangug-eo nolaereul teul-eojuseyo.",
        "en": "I want to listen to Korean, so please play some Korean songs.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_do_20231230_저는_한국어를_듣고_싶어요_그러니까_한국어_노래를_틀어주세요.mp3"
      },
      {
        "kr": "방학에는 친구들과 여행 가고 싶어요.",
        "romaji": "Banghag-eneun chingu-deulgwa yeohaeng gago sip-eoyo.",
        "en": "I want to go on a trip with my friends during the holidays.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_do_20231230_방학에는_친구들과_여행_가고_싶어요.mp3"
      },
      {
        "kr": "그녀에게 한국어를 가르치고 싶어요.",
        "romaji": "Geunyeo-ege hangugeo leul galeuchigo sip-eoyo.",
        "en": "I want to teach her Korean.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_do_20231230_그녀에게_한국어를_가르치고_싶어요.mp3"
      },
      {
        "kr": "맛있는 음식을 만들고 싶어서 요리 수업을 듣고 싶어요.",
        "romaji": "Masissneun eumsig-eul mandeulgo sip-eoseo yoli sueob-eul deudgo sip-eoyo.",
        "en": "I want to make delicious food, so I want to take cooking classes.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_do_20231230_맛있는_음식을_만들고_싶어서_요리_수업을_듣고_싶어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~기 전에 [gi jeone] (Before doing)",
    "short_explanation": "Used to express 'before doing something'.",
    "long_explanation": "'~기 전에 [gi jeone]' is a grammatical structure in Korean used for expressing an action that occurs prior to another action, essentially meaning 'before doing something'. It is a way to indicate that one action happens before another action and is usually used with a verb in order to describe a chronological sequence of events in the past, present, or future.",
    "formation": "Verb in Dictionary form + 기 + 전에",
    "examples": [
      {
        "kr": "저는 학교에 가기 전에 항상 아침 식사를 합니다.",
        "romaji": "Jeoneun hakgyoe gagi jeone hangsang achim siksa reul habnida.",
        "en": "I always have breakfast before going to school.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20231230_저는_학교에_가기_전에_항상_아침_식사를_합니다.mp3"
      },
      {
        "kr": "출발하기 전에 자세히 계획을 세우는 것이 중요합니다.",
        "romaji": "Chulbalhagi jeone jasehi gyehoegeul seweuneun geosi junghabnida.",
        "en": "It's important to plan carefully before leaving.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20231230_출발하기_전에_자세히_계획을_세우는_것이_중요합니다.mp3"
      },
      {
        "kr": "제가 카페에 가기 전에 당신의 주문을 알려주십시오.",
        "romaji": "Jega kapee gagi jeone dangsinui jumuneul allyeojusipsio.",
        "en": "Let me know your order before I go to the cafe.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20231230_제가_카페에_가기_전에_당신의_주문을_알려주십시오.mp3"
      },
      {
        "kr": "시험을 치르기 전에, 그 주제에 대해 충분히 공부를 해야합니다.",
        "romaji": "Sihumeul chirugi jeone, geu jujee daehae chungbunhi gongbureul haeyahabnida.",
        "en": "Before taking the test, you must study enough about that topic.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20231230_시험을_치르기_전에_그_주제에_대해_충분히_공부를_해야합니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~기 때문에 [gi ttaemune] (Because of doing)",
    "short_explanation": "Used to express a reason or cause; 'because of doing'.",
    "long_explanation": "'기 때문에 [gi ttaemune]' is a grammar point used in Korean to express a reason or cause related to an action, which is equivalent to 'because of doing' in English. This form is composed of the nominalizing suffix '기' attached to a verb stem, then followed by '때문에' which functions as a connecting ending meaning 'because'. It's typically used to explain the cause-effect relationship between two actions or situations.",
    "formation": "Verb stem + 기 + 때문에",
    "examples": [
      {
        "kr": "저는 공부하기 때문에 친구들과 놀러 갈 시간이 없어요.",
        "romaji": "Jeoneun gongbuhagi ttaemune chingudeulgwa nolleo gal sigani eopseoyo.",
        "en": "Because I study, I have no time to hang out with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_기_때문에_gi_ttaemune_Because_of_doing_20231230_저는_공부하기_때문에_친구들과_놀러_갈_시간이_없어요.mp3"
      },
      {
        "kr": "감기에 걸리기 때문에 학교에 가지 못했어요.",
        "romaji": "Gamgie geolligi ttaemune hakgyoe gaji mothaesseoyo.",
        "en": "I couldn't go to school because of catching a cold.",
        "grammar_audio": "/audio/korean/grammar/s_기_때문에_gi_ttaemune_Because_of_doing_20231230_감기에_걸리기_때문에_학교에_가지_못했어요.mp3"
      },
      {
        "kr": "많은 돈을 벌기 때문에 직장에 계속 나가고 있어요.",
        "romaji": "Maneun doneul beolgi ttaemune jikjange gyesok nagago isseoyo.",
        "en": "I keep going to work because I earn a lot of money.",
        "grammar_audio": "/audio/korean/grammar/s_기_때문에_gi_ttaemune_Because_of_doing_20231230_많은_돈을_벌기_때문에_직장에_계속_나가고_있어요.mp3"
      },
      {
        "kr": "운동하기 때문에 건강해지고 있어요.",
        "romaji": "Undonghagi ttaemune geonganghaejigo isseoyo.",
        "en": "I'm getting healthier because of exercising.",
        "grammar_audio": "/audio/korean/grammar/s_기_때문에_gi_ttaemune_Because_of_doing_20231230_운동하기_때문에_건강해지고_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~기로 하다 [giro hada] (Decide to do)",
    "short_explanation": "Used to express making a decision or a plan to do something.",
    "long_explanation": "'~기로 하다' is generally used in the form of Verb + 기로 하다 to express a decision or planning to do something. It can be translated as 'decide to do'. It is generally used to share a decision made in the past, the outcome of a conversion or a mutual agreement.",
    "formation": "Verb in 한자(韓字) Stem + 기로 하다",
    "examples": [
      {
        "kr": "우리는 내일 오후에 만나기로 했어요. 그래서 내일 아침에 일어나서 준비해야 돼요.",
        "romaji": "Urineun naeil ohue mannagiro haesseoyo. Geuraeseo naeil achime ileonaseo junbihaeya dwaeyo.",
        "en": "We decided to meet tomorrow afternoon. So I have to wake up and get ready in the morning tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_do_20231230_우리는_내일_오후에_만나기로_했어요_그래서_내일_아침에_일어나서_준비해야_돼요.mp3"
      },
      {
        "kr": "저는 다음 주에 친구와 여행가기로 했어요. 그래서 이번 주말에 가방을 싸야 돼요.",
        "romaji": "Jeoneun daeum jue chinguwa yeohaenggagiro haesseoyo. Geuraeseo ibeon jumare gabaengeul ssaya dwaeyo.",
        "en": "I decided to go on a trip with a friend next week. So I have to pack my bag this weekend.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_do_20231230_저는_다음_주에_친구와_여행가기로_했어요_그래서_이번_주말에_가방을_싸야_돼요.mp3"
      },
      {
        "kr": "최근에 너무 많이 먹어서 다이어트하기로 했어요. 그래서 오늘부터 식단을 조절하려고 했어요.",
        "romaji": "Choegeneun neomu mani meogeoseo daieoteugiro haesseoyo. Geuraeseo oneulbuteo sikdaneul jojeolharyeogo haesseoyo.",
        "en": "I ate too much recently, so I decided to go on a diet. So I tried to control my diet from today.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_do_20231230_최근에_너무_많이_먹어서_다이어트하기로_했어요_그래서_오늘부터_식단을_조절하려고_했어요.mp3"
      },
      {
        "kr": "시험 공부를 시작하기로 했어요. 그래서 오늘부터 매일 노트를 작성하고 싶어요.",
        "romaji": "Siheom gongbureul sijakgigiro haesseoyo. Geuraeseo oneulbuteo maeil noteureul jaksseunghago sippeoyo.",
        "en": "I decided to start studying for the test. So I want to write notes every day from today.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_do_20231230_시험_공부를_시작하기로_했어요_그래서_오늘부터_매일_노트를_작성하고_싶어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~기 시작하다 [gi sijakhada] (Start to do)",
    "short_explanation": "Expresses the commencement of an action or event, equivalent to 'start to do' in English.",
    "long_explanation": "'~기 시작하다 [gi sijakhada]' is used in Korean to express the initiation or commencement of an action. By attaching the nominalization marker '~기' to a verb followed by the verb '시작하다 (to start)', you can express the beginning of the action executed by the verb. It implies that an action or event has just begun or is about to start in the near future.",
    "formation": "Verb stem + 기 + 시작하다",
    "examples": [
      {
        "kr": "날씨가 점점 따뜻해지면서 꽃들이 피기 시작했어요.",
        "romaji": "Nalssiga jeomjeom ttatteuthaejimyeonseo kkotdeuri pigi sijakhayeo.",
        "en": "As the weather started to get warmer, the flowers started to bloom.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Start_to_do_20231230_날씨가_점점_따뜻해지면서_꽃들이_피기_시작했어요.mp3"
      },
      {
        "kr": "학기가 시작되자마자 숙제를 하기 시작했어요.",
        "romaji": "Hakgiga sijakdoejamaja sujereul hagi sijakhayeo.",
        "en": "As soon as the semester started, I started doing homework.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Start_to_do_20231230_학기가_시작되자마자_숙제를_하기_시작했어요.mp3"
      },
      {
        "kr": "그녀는 피아노를 치기 시작했습니다.",
        "romaji": "Geunyeoneun piano chigi sijakhaetsseumnida.",
        "en": "She started playing the piano.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Start_to_do_20231230_그녀는_피아노를_치기_시작했습니다.mp3"
      },
      {
        "kr": "친구들이 도착하자마자 파티가 시작하기 시작했어요.",
        "romaji": "Chingudeuri dochakhajamaja pati sijakgihagi sijakhayeo.",
        "en": "As soon as my friends arrived, the party started.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Start_to_do_20231230_친구들이_도착하자마자_파티가_시작하기_시작했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~기는 하다 [gineun hada] (Do something as a habit)",
    "short_explanation": "Used to express that someone does something as a regular activity or habit.",
    "long_explanation": "'~기는 하다 [gineun hada]' is a Korean grammar point used to express the habituality of an action, suggesting that someone does something as a regular activity or habit. It's a combination of the nominalizing suffix '~기' and the verb '하다', which is often translated as 'to do'. When this pattern is attached to the base form of action verb, it suggests that the subject of the sentence does that activity routinely or habitually.",
    "formation": "Verb stem + 기는 하다",
    "examples": [
      {
        "kr": "매일 아침에 영어를 공부하기는 하지만, 아직도 버벅거린다.",
        "romaji": "Maeil achime yeongeoreul gongbuhagineun hajiman, ajikdo beobeokgeorinda.",
        "en": "I study English every morning as a habit, but I'm still struggling.",
        "grammar_audio": "/audio/korean/grammar/s_기는_하다_gineun_hada_Do_something_as_a_habit_20231230_매일_아침에_영어를_공부하기는_하지만_아직도_버벅거린다.mp3"
      },
      {
        "kr": "저는 주말에 책을 읽기는 하는데, 많은 시간을 할애하지는 않아요.",
        "romaji": "Jeoneun jumare chaegil ilgkineun hande, maneun siganeul haraehajineun anhayo.",
        "en": "I do read books on the weekends as a habit, but I don't devote a lot of time to it.",
        "grammar_audio": "/audio/korean/grammar/s_기는_하다_gineun_hada_Do_something_as_a_habit_20231230_저는_주말에_책을_읽기는_하는데_많은_시간을_할애하지는_않아요.mp3"
      },
      {
        "kr": "요리를 만들기는 하지만, 그렇게 제 맛에 들지는 않아요.",
        "romaji": "Yorireul mandeulgineun hajiman, geureoke je mate deuljineun anhayo.",
        "en": "I do cook as a habit, but I don't really like the taste.",
        "grammar_audio": "/audio/korean/grammar/s_기는_하다_gineun_hada_Do_something_as_a_habit_20231230_요리를_만들기는_하지만_그렇게_제_맛에_들지는_않아요.mp3"
      },
      {
        "kr": "운동을 하루에 한 시간씩하기는 하는데, 아직도 체력이 부족해요.",
        "romaji": "Undongeul harue han sikanggineun hande, ajikdo cheryeogi bujokaeyo.",
        "en": "I do exercise for an hour a day as a habit, but I'm still lacking in stamina.",
        "grammar_audio": "/audio/korean/grammar/s_기는_하다_gineun_hada_Do_something_as_a_habit_20231230_운동을_하루에_한_시간씩하기는_하는데_아직도_체력이_부족해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~는 대로 [neun daero] (As it is)",
    "short_explanation": "'~는 대로' is used to state that something is done exactly as it is or as it is told.",
    "long_explanation": "The '~는 대로 [neun daero]' structure is used to express a sense of doing something exactly as it is, as it exists or as stated, emphasizing that no alteration, distortion or difference has occurred. It can also suggest that someone is doing or should do things strictly as they were told, hence focusing on following instructions or maintaining the original state of something.",
    "formation": "[Verb stem] + 는 대로",
    "examples": [
      {
        "kr": "제가 말하는 대로 정확히 따라해 주세요, 그렇게 하면 실패할 가능성이 낮아질 것입니다.",
        "romaji": "Jega malhaneun daero jeonghwakhi ttarahae juseyo, geureohge hamyeon silpaehal ganeungseongi najajil geosibnida.",
        "en": "Please follow exactly as I say, doing so will lower the chance of failure.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20231230_제가_말하는_대로_정확히_따라해_주세요_그렇게_하면_실패할_가능성이_낮아질_것입니다.mp3"
      },
      {
        "kr": "이 설명서에 적힌 대로 장난감을 조립하면 어려움 없이 완성할 수 있습니다.",
        "romaji": "I seolmyeongseoe jeoghin daero jangnangameul jo-riphamyeon eoryeoum eobsi wanseonghal su issseubnida.",
        "en": "If you assemble the toy as written in these instructions, you can complete it without difficulty.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20231230_이_설명서에_적힌_대로_장난감을_조립하면_어려움_없이_완성할_수_있습니다.mp3"
      },
      {
        "kr": "그는 부모님이 가르치는 대로 모든 것을 해왔고, 그 노력 덕분에 충분히 성공적인 삶을 살고 있습니다.",
        "romaji": "Geuneun bumonim-i gareuchineun daero modeun geoseul haewatgo, geu noryeok deogbun-e chungbunhi seong-gongjeog-in salm-eul salgo issseubnida.",
        "en": "He has done everything as his parents taught him, and thanks to his efforts, he is living a sufficiently successful life.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20231230_그는_부모님이_가르치는_대로_모든_것을_해왔고_그_노력_덕분에_충분히_성공적인_삶을_살고_있습니다.mp3"
      },
      {
        "kr": "음악을 들을 때는 가수가 부르는 대로 따라 부르는게 제일 재미있어요.",
        "romaji": "Eumageul deureul ttaeneun gasuga bureuneun daero ttara bureuneunge jeil jaemiisseoyo.",
        "en": "When listening to music, it's most fun to sing along just the way the singer does.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20231230_음악을_들을_때는_가수가_부르는_대로_따라_부르는게_제일_재미있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~는 바람에 [neun barame] (Because of)",
    "short_explanation": "This grammar is used when indicating the cause of a negative result or situation.",
    "long_explanation": "The Korean grammatical pattern '~는 바람에 [neun barame]' translates to 'because of' or 'due to'. It's used to indicate the cause or reason behind a negative consequence or situation. Its usage is common in complaints or expression of regret, and it emphasises the negative impact of the cause on the outcome.",
    "formation": "Subject + verb/adjective + 는 바람에",
    "examples": [
      {
        "kr": "집에 늦게 도착한 바람에 이른 아침 수업을 놓쳤어요.",
        "romaji": "Jibe neujge dochakhan barame irun achim sueobeul nohcheosseoyo.",
        "en": "Because I arrived home late, I missed the early morning class.",
        "grammar_audio": "/audio/korean/grammar/s_는_바람에_neun_barame_Because_of_20231230_집에_늦게_도착한_바람에_이른_아침_수업을_놓쳤어요.mp3"
      },
      {
        "kr": "그녀가 파티에 오지 않은 바람에 기분이 좋지 않았어요.",
        "romaji": "Geunyeoga pati-e oji anheun barame gibuni jotji anhasseoyo.",
        "en": "I felt bad because she did not come to the party.",
        "grammar_audio": "/audio/korean/grammar/s_는_바람에_neun_barame_Because_of_20231230_그녀가_파티에_오지_않은_바람에_기분이_좋지_않았어요.mp3"
      },
      {
        "kr": "비가 오는 바람에 피크닉을 취소했어요.",
        "romaji": "Biga oneun barame pikeunigeul chwisohaesseoyo.",
        "en": "I had to cancel the picnic because of the rain.",
        "grammar_audio": "/audio/korean/grammar/s_는_바람에_neun_barame_Because_of_20231230_비가_오는_바람에_피크닉을_취소했어요.mp3"
      },
      {
        "kr": "전화를 받지 못한 바람에 중요한 미팅을 놓쳤어요.",
        "romaji": "Jeonhwareul badji motan barame jungyohan miteingeul nohcheosseoyo.",
        "en": "I missed an important meeting because I couldn't answer the phone.",
        "grammar_audio": "/audio/korean/grammar/s_는_바람에_neun_barame_Because_of_20231230_전화를_받지_못한_바람에_중요한_미팅을_놓쳤어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~는 데 [neun de] (But)",
    "short_explanation": "Used to express contrast or contradiction; 'but', 'however'.",
    "long_explanation": "'~는 데 [neun de]' is a conjunction used in Korean to introduce a clause contrastive or contradictory to the first part of the sentence, akin to 'but' or 'however' in English. It is used to emphasize the contradiction between the two statements or situations, and is often placed between two clauses in a sentence.",
    "formation": "Clause 1 + 는 데 + Clause 2",
    "examples": [
      {
        "kr": "저는 밥을 많이 먹었는 데, 아직도 배가 고파요.",
        "romaji": "Jeoneun babeul mani meogeotneun de, ajikdo baega gopayo.",
        "en": "I ate a lot, but I'm still hungry.",
        "grammar_audio": "/audio/korean/grammar/s_는_데_neun_de_But_20231230_저는_밥을_많이_먹었는_데_아직도_배가_고파요.mp3"
      },
      {
        "kr": "제 친구는 항상 늦게 잠에 드는 데, 항상 일찍 일어나요.",
        "romaji": "Je chinguneun hangsang neutge jame deuneun de, hangsang iljjik ileonayo.",
        "en": "My friend always goes to bed late, but always wakes up early.",
        "grammar_audio": "/audio/korean/grammar/s_는_데_neun_de_But_20231230_제_친구는_항상_늦게_잠에_드는_데_항상_일찍_일어나요.mp3"
      },
      {
        "kr": "요즘 날씨가 추운 데, 눈이 안 와서 아쉬워요.",
        "romaji": "Yojum nalssiga chuneun de, nuni an waseo aswiwoyo.",
        "en": "The weather is cold these days, but it's regrettable that it's not snowing.",
        "grammar_audio": "/audio/korean/grammar/s_는_데_neun_de_But_20231230_요즘_날씨가_추운_데_눈이_안_와서_아쉬워요.mp3"
      },
      {
        "kr": "영화 보러 갔는 데, 표가 매진이 되어서 보지 못 했어요.",
        "romaji": "Yeonghwa boreo gatneun de, pyoga maejini dwaeseo boji mot haesseoyo.",
        "en": "I went to see a movie, but I couldn't because the tickets were sold out.",
        "grammar_audio": "/audio/korean/grammar/s_는_데_neun_de_But_20231230_영화_보러_갔는_데_표가_매진이_되어서_보지_못_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~는지 모르다 [neunji moreuda] (Don't know if)",
    "short_explanation": "It is used when the speaker is questionable or unsure about the situation or fact.",
    "long_explanation": "'~는지 모르다' is a form used to express uncertainty or lack of knowledge about something in Korean. It corresponds to the English 'do not know if'. This construction is used when the speaker does not know whether something happened, exists, or is true. The verb in front of '는지 모르다' must be in the adnominal form.",
    "formation": "Verb-는지 모르다 / Verb-ㄴ/은지 모르다 / Adjective-는지 모르다",
    "examples": [
      {
        "kr": "그가 오늘 학교에 올 것인지 모르겠어요.",
        "romaji": "Geuga oneul hakgyoe ol geotinji moreugesseoyo.",
        "en": "I don't know if he's coming to school today.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르다_neunji_moreuda_Dont_know_if_20231230_그가_오늘_학교에_올_것인지_모르겠어요.mp3"
      },
      {
        "kr": "그녀가 어떤 옷을 입을지 모르겠어요.",
        "romaji": "Geunyeoga eotteon oseul ibeulji moreugesseoyo.",
        "en": "I don't know what kind of clothes she will wear.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르다_neunji_moreuda_Dont_know_if_20231230_그녀가_어떤_옷을_입을지_모르겠어요.mp3"
      },
      {
        "kr": "그가 이 이야기를 들었는지 모릅니다.",
        "romaji": "Geuga i iyagireul deureotneunji moreumnida.",
        "en": "I don't know if he heard this story.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르다_neunji_moreuda_Dont_know_if_20231230_그가_이_이야기를_들었는지_모릅니다.mp3"
      },
      {
        "kr": "우리 친구가 이곳에서 행복할지 모르겠어요.",
        "romaji": "Uri chinguga igoseseo haengbokhalji moreugesseoyo.",
        "en": "I don't know if our friend will be happy here.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르다_neunji_moreuda_Dont_know_if_20231230_우리_친구가_이곳에서_행복할지_모르겠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~는지 알다 [neunji alda] (Know if)",
    "short_explanation": "Used to express 'know if' or 'know whether'.",
    "long_explanation": "The structure '~는지 알다 [neunji alda]' is used to express the concept of knowing if something is the case or not. It is utilized when conveying what someone knows or doesn't know about a certain aspect or event. The usage of this form often appears in sentences with unknown information about the subject or the situation.",
    "formation": "Verb+는지 알다 / Adjective+는지 알다",
    "examples": [
      {
        "kr": "그가 내 말을 이해하는지 알 수 없어요.",
        "romaji": "Geuga nae mareul ihaehaneunji al su eopseoyo.",
        "en": "I don't know if he understands my words.",
        "grammar_audio": "/audio/korean/grammar/s_는지_알다_neunji_alda_Know_if_20231230_그가_내_말을_이해하는지_알_수_없어요.mp3"
      },
      {
        "kr": "그녀가 결정을 내렸는지 알고 싶어요.",
        "romaji": "Geunyeoga gyeoljeongeul naeryeonneunji algo sip-eoyo.",
        "en": "I want to know if she has made a decision.",
        "grammar_audio": "/audio/korean/grammar/s_는지_알다_neunji_alda_Know_if_20231230_그녀가_결정을_내렸는지_알고_싶어요.mp3"
      },
      {
        "kr": "우리가 다음 주에 만날 수 있는지 알아야 해요.",
        "romaji": "Uriga da-eum jue mannal su issneunji al-aya haeyo.",
        "en": "We need to find out if we can meet next week.",
        "grammar_audio": "/audio/korean/grammar/s_는지_알다_neunji_alda_Know_if_20231230_우리가_다음_주에_만날_수_있는지_알아야_해요.mp3"
      },
      {
        "kr": "학생들이 문제를 해결하는지 알기 위해 선생님들이 항상 확인합니다.",
        "romaji": "Haksaengdeuli munjeleul haegyeolhaneunji algi wihae seonsaengnimdeuli hangsang hwaginhapnida.",
        "en": "Teachers always check to know if the students are solving the problem.",
        "grammar_audio": "/audio/korean/grammar/s_는지_알다_neunji_alda_Know_if_20231230_학생들이_문제를_해결하는지_알기_위해_선생님들이_항상_확인합니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~마다 [mada] (Every)",
    "short_explanation": "Used to express the regular occurrence of an action; 'every'.",
    "long_explanation": "'~마다 [mada]' is a postposition used in Korean to express a recurring or continuous action that happens at regular intervals, often corresponding to 'every' in English. This grammar point indicates repetition, illustrating that something happens each time or at each occurrence of the mentioned subject or object. It is applied to nouns denoting time, places, or people, to describe a habitual or regular circumstance.",
    "formation": "Noun + 마다",
    "examples": [
      {
        "kr": "저는 매일 아침마다 일찍 일어나서 운동을 합니다.",
        "romaji": "Jeoneun maeil achimmada iljjik ileonaseo undongeul habnida.",
        "en": "I wake up early and exercise every morning.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20231230_저는_매일_아침마다_일찍_일어나서_운동을_합니다.mp3"
      },
      {
        "kr": "여행을 갈 때마다 새로운 사람들을 만나서 매우 흥미로워요.",
        "romaji": "Yeohaengeul gal ttaemada saeroun saramdeureul mannaseo maeu heungmirowoyo.",
        "en": "Whenever I go traveling, meeting new people is always very interesting.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20231230_여행을_갈_때마다_새로운_사람들을_만나서_매우_흥미로워요.mp3"
      },
      {
        "kr": "테스트가 끝날 때마다 휴식을 조금씩 취합니다.",
        "romaji": "Testeu-ga kkeutnal ttaemada hyusigeul jogeumssik chwihabnida.",
        "en": "I take a bit of a rest every time a test ends.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20231230_테스트가_끝날_때마다_휴식을_조금씩_취합니다.mp3"
      },
      {
        "kr": "일주일마다 한국어를 공부하기 위해 도서관에 갑니다.",
        "romaji": "Iljuilmada Hangugeo-reul gongbuhagi wihae doseogwan-e gamnida.",
        "en": "I go to the library to study Korean every week.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20231230_일주일마다_한국어를_공부하기_위해_도서관에_갑니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~부터 ~까지 [buteo ~ kkaji] (From ~ to ~)",
    "short_explanation": "This grammar is used to express the beginning and end of an action or a range.",
    "long_explanation": "'~부터 ~까지 [buteo ~ kkaji]' is used in Korean to indicate a range, from the starting point to the end point. It can be used to describe periods of time, range of numbers, spaces or locations, or to express the starting and ending point of an action or state. This grammar point can be translated as 'from ~ to ~' in English. It's important to note that the verbs in the sentence referring to this range should be in harmony.",
    "formation": "Starting point + 부터 + End point + 까지",
    "examples": [
      {
        "kr": "우리는 월요일부터 금요일까지 일해요.",
        "romaji": "Urineun wolyoilibuteo geumyoilkkaji ilhaeyo.",
        "en": "We work from Monday to Friday.",
        "grammar_audio": "/audio/korean/grammar/s_부터_까지_buteo__kkaji_From__to__20231230_우리는_월요일부터_금요일까지_일해요.mp3"
      },
      {
        "kr": "점심시간은 오후 12시부터 1시까지에요.",
        "romaji": "Jeomsimsiganeun ohu 12sibuteo 1sikkaji eyo.",
        "en": "Lunch time is from 12 p.m. to 1. p.m.",
        "grammar_audio": "/audio/korean/grammar/s_부터_까지_buteo__kkaji_From__to__20231230_점심시간은_오후_12시부터_1시까지에요.mp3"
      },
      {
        "kr": "서울부터 부산까지 기차로 얼마나 걸리나요?",
        "romaji": "Seoulbuteo Busankkaji gicharo eolmanana geollinayo?",
        "en": "How long does it take from Seoul to Busan by train?",
        "grammar_audio": "/audio/korean/grammar/s_부터_까지_buteo__kkaji_From__to__20231230_서울부터_부산까지_기차로_얼마나_걸리나요.mp3"
      },
      {
        "kr": "나는 한국어를 공부하기 시작했을때부터 지금까지 많이 발전했어요.",
        "romaji": "Naneun hangugeoreul gongbu hagi sijakhaesseulttaebuteo jigeumkkaji mani baljeonhaesseoyo.",
        "en": "I have improved a lot from when I started studying Korean to now.",
        "grammar_audio": "/audio/korean/grammar/s_부터_까지_buteo__kkaji_From__to__20231230_나는_한국어를_공부하기_시작했을때부터_지금까지_많이_발전했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어/여 보이다 [a/eo/yeo boida] (Seems, looks like)",
    "short_explanation": "Used to express that something appears, seems or looks a certain way based on the perception or assessment of the speaker.",
    "long_explanation": "The grammar point '~아/어/여 보이다' in Korean is used to express the speaker's perception, conjecture or judgment based on the appearance or situation of something or someone. It can be translated as 'seems' or 'looks like' in English. It is used to demonstrate that the speaker is making an inference or commenting on something based on their own subjective perception, rather than stating an objective fact.",
    "formation": "Verb stem + 아/어/여 보이다",
    "examples": [
      {
        "kr": "그 사람은 행복해 보여서 다른 사람들도 기분이 좋아지자나요.",
        "romaji": "Geu saram-eun haengbokhae boyeoseo dareun saramdeuldo gibun-i jo-ajijanayo.",
        "en": "That person looks happy, making other people feel good too.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_보이다_a/eo/yeo_boida_Seems_looks_like_20231230_그_사람은_행복해_보여서_다른_사람들도_기분이_좋아지자나요.mp3"
      },
      {
        "kr": "이 음식은 맛있어 보이지만 실제로는 좀 짰어요.",
        "romaji": "I eumsik-eun masiss-eo boijiman siljeleoneun jom jjass-eoyo.",
        "en": "This food looks tasty, but it's actually a bit salty.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_보이다_a/eo/yeo_boida_Seems_looks_like_20231230_이_음식은_맛있어_보이지만_실제로는_좀_짰어요.mp3"
      },
      {
        "kr": "그 남자는 항상 기분이 나쁘게 보이는데 어떤 문제가 있나요.",
        "romaji": "Geu namja-neun hangsang gibun-i nappeuge boineunde eotteon munje-ga issnayo.",
        "en": "That man always looks upset, maybe there's a problem.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_보이다_a/eo/yeo_boida_Seems_looks_like_20231230_그_남자는_항상_기분이_나쁘게_보이는데_어떤_문제가_있나요.mp3"
      },
      {
        "kr": "이 옷은 사진에서 볼 땐 예뻤는데, 실제로 보니깐 그저 그래 보여요.",
        "romaji": "I ot-eun sajin-eseo bol ttaen yeppeossneunde, siljelo bonikkan geujeo geulae boyeoyo.",
        "en": "This outfit looked pretty in the photos, but in reality, it just looks so-so.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_보이다_a/eo/yeo_boida_Seems_looks_like_20231230_이_옷은_사진에서_볼_땐_예뻤는데_실제로_보니깐_그저_그래_보여요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어/여 주다 [a/eo/yeo juda] (Do for someone)",
    "short_explanation": "This form is used to express the action of doing something for someone.",
    "long_explanation": "The '아/어/여 주다 [a/eo/yeo juda]' form is a commonly used sentence ending in Korean that expresses the action of doing something for someone. This grammatical form is often used when the speaker is talking to someone who is doing a favor for them or is willing to do something for them. It's a mood form to express the speaker's gratitude and can also be used when asking someone to do something.",
    "formation": "Verb stem + 아/어/여 + 주다 depending on the vowel of the last syllable of the verb stem",
    "examples": [
      {
        "kr": "피곤해서 그럼 내가 그 숙제를 해 줄게.",
        "romaji": "Pigonsaeseo geureom naega geu sukje reul hae julge.",
        "en": "You seem tired, so I'll do your homework for you.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_주다_a/eo/yeo_juda_Do_for_someone_20231230_피곤해서_그럼_내가_그_숙제를_해_줄게.mp3"
      },
      {
        "kr": "걱정하지 마세요, 우리 아빠가 우리를 위해 보호해 줄 거예요.",
        "romaji": "Geokjeonghaji maseyo, uri appaga urireul wihae boho hae jul geoyeyo.",
        "en": "Don't worry, our dad will protect us.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_주다_a/eo/yeo_juda_Do_for_someone_20231230_걱정하지_마세요_우리_아빠가_우리를_위해_보호해_줄_거예요.mp3"
      },
      {
        "kr": "집에 돌아가는 길에 아빠가 택시를 잡아 주었어요.",
        "romaji": "Jibe doraganeun gire appaga taeksi reul jaba jueosseo yo.",
        "en": "On the way home, my dad caught a taxi for us.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_주다_a/eo/yeo_juda_Do_for_someone_20231230_집에_돌아가는_길에_아빠가_택시를_잡아_주었어요.mp3"
      },
      {
        "kr": "나는 어머니에게 저녁식사를 만들어 주었어요.",
        "romaji": "Naneun eomeoni ege jeonyeoksiksa reul mandeul eo jueo sseo yo.",
        "en": "I made dinner for my mother.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여_주다_a/eo/yeo_juda_Do_for_someone_20231230_나는_어머니에게_저녁식사를_만들어_주었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어/여야만 하다 [a/eo/yeoyaman hada] (Have to do)",
    "short_explanation": "This grammar point is used to express necessity or obligation; 'have to do', 'must'.",
    "long_explanation": "The phrase '~아/어/여야만 하다 [a/eo/yeoyaman hada]' in Korean language is used when someone must do something or has an obligation to do something. It's similar to English expressions such as 'have to', 'need to' or 'must'. It is formed by combining the verb stem with '아/어/여야만 하다', depending on the verb’s final vowel.",
    "formation": "Verb-stem + 아야만 하다 /어야만 하다 /여야만 하다",
    "examples": [
      {
        "kr": "모든 학생들은 시험을 준비해야만 해요, 그렇지 않으면 실패할 것입니다.",
        "romaji": "Modeun haksaengdeuleun siheomeul junbihaeyaman haeyo, geureohji anheumyeon silpaehal geosibnida.",
        "en": "All students have to prepare for the exam, otherwise they will fail.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여야만_하다_a/eo/yeoyaman_hada_Have_to_do_20231230_모든_학생들은_시험을_준비해야만_해요_그렇지_않으면_실패할_것입니다.mp3"
      },
      {
        "kr": "지금 당장 나가야만 해요, 만약 늦으면 비행기를 놓칠 것입니다.",
        "romaji": "Jigeum dangjang nagayaman haeyo, manyag neujmyeon bihaenggireul nochil geosibnida.",
        "en": "I have to leave right now, otherwise I will miss the plane.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여야만_하다_a/eo/yeoyaman_hada_Have_to_do_20231230_지금_당장_나가야만_해요_만약_늦으면_비행기를_놓칠_것입니다.mp3"
      },
      {
        "kr": "너는 이 일을 마무리해야만 해 서연 집에 갈 수 있어요.",
        "romaji": "Neoneun i ireul mamurihaeyaman haseo yeon jibe gal su isseoyo.",
        "en": "You have to finish this work in order to go home.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여야만_하다_a/eo/yeoyaman_hada_Have_to_do_20231230_너는_이_일을_마무리해야만_해_서연_집에_갈_수_있어요.mp3"
      },
      {
        "kr": "우리는 매일 아침 스트레칭을 해야만 해요, 건강을 유지하기 위해서입니다.",
        "romaji": "Urineun maeil achim seuteureching-eul haeyaman haeyo, geongangeul yujihagi wihaeseoibnida.",
        "en": "We have to stretch every morning to maintain our health.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여야만_하다_a/eo/yeoyaman_hada_Have_to_do_20231230_우리는_매일_아침_스트레칭을_해야만_해요_건강을_유지하기_위해서입니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어/여도 되다 [a/eo/yeodo doeda] (Is it okay to)",
    "short_explanation": "Used to ask or state if it's okay or permissible to do something.",
    "long_explanation": "'~아/어/여도 되다 [a/eo/yeodo doeda]' is a commonly used grammar pattern in Korean to ask for or give permission to do something. This pattern is typically found in interrogative (question) sentences or declarative statements signifying 'it is okay to ...' or seeking permission by asking 'can I or may I ...'",
    "formation": "Verb stem + 아/어/여도 되다",
    "examples": [
      {
        "kr": "저는 이 자리에 앉아도 되나요? 다른 사람이 예약하지 않았을 경우에만 가능하요.",
        "romaji": "Jeoneun i jarie anjaedo doenayo? Dareun sarami yeyaghaji anhasseul gyeong-uman ganeunghayo.",
        "en": "Can I sit in this seat? It's only possible if no one else has reserved it.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여도_되다_a/eo/yeodo_doeda_Is_it_okay_to_20231230_저는_이_자리에_앉아도_되나요_다른_사람이_예약하지_않았을_경우에만_가능하요.mp3"
      },
      {
        "kr": "내일 포토샵을 사용해도 돼요? 내 프로젝트에 필요하거든요.",
        "romaji": "Naeil photoshopeul sayonghaedo dwaeyo? Nae peurojekteue piryohageodeunyo.",
        "en": "Can I use Photoshop tomorrow? It's needed for my project.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여도_되다_a/eo/yeodo_doeda_Is_it_okay_to_20231230_내일_포토샵을_사용해도_돼요_내_프로젝트에_필요하거든요.mp3"
      },
      {
        "kr": "크게 음악을 들어도 되는 곳이 있나요? 록 음악을 좋아해서요.",
        "romaji": "Keuge eumageul deureodo doeneun gosi issnayo? Rok eumageul joahaseoyo.",
        "en": "Is there a place where I can listen to music loudly? I like rock music.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여도_되다_a/eo/yeodo_doeda_Is_it_okay_to_20231230_크게_음악을_들어도_되는_곳이_있나요_록_음악을_좋아해서요.mp3"
      },
      {
        "kr": "나는 비가 와도 축구를 해도 돼요. 저는 비를 매우 좋아해서요.",
        "romaji": "Naneun biga wado chukgureul haedo dwaeyo. Jeoneun bireul maeu joahaseoyo.",
        "en": "I can play soccer even if it's raining. It's because I love the rain.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여도_되다_a/eo/yeodo_doeda_Is_it_okay_to_20231230_나는_비가_와도_축구를_해도_돼요_저는_비를_매우_좋아해서요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어/여서는 안 되다 [a/eo/yeoseoneun an doeda] (Must not)",
    "short_explanation": "'~아/어/여서는 안 되다' is a Korean grammar pattern used to indicate that one must not do something.",
    "long_explanation": "The Korean language grammar point ~아/어/여서는 안 되다 is used to express prohibition or that something must not be done. The literal translation of this grammar point in English would be 'It must not be done'. It's a straightforward way of telling someone not to do something and you will most commonly hear it in formal or polite scenarios. It follows the verb stem, which transforms based on the vowel sound of the verb’s final syllable.",
    "formation": "Verb stem + 아/어/여 + 서는 안 되다",
    "examples": [
      {
        "kr": "이 표지판을 보면, 여기에서 담배를 피워서는 안 되어요.",
        "romaji": "I pyojipaneul bomyeon, yeogiseo dambaereul piwoseoneun an doeyo.",
        "en": "Looking at this sign, you must not smoke here.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여서는_안_되다_a/eo/yeoseoneun_an_doeda_Must_not_20231230_이_표지판을_보면_여기에서_담배를_피워서는_안_되어요.mp3"
      },
      {
        "kr": "우리는 건강을 소홀히 해서는 안 됩니다.",
        "romaji": "Urineun geongangeul soholhi haeseoneun an doeyo.",
        "en": "We must not neglect our health.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여서는_안_되다_a/eo/yeoseoneun_an_doeda_Must_not_20231230_우리는_건강을_소홀히_해서는_안_됩니다.mp3"
      },
      {
        "kr": "이 작업은 정밀하게 해야 해서, 정신없이 해서는 안 돼요.",
        "romaji": "I jageobeun jeongmilhage haeya haeseo, jeongsin eobsi haeseoneun an doeyo.",
        "en": "This job needs to be done meticulously, it must not be done carelessly.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여서는_안_되다_a/eo/yeoseoneun_an_doeda_Must_not_20231230_이_작업은_정밀하게_해야_해서_정신없이_해서는_안_돼요.mp3"
      },
      {
        "kr": "듣기 테스트 때문에 핸드폰을 켜서는 안 된다고 강조했습니다.",
        "romaji": "Deudgi teseuteu ttaemune haendeuponeul kyeoseoneun an doendago gangjohaetsseumnida.",
        "en": "I emphasized that you must not turn on your mobile phone because of the listening test.",
        "grammar_audio": "/audio/korean/grammar/s_아/어/여서는_안_되다_a/eo/yeoseoneun_an_doeda_Must_not_20231230_듣기_테스트_때문에_핸드폰을_켜서는_안_된다고_강조했습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~아/어서 [a/eo-seo] (Because, So)",
    "short_explanation": "This is used to express cause and effect, or reason and result.",
    "long_explanation": "The '~아/어서 [a/eoseo]' form is an important grammatical phrase in Korean, used to express the relationship of cause and effect, or reason and result. It is generally used to indicate the reason or cause for an action or state. There is also a temporal meaning, meaning 'after' or 'when', used to describe doing something after something else.",
    "formation": "Verb or Adjective stem + 아/어서",
    "examples": [
      {
        "kr": "오늘은 일이 많아서 학교에 가지 못했어요.",
        "romaji": "Oneureun iri manhaseo haggyoe gaji mothayossuyo.",
        "en": "I couldn't go to school today because I had a lot of work.",
        "grammar_audio": "/audio/korean/grammar/s_아/어서_a/eo-seo_Because_So_20231230_오늘은_일이_많아서_학교에_가지_못했어요.mp3"
      },
      {
        "kr": "방이 춥어서 옷을 더 많이 입었어요.",
        "romaji": "Bangi chuwoseo oseul deo mani ibossuyo.",
        "en": "I wore more clothes because the room was cold.",
        "grammar_audio": "/audio/korean/grammar/s_아/어서_a/eo-seo_Because_So_20231230_방이_춥어서_옷을_더_많이_입었어요.mp3"
      },
      {
        "kr": "그는 운동을 많이 해서 건강한 몸을 유지하고 있어요.",
        "romaji": "Geuneun undongeul mani aeseo geonganghan momeul yujiha-go isseoyo.",
        "en": "He maintains a healthy body because he exercises a lot.",
        "grammar_audio": "/audio/korean/grammar/s_아/어서_a/eo-seo_Because_So_20231230_그는_운동을_많이_해서_건강한_몸을_유지하고_있어요.mp3"
      },
      {
        "kr": "키가 적어서 외투를 사기 어려웠어요.",
        "romaji": "Kiga jeok-eoseo oetu-reul sagi eolyeosseoyo.",
        "en": "I had a hard time buying a coat because of my short stature.",
        "grammar_audio": "/audio/korean/grammar/s_아/어서_a/eo-seo_Because_So_20231230_키가_적어서_외투를_사기_어려웠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~았/었으면 좋겠다 [at/eosseumyeon joketda] (I wish/hope)",
    "short_explanation": "Used to express a desire for something to happen, equivalent to 'I wish/hope' in English.",
    "long_explanation": "'~았/었으면 좋겠다 [at/eosseumyeon joketda]' is a Korean grammar form used to express a wish or hoping for a certain event or situation to happen. This grammar structure combines past tense verb endings with the conditional '면' and '좋겠다' which means 'hope'. The nuance is similar to saying 'I wish' or 'I hope' in English wherein you hope for something that, while not currently true, you desire it to be or become so.",
    "formation": "Verb+았/었으면 좋겠다",
    "examples": [
      {
        "kr": "많은 시간을 가졌으면 좋겠어요, 그럼더 많은 책을 읽을 수 있었을 텐데.",
        "romaji": "Manheun siganeul gajosseumyeon jokesseoyo, geureom deo manheun chaegeul ilgul su isseosseul tende.",
        "en": "I wish I had more time, then I could have read more books.",
        "grammar_audio": "/audio/korean/grammar/s_았/었으면_좋겠다_at/eosseumyeon_joketda_I_wish/hope_20231230_많은_시간을_가졌으면_좋겠어요_그럼더_많은_책을_읽을_수_있었을_텐데.mp3"
      },
      {
        "kr": "내일 비가 왔으면 좋겠어요, 그래야 우리는 더 시원하게 쉴 수 있을 것 같아요.",
        "romaji": "Naeil biga wasseumyeon joketseoyo, geuraeya urineun deo siwonhage swil su isseul geot gatayo.",
        "en": "I hope it rains tomorrow, then we can relax more comfortably.",
        "grammar_audio": "/audio/korean/grammar/s_았/었으면_좋겠다_at/eosseumyeon_joketda_I_wish/hope_20231230_내일_비가_왔으면_좋겠어요_그래야_우리는_더_시원하게_쉴_수_있을_것_같아요.mp3"
      },
      {
        "kr": "그녀는 내 말을 더 이해했으면 좋겠다, 그럼 우리의 서로의 의견을 더 잘 나눌 수 있을 거에요.",
        "romaji": "Geunyeoneun nae mareul deo ihaehaesseumyeon joketda, geureom urineui seoroui uigongeul deo jal nanul su isseul geoe. ",
        "en": "I wish she understood my words better, then we could exchange our own opinions better.",
        "grammar_audio": "/audio/korean/grammar/s_았/었으면_좋겠다_at/eosseumyeon_joketda_I_wish/hope_20231230_그녀는_내_말을_더_이해했으면_좋겠다_그럼_우리의_서로의_의견을_더_잘_나눌_수_있을_거에요.mp3"
      },
      {
        "kr": "이번 주말에 날씨가 좋았으면 좋겠어요, 그럼 피크닉 갈 수 있을 것 같아요.",
        "romaji": "Ibeon jumare naghwaga johasseumyeon joketseoyo, geureom picnic gal su isseul geos gatayo.",
        "en": "I hope the weather is good this weekend, then it seems we can go on a picnic.",
        "grammar_audio": "/audio/korean/grammar/s_았/었으면_좋겠다_at/eosseumyeon_joketda_I_wish/hope_20231230_이번_주말에_날씨가_좋았으면_좋겠어요_그럼_피크닉_갈_수_있을_것_같아요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~어/아야 하다 [eo/ayahada] (Have to, should)",
    "short_explanation": "Used to express obligation, necessity or compulsion; 'have to', 'should'.",
    "long_explanation": "'~어/아야 하다 [eo/ayahada]' is a grammar point in Korean language used to express obligation, necessity, or compulsion, akin to 'have to' or 'should' in English. It is used to denote a task or action that must be performed as a requirement or due to some external pressure or obligation. The verb-ending changes depending on the final vowel of the verb stem. If the final vowel is '아' or '오', '아야 하다' is used otherwise '어야 하다' is used with other vowels.",
    "formation": "Verb Stem + 아/어야 하다",
    "examples": [
      {
        "kr": "내일 시험이 있으니까 오늘 밤에 공부해야 합니다.",
        "romaji": "Naeil siheomi isseunikka oneul bame gongbuhayeo haeayo.",
        "en": "I have to study tonight because I have an exam tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_어/아야_하다_eo/ayahada_Have_to_should_20231230_내일_시험이_있으니까_오늘_밤에_공부해야_합니다.mp3"
      },
      {
        "kr": "우리는 이번 주말에 집을 청소해야 해요.",
        "romaji": "Urineun ibeon jeumare jibeul cheongsohaeya haeyo.",
        "en": "We have to clean the house this weekend.",
        "grammar_audio": "/audio/korean/grammar/s_어/아야_하다_eo/ayahada_Have_to_should_20231230_우리는_이번_주말에_집을_청소해야_해요.mp3"
      },
      {
        "kr": "네가 감기에 걸렸으니까, 약을 먹어야 하겠어요.",
        "romaji": "Nega gamgigeollyeosseunikka, yageul meogeoyahagesseoyo.",
        "en": "As you have caught a cold, you should take medicine.",
        "grammar_audio": "/audio/korean/grammar/s_어/아야_하다_eo/ayahada_Have_to_should_20231230_네가_감기에_걸렸으니까_약을_먹어야_하겠어요.mp3"
      },
      {
        "kr": "일찍 일어나야 해서 얼른 잠에 들어야 해요.",
        "romaji": "Iljjik ileonayeo haseo eolleun jane deuleoya haeyo.",
        "en": "As I have to get up early, I should go to sleep quickly.",
        "grammar_audio": "/audio/korean/grammar/s_어/아야_하다_eo/ayahada_Have_to_should_20231230_일찍_일어나야_해서_얼른_잠에_들어야_해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~어/아도 [eo/ado] (Even if)",
    "short_explanation": "Used to express 'even if' indicating a condition or assumption.",
    "long_explanation": "'~어/아도 [eo/ado]' is a conjunctive form in Korean that is used to express an assumption or a conditional situation that could occur. The suffix '도' carries the meaning of 'even if' or 'although'. The preceding vowels '어/아' are dependent on the verb stem's last vowel, similar to other Korean grammar forms. It essentially allows for the creation of conditional sentences, where the consequence or effects of a hypothetical action or state are discussed. It does not imply a negative connotation and is neutral in tone.",
    "formation": "Verb stem + 어/아(If the verb stem final syllable has vowel 'ㅏ' or 'ㅗ') + 도",
    "examples": [
      {
        "kr": "비가 오더라도 나는 계속 걸어갈 거예요, 그것이 제일 빠른 방법이라고 생각해요.",
        "romaji": "Biga odeorado naneun gyesok georeogal geoyeyo, geugeosi jeil ppareun bangbeobirago saenggakhaeyo.",
        "en": "Even if it rains, I will continue to walk, as I think that is the fastest method.",
        "grammar_audio": "/audio/korean/grammar/s_어/아도_eo/ado_Even_if_20231230_비가_오더라도_나는_계속_걸어갈_거예요_그것이_제일_빠른_방법이라고_생각해요.mp3"
      },
      {
        "kr": "피곤하다고 아무리 말해도 저는 계속 일해야 합니다, 이 일을 끝내야 해요.",
        "romaji": "Pigonhadago amuri malhaedo jeoneun gyesok ilhaeya habnida, i ireul kkeutnaeya haeyo.",
        "en": "Even if I say I'm tired no matter how much, I must keep working, I need to finish this job.",
        "grammar_audio": "/audio/korean/grammar/s_어/아도_eo/ado_Even_if_20231230_피곤하다고_아무리_말해도_저는_계속_일해야_합니다_이_일을_끝내야_해요.mp3"
      },
      {
        "kr": "어려운 문제라도 저는 포기하지 않고 계속 시도할 거예요, 저는 항상 도전을 좋아해요.",
        "romaji": "Eoryeoun munjeralado jeoneun pogihaji anhgo gyesok sidohal geoyeyo, jeoneun hangsang dojeoneul joahaeyo.",
        "en": "Even if it is a hard question, I won't give up and continue to try, I always like a challenge.",
        "grammar_audio": "/audio/korean/grammar/s_어/아도_eo/ado_Even_if_20231230_어려운_문제라도_저는_포기하지_않고_계속_시도할_거예요_저는_항상_도전을_좋아해요.mp3"
      },
      {
        "kr": "시험 결과가 좋지 않아도 저는 분발하겠어요, 실패는 성공의 어머니라고 생각합니다.",
        "romaji": "Siheom gyeolgwaga jojinhaji anhado jeoneun bunbalhagessueyo, silpaeneun seonggongui eomeonirago saenggakhabnida.",
        "en": "Even if the test results are not good, I will exert myself, I think failure is the mother of success.",
        "grammar_audio": "/audio/korean/grammar/s_어/아도_eo/ado_Even_if_20231230_시험_결과가_좋지_않아도_저는_분발하겠어요_실패는_성공의_어머니라고_생각합니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~어/아 버리다 [eo/a beorida] (Regretfully, completely)",
    "short_explanation": "Used to express that an action is completed, often with regret or unintended consequences.",
    "long_explanation": "'~어/아 버리다 [eo/a beorida]' is a verb ending in Korean that expresses the completion of an action, often with a sense of regret or with unintended results. This grammar point is usually used to highlight situations where the speaker or someone else has done something they didn't intend to do, or wish they hadn't done, leading to regret or a complete change.",
    "formation": "Verb + ~어/아 버리다",
    "examples": [
      {
        "kr": "제가 중요한 출장을 놓쳐 버렸어요, 그래서 사장님이 저를 혼냈어요.",
        "romaji": "Jega jungyohan chuljangeul nohchyeo beoryeosseoyo, geuraeseo sajangnimi jeoreul honnesseoyo.",
        "en": "I regrettably missed an important business trip, so the boss scolded me.",
        "grammar_audio": "/audio/korean/grammar/s_어/아_버리다_eo/a_beorida_Regretfully_completely_20231230_제가_중요한_출장을_놓쳐_버렸어요_그래서_사장님이_저를_혼냈어요.mp3"
      },
      {
        "kr": "친구가 제 가방을 다치어 버렸어요, 그래서 제 모든 물건들이 다 쏟아졌어요.",
        "romaji": "Chinguga je gabangeul dachyeo beoryeosseoyo, geuraeseo je modeun mulgeondeuli da ssodajyeosseoyo.",
        "en": "My friend accidentally dropped my bag, so all my belongings spilled out.",
        "grammar_audio": "/audio/korean/grammar/s_어/아_버리다_eo/a_beorida_Regretfully_completely_20231230_친구가_제_가방을_다치어_버렸어요_그래서_제_모든_물건들이_다_쏟아졌어요.mp3"
      },
      {
        "kr": "브레이크를 밟지 않으면 차가 충돌해서 모두 상해를 입어 버릴 수도 있어요.",
        "romaji": "Beureikeureul balpji anheumyeon chaga chungdolhaeseo modu sanghaereul ibeo beoril sudo isseoyo.",
        "en": "If you don't hit the brakes, the car could crash and everyone inside could get completely injured.",
        "grammar_audio": "/audio/korean/grammar/s_어/아_버리다_eo/a_beorida_Regretfully_completely_20231230_브레이크를_밟지_않으면_차가_충돌해서_모두_상해를_입어_버릴_수도_있어요.mp3"
      },
      {
        "kr": "저도 모르게 그 말을 들어 버렸어요, 그래서 제 기분이 매우 나빠졌어요.",
        "romaji": "Jeodo moreuge geu mareul deureo beoryeosseoyo, geuraeseo je gibuni maeu nappajyeosseoyo.",
        "en": "I unintentionally overheard that comment and it completely ruined my mood.",
        "grammar_audio": "/audio/korean/grammar/s_어/아_버리다_eo/a_beorida_Regretfully_completely_20231230_저도_모르게_그_말을_들어_버렸어요_그래서_제_기분이_매우_나빠졌어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "25"
  },
  {
    "title": "~으면/면 [eumyeon/myeon] (If, when)",
    "short_explanation": "Used to express 'if' or 'when' in conditions or hypothetical situations.",
    "long_explanation": "'~으면/면 [eumyeon/myeon]' is used in Korean to express conditions or hypothetical situations. This grammar point is equivalent to 'if' or 'when' in English. It is usually used to denote a future possibility, expectation, or plan under the condition that something occurs. This form of the verb stands at the end of the clause, making it a complex form of a sentence.",
    "formation": "Verb stem + -으면/면",
    "examples": [
      {
        "kr": "비가 오면 우산을 가져와야 해요.",
        "romaji": "Biga omyeon usaneul gajyeowaya haeyo.",
        "en": "If it rains, you should bring an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_으면/면_eumyeon/myeon_If_when_20231230_비가_오면_우산을_가져와야_해요.mp3"
      },
      {
        "kr": "시간이 있으면 책을 좀 더 읽어 보겠어요.",
        "romaji": "Sigani iss-eumyeon chaeg-eul jom deo ilg-eo bogess-eoyo.",
        "en": "If I have time, I will try to read more books.",
        "grammar_audio": "/audio/korean/grammar/s_으면/면_eumyeon/myeon_If_when_20231230_시간이_있으면_책을_좀_더_읽어_보겠어요.mp3"
      },
      {
        "kr": "영화를 보면 이해가 더 쉬울 거예요.",
        "romaji": "Yeonghwaleul bomyeon ihaega deo swiul geoyeyo.",
        "en": "If you watch the movie, you will understand it more easily.",
        "grammar_audio": "/audio/korean/grammar/s_으면/면_eumyeon/myeon_If_when_20231230_영화를_보면_이해가_더_쉬울_거예요.mp3"
      },
      {
        "kr": "날씨가 좋으면 나가서 산책하겠습니다.",
        "romaji": "Nalssi ga joh-eumyeon nagaseo sanchaekhagessseubnida.",
        "en": "If the weather is good, I will go out for a walk.",
        "grammar_audio": "/audio/korean/grammar/s_으면/면_eumyeon/myeon_If_when_20231230_날씨가_좋으면_나가서_산책하겠습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을/를 빼다 [eul/reul ppaeda] (Except for)",
    "short_explanation": "Used to express 'except for' or 'excluding', conveying an exclusion of something from a group or a set.",
    "long_explanation": "The phrase '~을/를 빼다 [eul/reul ppaeda]' is a conjunction used in Korean to imply an exception to the general statement, or to indicate that something is 'not included' or 'excluded'. Therefore, it can be translated as 'except for', 'aside from', or 'discounting' in English. The noun, grouping, or person that we want to make an exception from a group or a set is attached to '~을/를' and '빼다' follows. The sentence '은/는' can be used to describe who or what is included in the group.",
    "formation": "Noun + 을/를 빼다",
    "examples": [
      {
        "kr": "그는 아무 것도 하지 않았어요, 그림 그리는 것을 빼고 말이죠.",
        "romaji": "Geuneun amu geotdo haji anhasseoyo, geurim geurineun geoseul ppaego marijyo.",
        "en": "He didn't do anything, except for drawing pictures.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_빼다_eul/reul_ppaeda_Except_for_20231230_그는_아무_것도_하지_않았어요_그림_그리는_것을_빼고_말이죠.mp3"
      },
      {
        "kr": "모든 학생들이 방과 후에 운동을 했어요, 제가 아픈 것을 빼고 말이죠.",
        "romaji": "Modeun haksaengdeuri banggwa hue undongeul haesseoyo, jegA apeun geoseul ppaego marijyo.",
        "en": "All the students exercised after school, except for me being ill.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_빼다_eul/reul_ppaeda_Except_for_20231230_모든_학생들이_방과_후에_운동을_했어요_제가_아픈_것을_빼고_말이죠.mp3"
      },
      {
        "kr": "저는 모든 과일을 좋아해요, 체리를 빼고 말이에요.",
        "romaji": "Jeoneun modeun gwaireul joahaeyo, cherireul ppaego marieyo.",
        "en": "I like all fruits, except for cherries.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_빼다_eul/reul_ppaeda_Except_for_20231230_저는_모든_과일을_좋아해요_체리를_빼고_말이에요.mp3"
      },
      {
        "kr": "지금까지 모든 영화를 다 봤어요, 코메디를 빼고요.",
        "romaji": "Jigeumkkaji modeun yeongwareul da bwasseoyo, komedireul ppaegoyo.",
        "en": "So far, I've watched all the movies, except for comedies.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_빼다_eul/reul_ppaeda_Except_for_20231230_지금까지_모든_영화를_다_봤어요_코메디를_빼고요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을/를 수 있다 [eul/reul su itda] (Can, possible)",
    "short_explanation": "Used to express the ability or possibility to do something; 'can', 'be able to'.",
    "long_explanation": "'~을/를 수 있다 [eul/reul su itda]' is a verb ending that indicates the speaker's ability or possibility to perform an action in Korean. The subject of the sentence is capable of doing the action expressed by the verb. This verb ending is often used in both formal and informal language to signify capability or possibility so it can translate to 'can', 'be able to', 'possible' in English.",
    "formation": "Verb + ~을/를 수 있다",
    "examples": [
      {
        "kr": "우리는 이 문제를 해결할 수 있어요, 모두 함께 협력하면 충분히 가능하다고 생각해요.",
        "romaji": "Urineun i munjeleul haegyeolhal su isseoyo, modu hamkke hyeopheoghamyeon chungbunhi ganeunghadago saenggakhaeyo.",
        "en": "We can solve this problem, I think it's perfectly possible if we all work together.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_수_있다_eul/reul_su_itda_Can_possible_20231230_우리는_이_문제를_해결할_수_있어요_모두_함께_협력하면_충분히_가능하다고_생각해요.mp3"
      },
      {
        "kr": "나는 내일 그 회의에 참석할 수 있을 것 같아요, 다행히 다른 일정이 없어서 참석 가능한 시간이에요.",
        "romaji": "Naneun naeil geu hoeuie chamseoghal su isseul geos gatayo, dahenghi dareun iljeongi eopseoseo chamseog ganeungnan siganieyo.",
        "en": "I think I can attend the meeting tomorrow, luckily I'm free so the time for participation is available.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_수_있다_eul/reul_su_itda_Can_possible_20231230_나는_내일_그_회의에_참석할_수_있을_것_같아요_다행히_다른_일정이_없어서_참석_가능한_시간이에요.mp3"
      },
      {
        "kr": "당신은 수영을 배우면 언젠가는 자유자재로 수영할 수 있을 거예요, 노력하면 가능합니다.",
        "romaji": "Dangshineun suyeongeul baeumyeon eonjenganeun jayujajaero suyeonghal su isseul geoyeyo, noryeoghamyeon ganeunghamnida.",
        "en": "If you learn swimming, you'll be able to swim freely someday, it's possible if you try.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_수_있다_eul/reul_su_itda_Can_possible_20231230_당신은_수영을_배우면_언젠가는_자유자재로_수영할_수_있을_거예요_노력하면_가능합니다.mp3"
      },
      {
        "kr": "그는 한국어를 열심히 공부하면 TOPIK 시험을 패스할 수 있을 것입니다, 그리고 꼭 성공할 것입니다.",
        "romaji": "Geuneun hangugereul yeolsimhi gongbuhamyeon TOPIK siheomeul paeseuhal su isseul geosibnida, geurigo ggok seonggonghal geosibnida.",
        "en": "If he studies Korean hard, he will be able to pass the TOPIK exam, and he will definitely succeed.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_수_있다_eul/reul_su_itda_Can_possible_20231230_그는_한국어를_열심히_공부하면_TOPIK_시험을_패스할_수_있을_것입니다_그리고_꼭_성공할_것입니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을/를 통해 [eul/reul tonghae] (Through, via)",
    "short_explanation": "Used to express the means, method, or channel through which something is done, achieved, or communicated.",
    "long_explanation": "'~을/를 통해 [eul/reul tonghae]' is a postposition used in Korean to show that something is done, achieved, or communicated through a particular method, medium, or channel. It is used to specify the way how something is done, or the conduit through which information or action is transmitted. This grammar point essentially translates to 'through' or 'via' in English, indicating the process or medium involved.",
    "formation": "Noun + 을/를 통해",
    "examples": [
      {
        "kr": "저는 한국어를 드라마를 통해 배웠어요, 그래서 의미를 더 잘 이해할 수 있었어요.",
        "romaji": "Jeoneun hangugeoreul deurameul tonghae baeweosseoyo, geuraeseo uimireul deo jal ihaehal su isseosseoyo.",
        "en": "I learned Korean through dramas, so I could understand the meanings better.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_통해_eul/reul_tonghae_Through_via_20231230_저는_한국어를_드라마를_통해_배웠어요_그래서_의미를_더_잘_이해할_수_있었어요.mp3"
      },
      {
        "kr": "우리는 이메일을 통해 회의 일정을 조정했어요, 그래서 시간 관리가 더 효율적이었어요.",
        "romaji": "Urineun imeireul tonghae hoeui iljeongeul jojeonghaesseoyo, geuraeseo sigan gwanriga deo hyoyuljeogieosseoyo.",
        "en": "We adjusted the meeting schedule via email, so time management was more efficient.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_통해_eul/reul_tonghae_Through_via_20231230_우리는_이메일을_통해_회의_일정을_조정했어요_그래서_시간_관리가_더_효율적이었어요.mp3"
      },
      {
        "kr": "그는 음악을 통해 자신의 감정을 표현하곤 해요, 음악은 그에게 가장 효과적인 소통 방법이에요.",
        "romaji": "Geuneun eumageul tonghae jasinui gamjeongeul pyohyeonghagon haeyo, eumageun geuege gajang hyogwajeogin sotong bangbeobieyo.",
        "en": "He often expresses his feelings through music, music is the most effective form of communication for him.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_통해_eul/reul_tonghae_Through_via_20231230_그는_음악을_통해_자신의_감정을_표현하곤_해요_음악은_그에게_가장_효과적인_소통_방법이에요.mp3"
      },
      {
        "kr": "사진을 통해 우리는 다른 사람들의 일상생활을 이해하고 공감할 수 있어요.",
        "romaji": "Sajineul tonghae urineun dareun saramdeuri ilsaenghwareul ihaehago gonggamhal su isseoyo.",
        "en": "Through photos, we can understand and empathize with other people's daily lives.",
        "grammar_audio": "/audio/korean/grammar/s_을/를_통해_eul/reul_tonghae_Through_via_20231230_사진을_통해_우리는_다른_사람들의_일상생활을_이해하고_공감할_수_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을까 [eulkka] (Shall we?)",
    "short_explanation": "Used to make a suggestion or proposal; 'shall we?', 'what about?'.",
    "long_explanation": "'~을까 [eulkka]' is a grammar point used in Korean to suggest an idea or action to another person. It is relatively informal and primarily for friendly or casual settings. It is frequently used to ask rhetorical questions to suggest or propose plans or actions. It is similar to 'shall we?' or 'what about?' in English.",
    "formation": "Verb stem + 을까",
    "examples": [
      {
        "kr": "우리 이번 주말에 캠핑을 가볼까?",
        "romaji": "Uri ibeon jumal-e kaemping-eul gabolkkah?",
        "en": "Shall we go camping this weekend?",
        "grammar_audio": "/audio/korean/grammar/s_을까_eulkka_Shall_we_20231230_우리_이번_주말에_캠핑을_가볼까.mp3"
      },
      {
        "kr": "내일 영화를 볼까?",
        "romaji": "Naeil yeonghwa-reul bolkkah?",
        "en": "Shall we watch a movie tomorrow?",
        "grammar_audio": "/audio/korean/grammar/s_을까_eulkka_Shall_we_20231230_내일_영화를_볼까.mp3"
      },
      {
        "kr": "오늘 저녁에 식당에서 저녁을 먹을까?",
        "romaji": "Oneul jeonyeok-e sikdang-eseo jeonyeok-eul meogeulkkah?",
        "en": "Shall we eat dinner at a restaurant tonight?",
        "grammar_audio": "/audio/korean/grammar/s_을까_eulkka_Shall_we_20231230_오늘_저녁에_식당에서_저녁을_먹을까.mp3"
      },
      {
        "kr": "학원 후에 공부를 할까?",
        "romaji": "Hakwon hu-e gongbu-reul halkkah?",
        "en": "Shall we study after going to the academy?",
        "grammar_audio": "/audio/korean/grammar/s_을까_eulkka_Shall_we_20231230_학원_후에_공부를_할까.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을래 [eullae] (Want to)",
    "short_explanation": "Used to express the speaker's intention or will; 'want to'.",
    "long_explanation": "'~을래 [eullae]' is a sentence ending in Korean, used when the speaker wants to express his or her own intention or will to do something. It also implies a suggestion and can be translated as 'want to' in English. It's often used in informal speech between friends or close acquaintances.",
    "formation": "Verb Stem + 을래",
    "examples": [
      {
        "kr": "나는 오늘 밤 영화보러 갈래, 너도 같이 가고 싶어?",
        "romaji": "Naneun oneul bam yeonghwaboreo gallae, neodo gachi gago sip-eo?",
        "en": "I want to go to watch a movie tonight, do you want to go with me?",
        "grammar_audio": "/audio/korean/grammar/s_을래_eullae_Want_to_20231230_나는_오늘_밤_영화보러_갈래_너도_같이_가고_싶어.mp3"
      },
      {
        "kr": "저는 집에서 저녁을 먹을래, 외식하기보다 집에서 먹는 음식이 더 좋아요.",
        "romaji": "Jeoneun jib-eseo jeonyeog-mogeullae, oesik-hagiboda jib-eseo meokneun eumsigi deo joahyo.",
        "en": "I want to eat dinner at home, I prefer home-cooked meals over eating out.",
        "grammar_audio": "/audio/korean/grammar/s_을래_eullae_Want_to_20231230_저는_집에서_저녁을_먹을래_외식하기보다_집에서_먹는_음식이_더_좋아요.mp3"
      },
      {
        "kr": "나는 이번 주말에 친구들과 등산을 갈래, 건강을 위해 운동을 좀 해야 할 것 같아요.",
        "romaji": "Naneun ibeon jumale chingudeulgwa deungsaneul gallae, geongangeul wihae undongeul jom haeya hal geot gat-ayo.",
        "en": "I want to go hiking with my friends this weekend, I think I need to do some exercise for my health.",
        "grammar_audio": "/audio/korean/grammar/s_을래_eullae_Want_to_20231230_나는_이번_주말에_친구들과_등산을_갈래_건강을_위해_운동을_좀_해야_할_것_같아요.mp3"
      },
      {
        "kr": "나는 내일부터 다이어트를 시작할래, 최근에 좀 살이 찐 것 같아서요.",
        "romaji": "Naneun naeilbuteo daieoteu-reul sijak-hallae, choegeune jom sal-i jjin geot gataseoyo.",
        "en": "I want to start a diet from tomorrow, I think I've gained some weight recently.",
        "grammar_audio": "/audio/korean/grammar/s_을래_eullae_Want_to_20231230_나는_내일부터_다이어트를_시작할래_최근에_좀_살이_찐_것_같아서요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을지라도 [euljirado] (Even if)",
    "short_explanation": "Used to express 'Even if', indicating that regardless of the condition, the following statement holds true.",
    "long_explanation": "'~을지라도 [euljirado]' is a conjunctive ending in Korean which means 'even if'. This is usually used to indicate that regardless of the condition stated by the clause ending in '을지라도', the following clause still holds true. In other words, it underlines that the action or state in the main clause will take place irrespective of the circumstances specified in the subordinate clause.",
    "formation": "Verb stem + 을지라도",
    "examples": [
      {
        "kr": "문제가 어려울지라도 포기하지 마세요, 결국에는 해결할 수 있을 것입니다.",
        "romaji": "Munjega eoryeouljirado pogihaji maseyo, gyeolgugen haegyeolhal su isseul geosibnida.",
        "en": "Even if the problem is difficult, don't give up, you will eventually be able to solve it.",
        "grammar_audio": "/audio/korean/grammar/s_을지라도_euljirado_Even_if_20231230_문제가_어려울지라도_포기하지_마세요_결국에는_해결할_수_있을_것입니다.mp3"
      },
      {
        "kr": "이 책이 비싸길지라도 꼭 필요해서 반드시 사야겠어요.",
        "romaji": "I chaegi bissagiljirado ggok piryohaseo bandeusi saya gessoyo.",
        "en": "Even if this book is expensive, I have to buy it because I really need it.",
        "grammar_audio": "/audio/korean/grammar/s_을지라도_euljirado_Even_if_20231230_이_책이_비싸길지라도_꼭_필요해서_반드시_사야겠어요.mp3"
      },
      {
        "kr": "시험이 어려울지라도 열심히 공부하면 분명 성과가 있을 거예요.",
        "romaji": "Siheomi eoryeouljirado yeolsimhi gongbuhamyun bunmyeong seonggaga isseul geoyeyo.",
        "en": "Even if the test is difficult, if you study hard, there will surely be results.",
        "grammar_audio": "/audio/korean/grammar/s_을지라도_euljirado_Even_if_20231230_시험이_어려울지라도_열심히_공부하면_분명_성과가_있을_거예요.mp3"
      },
      {
        "kr": "날씨가 추울지라도 친구들과 약속이 있어서 외출해야 해요.",
        "romaji": "Nalssiga chwiuljirado chingudeulgwa yaksogi isseoseo oechulhaeya haeyo.",
        "en": "Even if the weather is cold, I have to go out because I have a promise with friends.",
        "grammar_audio": "/audio/korean/grammar/s_을지라도_euljirado_Even_if_20231230_날씨가_추울지라도_친구들과_약속이_있어서_외출해야_해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~을지언정 [euljieonjeong] (Whether...or...)",
    "short_explanation": "Used to indicate 'whether...or...', expressing a condition or possibility.",
    "long_explanation": "The grammar point '~을지언정 [euljieonjeong]' is used in Korean to present two possible scenarios or conditions. It translates to 'whether...or...' in English. This form is commonly used to express an uncertain situation where both options hold a possibility, or to emphasize that no matter what the condition might be, the result will be unchanged.",
    "formation": "(Adjective/Verb stem)을지언정 or (Noun + 이)을지언정",
    "examples": [
      {
        "kr": "시험에 떨어질지언정 목표를 향해 노력하는 것이 중요합니다.",
        "romaji": "Siheome tteoreojiljieonjeong mokpyoreul hyanghae noryeokhaneun geosi jungyohabnida.",
        "en": "Whether you fail the exam or not, it's important to strive towards your goal.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Whetheror_20231230_시험에_떨어질지언정_목표를_향해_노력하는_것이_중요합니다.mp3"
      },
      {
        "kr": "벌써 봄이 왔을지언정 아직 추운 날씨예요.",
        "romaji": "Beolsseo bomi wasseuljieonjeong ajik chuun nalssiyeoyo.",
        "en": "Whether spring has already come, the weather is still cold.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Whetheror_20231230_벌써_봄이_왔을지언정_아직_추운_날씨예요.mp3"
      },
      {
        "kr": "방이 클지언정 정리하지 않으면 엉망이 될 것입니다.",
        "romaji": "Bangi keuljieonjeong jeongrihaji anheumyeon eongmangi doel geosibnida.",
        "en": "Whether the room is big or not, it will be a mess if you don't tidy it up.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Whetheror_20231230_방이_클지언정_정리하지_않으면_엉망이_될_것입니다.mp3"
      },
      {
        "kr": "그녀에게 전화 할지언정 그녀가 받을지 안 받을지는 모르겠어요.",
        "romaji": "Geunyeoege jeonhwa haljieonjeong geunyeoga badeulji an badeuljineun moreugesseoyo.",
        "en": "Whether I call her or not, I don't know if she will answer.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Whetheror_20231230_그녀에게_전화_할지언정_그녀가_받을지_안_받을지는_모르겠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이 되다 [i doeda] (Become)",
    "short_explanation": "Used to indicate a change or transformation; 'become'",
    "long_explanation": "'~이 되다 [i doeda]' is a common expression in Korean that is used to demonstrate the transformation or change from one state or condition to another, often referring, but not limited, to changes in weather, job positions, relationships, behaviour, or a particular state. The expression '이 되다' is typically used after a noun.",
    "formation": "Noun + 이 되다",
    "examples": [
      {
        "kr": "가을이라서 날씨가 추워지니까 점점 니트웨어가 필요하다는 것을 느끼게 되어요.",
        "romaji": "Ga-eul-iraseo nalssi-ga chuwo-jini-kka jeomjeom nit-wea-ga pilyohan geot-eul neukkige doeeoyo.",
        "en": "As it becomes autumn and the weather gets colder, I start to feel the need for knitwear.",
        "grammar_audio": "/audio/korean/grammar/s_이_되다_i_doeda_Become_20231230_가을이라서_날씨가_추워지니까_점점_니트웨어가_필요하다는_것을_느끼게_되어요.mp3"
      },
      {
        "kr": "학부생 때는 지망 직업이 변호사였는데, 대학원에서는 교수가 되고 싶다는 생각이 들었어요.",
        "romaji": "Hakbosaeng ttaeneun jimang jig-eob-i byeonhosa-yeossneunde, daehakwon-eseoneun gyosu-ga doego sipda-neun saeng-gag-i deuleosseoyo.",
        "en": "When I was an undergraduate, I aspired to be a lawyer, but in graduate school, I started to think of becoming a professor.",
        "grammar_audio": "/audio/korean/grammar/s_이_되다_i_doeda_Become_20231230_학부생_때는_지망_직업이_변호사였는데_대학원에서는_교수가_되고_싶다는_생각이_들었어요.mp3"
      },
      {
        "kr": "나는 친구들과 공부를 함께하니까 점점 좋은 학생이 되어가고 있어요.",
        "romaji": "Na-neun chingu-deul-gwa gongbu-reul hamkke-hanikka jeomjeom joeun haksaeng-i doeeo-gago iss-eoyo.",
        "en": "I am becoming a better student as I study with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_이_되다_i_doeda_Become_20231230_나는_친구들과_공부를_함께하니까_점점_좋은_학생이_되어가고_있어요.mp3"
      },
      {
        "kr": "얼굴에 흠집이 난 후에, 그 흠집은 큰 흉터가 되었어요.",
        "romaji": "Eolgul-e heumjip-i nan hu-e, geu heumjip-eun keun hyungteo-ga doeeoss-eoyo.",
        "en": "After the face was scratched, that scratch became a big scar.",
        "grammar_audio": "/audio/korean/grammar/s_이_되다_i_doeda_Become_20231230_얼굴에_흠집이_난_후에_그_흠집은_큰_흉터가_되었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이나 ~ [ina] (Either, or)",
    "short_explanation": "Used to provide options or alternatives; 'either', 'or'.",
    "long_explanation": "'~이나 ~ [ina]' is used in Korean to provide alternatives or options between subjects or objects. It's akin to 'either' or 'or' in English. It's commonly used in sentences to express uncertainty or indecision, where more than one choice is available. Note that the first instance of '이나' is attached directly to the end of a word, while the second '나' is usually followed by a verb or adjective.",
    "formation": "Noun1 + 이나 + Noun2 + 나 + Verb/Adjective",
    "examples": [
      {
        "kr": "우리는 주말에 영화를 보러 가거나, 또는 집에서 게임이나 할 것이다.",
        "romaji": "Urineun jumal-e yeonghwareul boreo gageona, tto-neun jib-eseo gaeimirado hal geos-ida.",
        "en": "We are either going to go watch a movie on the weekend, or might play some games at home.",
        "grammar_audio": "/audio/korean/grammar/s_이나__ina_Either_or_20231230_우리는_주말에_영화를_보러_가거나_또는_집에서_게임이나_할_것이다.mp3"
      },
      {
        "kr": "커피나 차나 마시러 가고 싶습니다.",
        "romaji": "Keopina chana masireo gago sipseubnida.",
        "en": "I want to go for either coffee or tea.",
        "grammar_audio": "/audio/korean/grammar/s_이나__ina_Either_or_20231230_커피나_차나_마시러_가고_싶습니다.mp3"
      },
      {
        "kr": "오늘이나 내일이나 언제나 돼.",
        "romaji": "Oneulina naeuirina eonjena dwae.",
        "en": "Either today or tomorrow, anytime is fine.",
        "grammar_audio": "/audio/korean/grammar/s_이나__ina_Either_or_20231230_오늘이나_내일이나_언제나_돼.mp3"
      },
      {
        "kr": "이번 달에는 여행을 가거나, 또는 집에서 책이나 읽을 계획이다.",
        "romaji": "Ibeon dar-eneun yeohaengeul gageona, tto-neun jib-eseo chaegina ilgeun gyehoeg-ida.",
        "en": "This month, I am planning to either go on a trip, or read books at home.",
        "grammar_audio": "/audio/korean/grammar/s_이나__ina_Either_or_20231230_이번_달에는_여행을_가거나_또는_집에서_책이나_읽을_계획이다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이라도 [irado] (At least)",
    "short_explanation": "Used to express 'at least', 'even if', or 'even'.",
    "long_explanation": "'~이라도 [irado]' is used in Korean to convey a meaning of the least favorable option or an alternative under a certain condition, similar to 'at least' or 'even if' in English. It allows the speaker to reduce the degree of a certain expectation or to express a minimal request when there seems to be no other options.",
    "formation": "Noun or verb stem + 이라도",
    "examples": [
      {
        "kr": "이 비싼 가격에도 불구하고, 저기 있는 음식이라도 사먹어야겠어요. 제가 아무것도 먹지 않으면 아무런 힘이 없을 테니까요.",
        "romaji": "I bissan gagyeogedo bulguhago, jeogi inneun eumsigirado sameogeoya getsseoyo. Jega amugeotdo meokji an-eumyeon amuron himi eobs-eul tenikka yo.",
        "en": "Even though it's expensive, I must at least buy and eat the food over there. If I don't eat anything, I won't have any energy.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_20231230_이_비싼_가격에도_불구하고_저기_있는_음식이라도_사먹어야겠어요_제가_아무것도_먹지_않으면_아무런_힘이_없을_테니까요.mp3"
      },
      {
        "kr": "오늘의 일정이 아주 바쁜데, 저녁이라도 제대로 먹어야 할 것 같아요.",
        "romaji": "Oneulyi iljeongi aju bappeunde, jeonyeogirado jedaero meogeoya hal geot gatayo.",
        "en": "Today's schedule is very busy, but I think I should at least have a proper dinner.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_20231230_오늘의_일정이_아주_바쁜데_저녁이라도_제대로_먹어야_할_것_같아요.mp3"
      },
      {
        "kr": "그의 성격이 별로지만, 일이라도 잘해서 팀에서 중요한 사람이에요.",
        "romaji": "Geuui seonggyeogi byeollojiman, irirado jalhaeseo timeseo jungyohan sarameyo.",
        "en": "Even though his personality is not great, he does his work well so he is an important person in the team.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_20231230_그의_성격이_별로지만_일이라도_잘해서_팀에서_중요한_사람이에요.mp3"
      },
      {
        "kr": "이번 시험이 어렵다고들 하지만, 돌아가는 이라도 따라가야겠어요.",
        "romaji": "Ibeon siheomi eoryeobdagodeul hajiman, doraganeun irado ddaragayagesseoyo.",
        "en": "Even though they say this exam is difficult, I should at least follow what's going on.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_20231230_이번_시험이_어렵다고들_하지만_돌아가는_이라도_따라가야겠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이랑 [irang] (And, with)",
    "short_explanation": "Used to express ', and' or ', with' when connecting two or more nouns.",
    "long_explanation": "'~이랑 [irang]' is a common conjunction used in Korean to connect two or more nouns, similar to 'and' or 'with' in English. It is often used in everyday spoken language, making it quite informal. It can be used to introduce people, things, or ideas, or to list items or actions in sequence.",
    "formation": "Noun + 이랑 + Noun",
    "examples": [
      {
        "kr": "제가 오늘 친구이랑 영화를 보러 갔어요.",
        "romaji": "Jega oneul chingu irang yeonghwareul boreo gasseoyo.",
        "en": "I went to see a movie with a friend today.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20231230_제가_오늘_친구이랑_영화를_보러_갔어요.mp3"
      },
      {
        "kr": "저는 커피이랑 케이크를 주문했어요.",
        "romaji": "Jeoneun keopi irang keikeu reul jumunhaesseoyo.",
        "en": "I ordered coffee and cake.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20231230_저는_커피이랑_케이크를_주문했어요.mp3"
      },
      {
        "kr": "언니이랑 나는 같은 옷을 입었어요.",
        "romaji": "Eonnirang naneun gateun otseul ibeosseoyo.",
        "en": "My sister and I wore the same clothes.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20231230_언니이랑_나는_같은_옷을_입었어요.mp3"
      },
      {
        "kr": "아빠이랑 엄마는 서울에 살아요.",
        "romaji": "Appa irang eommaneun seoul-e sal-ayo.",
        "en": "My dad and mom live in Seoul.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20231230_아빠이랑_엄마는_서울에_살아요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이래 [irae] (Since)",
    "short_explanation": "Used to express a certain period of time from a past point to the present; 'since'.",
    "long_explanation": "'~이래 [irae]' is a connector used in Korean to express a duration of time from a certain past point or event until the present moment. It is similar to the concept of 'since' in English, marking a starting point in the past from which a condition or event has continued. It should be used with a verb in pasttense that signifies a specific past event or point in time.",
    "formation": "Verb(past tense) + 이래",
    "examples": [
      {
        "kr": "제가 태어난 이래 가장 추운 겨울이었어요, 이렇게 추운 날씨를 경험한 적이 없어요.",
        "romaji": "Jega taeeonan irae gajang chuun gyeouliyeosseoyo, ireohge chuun nalssireul gyeongheomhan jeogi eopseoyo.",
        "en": "It was the coldest winter since I was born, I have never experienced such cold weather.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_20231230_제가_태어난_이래_가장_추운_겨울이었어요_이렇게_추운_날씨를_경험한_적이_없어요.mp3"
      },
      {
        "kr": "그가 학교를 졸업한 이래로 처음으로 그를 다시 만났어요.",
        "romaji": "Geuga hakgyoreul joleobhan iraero cheoeumeuro geureul dasi mannasseoyo.",
        "en": "I met him for the first time since he graduated from school.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_20231230_그가_학교를_졸업한_이래로_처음으로_그를_다시_만났어요.mp3"
      },
      {
        "kr": "요즘 우리 동네에 이사 온 이래로 친구가 한 명도 없어져서 정말로 외로워요.",
        "romaji": "Yojum uri dongne-e isa on iraero chinguga han myeongdo eopseojyeoseo jeongmalro oeroweoyo.",
        "en": "I've been really lonely since I moved to our neighborhood these days, as I have no friends at all.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_20231230_요즘_우리_동네에_이사_온_이래로_친구가_한_명도_없어져서_정말로_외로워요.mp3"
      },
      {
        "kr": "퇴근한 이래 바쁘게 일을 처리하느라 휴식도 못 했어요.",
        "romaji": "Towig-han irae bappeuge ileul cheolihaneula hyusikdo mot haess-eoyo.",
        "en": "I haven't been able to rest since I finished work because I've been busy handling affairs.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_20231230_퇴근한_이래_바쁘게_일을_처리하느라_휴식도_못_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이므로 [imyeo] (Because, so)",
    "short_explanation": "Used to express a reason or cause; 'because', 'so'.",
    "long_explanation": "The Korean grammar point '이므로 [imyeo]' is a conjunctive adverb that is used to present a cause or reason and it typically comes in the middle of a sentence. It can be translated into English as 'because' or 'so'. It indicates that the preceding clause is the reason or cause for the information in clause that follows.",
    "formation": "Noun + 이다 + 이므로 / Adj. Verb + 이므로",
    "examples": [
      {
        "kr": "오늘 비가 오므로 나는 우산을 가져갔습니다.",
        "romaji": "Oneul biga omuro naneun usaneul gajyeogassseubnida.",
        "en": "Because it is raining today, I brought an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imyeo_Because_so_20231230_오늘_비가_오므로_나는_우산을_가져갔습니다.mp3"
      },
      {
        "kr": "그녀는 좋은 성적을 받으므로 기가 막히다.",
        "romaji": "Geunyeoneun joheun seongjeogeul badeumuro giga makida.",
        "en": "Because she's received good grades, it's astonishing.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imyeo_Because_so_20231230_그녀는_좋은_성적을_받으므로_기가_막히다.mp3"
      },
      {
        "kr": "이 작업은 어렵므로 조심해야 합니다.",
        "romaji": "I jageobeun eoryeoumuro josimhaeya haseupnida.",
        "en": "Because this job is difficult, you need to be careful.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imyeo_Because_so_20231230_이_작업은_어렵므로_조심해야_합니다.mp3"
      },
      {
        "kr": "내일로 치료를 미루지 마세요, 왜냐하면 상황이 심각하므로.",
        "romaji": "Naeillo chiryoreul miruji maseyo, waenyahamyeon sanghwangi simgagimuro.",
        "en": "Do not postpone the treatment until tomorrow, because the situation is serious.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imyeo_Because_so_20231230_내일로_치료를_미루지_마세요_왜냐하면_상황이_심각하므로.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이어서 [ieoseo] (And then, so)",
    "short_explanation": "Used to indicate a following action or outcome as a result of a preceding event; 'and then', 'so'.",
    "long_explanation": "'~이어서 [ieoseo]' is a conjunction used in Korean to narrate events in chronological order, or explain outcomes as a result of preceding situations. It translates to 'and then' when used to connect successive events and 'so' when used to denote an outcome or a result of a cause. It is useful in storytelling and sharing experiences or explaining logical sequences.",
    "formation": "Action Verb + -아/어서, depending on vowel harmony",
    "examples": [
      {
        "kr": "저는 오늘 일찍 집에 와서 책을 읽었어요. 책을 읽은 후에는 잤어요.",
        "romaji": "Jeoneun oneul iljjik jibe waseo chaegul ilgosseoyo. Chaegul ilkun hueneun jasseoyo.",
        "en": "I came home early today and then read a book. After reading the book, I slept.",
        "grammar_audio": "/audio/korean/grammar/s_이어서_ieoseo_And_then_so_20231230_저는_오늘_일찍_집에_와서_책을_읽었어요_책을_읽은_후에는_잤어요.mp3"
      },
      {
        "kr": "오늘 아침에 비가 와서 나가기 힘들었어요, 그래서 집에서 쉬었어요.",
        "romaji": "Oneul achime biga waseo nagagi himdeureosseoyo, geuraeseo jibeseo swieosseoyo.",
        "en": "It was raining this morning so it was hard to go outside, so I rested at home.",
        "grammar_audio": "/audio/korean/grammar/s_이어서_ieoseo_And_then_so_20231230_오늘_아침에_비가_와서_나가기_힘들었어요_그래서_집에서_쉬었어요.mp3"
      },
      {
        "kr": "친구를 만나러 가게 되었어요. 맛있는 음식을 먹었어요.",
        "romaji": "Chingureul mannareo gage doeeosseoyo. Mashit-neun eumsigeul meogeosseoyo.",
        "en": "I ended up meeting a friend. And then, we ate delicious food.",
        "grammar_audio": "/audio/korean/grammar/s_이어서_ieoseo_And_then_so_20231230_친구를_만나러_가게_되었어요_맛있는_음식을_먹었어요.mp3"
      },
      {
        "kr": "고양이를 보았어요, 너무 귀여워서 사진을 찍었어요.",
        "romaji": "Goyangireul boatseoyo, neomu gwiyeowoseo sajineul jjigeosseoyo.",
        "en": "I saw a cat and it was so cute, so I took a photo.",
        "grammar_audio": "/audio/korean/grammar/s_이어서_ieoseo_And_then_so_20231230_고양이를_보았어요_너무_귀여워서_사진을_찍었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~이지만 [ijiman] (But, however)",
    "short_explanation": "Used to express 'but' or 'however' in a sentence, showing contrast or contradiction.",
    "long_explanation": "'~이지만 [ijiman]' is a conjunctive expression used in Korean to show contrast or contradiction between two clauses. It can be translated to 'but' or 'however' in English. Typically, the clause before ~이지만 states something positive or desirable, and the clause after ~이지만 introduces a conflicting point or negates the prior clause, creating a sense of contrast or contradiction.",
    "formation": "Verbs/Adjectives + 이지만",
    "examples": [
      {
        "kr": "날씨가 매우 좋이지만, 제가 외출할 시간이 없어요.",
        "romaji": "Nalssiga maeu joijiman, jega oechulhal sigani eopseoyo.",
        "en": "The weather is very nice, but I have no time to go out.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_however_20231230_날씨가_매우_좋이지만_제가_외출할_시간이_없어요.mp3"
      },
      {
        "kr": "저는 피자를 좋아하이지만, 다이어트 때문에 먹을 수 없어요.",
        "romaji": "Jeoneun pijareul joahaijiman, daieoteu ttaemune meogeul su eopseoyo.",
        "en": "I like pizza, but I can't eat it because of my diet.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_however_20231230_저는_피자를_좋아하이지만_다이어트_때문에_먹을_수_없어요.mp3"
      },
      {
        "kr": "이 노래는 유명 이지만, 저는 별로 좋아하지 않아요.",
        "romaji": "I noraeneun yumyeong ijiman, jeoneun byeollo joahaji anhayo.",
        "en": "This song is famous, but I don't really like it.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_however_20231230_이_노래는_유명_이지만_저는_별로_좋아하지_않아요.mp3"
      },
      {
        "kr": "친구가 저에게 돈을 줄 것이라고 약속했지만, 아직도 받지 않았어요.",
        "romaji": "Chinguga jeoege doneul jul geotirago yaksokhaetjiman, ajikdo badji anhasseoyo.",
        "en": "My friend promised to give me some money, but I still haven't received it.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_however_20231230_친구가_저에게_돈을_줄_것이라고_약속했지만_아직도_받지_않았어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~인/는데 [in/neunde] (But, so)",
    "short_explanation": "Used to express a contrast, reason, or cause; 'but', 'so'.",
    "long_explanation": "'~인/는데 [in/neunde]' is a conjunction used in Korean to connect two sentences, indicating a contrast or a reason between the two sentences. It could translate into 'but', 'so', 'however', or 'although' in English. It is used to connect the clauses, express reason or cause, being the starting of the next expression, or connect contrasting situations or conditions.",
    "formation": "Verb/Noun + ~인/는데",
    "examples": [
      {
        "kr": "오늘 날씨가 좋은데 외출하지 않을 거 같아요, 저는 집에서 영화를 보려고 해요.",
        "romaji": "Oneul nalssiga johneunde oechulhaji anheul geo gatayo, jeoneun jibeseo yeonghwareul boryeogo haeyo.",
        "en": "The weather is good today, but I think I won't go out. I plan to watch a movie at home.",
        "grammar_audio": "/audio/korean/grammar/s_인/는데_in/neunde_But_so_20231230_오늘_날씨가_좋은데_외출하지_않을_거_같아요_저는_집에서_영화를_보려고_해요.mp3"
      },
      {
        "kr": "잠을 잘 수 있었는데 알람 소리 때문에 일어났어요.",
        "romaji": "Jameul jal su isseossneunde allam sori ttaemune ileonasseoyo.",
        "en": "I could have slept well, but I woke up because of the alarm sound.",
        "grammar_audio": "/audio/korean/grammar/s_인/는데_in/neunde_But_so_20231230_잠을_잘_수_있었는데_알람_소리_때문에_일어났어요.mp3"
      },
      {
        "kr": "저는 한국어를 배우고 있는데 발음이 어려워서 가끔 힘들어요.",
        "romaji": "Jeoneun hangug-eoleul baeugo issneunde bal-um-i eolyeowoseo gakkeum himdeul-eoyo.",
        "en": "I am learning Korean, but sometimes it's hard because the pronunciation is difficult.",
        "grammar_audio": "/audio/korean/grammar/s_인/는데_in/neunde_But_so_20231230_저는_한국어를_배우고_있는데_발음이_어려워서_가끔_힘들어요.mp3"
      },
      {
        "kr": "구직 심사가 어려웠는데, 다행히도 í요 직업을 찾을 수 있었어요.",
        "romaji": "Gu-jig sim-sa-ga eo-ryeowossneunde, da-haeng-hi-do i yo jik-eob-eul chaj-eul su iss-eoss-eoyo.",
        "en": "The job hunting process was tough, but fortunately, I was able to find this job.",
        "grammar_audio": "/audio/korean/grammar/s_인/는데_in/neunde_But_so_20231230_구직_심사가_어려웠는데_다행히도_í요_직업을_찾을_수_있었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~자 [ja] (Let’s)",
    "short_explanation": "Used to suggest or propose an action; 'let's'.",
    "long_explanation": "'~자 [ja]' is a conjugation used in Korean to suggest, propose, or encourage an action, similar to the English phrase 'let's'. It is often used in an informal context, and is usually appended directly to the verb stem. In conversations, it's a useful phrase to propose an idea on what to do.",
    "formation": "Verb stem + 자",
    "examples": [
      {
        "kr": "우리 영화보러 가자, 여기에 있는 신작 영화를 봐야 해요.",
        "romaji": "Uri yeonghwaboreo gaja, yeogie issneun sinjak yeonghwareul bwaya haeyo.",
        "en": "Let's go watch a movie, we have to watch the new movie here.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20231230_우리_영화보러_가자_여기에_있는_신작_영화를_봐야_해요.mp3"
      },
      {
        "kr": "밖에 날씨가 좋으니까 산책하러 가자.",
        "romaji": "Bakke nalssiga johunikka sanchaekhareo gaja.",
        "en": "The weather is nice outside, let's go for a walk.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20231230_밖에_날씨가_좋으니까_산책하러_가자.mp3"
      },
      {
        "kr": "지금부터 공부하자, 시험은 가까운데 아직 개념을 이해하지 못했어요.",
        "romaji": "Jigeumbuteo gongbuhaja, siheomeun gakkaunde ajik gaenyeomeul ihaehaji mothayeo.",
        "en": "Let's study from now on, the exam is near and I still don't understand the concept.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20231230_지금부터_공부하자_시험은_가까운데_아직_개념을_이해하지_못했어요.mp3"
      },
      {
        "kr": "맛있는 점심을 먹었으니까 잠깐 쉬자, 배가 너무 부르니까 좀 쉬어요.",
        "romaji": "Masissneun jeomsimeul meogeossunikka jamkkan swija, baega neomu bureunikka jom swieoyo.",
        "en": "We had a delicious lunch, so let's take a break, my stomach is so full that I need to rest.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20231230_맛있는_점심을_먹었으니까_잠깐_쉬자_배가_너무_부르니까_좀_쉬어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~자마자 [jamaja] (As soon as)",
    "short_explanation": "Used to indicate that event B occurs immediately after event A.",
    "long_explanation": "'~자마자 [jamaja]' is a conjugation used in Korean to indicate that an event B occurs immediately or directly after event A. It is akin to 'as soon as' in English. It is commonly used when you want to emphasize that there was no gap or delay between two actions. The action expressed in the first clause comes directly without any pause after the action in the second clause.",
    "formation": "Verb stem + 자마자",
    "examples": [
      {
        "kr": "학교에 도착하자마자 친구를 만났어요. 아침에 너무 바빠서 전화도 못 했어요.",
        "romaji": "Hakgyoe dochakhamjamaja chingureul mannasseoyo. Achime neomu bappaseo jeonhwado mot haesseoyo.",
        "en": "As soon as I arrived at school, I met my friend. I was so busy in the morning that I couldn't even call.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20231230_학교에_도착하자마자_친구를_만났어요_아침에_너무_바빠서_전화도_못_했어요.mp3"
      },
      {
        "kr": "문을 열자마자 고양이가 나가버렸어요. 한시도 쉬지 않고 찾아야 했어요.",
        "romaji": "Muneul yeoljamaja goyangiga nagabeoryeosseoyo. Hansido swiji anhgo chajaya haesseoyo.",
        "en": "As soon as I opened the door, the cat ran out. I had to search without resting for a moment.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20231230_문을_열자마자_고양이가_나가버렸어요_한시도_쉬지_않고_찾아야_했어요.mp3"
      },
      {
        "kr": "비행기가 착륙하자마자 핸드폰을 켰어요. 중요한 전화가 있을 줄 알았어요.",
        "romaji": "Bihaenggiga chakryukhamjamaja haendeuponeul kyeosseoyo. Jungyohan jeonhwaga isseul jul alasseoyo.",
        "en": "As soon as the airplane landed, I turned on my cell phone. I thought there would be an important call.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20231230_비행기가_착륙하자마자_핸드폰을_켰어요_중요한_전화가_있을_줄_알았어요.mp3"
      },
      {
        "kr": "집에 돌아오자마자 씻었어요. 오늘 너무 더워서 꼭 씻어야 했어요.",
        "romaji": "Jibe doraojamaja ssisseosseoyo. Oneul neomu deowoseo ggok ssisseoya haesseoyo.",
        "en": "As soon as I got home, I took a shower. It was so hot today that I had to shower.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20231230_집에_돌아오자마자_씻었어요_오늘_너무_더워서_꼭_씻어야_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~처럼 [cheoreom] (Like, as)",
    "short_explanation": "Used to express similarity or imitation; 'like', 'as'.",
    "long_explanation": "'~처럼 [cheoreom]' is a postposition used in Korean to show comparison, resemblance, or imitation. It is often translated as 'like' or 'as' in English and compares two different things, expressing that one thing is similar to or acts like another. You can use it with both nouns and verbs.",
    "formation": "Noun/Verb + 처럼",
    "examples": [
      {
        "kr": "그의 눈은 별처럼 반짝반짝 빛나고 있어요.",
        "romaji": "Geuui nuneun byeolcheoreom banjjakbanjjak bitnago isseoyo.",
        "en": "His eyes are shining like stars.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_20231230_그의_눈은_별처럼_반짝반짝_빛나고_있어요.mp3"
      },
      {
        "kr": "우리 아버지는 늘 날개가 달린 말처럼 열심히 일해요.",
        "romaji": "Uri abeojineun neul nalgae ga dallin malcheoreom yeolsimhi ilhaeyo.",
        "en": "My father always works hard as if he was a horse with wings.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_20231230_우리_아버지는_늘_날개가_달린_말처럼_열심히_일해요.mp3"
      },
      {
        "kr": "그녀는 수영을 물고기처럼 잘 해요.",
        "romaji": "Geunyeoneun suyeongeul mulgogicheoreom jal haeyo.",
        "en": "She swims as well as a fish.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_20231230_그녀는_수영을_물고기처럼_잘_해요.mp3"
      },
      {
        "kr": "오늘 하루 종일 나는 새처럼 자유롭게 날아다녔어요.",
        "romaji": "Oneul haru jongil naneun saecheoreom jayurobge naradanwosseoyo.",
        "en": "I flew around freely like a bird all day today.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_20231230_오늘_하루_종일_나는_새처럼_자유롭게_날아다녔어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~쯤 [jjeum] (Around, about)",
    "short_explanation": "Used to indicate approximation; 'around', 'about'.",
    "long_explanation": "'쯤 [jjeum]' is a suffixed particle used in Korean to demonstrate approximation or estimated range. It is often used when the speaker is not sure of the exact amount, time, or degree but gives an approximate idea. It can be compared to the English equivalent of 'around' or 'about' and is used in a variety of contexts to loosely define a quantity, time, or degree without stating an exact value.",
    "formation": "Noun (relating to number, quantity, or time) + 쯤",
    "examples": [
      {
        "kr": "시험이 어렵기 때문에 공부를 하루에 3시간쯤은 해야 해요.",
        "romaji": "Siheom-i eoryeobgikkaji, gongbu-chingchaneuro 3si-gan-jjeum-eun haeya ha-yo.",
        "en": "Because the exam is difficult, you have to study about 3 hours a day.",
        "grammar_audio": "/audio/korean/grammar/s_쯤_jjeum_Around_about_20231230_시험이_어렵기_때문에_공부를_하루에_3시간쯤은_해야_해요.mp3"
      },
      {
        "kr": "저희 집에서 버스로 가면 약 20분쯤 걸릴 것 같아요.",
        "romaji": "Jeohui jipeseo beoseuro gamyeon yak 20bunjjeum geollil geot gatayo.",
        "en": "It seems like it will take about 20 minutes to get there by bus from my house.",
        "grammar_audio": "/audio/korean/grammar/s_쯤_jjeum_Around_about_20231230_저희_집에서_버스로_가면_약_20분쯤_걸릴_것_같아요.mp3"
      },
      {
        "kr": "오늘 날씨가 더워서 온도가 30도쯤 될 것 같아요.",
        "romaji": "Oneul nalssiga deowoseo ondogu 30dojjeum doel geot gatayo.",
        "en": "Since the weather is hot today, I think the temperature will be around 30 degrees.",
        "grammar_audio": "/audio/korean/grammar/s_쯤_jjeum_Around_about_20231230_오늘_날씨가_더워서_온도가_30도쯤_될_것_같아요.mp3"
      },
      {
        "kr": "그 책을 읽으려면 한주 정도쯤 걸릴 것 같아요.",
        "romaji": "Geu chaekeul ilgeuryeomyeon hanju jeongdojjeum geollil geot gatayo.",
        "en": "I think it will take about a week to read that book.",
        "grammar_audio": "/audio/korean/grammar/s_쯤_jjeum_Around_about_20231230_그_책을_읽으려면_한주_정도쯤_걸릴_것_같아요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~지 않다 [ji anta] (Not)",
    "short_explanation": "Used to express a negative verb or sentence; 'Not'.",
    "long_explanation": "'~지 않다 [ji anta]' is a verb ending used in Korean to express negative verbs or sentences. It literally means 'not', turning a verb into a negative. It is attached directly to the verb stem, removing the '다' from the dictionary form of the verb. This formation is used in both formal and informal settings, and helps express a negation or refusal of action.",
    "formation": "Verb stem + ~지 않다",
    "examples": [
      {
        "kr": "제가 이번 회의에 참석하지 않을 것입니다, 왜냐하면 그 시간에 다른 중요한 일정이 있어요.",
        "romaji": "Jega ibeon hoeuie chamseokji anteu geosimnida, waenyahamyeon geu sigane dareun jungyohan iljeongi isseoyo.",
        "en": "I will not attend this meeting because I have another important schedule at that time.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Not_20231230_제가_이번_회의에_참석하지_않을_것입니다_왜냐하면_그_시간에_다른_중요한_일정이_있어요.mp3"
      },
      {
        "kr": "우리 아빠는 흡연하지 않아요, 그래서 우리 집은 항상 신선한 공기가 가득해요.",
        "romaji": "Uri appaneun heubyunji anhnayo, geuraeseo uri jip-eun hangsang sinseonhan gong-gi-ga gadeughaeyo.",
        "en": "My father does not smoke, so our house is always full of fresh air.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Not_20231230_우리_아빠는_흡연하지_않아요_그래서_우리_집은_항상_신선한_공기가_가득해요.mp3"
      },
      {
        "kr": "그녀는 항상 밝은 표정을 지니지 않아서 다른 사람들로부터 거리감을 느껴요.",
        "romaji": "Geunyeoneun hangsang balgeun pyojeongeul jiniji anhaseo dareun saramdeulrobuteo georigameul neukyeoyo.",
        "en": "She does not always have a bright expression, so she feels distanced from other people.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Not_20231230_그녀는_항상_밝은_표정을_지니지_않아서_다른_사람들로부터_거리감을_느껴요.mp3"
      },
      {
        "kr": "저는 육류를 먹지 않아요, 그래서 항상 채식주의에 맞는 식사를 해야 해요.",
        "romaji": "Jeoneun yuklyureul meokji anhayo, geuraeseo hangsang chaesikjuuie majneun sigsareul haeya haeyo.",
        "en": "I do not eat meat, so I always have to eat a vegetarian diet.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Not_20231230_저는_육류를_먹지_않아요_그래서_항상_채식주의에_맞는_식사를_해야_해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~지만 [jiman] (But)",
    "short_explanation": "Used to express contrast or contradiction; 'but', 'however'.",
    "long_explanation": "'~지만 [jiman]' is a conjunction used in Korean to indicate a contrasting situation or contradiction. It conveys a sense of 'but' or 'however' in English. It is utilized when the speaker wants to present a fact or situation that seems to contradict or contrast with another fact or situation that has been talked about prior.",
    "formation": "Verb/Adjective + 지만, Noun + 이지만/지만",
    "examples": [
      {
        "kr": "저는 아주 피곤하지만, 이일을 끝내야 해서 계속해야 할 것 같아요.",
        "romaji": "Jeoneun aju pigonhajiman, iireul kkeunnaeya haeseo gyesokhaeya hal geot gatayo.",
        "en": "I'm very tired, but I think I have to keep going because I have to finish this work.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jiman_But_20231230_저는_아주_피곤하지만_이일을_끝내야_해서_계속해야_할_것_같아요.mp3"
      },
      {
        "kr": "그 음식은 맛이 없지만, 영양이 가득해서 먹어야해요.",
        "romaji": "Geu eumsikeun masi eobjiman, yeongangi gadeukhaeseo meogeoya haeyo.",
        "en": "The food is not tasty, but I have to eat it because it's full of nutrients.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jiman_But_20231230_그_음식은_맛이_없지만_영양이_가득해서_먹어야해요.mp3"
      },
      {
        "kr": "여러분들 중에는 문제가 어렵다고 느낀 사람도 있겠지만, 포기하면 안 돼요.",
        "romaji": "Yeoreobundeul jungeoneun munjega eoryeobdagoneun nigan saramdo itgetjiman, pogihamyeon an doeyo.",
        "en": "There might be some of you who find the problem difficult, but you should not give up.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jiman_But_20231230_여러분들_중에는_문제가_어렵다고_느낀_사람도_있겠지만_포기하면_안_돼요.mp3"
      },
      {
        "kr": "그는 성격이 좋지만, 명확히 의견을 말하는 것은 좀 어려워해요.",
        "romaji": "Geuneun seonggyeogi joajiman, myeonghwakhi uigyeongeul malhaneun geoseun jom eoryeowo haeyo.",
        "en": "He has a good personality, but he finds it a bit difficult to express his opinions clearly.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jiman_But_20231230_그는_성격이_좋지만_명확히_의견을_말하는_것은_좀_어려워해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~지요/~죠 [jiyo/jyo] (Isn’t it?, right?)",
    "short_explanation": "Used to confirm or seek agreement on a statement; 'isn't it?', 'right?'",
    "long_explanation": "The '지요' or '죠' ending is a way to seek an agreement or confirmation from the listener, kind of like saying ‘right?’ or ‘isn’t it?’ at the end of sentences in English. It can be used in both informal and formal contexts, differing mainly in politeness level. It is a softer way of asserting something, and can also be used to request a confirmation from the person you are speaking to.",
    "formation": "Verb + 지요/죠 or Adjective + 지요/죠",
    "examples": [
      {
        "kr": "오늘 날씨가 좋아지요.",
        "romaji": "Oneul nalssiga joajyo.",
        "en": "The weather is nice today, isn't it?",
        "grammar_audio": "/audio/korean/grammar/s_지요/죠_jiyo/jyo_Isnt_it_right_20231230_오늘_날씨가_좋아지요.mp3"
      },
      {
        "kr": "우리는 같은 반에 있었지요?",
        "romaji": "Urineun gateun bane isseotjiyo?",
        "en": "We were in the same class, right?",
        "grammar_audio": "/audio/korean/grammar/s_지요/죠_jiyo/jyo_Isnt_it_right_20231230_우리는_같은_반에_있었지요.mp3"
      },
      {
        "kr": "이 일을 끝내야겠죠?",
        "romaji": "I ireul kkeutnaeyagetjyo?",
        "en": "We have to finish this work, don't we?",
        "grammar_audio": "/audio/korean/grammar/s_지요/죠_jiyo/jyo_Isnt_it_right_20231230_이_일을_끝내야겠죠.mp3"
      },
      {
        "kr": "그 영화 진짜 재미있었지요?",
        "romaji": "Geu yeonghwa jinjja jaemiisseotjiyo?",
        "en": "That movie was really fun, wasn't it?",
        "grammar_audio": "/audio/korean/grammar/s_지요/죠_jiyo/jyo_Isnt_it_right_20231230_그_영화_진짜_재미있었지요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~하고 [hago] (And, with)",
    "short_explanation": "'~하고 [hago]' is used to connect nouns and verb stems to indicate 'and', 'with', or 'as'.",
    "long_explanation": "'~하고 [hago]' is a postposition in Korean that indicates conjunction or inclusion. When used between two nouns, it corresponds to 'and' in English and indicates that both nouns are involved in the situation. When used between a noun and a verb, '~하고 [hago]' corresponds to 'with' in English and indicates a role of a noun in the action",
    "formation": "Noun1 + 하고 + Noun2 (to indicate and) / Noun + 하고 + Verb (to indicate with)",
    "examples": [
      {
        "kr": "저는 커피하고 도넛을 주문했어요.",
        "romaji": "Jeoneun keopi hago doneuteul jumunhaesseoyo.",
        "en": "I ordered coffee and doughnuts.",
        "grammar_audio": "/audio/korean/grammar/s_하고_hago_And_with_20231230_저는_커피하고_도넛을_주문했어요.mp3"
      },
      {
        "kr": "우리는 함께하고 이야기하며 즐거운 시간을 보냈어요.",
        "romaji": "Urineun hamkke hago iyagihameyhe jeulgeoun siganeul bonaesseoyo.",
        "en": "We had a good time talking and being together.",
        "grammar_audio": "/audio/korean/grammar/s_하고_hago_And_with_20231230_우리는_함께하고_이야기하며_즐거운_시간을_보냈어요.mp3"
      },
      {
        "kr": "나는 딸기하고 바나나를 믹서에 넣어 스무디를 만들었어요.",
        "romaji": "Naneun ttalgihago bananareul mikseo-e neoh-eo seumudireul mandeuleosseoyo.",
        "en": "I put strawberries and bananas in a blender and made a smoothie.",
        "grammar_audio": "/audio/korean/grammar/s_하고_hago_And_with_20231230_나는_딸기하고_바나나를_믹서에_넣어_스무디를_만들었어요.mp3"
      },
      {
        "kr": "그는 친구하고 축구를 하려고 공원에 갔어요.",
        "romaji": "geuneun chinguhago chukgureul haryeogo gong-won-e gass-eoyo.",
        "en": "He went to the park to play soccer with his friend.",
        "grammar_audio": "/audio/korean/grammar/s_하고_hago_And_with_20231230_그는_친구하고_축구를_하려고_공원에_갔어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "50"
  },
  {
    "title": "~하기로 [hagiro] (Decide to)",
    "short_explanation": "Used to express a decision made to do something.",
    "long_explanation": "'~하기로 [hagiro]' is a postposition used in Korean to indicate that a decision has been made to do a certain action. It is widely used in daily conversations to tell about decisions, plans or arrange meetings. It can be translated as ‘decide to’ in English and is often used to express a decision or resolve.",
    "formation": "Verb stem + 기로",
    "examples": [
      {
        "kr": "우리는 내일 서울로 가기로 결정했어요, 그곳에서 친구들을 만나기로 해서요.",
        "romaji": "Urineun naeil Seoul-lo gagiro gyeoljeonghaesseoyo, geugoseseo chingudeul-eul mannagiro haesyeoyo.",
        "en": "We decided to go to Seoul tomorrow, because we decided to meet friends there.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_hagiro_Decide_to_20231230_우리는_내일_서울로_가기로_결정했어요_그곳에서_친구들을_만나기로_해서요.mp3"
      },
      {
        "kr": "나는 다음 달에 새로운 일을 시작하기로 결정했습니다, 이번 일은 너무 지루해서요.",
        "romaji": "Naneun daeum dal-e saelong-ui ileul sijakagiro gyeoljeonghaessseubnida, ibeon il-eun neumu jiruhagyieyo.",
        "en": "I decided to start a new job next month, because this job is too boring.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_hagiro_Decide_to_20231230_나는_다음_달에_새로운_일을_시작하기로_결정했습니다_이번_일은_너무_지루해서요.mp3"
      },
      {
        "kr": "우리 가족은 다음 주말에 피크닉 가기로 했어요, 날씨가 좋을 예정이라서요.",
        "romaji": "Uli gajok-eun da-eum ju-mal-e picnic gagiro haesseoyo, nalssi-ga joh-eul yejeong-irasheoyo.",
        "en": "Our family decided to go for a picnic next weekend, because the weather is expected to be good.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_hagiro_Decide_to_20231230_우리_가족은_다음_주말에_피크닉_가기로_했어요_날씨가_좋을_예정이라서요.mp3"
      },
      {
        "kr": "나는 하루에 한 시간 독서하기로 결정했어요, 독서는 지식을 증가시켜주기 때문이에요.",
        "romaji": "Naneun haru-e hansigan dogseohagiro gyeoljeonghaesseoyo, dogseo-neun jisig-eul jeungga sikyeojugi tta-mun-ieyo.",
        "en": "I decided to read for one hour every day, because reading increases knowledge.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_hagiro_Decide_to_20231230_나는_하루에_한_시간_독서하기로_결정했어요_독서는_지식을_증가시켜주기_때문이에요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하기는 [hagineun] (But)",
    "short_explanation": "Used to introduce a contrasting clause or point; 'but', 'however'.",
    "long_explanation": "'~하기는 [hagineun]' is a complex form used in Korean grammar to introduce a contrasting viewpoint or situation. It is translated as 'but', 'however', or 'on the other hand' in English. This form is often used when the speaker wants to express a different perspective or highlight a contrast between two ideas, events or conditions.",
    "formation": "Verb stem + 기는",
    "examples": [
      {
        "kr": "그 날씨가 추웠기는 했지만, 우리는 아직도 즐거운 시간을 보냈어요.",
        "romaji": "Geu nalssiga chuweossgineun haetjiman, urineun ajikdo jeulgeoun siganeul bonaesseoyo.",
        "en": "The weather was cold, but we still had a good time.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_hagineun_But_20231230_그_날씨가_추웠기는_했지만_우리는_아직도_즐거운_시간을_보냈어요.mp3"
      },
      {
        "kr": "이 새별을 좋아하기는 해도, 이것은 너무 비싸서 사기 어려워요.",
        "romaji": "I saebyeoreul johahagineun haedo, igeoseun neomu bissaseo sagi eoryeowoyo.",
        "en": "I do like this new star, but it's too expensive to buy.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_hagineun_But_20231230_이_새별을_좋아하기는_해도_이것은_너무_비싸서_사기_어려워요.mp3"
      },
      {
        "kr": "요리를 잘하긴 하나, 요리를 하기위해 들이는 시간과 노력이 많이 필요해요.",
        "romaji": "Yorireul jalhagineun hana, yorireul hagiwihae deurineun sigangwa noryeogi mani piryohaeyo.",
        "en": "I am good at cooking, but it requires a lot of time and effort to cook.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_hagineun_But_20231230_요리를_잘하긴_하나_요리를_하기위해_들이는_시간과_노력이_많이_필요해요.mp3"
      },
      {
        "kr": "그는 성격이 좋기는 한데, 종종 늦게 오는 습관이 있어요.",
        "romaji": "Geuneun seonggyeogi jogeum joahagineun hande, jongjong neujge oneun seubgwani iss-eoyo.",
        "en": "He has a good personality, but he often has a habit of coming late.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_hagineun_But_20231230_그는_성격이_좋기는_한데_종종_늦게_오는_습관이_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하기보다 [hagiboda] (Rather than)",
    "short_explanation": "Used to express 'rather than', 'instead of' or 'in preference to'.",
    "long_explanation": "'~하기보다 [hagiboda]' is a conjunctive form used in Korean to contrast or compare two actions, states, or situations. It's used to express a preference for one thing over another, essentially meaning 'rather than' or 'instead of' in English. The first verb before 'hagiboda' indicates the less preferred action, and the coming verb after 'hagiboda' indicates the more preferred action.",
    "formation": "Verb[Stem] + 기보다",
    "examples": [
      {
        "kr": "저는 차를 운전하기보다 버스를 타는 것이 더 편하다고 생각해요.",
        "romaji": "Jeoneun chareul unjeonhagiboda beoseureul taneun geosi deo pyeonhadago saenggakhaeyo.",
        "en": "I think it's more comfortable to take a bus rather than driving a car.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hagiboda_Rather_than_20231230_저는_차를_운전하기보다_버스를_타는_것이_더_편하다고_생각해요.mp3"
      },
      {
        "kr": "음식을 사 먹기보다 직접 요리하는 것이 더 건강해요.",
        "romaji": "Eumsigeul sa meokgiboda jikjeop yorihaneun geosi deo geonganghaeyo.",
        "en": "Cooking for yourself is healthier than buying food.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hagiboda_Rather_than_20231230_음식을_사_먹기보다_직접_요리하는_것이_더_건강해요.mp3"
      },
      {
        "kr": "집에서 일하기보다 사무실에서 작업하는 것이 더 생산적이라고 생각합니다.",
        "romaji": "Jibeseo ilhagiboda samusilesseo jageobhaneun geosi deo saengsanjeogirago saenggakhamnida.",
        "en": "I think working in the office is more productive than working at home.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hagiboda_Rather_than_20231230_집에서_일하기보다_사무실에서_작업하는_것이_더_생산적이라고_생각합니다.mp3"
      },
      {
        "kr": "돈을 벌기보다 친구들과 함께 시간을 보내는 게 더 중요하다고 생각해요.",
        "romaji": "Doneul beolgiboda chingudeulgwa hamkke siganeul bonaeneun ge deo jungyohadago saenggakhaeyo.",
        "en": "I think spending time with friends is more important than making money.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hagiboda_Rather_than_20231230_돈을_벌기보다_친구들과_함께_시간을_보내는_게_더_중요하다고_생각해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하나 [hana] (Questioning oneself)",
    "short_explanation": "This particle is used to question oneself or ponder over something.",
    "long_explanation": "The '~하나 [hana]' ending is used in Korean to express self-questioning or puzzling over something. It is frequently used in informal, conversational language when the speaker is wondering or considering something, asking themselves a question, or trying to understand something perplexing. The English equivalent might be something like 'I wonder' or 'Could it be'.",
    "formation": "Verb + 는/ㄴ/은/인 + 하나 ",
    "examples": [
      {
        "kr": "나는 왜 항상 혼자인지 모르겠는 하나.",
        "romaji": "Naneun wae hangsang honjainji moreugneun hana.",
        "en": "I wonder why I'm always alone.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_Questioning_oneself_20231230_나는_왜_항상_혼자인지_모르겠는_하나.mp3"
      },
      {
        "kr": "왜 그가 저렇게 말했는지 이해가 안 가는 하나.",
        "romaji": "Wae geuga jeoreohge malhaessneunji ihaega an ganeun hana.",
        "en": "I'm puzzled as to why he said that.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_Questioning_oneself_20231230_왜_그가_저렇게_말했는지_이해가_안_가는_하나.mp3"
      },
      {
        "kr": "자주 연락하던 친구가 갑자기 연락이 안 오는 하나.",
        "romaji": "Jaju yeonrakhadeon chinguga gapjagi yeonraki an oneun hana.",
        "en": "I wonder why the friend who used to contact me often suddenly doesn't contact me.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_Questioning_oneself_20231230_자주_연락하던_친구가_갑자기_연락이_안_오는_하나.mp3"
      },
      {
        "kr": "공부를 많이 했는데도 시험을 못 본다는 하나.",
        "romaji": "Gongbureul mani haessneundedo siheomeul mot bondaneun hana.",
        "en": "I wonder why, despite studying a lot, I can't take the test.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_Questioning_oneself_20231230_공부를_많이_했는데도_시험을_못_본다는_하나.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하다가 [hadaga] (Doing and then)",
    "short_explanation": "Used to express the notion of 'doing something and then'.",
    "long_explanation": "'~하다가 [hadaga]' is a composite verb form in Korean which is used to express the notion of 'doing something and then'. It signifies that while a person was in the middle of doing an action, another event occurred. The first action does not necessarily have to be completed for the second action to happen. Often, the second action interrupts the first one.",
    "formation": "Verb + 하다가 ",
    "examples": [
      {
        "kr": "청소를 하다가 우연히 오래된 사진을 발견했어요.",
        "romaji": "Cheongso reul hadaga uyeonhi oraedoen sajineul balgyeonhaesseoyo.",
        "en": "While I was cleaning, I happened to find an old photo.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_hadaga_Doing_and_then_20231230_청소를_하다가_우연히_오래된_사진을_발견했어요.mp3"
      },
      {
        "kr": "저는 책을 읽다가 잠이 들었어요.",
        "romaji": "Jeoneun chaekeul ilkda ga jami deureosseoyo.",
        "en": "I was reading a book, and then I fell asleep.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_hadaga_Doing_and_then_20231230_저는_책을_읽다가_잠이_들었어요.mp3"
      },
      {
        "kr": "친구와 이야기를 하다가 시간을 잊었어요.",
        "romaji": "Chingu wa iyagireul hadaga siganeul ilheosseoyo.",
        "en": "I was talking with my friend and lost track of time.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_hadaga_Doing_and_then_20231230_친구와_이야기를_하다가_시간을_잊었어요.mp3"
      },
      {
        "kr": "운전을 하다가 길을 잃었습니다.",
        "romaji": "Unjeoneul hadaga gireul ilheosseumnida.",
        "en": "I was driving and got lost.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_hadaga_Doing_and_then_20231230_운전을_하다가_길을_잃었습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하다가 말다 [hadaga malda] (Stop doing something)",
    "short_explanation": "Used to express someone or something that stops in the course of doing something.",
    "long_explanation": "'~하다가 말다 [hadaga malda]' is a grammar point in Korean language that depicts an action or behavior that got interrupted or stopped while it was being executed. It often implies that the action was stopped before it was fully completed, with the potential to resume at a later time. It's often used to highlight sudden change, interruption or unforeseen situations that cause the action to cease. The verb precedes '하다가 말다' is in dictionary form",
    "formation": "Verb in dictionary form + 하다가 말다",
    "examples": [
      {
        "kr": "공부하다가 말았어요, 왜냐하면 알람이 안 울려서 시간을 잊어버렸어요.",
        "romaji": "Gongbuhadaga malasseoyo, waenyahamyeon allam-i an ullyeoseo sigan-eul ij-eobeolyeoss-eoyo.",
        "en": "I was studying and then I stopped, because I forgot the time as the alarm did not ring.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_말다_hadaga_malda_Stop_doing_something_20231230_공부하다가_말았어요_왜냐하면_알람이_안_울려서_시간을_잊어버렸어요.mp3"
      },
      {
        "kr": "친구가 집에 왔기 때문에 저는 밥 요리하다가 말았어요.",
        "romaji": "Chinguga jib-e wasseugi ttaemun-e jeoneun bab yoli hadaga mal-ass-eoyo.",
        "en": "I was cooking rice but then I stopped because my friend came over.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_말다_hadaga_malda_Stop_doing_something_20231230_친구가_집에_왔기_때문에_저는_밥_요리하다가_말았어요.mp3"
      },
      {
        "kr": "운동하다가 말았어요, 왜냐하면 비가 너무 많이 왔기 때문입니다.",
        "romaji": "Undonghadaga malasseoyo, waenyahamyeon biga neomu mani wasgi ttaemun-ibnida.",
        "en": "I was exercising and then I stopped, because it was raining too much.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_말다_hadaga_malda_Stop_doing_something_20231230_운동하다가_말았어요_왜냐하면_비가_너무_많이_왔기_때문입니다.mp3"
      },
      {
        "kr": "책을 읽다가 말았어요, 왜냐하면 갑자기 잠이 와서입니다.",
        "romaji": "Chaeg-eul ilgdaga mal-ass-eoyo, waenyahamyeon gabjagi jam-i waseoibnida.",
        "en": "I was reading a book and then I stopped, because I suddenly felt sleepy.",
        "grammar_audio": "/audio/korean/grammar/s_하다가_말다_hadaga_malda_Stop_doing_something_20231230_책을_읽다가_말았어요_왜냐하면_갑자기_잠이_와서입니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하더라 [hadeora] (I observed, I remember)",
    "short_explanation": "Used to express recollection or observation of a past event.",
    "long_explanation": "'~하더라 [hadeora]' is a Korean grammar pattern that denotes someone's personal experience, observation, or feeling of a certain event in the past. It indicates something that was perceived or noticed, oftentimes used when sharing personal memories or observations with someone else. Unlike ~했다, which simply states a past fact, ~하더라 provides a hint that the speaker personally witnessed or experienced something.",
    "formation": "Verb-stem + 더라",
    "examples": [
      {
        "kr": "너의 여동생은 참 예쁘더라, 동네에서 가장 예쁜 소녀로 알려져 있었어.",
        "romaji": "Neoui yeodongsaengeun cham yeppeudeora, dongneeseo gajang yeppeun sonyeoro allyeojyeo isseosseo.",
        "en": "Your younger sister is very pretty, she was known as the most beautiful girl in the neighborhood.",
        "grammar_audio": "/audio/korean/grammar/s_하더라_hadeora_I_observed_I_remember_20231230_너의_여동생은_참_예쁘더라_동네에서_가장_예쁜_소녀로_알려져_있었어.mp3"
      },
      {
        "kr": "그는 항상 바빠 보였더라, 따라서 그와 만날 시간을 찾기 어려웠어.",
        "romaji": "Geuneun hangsang bappa boyeossdeora, ttaraseo geuwa mannal siganeul chatgi eoryeosseo.",
        "en": "He always seemed busy, so I found it difficult to find a time to meet with him.",
        "grammar_audio": "/audio/korean/grammar/s_하더라_hadeora_I_observed_I_remember_20231230_그는_항상_바빠_보였더라_따라서_그와_만날_시간을_찾기_어려웠어.mp3"
      },
      {
        "kr": "우리 아빠는 어릴 때 축구를 잘했더라, 그래서 아직도 그의 축구 실력이 대단해.",
        "romaji": "Uri appaneun eoril ttae chukgureul jalhaessdeora, geuraeseo ajikdo geui chukgu sillagi daedanhae.",
        "en": "My father was good at soccer when he was young, so his soccer skills are still great.",
        "grammar_audio": "/audio/korean/grammar/s_하더라_hadeora_I_observed_I_remember_20231230_우리_아빠는_어릴_때_축구를_잘했더라_그래서_아직도_그의_축구_실력이_대단해.mp3"
      },
      {
        "kr": "작년에 우리가 해변에 갔던 때, 해가 질 때가 참 예뻤더라.",
        "romaji": "Jagnyeon-e uri-ga haebyeon-e gassdeon ttae, hae-ga jil ttae-ga cham yeppeossdeora.",
        "en": "Last year when we went to the beach, the sunset was really beautiful.",
        "grammar_audio": "/audio/korean/grammar/s_하더라_hadeora_I_observed_I_remember_20231230_작년에_우리가_해변에_갔던_때_해가_질_때가_참_예뻤더라.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하려고 [haryeogo] (In order to)",
    "short_explanation": "Used to express purpose or intention; 'in order to', 'for the purpose of'.",
    "long_explanation": "'~하려고 [haryeogo]' is a Korean grammar pattern used to indicate purpose or intention. In essence, it translates to 'in order to' or 'for the purpose of' in English. It is used to explain the reason behind one's actions, or the intended end result. This pattern is commonly seen at the end of a sentence, and is often used with verbs to indicate the intention behind the action.",
    "formation": "Verb stem + 려고",
    "examples": [
      {
        "kr": "한국어를 더 잘 이해하려고 많은 책을 읽었습니다.",
        "romaji": "Hangugeoreul deo jal ihaeharyeogo manheun chaegeul ilgeotsseumnida.",
        "en": "I read many books in order to understand Korean better.",
        "grammar_audio": "/audio/korean/grammar/s_하려고_haryeogo_In_order_to_20231230_한국어를_더_잘_이해하려고_많은_책을_읽었습니다.mp3"
      },
      {
        "kr": "시험을 잘 보기 위해 열심히 공부하려고 합니다.",
        "romaji": "Siheomeul jal bogi wihae yeolsimhi gongbuharyeogo hamnida.",
        "en": "I am studying hard in order to do well on the test.",
        "grammar_audio": "/audio/korean/grammar/s_하려고_haryeogo_In_order_to_20231230_시험을_잘_보기_위해_열심히_공부하려고_합니다.mp3"
      },
      {
        "kr": "건강을 유지하려고 운동하고 있어요.",
        "romaji": "Geongangeul yujiharyeogo undonghago isseoyo.",
        "en": "I am exercising in order to maintain my health.",
        "grammar_audio": "/audio/korean/grammar/s_하려고_haryeogo_In_order_to_20231230_건강을_유지하려고_운동하고_있어요.mp3"
      },
      {
        "kr": "여행 때문에 돈을 모으려고 아르바이트를 했어요.",
        "romaji": "Yeohaeng ttaemune doneul moeuryeogo areubaiteureul haesseoyo.",
        "en": "I did a part-time job in order to save money for the trip.",
        "grammar_audio": "/audio/korean/grammar/s_하려고_haryeogo_In_order_to_20231230_여행_때문에_돈을_모으려고_아르바이트를_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~하여/해서 [hayeo/haeseo] (So, therefore)",
    "short_explanation": "Connective ending used to express reason or cause.",
    "long_explanation": "'~하여/해서 [hayeo/haeseo]' is a connective verb ending used in Korean to link two clauses where the first clause is the cause or reason for the second clause. The second clause, the result or effect, presents a factual or logical outcome from the first clause. It correlates with 'So' or 'Therefore' in English. The shorter form '해서' is more colloquial and often used in daily conversation.",
    "formation": "Verb stem + ~하여/해서",
    "examples": [
      {
        "kr": "비가 오는데서 집에 늦게 왔어요.",
        "romaji": "Biga oneun daeseo jibe neutge wasseoyo.",
        "en": "Because it was raining, I came home late.",
        "grammar_audio": "/audio/korean/grammar/s_하여/해서_hayeo/haeseo_So_therefore_20231230_비가_오는데서_집에_늦게_왔어요.mp3"
      },
      {
        "kr": "컴퓨터가 망가져서 과제를 못 했어요.",
        "romaji": "Keompyuteoga manggajyeo-seo gwajereul mot haesseoyo.",
        "en": "Because the computer broke, I couldn't do the assignment.",
        "grammar_audio": "/audio/korean/grammar/s_하여/해서_hayeo/haeseo_So_therefore_20231230_컴퓨터가_망가져서_과제를_못_했어요.mp3"
      },
      {
        "kr": "열심히 공부해서 시험에 잘 봤어요.",
        "romaji": "Yeolsimhi gongbuhaeseo siheome jal bwasseoyo.",
        "en": "I studied hard, so I did well on the test.",
        "grammar_audio": "/audio/korean/grammar/s_하여/해서_hayeo/haeseo_So_therefore_20231230_열심히_공부해서_시험에_잘_봤어요.mp3"
      },
      {
        "kr": "빵을 너무 많이 먹어서 배가 아팠어요.",
        "romaji": "Bbangeul neomu mani meogeoseo baega apasseoyo.",
        "en": "I ate too much bread, so my stomach hurt.",
        "grammar_audio": "/audio/korean/grammar/s_하여/해서_hayeo/haeseo_So_therefore_20231230_빵을_너무_많이_먹어서_배가_아팠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~한테/한테서 [hante/hanteseo] (To/From someone)",
    "short_explanation": "Used to indicate 'to' or 'from' someone in Korean.",
    "long_explanation": "'~한테/한테서 [hante/hanteseo]' is used to show the direction or target of the action in Korean, indicating 'to' or 'from' respectively. It is most commonly used with animate objects, usually people. It can refer to both physical and metaphorical direction. When used with a verb, '한테' shows who is receiving the action while '한테서' shows who is the source of the action.",
    "formation": "Verb + 한테 (To), Verb + 한테서 (From)",
    "examples": [
      {
        "kr": "제가 친구한테 선물을 주었어요.",
        "romaji": "Jega chinguhante seonmureul jueosseoyo.",
        "en": "I gave a gift to my friend.",
        "grammar_audio": "/audio/korean/grammar/s_한테/한테서_hante/hanteseo_To/From_someone_20231230_제가_친구한테_선물을_주었어요.mp3"
      },
      {
        "kr": "제가 선생님한테서 한국어를 배웠어요.",
        "romaji": "Jega seonsaengnimhanteso hangugeoreul baewosseoyo.",
        "en": "I learned Korean from my teacher.",
        "grammar_audio": "/audio/korean/grammar/s_한테/한테서_hante/hanteseo_To/From_someone_20231230_제가_선생님한테서_한국어를_배웠어요.mp3"
      },
      {
        "kr": "그의 아버지한테서 돈을 빌렸어요.",
        "romaji": "Geuui abeojihanteso doneul billyeosseoyo.",
        "en": "He borrowed money from his father.",
        "grammar_audio": "/audio/korean/grammar/s_한테/한테서_hante/hanteseo_To/From_someone_20231230_그의_아버지한테서_돈을_빌렸어요.mp3"
      },
      {
        "kr": "나한테 좋은 말만 해주세요.",
        "romaji": "Nahante joheun manman haejuseyo.",
        "en": "Please, only say nice things to me.",
        "grammar_audio": "/audio/korean/grammar/s_한테/한테서_hante/hanteseo_To/From_someone_20231230_나한테_좋은_말만_해주세요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할 거예요 [hal geoyeyo] (Going to do)",
    "short_explanation": "Used to express future plans or intentions; 'going to do'.",
    "long_explanation": "'~할 거예요 [hal geoyeyo]' is a future tense verb ending used in Korean to indicate a plan or intention in the future. It is most closely translated to 'going to do' in English. It is often used in sentences to express an intention or plan to do something in the future.",
    "formation": "Verb-기 form + 할 거예요",
    "examples": [
      {
        "kr": "저는 이번 주말에 친구들과 함께 캠핑을 갈 거예요, 텐트와 캠핑 용품을 준비해야 해요.",
        "romaji": "Jeoneun ibeon jumare chingudeulgwa hamkke kaempingeul gal geoyeyo, tenteuwa kaemping yongpumeul junbihaeya haeyo.",
        "en": "I am going to go camping with my friends this weekend, I have to prepare tents and camping supplies.",
        "grammar_audio": "/audio/korean/grammar/s_할_거예요_hal_geoyeyo_Going_to_do_20231230_저는_이번_주말에_친구들과_함께_캠핑을_갈_거예요_텐트와_캠핑_용품을_준비해야_해요.mp3"
      },
      {
        "kr": "내일은 날씨가 좋으니까 공원에서 산책할 거예요, 맑은 날씨를 즐길 수 있을 거예요.",
        "romaji": "Naeireun nalssiga joheunikka gongwoneso sancaekhal geoyeyo, malgeun nalssireul jeulgil su isseul geoyeyo.",
        "en": "I'm going to go for a walk in the park tomorrow, because the weather will be nice, I will be able to enjoy the clear weather.",
        "grammar_audio": "/audio/korean/grammar/s_할_거예요_hal_geoyeyo_Going_to_do_20231230_내일은_날씨가_좋으니까_공원에서_산책할_거예요_맑은_날씨를_즐길_수_있을_거예요.mp3"
      },
      {
        "kr": "저는 저녁에 스파게티를 요리할 거예요, 스파게티 소스와 파스타를 구입해야 해요.",
        "romaji": "Jeoneun jeonyeoge seupagetireul yorihal geoyeyo, seupageti soseuwa pasauteureul guibhaeya haeyo.",
        "en": "I am going to cook spaghetti in the evening, I have to buy spaghetti sauce and pasta.",
        "grammar_audio": "/audio/korean/grammar/s_할_거예요_hal_geoyeyo_Going_to_do_20231230_저는_저녁에_스파게티를_요리할_거예요_스파게티_소스와_파스타를_구입해야_해요.mp3"
      },
      {
        "kr": "아버지가 퇴근하면 함께 식당에서 저녁을 먹을 거예요, 아버지가 좋아하는 음식을 선택해야 해요.",
        "romaji": "Abeojiga toegeunhamyeon hamkke sikdangeseo jeonyeogeul meogeul geoyeyo, abeojiga joahaneun eumsigeul seontaekhaeya haeyo.",
        "en": "When my father comes home from work, we're going to eat dinner at a restaurant, I have to choose the food my father likes.",
        "grammar_audio": "/audio/korean/grammar/s_할_거예요_hal_geoyeyo_Going_to_do_20231230_아버지가_퇴근하면_함께_식당에서_저녁을_먹을_거예요_아버지가_좋아하는_음식을_선택해야_해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할 만하다 [hal manhada] (Worth doing)",
    "short_explanation": "This expression is used to state that something is worth the effort or time; 'worth doing'.",
    "long_explanation": "'~할 만하다 [hal manhada]' is a commonly used grammar point in Korean which means that something is worth doing. It can be used with a verb stem to indicate that the action or behavior of the verb is worth the effort, cost or time that would be needed to do it. This grammar point often suggests that even though the action might require some effort, the value or benefit gained from performing it outweighs the cost or effort.",
    "formation": "Verb stem + 할 만하다",
    "examples": [
      {
        "kr": "이 여행은 비싸지만 가볼 만해요, 왜냐하면 그 곳은 정말 아름답기 때문이에요.",
        "romaji": "I yeohaengeun bissajiman gabol manhaeyo, waenahamyeon geu gos-eun jeongmal aleumdabgi ttaemunieyo.",
        "en": "This trip is expensive, but it's worth going to because the place is really beautiful.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20231230_이_여행은_비싸지만_가볼_만해요_왜냐하면_그_곳은_정말_아름답기_때문이에요.mp3"
      },
      {
        "kr": "이 영화는 길지만 보는 만합니다, 왜냐하면 스토리가 정말 재미있기 때문이에요.",
        "romaji": "I yeonghwaneun giljiman boneun manhamnida, waenahamyeon seutoriga jeongmal jaemiissgi ttaemunieyo.",
        "en": "This movie is long, but it's worth watching because the story is really interesting.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20231230_이_영화는_길지만_보는_만합니다_왜냐하면_스토리가_정말_재미있기_때문이에요.mp3"
      },
      {
        "kr": "이 책은 두껍지만 읽을 만해요, 왜냐하면 그 콘텐츠는 정말 유익하기 때문이에요.",
        "romaji": "I chaegeun duggobjiman ilgeul manhaeyo, waenahamyeon geu kontencheuneun jeongmal yuighagi ttaemunieyo.",
        "en": "This book is thick, but it's worth reading because its content is really beneficial.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20231230_이_책은_두껍지만_읽을_만해요_왜냐하면_그_콘텐츠는_정말_유익하기_때문이에요.mp3"
      },
      {
        "kr": "이 식당은 멀지만 가볼 만해요, 왜냐하면 그 음식은 진짜 맛있기 때문이에요.",
        "romaji": "I sikdangeun meoljiman gabol manhaeyo, waenahamyeon geu eumsikeun jinjja mashitgi ttaemunieyo.",
        "en": "This restaurant is far, but it's worth going to because the food is really delicious.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20231230_이_식당은_멀지만_가볼_만해요_왜냐하면_그_음식은_진짜_맛있기_때문이에요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할 수록 [hal surok] (The more...)",
    "short_explanation": "Used to describe a situation where one action or state increases or intensifies as another action or state does.",
    "long_explanation": "'~할 수록 [hal surok]' is a compound grammar pattern used to express a situation where as one thing happens, another thing happens correspondingly. Essentially, it means 'the more...'. It is used to convey a sense of proportionality or dependency relating two different elements, often employed when the progress of one situation affects the state of another. It may be used in various contexts and situations. Note that both clauses in the sentence usually share the same subject.",
    "formation": "Verb stem + 할 수록 + Increasing situation",
    "examples": [
      {
        "kr": "그녀를 알게 될수록 나는 그녀를 더 사랑하게 되었어요.",
        "romaji": "Geunyeoreul alge doelsurok naneun geunyeoreul deo saranghage dweeosseoyo.",
        "en": "The more I got to know her, the more I fell in love with her.",
        "grammar_audio": "/audio/korean/grammar/s_할_수록_hal_surok_The_more_20231230_그녀를_알게_될수록_나는_그녀를_더_사랑하게_되었어요.mp3"
      },
      {
        "kr": "연습을 할수록, 당신의 기술은 더 향상될 것입니다.",
        "romaji": "Yeonseubeul halsurok, dangsinui gisuleun deo hyangsangdoel geosibnida.",
        "en": "The more you practice, the more your skills will improve.",
        "grammar_audio": "/audio/korean/grammar/s_할_수록_hal_surok_The_more_20231230_연습을_할수록_당신의_기술은_더_향상될_것입니다.mp3"
      },
      {
        "kr": "사람들이 많을수록 파티는 더 즐거워질 것입니다.",
        "romaji": "Saramdeuri manheulsurok patineun deo jeulgeowojil geosibnida.",
        "en": "The more people there are, the more fun the party will be.",
        "grammar_audio": "/audio/korean/grammar/s_할_수록_hal_surok_The_more_20231230_사람들이_많을수록_파티는_더_즐거워질_것입니다.mp3"
      },
      {
        "kr": "시간이 흘러갈수록 그의 그립움은 더 커져 갔어요.",
        "romaji": "Sigani heulleogalsurok geuui geuripumeun deo keojyeo gasseoyo.",
        "en": "As time passed, his longing grew greater.",
        "grammar_audio": "/audio/korean/grammar/s_할_수록_hal_surok_The_more_20231230_시간이_흘러갈수록_그의_그립움은_더_커져_갔어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할 줄 알다 [hal jul alda] (Know how to)",
    "short_explanation": "Used to express the knowledge or skill to do something.",
    "long_explanation": "'~할 줄 알다 [hal jul alda]' is a Korean grammar point used to indicate the ability or skill to do something. It directly translates as 'know how to do'. It is used when you want to say that someone (including yourself) knows how to do a certain action. This phrase is often used in sentences which expresses the ability, capability, possibility or potentiality.",
    "formation": "Verb in Dictionary form + 줄 알다",
    "examples": [
      {
        "kr": "나는 요리할 줄 알아요, 그래서 친구들이 집에 놀러 올 때마다 맛있는 음식을 해 줄 수 있어요.",
        "romaji": "Naneun yorihal jul alyo, geuraeseo chingudeuri jibe nolleo ol ttaemada masitneun eumsigeul hae jul su iss-eoyo.",
        "en": "I know how to cook, so whenever friends come to play at my house, I can make delicious food.",
        "grammar_audio": "/audio/korean/grammar/s_할_줄_알다_hal_jul_alda_Know_how_to_20231230_나는_요리할_줄_알아요_그래서_친구들이_집에_놀러_올_때마다_맛있는_음식을_해_줄_수_있어요.mp3"
      },
      {
        "kr": "제 친구는 한국어를 말할 줄 알아요, 그래서 한국 친구와 자유롭게 대화할 수 있어요.",
        "romaji": "Je chinguneun hangugeoreul malhal jul alyo, geuraeseo hanguk chinguwa jayurobge daehwahal su iss-eoyo.",
        "en": "My friend knows how to speak Korean, so he can converse freely with Korean friends.",
        "grammar_audio": "/audio/korean/grammar/s_할_줄_알다_hal_jul_alda_Know_how_to_20231230_제_친구는_한국어를_말할_줄_알아요_그래서_한국_친구와_자유롭게_대화할_수_있어요.mp3"
      },
      {
        "kr": "부모님은 운전을 하실 줄 아셔서, 어디든지 가실 수 있어요.",
        "romaji": "Bumonim-eun unjeoneul hasil jul ashsyeoseo, eodideunji gasil su iss-eoyo.",
        "en": "My parents know how to drive, so they can go anywhere.",
        "grammar_audio": "/audio/korean/grammar/s_할_줄_알다_hal_jul_alda_Know_how_to_20231230_부모님은_운전을_하실_줄_아셔서_어디든지_가실_수_있어요.mp3"
      },
      {
        "kr": "나는 피아노를 칠 줄 알아요, 그래서 친구들과 함께 노래방에 갔을 때 항상 자랑 스럽게 느껴져요.",
        "romaji": "Naneun pianoreul chil jul alyo, geuraeseo chingudeulgwa hamkke nolaebang-e gass-eul ttae hangsang jajang seulobge neukkyeojyeoyo.",
        "en": "I know how to play the piano, so whenever I go to Karaoke with friends, I always feel proud.",
        "grammar_audio": "/audio/korean/grammar/s_할_줄_알다_hal_jul_alda_Know_how_to_20231230_나는_피아노를_칠_줄_알아요_그래서_친구들과_함께_노래방에_갔을_때_항상_자랑_스럽게_느껴져요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할지라도 [haljirado] (Even if)",
    "short_explanation": "Used to express the meaning 'even if'.",
    "long_explanation": "'~할지라도 [haljirado]' is a Korean conjunction that translates to 'even if' in English. It is used when the speaker wants to say that even in the hypothetical condition expressed in the clause that it is attached to, the situation or fact spoken of in the following clause will not change.",
    "formation": "Verb+ㄹ/을지라도",
    "examples": [
      {
        "kr": "내일 비가 올지라도 나는 운동하러 갈 거야.",
        "romaji": "naeil biga oljirado naneun undonghago galgeoya.",
        "en": "Even if it rains tomorrow, I will go to exercise.",
        "grammar_audio": "/audio/korean/grammar/s_할지라도_haljirado_Even_if_20231230_내일_비가_올지라도_나는_운동하러_갈_거야.mp3"
      },
      {
        "kr": "부모님이 그에 대해 싫어할지라도, 나는 그를 계속 만나려고 합니다.",
        "romaji": "bumonimi geue daehae sirheohaljirado, naneun geureul gyesog mannaryeogo habnida.",
        "en": "Even if my parents dislike him, I intend to keep seeing him.",
        "grammar_audio": "/audio/korean/grammar/s_할지라도_haljirado_Even_if_20231230_부모님이_그에_대해_싫어할지라도_나는_그를_계속_만나려고_합니다.mp3"
      },
      {
        "kr": "시험이 어려울지라도, 열심히 공부했기 때문에 자신이 있어.",
        "romaji": "siheomi eoryeouljirado, yeolsimhi gongbuhaetgi ttaemune jasin-i isseo.",
        "en": "Even if the exam is hard, I'm confident because I studied hard.",
        "grammar_audio": "/audio/korean/grammar/s_할지라도_haljirado_Even_if_20231230_시험이_어려울지라도_열심히_공부했기_때문에_자신이_있어.mp3"
      },
      {
        "kr": "너가 어떻게 생각할지라도, 나는 그 결정을 후회하지 않아.",
        "romaji": "neoga eotteoke saenggakhaljirado, naneun geu gyeoljeongeul hugoehaji anha.",
        "en": "Even if you think differently, I do not regret that decision.",
        "grammar_audio": "/audio/korean/grammar/s_할지라도_haljirado_Even_if_20231230_너가_어떻게_생각할지라도_나는_그_결정을_후회하지_않아.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~할 텐데 [hal tende] (I thought/would have thought that..)",
    "short_explanation": "Used to express a presumption or expectation that has not been realized.",
    "long_explanation": "'~할 텐데 [hal tende]' is a grammar construction in Korean used to express a presumption or expectation that has not fulfilled or proven to be inaccurate. It is used when the speaker anticipates a certain outcome but the actual outcome turns out to be different. It can be translated into English as 'I thought/would have thought that..' The assumption here could be based on common sense, general knowledge or particular circumstances, but it does not coincide with the actual result.",
    "formation": "Verb stem + 을/ㄹ 텐데",
    "examples": [
      {
        "kr": "오늘 날씨가 좋을 텐데 비가 옵니다, 예상이 달랐네요.",
        "romaji": "Oneul nalssiga joheul tende biga omyeon, yesangi dallatneyo.",
        "en": "I thought the weather would be good today, but it's raining; my prediction was wrong.",
        "grammar_audio": "/audio/korean/grammar/s_할_텐데_hal_tende_I_thought/would_have_thought_that_20231230_오늘_날씨가_좋을_텐데_비가_옵니다_예상이_달랐네요.mp3"
      },
      {
        "kr": "그는 저녁에 연락할 텐데 아직 연락이 없어요, 어떤 일이 생겼나봐요.",
        "romaji": "Geuneun jeonyeoke yeonrakhal tende ajik yeonraki eopseoyo, eotteon iri saenggyeonnabwayo.",
        "en": "I thought he would contact me in the evening, but he hasn't yet; something must have come up.",
        "grammar_audio": "/audio/korean/grammar/s_할_텐데_hal_tende_I_thought/would_have_thought_that_20231230_그는_저녁에_연락할_텐데_아직_연락이_없어요_어떤_일이_생겼나봐요.mp3"
      },
      {
        "kr": "그녀는 항상 분위기가 좋을 텐데 오늘은 왠지 행복해 보이지 않아요.",
        "romaji": "Geunyeoneun hangsang bunwigiga joheul tende oneulen waenji haengbokhae boiji anayyo.",
        "en": "I thought she's always in a good mood, but for some reason she doesn't look happy today.",
        "grammar_audio": "/audio/korean/grammar/s_할_텐데_hal_tende_I_thought/would_have_thought_that_20231230_그녀는_항상_분위기가_좋을_텐데_오늘은_왠지_행복해_보이지_않아요.mp3"
      },
      {
        "kr": "시험은 쉬울 텐데 너무 어렵게 나와서 놀랐어요.",
        "romaji": "Siheomeun swiul tende neomu eoryeopge nawayo, nollasseoyo.",
        "en": "I thought the exam would be easy, but it turned out to be very difficult, and I was surprised.",
        "grammar_audio": "/audio/korean/grammar/s_할_텐데_hal_tende_I_thought/would_have_thought_that_20231230_시험은_쉬울_텐데_너무_어렵게_나와서_놀랐어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~해야지 [haeyaji] (Decide to)",
    "short_explanation": "Used to express a personal decision or intention, similar to 'I should' or 'I will' in English.",
    "long_explanation": "'~해야지 [haeyaji]' is a useful grammatical structure in Korean which is used to show a decision made by the speaker about doing something in the future. It's typically used when somebody is talking to himself or herself, deciding on what to do next. It can be translated as 'I should' or 'I will' in English. This can also be used when providing a softer suggestion to someone else.",
    "formation": "Verb stem + '아/어/여야지'",
    "examples": [
      {
        "kr": "오늘은 일찍 집에 가야지, 내일 일찍 일어나야 되니까.",
        "romaji": "Oneureun iljjik jib-e gayaji, naeil iljjik ileonaya doeni-kka.",
        "en": "I should go home early today since I need to wake up early tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_Decide_to_20231230_오늘은_일찍_집에_가야지_내일_일찍_일어나야_되니까.mp3"
      },
      {
        "kr": "건강을 위해 운동을 시작해야지.",
        "romaji": "Geongangeul wihae undongeul sijakhaeyaji.",
        "en": "I should start exercising for my health.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_Decide_to_20231230_건강을_위해_운동을_시작해야지.mp3"
      },
      {
        "kr": "나는 다양한 책을 읽어야지, 이렇게 하면 나의 지식을 넓힐 수 있을 것이다.",
        "romaji": "Naneun dayang-han chaek-eul ilkeoya-ji, ileohke haemyeon naui jisikeul neolphil su iss-eul geos-ida.",
        "en": "I should read a variety of books, by doing so I can broaden my knowledge.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_Decide_to_20231230_나는_다양한_책을_읽어야지_이렇게_하면_나의_지식을_넓힐_수_있을_것이다.mp3"
      },
      {
        "kr": "하지만, 천천히 먹어야지, 그래야 소화가 잘 될 것입니다.",
        "romaji": "Hajiman, cheoncheonhi meogeoya-ji, geulaeya sohwaga jal doel geosibnida.",
        "en": "But, I should eat slowly, that way, it will digest well.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_Decide_to_20231230_하지만_천천히_먹어야지_그래야_소화가_잘_될_것입니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~해도/해봐도 [haedo/haebwado] (Even if)",
    "short_explanation": "Indicates the meaning of 'even if' in sentences.",
    "long_explanation": "'~해도/해봐도 [haedo/haebwado]' is a Korean grammar point that conveys the meaning of 'even if' in sentences. It is often used to express an action or situation that does not influence the result or outcome, regardless of whether that action or situation happens or not. It asserts a degree of indifference or certainty about circumstances that might ordinarily be thought of as affecting an outcome.",
    "formation": "Verb stem + 해도/해봐도",
    "examples": [
      {
        "kr": "여기서 우리가 얼마나 노력을 해봐도, 상황이 개선되지 않습니다.",
        "romaji": "Yogi seori ga jan man an haedo, sikeuneegeun gaeb jonhan upnida",
        "en": "Even if we try hard here, the situation does not improve.",
        "grammar_audio": "/audio/korean/grammar/s_해도/해봐도_haedo/haebwado_Even_if_20231230_여기서_우리가_얼마나_노력을_해봐도_상황이_개선되지_않습니다.mp3"
      },
      {
        "kr": "그 가게의 음식이 맛있어도, 거기서 일하고 싶지 않아요.",
        "romaji": "geu gageyi eumsiki masisseodo, geogiseo ilhago sipji anhayo.",
        "en": "Even if the food at that store is delicious, I do not want to work there.",
        "grammar_audio": "/audio/korean/grammar/s_해도/해봐도_haedo/haebwado_Even_if_20231230_그_가게의_음식이_맛있어도_거기서_일하고_싶지_않아요.mp3"
      },
      {
        "kr": "아무리 많은 돈을 벌어봐도, 행복하지 않다면 의미가 없어요.",
        "romaji": "Amuri manheun doneul beoreobwado, haengbokhaji an damyeon uimiga eopseoyo.",
        "en": "Even if you earn a lot of money, it’s meaningless if you’re not happy.",
        "grammar_audio": "/audio/korean/grammar/s_해도/해봐도_haedo/haebwado_Even_if_20231230_아무리_많은_돈을_벌어봐도_행복하지_않다면_의미가_없어요.mp3"
      },
      {
        "kr": "그녀가 얼마나 사랑해봐도, 그녀의 마음을 이해할 수 없어.",
        "romaji": "Geunyeoga eolmana sarang haebwado, geunyeo e maeumeul ihae hal su ebseo.",
        "en": "No matter how much she loves, I cannot understand her feelings.",
        "grammar_audio": "/audio/korean/grammar/s_해도/해봐도_haedo/haebwado_Even_if_20231230_그녀가_얼마나_사랑해봐도_그녀의_마음을_이해할_수_없어.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~해보다 [haeboda] (Try to)",
    "short_explanation": "'해보다 [haeboda]' is used to describe an action that someone has tried or attempted to do.",
    "long_explanation": "'해보다 [haeboda]' is a verb ending that denotes an attempt or experience of trying something. It is used when one attempts to do something for the first time or when suggesting or advising someone to try something. It is a combination of an action verb and '보다' that adds the meaning of 'try' to the basic verb.",
    "formation": "Action Verb Stem + 아/어/해 + 보다",
    "examples": [
      {
        "kr": "나는 새로운 한국 음식을 먹어보려고 노력했지만, 그것은 너무 어려웠어요.",
        "romaji": "Naneun saeroun hanguk eumsigeul meogeoboryeogo noryeokhaetjiman, geugeoseun neomu eoryeosseoyo.",
        "en": "I tried to eat new Korean food, but it was too difficult.",
        "grammar_audio": "/audio/korean/grammar/s_해보다_haeboda_Try_to_20231230_나는_새로운_한국_음식을_먹어보려고_노력했지만_그것은_너무_어려웠어요.mp3"
      },
      {
        "kr": "당신은 이 새로운 언어를 배워보는 것에 대해 어떻게 생각하세요?",
        "romaji": "Dangsineun i saeroun eoneoreul baeweoboneun geose daehae eotteoke saengakhayo?",
        "en": "What do you think about trying to learn this new language?",
        "grammar_audio": "/audio/korean/grammar/s_해보다_haeboda_Try_to_20231230_당신은_이_새로운_언어를_배워보는_것에_대해_어떻게_생각하세요.mp3"
      },
      {
        "kr": "처음에는 읽기가 어려웠지만, 계속 해보니까 서서히 알게 되었어요.",
        "romaji": "Cheoeum-eneun ilgigiga eoryeosseotjiman, gyesok haebonikka seoseohi alge dweeosseoyo.",
        "en": "Reading was difficult at first, but as I kept trying, I gradually understood.",
        "grammar_audio": "/audio/korean/grammar/s_해보다_haeboda_Try_to_20231230_처음에는_읽기가_어려웠지만_계속_해보니까_서서히_알게_되었어요.mp3"
      },
      {
        "kr": "이번 주말에 새로운 취미를 찾아보는 것은 어떨까요?",
        "romaji": "Ibeon jumale saeroun chwimireul chajaboneun geoseun eotteolkka yo?",
        "en": "How about trying to find a new hobby this weekend?",
        "grammar_audio": "/audio/korean/grammar/s_해보다_haeboda_Try_to_20231230_이번_주말에_새로운_취미를_찾아보는_것은_어떨까요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~해주다 [haejuda] (Do for someone)",
    "short_explanation": "This grammar point is used to express the intention of doing something for someone else.",
    "long_explanation": "The grammar point '~해주다 [haejuda]' is used to indicate that the speaker will do something for another person, or to express a kind action one person does for another. It is frequently used in situations where a person is helping another by doing something beneficial for them. The literal English equivalent for '~해주다' could be considered something along the lines of 'to do something for someone', but in a more altruistic or considerate sense.",
    "formation": "Verb stem + 아/어/해 + 주다",
    "examples": [
      {
        "kr": "저는 어머니께 밥을 해주려고 요리를 배우고 있어요.",
        "romaji": "Jeoneun eomeonikke babeul haejuryeogo yorireul baeugo isseoyo.",
        "en": "I’m learning to cook to make meals for my mother.",
        "grammar_audio": "/audio/korean/grammar/s_해주다_haejuda_Do_for_someone_20231230_저는_어머니께_밥을_해주려고_요리를_배우고_있어요.mp3"
      },
      {
        "kr": "친구가 시험 공부가 힘들어서 저는 친구를 위해서 정리를 해주었어요.",
        "romaji": "Chinguga siheom gongbuga himdeureoseo jeoneun chingureul wihaeseo jeongrireul haejueosseoyo.",
        "en": "My friend was struggling with exam revision, so I summarized it for her.",
        "grammar_audio": "/audio/korean/grammar/s_해주다_haejuda_Do_for_someone_20231230_친구가_시험_공부가_힘들어서_저는_친구를_위해서_정리를_해주었어요.mp3"
      },
      {
        "kr": "아버지가 피곤하셔서 제가 운전을 해주었습니다.",
        "romaji": "Abeojiga pigonhasyeoseo jega unjeoneul haejueossseubnida.",
        "en": "My father was tired, so I drove for him.",
        "grammar_audio": "/audio/korean/grammar/s_해주다_haejuda_Do_for_someone_20231230_아버지가_피곤하셔서_제가_운전을_해주었습니다.mp3"
      },
      {
        "kr": "우리 팀원들이 바빠서 나는 이번 보고서를 대신 작성해주었어요.",
        "romaji": "Uli timwondeuli bappaseo naneun ibeon bogoseoreul daesin jakseonghaejueosseoyo.",
        "en": "Our team members were busy, so I wrote this report for them.",
        "grammar_audio": "/audio/korean/grammar/s_해주다_haejuda_Do_for_someone_20231230_우리_팀원들이_바빠서_나는_이번_보고서를_대신_작성해주었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했더니 [haetdeoni] (When, and then)",
    "short_explanation": "This grammar point is used to express 'when something happened and then something else happened as a result'.",
    "long_explanation": "'~했더니 [haetdeoni]' is a grammar point used in Korean to signify a cause-and-effect relationship where the first action directly leads to the second action. This construction denotes 'when I did [first action] and then [second action] happened'. It is often used in instances when the result is unexpected or surprising, emphasizing that the second action is a direct result of the first action.",
    "formation": "Verb in past tense + 더니 + Resulting action or state",
    "examples": [
      {
        "kr": "저는 이 케이크를 먹었더니, 막상 맛있어서 더 먹고 싶었어요.",
        "romaji": "Jeoneun i keikeureul meogeosseodeoni, maksang masisseoseo deo meokgo sippeosseoyo.",
        "en": "When I ate this cake, it was surprisingly delicious and I wanted to eat more.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_When_and_then_20231230_저는_이_케이크를_먹었더니_막상_맛있어서_더_먹고_싶었어요.mp3"
      },
      {
        "kr": "나는 출근했더니 사무실에 누가 없었어요.",
        "romaji": "Naneun chulgeunhaessdeoni samusile nuga eopseosseoyo.",
        "en": "When I came to work, there was nobody in the office.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_When_and_then_20231230_나는_출근했더니_사무실에_누가_없었어요.mp3"
      },
      {
        "kr": "나는 이 책을 읽었더니 처음 생각했던 것보다 훨씬 재미있었어요.",
        "romaji": "Naneun i chaegeul ilgeossdeoni cheoeum saenggakhaessdeon geotboda hwolssin jaemiisseosseoyo.",
        "en": "When I read this book, it was much more interesting than I initially thought.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_When_and_then_20231230_나는_이_책을_읽었더니_처음_생각했던_것보다_훨씬_재미있었어요.mp3"
      },
      {
        "kr": "나는 친구를 만났더니 오랜만에 보니까 정말 기쁘었어요.",
        "romaji": "Naneun chingureul mannassdeoni oraenmane bonigga jeongmal gippueosseoyo.",
        "en": "When I met my friend, I was really happy because it's been a long time since we last saw each other.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_When_and_then_20231230_나는_친구를_만났더니_오랜만에_보니까_정말_기쁘었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했었다 [haesseotda] (Had done)",
    "short_explanation": "Used to describe an action that had been done in the past, before another action or situation.",
    "long_explanation": "'~했었다' [haesseotda]' is a verb ending used in Korean to express an action that had been completed before another event or action occurred. This form is similar to the English past perfect tense, often used to explain a past event or situation that happened prior to another past event. It can be used to explain past regrets, experiences, and situations that were true in the past but not necessarily in the present.",
    "formation": "Verb Stem + 했었다",
    "examples": [
      {
        "kr": "그날까지는 그녀를 보지 않았어요, 그러나 그 전에는 수없이 많은 편지들을 썼었어요.",
        "romaji": "Geunalkkajineun geunyeoreul boji anhasseoyo, geureona geu jeoneneun sueobsi maneun pyeonjideureul sseosseosseoyo.",
        "en": "Until that day, I didn't see her, but before that, I had written countless letters.",
        "grammar_audio": "/audio/korean/grammar/s_했었다_haesseotda_Had_done_20231230_그날까지는_그녀를_보지_않았어요_그러나_그_전에는_수없이_많은_편지들을_썼었어요.mp3"
      },
      {
        "kr": "처음 한국에 왔을 때, 알파벳밖에 모르는 상황이었어요. 그러나 나는 알파벳을 가르치기 위해 한국어를 배웠었어요.",
        "romaji": "Cheoeum hanguge waseul ttae, alphabetsbakke moreuneun sanghwangieosseoyo. Geureona naneun alphabeteul gareuchigi wihae hangugeoreul baeweosseosseoyo.",
        "en": "When I first came to Korea, I was in a situation where I knew nothing but the alphabet. But I had learned Korean to teach the alphabet.",
        "grammar_audio": "/audio/korean/grammar/s_했었다_haesseotda_Had_done_20231230_처음_한국에_왔을_때_알파벳밖에_모르는_상황이었어요_그러나_나는_알파벳을_가르치기_위해_한국어를_배웠었어요.mp3"
      },
      {
        "kr": "그는 오늘 아침에 호텔로 왔었어요, 하지만 점심에는 그 학교에 있었어요.",
        "romaji": "Geuneun oneul achime hotelro wasseosseoyo, hajiman jeomsimeneun geu hakyoe isseosseoyo.",
        "en": "He had come to the hotel this morning, but he was at that school at lunchtime.",
        "grammar_audio": "/audio/korean/grammar/s_했었다_haesseotda_Had_done_20231230_그는_오늘_아침에_호텔로_왔었어요_하지만_점심에는_그_학교에_있었어요.mp3"
      },
      {
        "kr": "나는 그녀에게 단지 한 번만 인사했었어요. 그 후로는 그녀를 보지 못했어요.",
        "romaji": "Naneun geunyeoege danji han beonman insahaesseosseoyo. Geu huroe geunyeoreul boji moshaesseoyo.",
        "en": "I had just greeted her once. After that, I couldn't see her.",
        "grammar_audio": "/audio/korean/grammar/s_했었다_haesseotda_Had_done_20231230_나는_그녀에게_단지_한_번만_인사했었어요_그_후로는_그녀를_보지_못했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했으면 [haesseumyeon] (If it were)",
    "short_explanation": "This is used to express hypothetical condition; 'If it were', 'If it could be'.",
    "long_explanation": "'~했으면 [haesseumyeon]' is a Korean grammar structure used to express hypothetical situations or conditions in the past. It's often used to reflect wishes, or to suppose different outcomes based on past events. It's generally translated 'If it were' or 'If it could be' in English.",
    "formation": "Verb + 았/었으면",
    "examples": [
      {
        "kr": "그때 해외로 외출했으면 지금 그리움을 느끼지 않았을 거예요.",
        "romaji": "Geuttae haeoero oechoolhaesseumyeon jigeum geuriumeul neukkiji anhassdeul geoyeyo.",
        "en": "If I had gone abroad at that time, I would not feel the loneliness now.",
        "grammar_audio": "/audio/korean/grammar/s_했으면_haesseumyeon_If_it_were_20231230_그때_해외로_외출했으면_지금_그리움을_느끼지_않았을_거예요.mp3"
      },
      {
        "kr": "답을 알았으면 시험에서 더 잘 했을 것이에요.",
        "romaji": "Dabeul arasseumyeon siheomeseo deo jal haesseul geosieyo.",
        "en": "If I knew the answer, I would have done better on the test.",
        "grammar_audio": "/audio/korean/grammar/s_했으면_haesseumyeon_If_it_were_20231230_답을_알았으면_시험에서_더_잘_했을_것이에요.mp3"
      },
      {
        "kr": "당신이 저를 그때 도와줬으면, 저는 실패하지 않았을 것이에요.",
        "romaji": "Dangsini jeoreul geuttae dowajwosseumyeon, jeoneun silpaehaji anhasseul geosieyo.",
        "en": "If you had helped me then, I would not have failed.",
        "grammar_audio": "/audio/korean/grammar/s_했으면_haesseumyeon_If_it_were_20231230_당신이_저를_그때_도와줬으면_저는_실패하지_않았을_것이에요.mp3"
      },
      {
        "kr": "그 일을 빨리 처리했으면, 지금 이 문제를 겪지 않았을 거예요.",
        "romaji": "Geu ireul ppalli cheorihwasseumyeon, jigeum i munjereul gyeokji anhasseul geoyeyo.",
        "en": "If I had handled that work quickly, I wouldn't be facing this problem now.",
        "grammar_audio": "/audio/korean/grammar/s_했으면_haesseumyeon_If_it_were_20231230_그_일을_빨리_처리했으면_지금_이_문제를_겪지_않았을_거예요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했을 때 [haesseul ttae] (When someone did)",
    "short_explanation": "Used to express the time when a particular action or event took place.",
    "long_explanation": "'~했을 때 [haesseul ttae]' is a verb ending used in Korean to indicate the time when a specific action or event happened in the past. It's typically translated as 'when someone did' in English. It's utilized to connect two clauses: the first clause describes the action in the past and the second clause conveys the result or consequence of that action.",
    "formation": "Verb in past tense + 았을 때/었을 때",
    "examples": [
      {
        "kr": "나는 어렸을 때 가족과 많이 여행갔어요.",
        "romaji": "Naneun eoryeosseul ttae gajokgwa mani yeohaenggasseoyo.",
        "en": "When I was young, I used to travel a lot with my family.",
        "grammar_audio": "/audio/korean/grammar/s_했을_때_haesseul_ttae_When_someone_did_20231230_나는_어렸을_때_가족과_많이_여행갔어요.mp3"
      },
      {
        "kr": "처음 한국어를 배웠을 때 말하기가 참 어려웠어요.",
        "romaji": "Cheoeum hangugeoreul baewosseul ttae malhagiga cham eoryeosseoyo.",
        "en": "When I first learned Korean, speaking was very difficult.",
        "grammar_audio": "/audio/korean/grammar/s_했을_때_haesseul_ttae_When_someone_did_20231230_처음_한국어를_배웠을_때_말하기가_참_어려웠어요.mp3"
      },
      {
        "kr": "그가 도서관에 갔을 때 기다려야 했어요.",
        "romaji": "Geuga doseogwane gasseul ttae gidaryeoya haesseoyo.",
        "en": "When he went to the library, I had to wait.",
        "grammar_audio": "/audio/korean/grammar/s_했을_때_haesseul_ttae_When_someone_did_20231230_그가_도서관에_갔을_때_기다려야_했어요.mp3"
      },
      {
        "kr": "당신이 울었을 때 나도 슬퍼지는 걸 알아버렸어요.",
        "romaji": "Dangshini ureosseul ttae nado seulpeojineun geol arabureosseoyo.",
        "en": "When you cried, I realized that I also get sad.",
        "grammar_audio": "/audio/korean/grammar/s_했을_때_haesseul_ttae_When_someone_did_20231230_당신이_울었을_때_나도_슬퍼지는_걸_알아버렸어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했을 텐데 [haesseul tende] (I think I did)",
    "short_explanation": "Used to express a strong assumption or belief about a past action.",
    "long_explanation": "'~했을 텐데' is a grammatical expression used in Korean to indicate a strong assumption or belief regarding a past action or state. The speaker believes that the action mentioned has likely occurred in the past, even though they do not have direct or definite confirmation. This grammar form conveys a sense of uncertainty combined with a high probability.",
    "formation": "Verb stem + 았/었을 텐데",
    "examples": [
      {
        "kr": "나는 그 양식을 이미 제출했을 텐데 왜 다시 요구하는지 모르겠어요.",
        "romaji": "Naneun geu yangsigeul imi jeculhaesseul tende wae dasi yoguhaneunji moreugesseoyo.",
        "en": "I think I've already submitted that form, I don't know why they're asking for it again.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseul_tende_I_think_I_did_20231230_나는_그_양식을_이미_제출했을_텐데_왜_다시_요구하는지_모르겠어요.mp3"
      },
      {
        "kr": "그는 그 소식을 들었을 텐데 아직 반응이 없네요.",
        "romaji": "Geuneun geu sosigeul deureosseul tende ajik baneungi eopsneyo.",
        "en": "I think he must have heard the news, but he hasn't responded yet.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseul_tende_I_think_I_did_20231230_그는_그_소식을_들었을_텐데_아직_반응이_없네요.mp3"
      },
      {
        "kr": "우리는 그 날 회의에 참석했을 텐데 이름이 명단에 없습니다.",
        "romaji": "Urineun geu nal hoeuie chamseokhaesseul tende ireumi myeongdane eopseumnida.",
        "en": "We should've attended the meeting that day, but our names aren't on the list.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseul_tende_I_think_I_did_20231230_우리는_그_날_회의에_참석했을_텐데_이름이_명단에_없습니다.mp3"
      },
      {
        "kr": "그녀는 이 연락을 받았을 텐데 아직 답장이 오지 않았어요.",
        "romaji": "Geunyeoneun i yeonrageul badasseul tende ajik dapjangi oji anhasseoyo.",
        "en": "She should have received this message, but she hasn't replied yet.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseul_tende_I_think_I_did_20231230_그녀는_이_연락을_받았을_텐데_아직_답장이_오지_않았어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "75"
  },
  {
    "title": "~했지만 [haetjiman] (But, however)",
    "short_explanation": "Used to express a contrast or contradiction; 'but', 'however'.",
    "long_explanation": "'~했지만 [haetjiman]' is a conjunctive form used in Korean to indicate a contrast or contradiction between two clauses. It is often used to combine sentences or points that may initially seem consistent, but have some form of contradiction or surprising element within them. This is similar to the English conjunctions 'but' or 'however'.",
    "formation": "Verb + ~했지만",
    "examples": [
      {
        "kr": "여행을 많이 가고 싶었지만, 시간이 없어서 못 갔어요.",
        "romaji": "Yeohaengeul mani gago sipeotjiman, sigani eopseoso mot gassseoyo.",
        "en": "I wanted to travel a lot but I couldn't because I didn't have time.",
        "grammar_audio": "/audio/korean/grammar/s_했지만_haetjiman_But_however_20231230_여행을_많이_가고_싶었지만_시간이_없어서_못_갔어요.mp3"
      },
      {
        "kr": "저는 공부를 열심히 했지만, 시험에서 높은 점수를 받지 못했어요.",
        "romaji": "Jeoneun gongbureul yeolsimhi haetjiman, siheomeseo nopeun jeomsureul batji moshaesseoyo.",
        "en": "Although I studied hard, I did not get high scores in the exam.",
        "grammar_audio": "/audio/korean/grammar/s_했지만_haetjiman_But_however_20231230_저는_공부를_열심히_했지만_시험에서_높은_점수를_받지_못했어요.mp3"
      },
      {
        "kr": "그는 재미있는 일을 많이 하고 싶었지만, 매일밤 일해야 했어요.",
        "romaji": "Geuneun jaemiissneun ireul mani hago sipeotjiman, maeilbam ilhaeya haesseoyo.",
        "en": "He wanted to do a lot of fun things, but he had to work every night.",
        "grammar_audio": "/audio/korean/grammar/s_했지만_haetjiman_But_however_20231230_그는_재미있는_일을_많이_하고_싶었지만_매일밤_일해야_했어요.mp3"
      },
      {
        "kr": "친구들과 함께 놀고 싶었지만, 과제때문에 나갈 수 없었어요.",
        "romaji": "Chingudeulgwa hamkke nolgo sipeotjiman, gwajettaemune nagal su eopseosseoyo.",
        "en": "I wanted to play with my friends, but I couldn't go out due to assignments.",
        "grammar_audio": "/audio/korean/grammar/s_했지만_haetjiman_But_however_20231230_친구들과_함께_놀고_싶었지만_과제때문에_나갈_수_없었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~혀/어/여 [hyeo/eo/yeo] (Because, so)",
    "short_explanation": "This grammar point is used to indicate the reason or cause for something. It can be translated as 'because' or 'so' in English.",
    "long_explanation": "The ~혀/어/여 [hyeo/eo/yeo] ending is used in Korean grammar to denote a cause and effect relationship between two clauses. The clause that contains ~혀/어/여 indicates the reason or cause for the action or state expressed in the main clause. The form of ~혀/어/여 depends on the final syllable of the verb stem it follows: '혀' is used after a verb stem ending in '하', '어' after those ending in a vowel, and '여' after those ending in 'ㅏ' or 'ㅗ'.",
    "formation": "Verb stem + 혀/어/여 + Sentence",
    "examples": [
      {
        "kr": "저는 배가 고파서 밥을 많이 먹었어요.",
        "romaji": "Jeoneun baega gopaseo babeul manhi meogeosseoyo.",
        "en": "I ate a lot because I was hungry.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여_hyeo/eo/yeo_Because_so_20231230_저는_배가_고파서_밥을_많이_먹었어요.mp3"
      },
      {
        "kr": "그는 성격이 좋아서 친구가 많아요.",
        "romaji": "Geuneun seonggyeogi joaseo chinguga manhayo.",
        "en": "He has a lot of friends because his personality is good.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여_hyeo/eo/yeo_Because_so_20231230_그는_성격이_좋아서_친구가_많아요.mp3"
      },
      {
        "kr": "나는 기차가 늦어서 회사에 늦었어요.",
        "romaji": "Naneun gichaga neujeoseo hoesae neujeosseoyo.",
        "en": "I was late to the office because the train was late.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여_hyeo/eo/yeo_Because_so_20231230_나는_기차가_늦어서_회사에_늦었어요.mp3"
      },
      {
        "kr": "이 방이 너무 시끄러워서 공부를 할 수 없어요.",
        "romaji": "I bangi neomu sikkureoseo gongbureul hal su eopseoyo.",
        "en": "I can't study because this room is too noisy.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여_hyeo/eo/yeo_Because_so_20231230_이_방이_너무_시끄러워서_공부를_할_수_없어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~혀/어/여야 [hyeo/eo/yeoya] (Have to)",
    "short_explanation": "Used to express necessity or obligation; 'have to', 'must'.",
    "long_explanation": "'~혀/어/여야 [hyeo/eo/yeoya]' is a Korean grammar pattern used to indicate the necessity or obligation to do something, similar to 'have to' or 'must' in English. It is usually used when the speaker wants to express that a certain action must be done in order to achieve something, or when there is a compelling need to perform the action. The ending '야' is combined with a verb stem and an auxiliary verb, depending on the verb stem's final vowel.",
    "formation": "Verb Stem + 혀야/어야/여야",
    "examples": [
      {
        "kr": "기말고사를 위해 어려운 문제들을 많이 풀어야 합니다.",
        "romaji": "Gimalgosareul wihae eoryeoun munjedeureul mani pureoya habnida.",
        "en": "I have to solve many difficult problems for the final exam.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여야_hyeo/eo/yeoya_Have_to_20231230_기말고사를_위해_어려운_문제들을_많이_풀어야_합니다.mp3"
      },
      {
        "kr": "오늘은 일찍 자야 내일의 피곤을 피할 수 있을 것 같아요.",
        "romaji": "Oneureun iljjik jaya naeirui pigoneul pihal su isseul geot gatayo.",
        "en": "I have to go to bed early today in order to avoid fatigue tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여야_hyeo/eo/yeoya_Have_to_20231230_오늘은_일찍_자야_내일의_피곤을_피할_수_있을_것_같아요.mp3"
      },
      {
        "kr": "나는 이번 달을 위해 더 많이 돈을 벌어야 해요.",
        "romaji": "Naneun ibeon dareul wihae deo mani doneul beoreoya haeyo.",
        "en": "I have to earn more money for this month.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여야_hyeo/eo/yeoya_Have_to_20231230_나는_이번_달을_위해_더_많이_돈을_벌어야_해요.mp3"
      },
      {
        "kr": "프로젝트 제출 전에 팀원들과 미팅을 하여야 합니다.",
        "romaji": "Peurojekteu jechul jeone timweondeulgwa mitingeul hayeoya habnida.",
        "en": "We have to have a meeting with team members before submitting the project.",
        "grammar_audio": "/audio/korean/grammar/s_혀/어/여야_hyeo/eo/yeoya_Have_to_20231230_프로젝트_제출_전에_팀원들과_미팅을_하여야_합니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~후에 [hue] (After)",
    "short_explanation": "Used to indicate the happening of an action or event after another action or event.",
    "long_explanation": "'~후에 [hue]' is a time-related grammar point used in Korean language to denote the sequential happening of events, meaning 'after' in English. It is used to connect two different events or actions where the second event or action happens after the first event or action. The use of this grammar point emphasizes the chronology of events.",
    "formation": "Verb-과거(ㄴ/은/ㄹ) + 후에",
    "examples": [
      {
        "kr": "저는 학교를 졸업한 후에 바로 일을 찾으러 갔어요, 다른 일이 있다고 쉴 수 있는 시간이 없었어요.",
        "romaji": "Jeoneun hakgyoreul joleophan hue baro ireul chajeureo gasseoyo, dareun iri issgo swil su issneun sigani eopseosseoyo.",
        "en": "After I graduated from school, I immediately went to find a job, I didn't have time to rest because there were other things to do.",
        "grammar_audio": "/audio/korean/grammar/s_후에_hue_After_20231230_저는_학교를_졸업한_후에_바로_일을_찾으러_갔어요_다른_일이_있다고_쉴_수_있는_시간이_없었어요.mp3"
      },
      {
        "kr": "저는 매일 일어난 후에 운동을 하고 다시 집에 돌아와서 준비를 해요.",
        "romaji": "Jeoneun maeil ileonan hue undongeul hago dasi jibe dorawaseo junbireul haeyo.",
        "en": "After I wake up every day, I exercise and then go back home to get ready.",
        "grammar_audio": "/audio/korean/grammar/s_후에_hue_After_20231230_저는_매일_일어난_후에_운동을_하고_다시_집에_돌아와서_준비를_해요.mp3"
      },
      {
        "kr": "밥을 먹은 후에 휴식 시간이 있어서 친구들하고 대화를 나눠요.",
        "romaji": "Babeul meogeun hue hyusik sigani isseoseo chingudeulhago daehwareul nanwoyo.",
        "en": "After eating, I have a rest time and have a conversation with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_후에_hue_After_20231230_밥을_먹은_후에_휴식_시간이_있어서_친구들하고_대화를_나눠요.mp3"
      },
      {
        "kr": "공부를 한 후에 테스트를 볼 것이지만 그럴 시간이 많이 없어요.",
        "romaji": "Gongbureul han hue testeu-reur bol geosijiman geureol sigani mani eopseoyo.",
        "en": "I'm going to take a test after studying, but I don't have a lot of time to do so.",
        "grammar_audio": "/audio/korean/grammar/s_후에_hue_After_20231230_공부를_한_후에_테스트를_볼_것이지만_그럴_시간이_많이_없어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)나 [(eu)na] (But, however)",
    "short_explanation": "Used to express contradiction or opposition; 'but', 'however'.",
    "long_explanation": "'~(으)나 [(eu)na]' is a conjunction used in Korean to indicate a contrast or a contradiction between two clauses or sentences. It conveys a sense of transition from one point to another, similar to 'but' or 'however' in English. It is used to deliver a contrary opinion or fact, often giving a surprising or contradictory information.",
    "formation": "Statement + ~(으)나 + Contradicting statement",
    "examples": [
      {
        "kr": "오늘은 사실 기분이 좋으나, 날씨가 너무 비올려서 좀 힘이 들어요.",
        "romaji": "Oneureun sasil gibuni joeuna, nalssiga neomu biollyeoseo jom himi deureoyo.",
        "en": "I actually feel good today, but the weather seems to be rainy, which is a bit draining.",
        "grammar_audio": "/audio/korean/grammar/s_으나_euna_But_however_20231230_오늘은_사실_기분이_좋으나_날씨가_너무_비올려서_좀_힘이_들어요.mp3"
      },
      {
        "kr": "집에 가고 싶으나, 공부를 더 해야해서 학교에 머물러야 해요.",
        "romaji": "Jibe gago sipuna, gongbureul deo haeyahaseo hakgyoe meomulleoya haeyo.",
        "en": "I want to go home, but I need to study more so I have to stay at school.",
        "grammar_audio": "/audio/korean/grammar/s_으나_euna_But_however_20231230_집에_가고_싶으나_공부를_더_해야해서_학교에_머물러야_해요.mp3"
      },
      {
        "kr": "나는 물론 친구들도 이 영화를 볼 계획이었으나, 표가 다 매진되어서 볼 수 없었어요.",
        "romaji": "Naneun mullon chingudeuldo i yeonghwareul bol gyehogieosseuna, pyoga da maejindoeseo bol su eopseossseoyo.",
        "en": "Of course, not only me but my friends also planned to watch this movie, but the tickets were all sold out so we couldn't watch it.",
        "grammar_audio": "/audio/korean/grammar/s_으나_euna_But_however_20231230_나는_물론_친구들도_이_영화를_볼_계획이었으나_표가_다_매진되어서_볼_수_없었어요.mp3"
      },
      {
        "kr": "숙제가 많으나, 워낙 지독하게 어려워서 정말히 어떻게 할지 모르겠어요.",
        "romaji": "Sukjega manhna, wonag jidokhage eoryeowoseo jeongmalhi eotteohge halji moreugesseoyo.",
        "en": "There's a lot of homework, but it's so viciously hard that I really don't know what to do.",
        "grammar_audio": "/audio/korean/grammar/s_으나_euna_But_however_20231230_숙제가_많으나_워낙_지독하게_어려워서_정말히_어떻게_할지_모르겠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄹ까요? [(eu)lkka yo?] (Shall we?)",
    "short_explanation": "This grammar point is used to make a suggestion or proposal to do something together.",
    "long_explanation": "'~(으)ㄹ까요?' is a grammar form in Korean which is used when someone is offering a suggestion or making a proposal. This sentence ending is used when the speaker wishes to propose something altogether with the person they're talking to. For verbs that end with a vowel, only 'ㄹ까요?' is added, if it ends a consonant, '을까요?' is used.",
    "formation": "Verb-stem + (으)ㄹ까요?",
    "examples": [
      {
        "kr": "우리 사진 찍을까요? 날씨가 좋아서 멋진 사진이 나올 것 같아요.",
        "romaji": "Uri sajin jjigeulkka yo? Nalssiga joaseo meongjin sajini naol geot gatayo.",
        "en": "Shall we take a photo? The weather is nice, so I think we will get a great picture.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ까요_eulkka_yo_Shall_we_20231230_우리_사진_찍을까요_날씨가_좋아서_멋진_사진이_나올_것_같아요.mp3"
      },
      {
        "kr": "점심시간에 함께 운동할까요? 몸을 움직이는 것이 건강에 좋으니까요.",
        "romaji": "Jeomsimsigan-e hamkke undonghalkka yo? Momeul umjigineun geosi geongange jo-eunikka yo.",
        "en": "Shall we exercise together during lunch time? Moving the body is good for health.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ까요_eulkka_yo_Shall_we_20231230_점심시간에_함께_운동할까요_몸을_움직이는_것이_건강에_좋으니까요.mp3"
      },
      {
        "kr": "이번 주말에 영화를 볼까요? 재미있는 영화가 많이 개봉했어요.",
        "romaji": "Ibeon jumale yeonghwareul bolkka yo? Jaemiissneun yeonghwaga manh-i gaebonghaess-eoyo.",
        "en": "Shall we watch a movie this weekend? There have been a lot of fun movies released.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ까요_eulkka_yo_Shall_we_20231230_이번_주말에_영화를_볼까요_재미있는_영화가_많이_개봉했어요.mp3"
      },
      {
        "kr": "같이 커피를 마실까요? 커피를 마시면서 이야기를 나누면 좋을 것 같아요.",
        "romaji": "Gachi keopileul masilkka yo? Keopireul masimyeonseo iyagileul nanumyeon jo-eul geot gatayo.",
        "en": "Shall we have a coffee together? I think it would be nice to have a conversation while drinking coffee.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ까요_eulkka_yo_Shall_we_20231230_같이_커피를_마실까요_커피를_마시면서_이야기를_나누면_좋을_것_같아요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄹ래요 [(eu)llae yo] (I will)",
    "short_explanation": "This grammar point is used when the speaker is suggesting doing something or explaining his/her intention.",
    "long_explanation": "'~(으)ㄹ래요 [(eu)llae yo]' is a Korean grammar structure used to express the speaker's intention or decision to perform an action. It can also indicate a suggestion provided by the speaker, inviting others to join them in an action. This form is usually used in informal (or polite but casual) situations among friends, family, and people who are about the same age or younger.",
    "formation": "(Verb stem) + (으)ㄹ래요",
    "examples": [
      {
        "kr": "저녁에 같이 영화를 볼래요? 제가 좋은 영화를 찾아보았어요.",
        "romaji": "Jeonyeoge gachi yeongwareul bollae yo? Jega joheun yeongwareul chajabwasseoyo.",
        "en": "Do you want to watch a movie together in the evening? I have found a good movie.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래요_eullae_yo_I_will_20231230_저녁에_같이_영화를_볼래요_제가_좋은_영화를_찾아보았어요.mp3"
      },
      {
        "kr": "날씨가 좋으니까 외부에서 점심을 먹을래요. 신선한 공기를 즐기면서 식사할 수 있어요.",
        "romaji": "Nalssiga joheunikka oebueseon jeomsimeul meogeullae yo. Sinsaenghan gonggireul jeulgimyeonseo siksa hal su isseoyo.",
        "en": "Since the weather is nice, I want to eat lunch outside. We can enjoy fresh air while dining.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래요_eullae_yo_I_will_20231230_날씨가_좋으니까_외부에서_점심을_먹을래요_신선한_공기를_즐기면서_식사할_수_있어요.mp3"
      },
      {
        "kr": "오늘 저녁에 저와 체스를 둘래요? 제가 오랫동안 연습해 왔어요.",
        "romaji": "Oneul jeonyeoge jewa cheseureul dullae yo? Jega oraesdongan yeonseuphae wasseoyo.",
        "en": "Do you want to play chess with me this evening? I have been practicing for a long time.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래요_eullae_yo_I_will_20231230_오늘_저녁에_저와_체스를_둘래요_제가_오랫동안_연습해_왔어요.mp3"
      },
      {
        "kr": "당신의 분실물을 찾을래요. 택시 드라이버에게 연락해 볼게요.",
        "romaji": "Dangsinui bunsilmureul chajeullae yo. Taeksi deuraibeoege yeonlakhae bolgeyo.",
        "en": "I will look for your lost item. I will try contacting the taxi driver.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래요_eullae_yo_I_will_20231230_당신의_분실물을_찾을래요_택시_드라이버에게_연락해_볼게요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)면서 [(eu)myeonseo] (While)",
    "short_explanation": "Used to express 'while' or 'at the same time' in Korean.",
    "long_explanation": "'~(으)면서 [(eu)myeonseo]' is used in Korean to denote simultaneous actions or states. It is similar to 'while' in English, indicating that two or more actions are happening at the same time. It can also be used to express contradictions between two clauses, akin to 'but' or 'however'., usually to express a sense of surprise or unexpected situations.",
    "formation": "Verb + ~(으)면서",
    "examples": [
      {
        "kr": "저는 학교에 다니면서 풀타임으로 일을 하고 있어요.",
        "romaji": "Jeoneun hakgyoe danimyeonseo pulltaimeuro ireul hago iss-eoyo.",
        "en": "I'm working full time while attending school.",
        "grammar_audio": "/audio/korean/grammar/s_으면서_eumyeonseo_While_20231230_저는_학교에_다니면서_풀타임으로_일을_하고_있어요.mp3"
      },
      {
        "kr": "승민은 음악을 들으면서 공부를 하고 있어요.",
        "romaji": "Seungmin-eun eumag-eul deuleumyeonseo gongbuleul hago iss-eoyo.",
        "en": "Seungmin is studying while listening to music.",
        "grammar_audio": "/audio/korean/grammar/s_으면서_eumyeonseo_While_20231230_승민은_음악을_들으면서_공부를_하고_있어요.mp3"
      },
      {
        "kr": "그는 눈물을 흘리면서 웃었어요, 그의 기쁨이 넘쳐서 그랬어요.",
        "romaji": "Geuneun nunmureul heullimyeonseo us-eoss-eoyo, geuui gippeumi neomchyeoseo geulaess-eoyo.",
        "en": "He laughed while shedding tears, because his joy was overflowing.",
        "grammar_audio": "/audio/korean/grammar/s_으면서_eumyeonseo_While_20231230_그는_눈물을_흘리면서_웃었어요_그의_기쁨이_넘쳐서_그랬어요.mp3"
      },
      {
        "kr": "할머니는 요리도 하면서 또 사랑방에서 얘기를 해주시는데, 나는 그게 능력이라고 생각해요.",
        "romaji": "Halmoni-neun yori-do hamyeonseo tto sarangbang-eseo yaegi-reul haeju-sineunde, na-neun geuge neungnyeok-irago saenggag-haeyo.",
        "en": "My grandma cooks and also tells stories in the living room at the same time - I think that's skill.",
        "grammar_audio": "/audio/korean/grammar/s_으면서_eumyeonseo_While_20231230_할머니는_요리도_하면서_또_사랑방에서_얘기를_해주시는데_나는_그게_능력이라고_생각해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)로 [(eu)ro] (Towards, by means of)",
    "short_explanation": "This particle is used to express the direction, means or method, or the purpose of an action.",
    "long_explanation": "'~(으)로 [(eu)ro]' is a particle in Korean that can be used to express various meanings in a sentence, including direction towards which an action is made, means or method by which an action is carried out, and the purpose or intended result of an action. Depending on the context, it can be equivalent to English prepositions like 'to', 'by', 'with', 'as', or 'for'. ",
    "formation": "If the preceding noun ends with a vowel, use ‘로’. If the preceding noun ends with a consonant, use ‘으로’.",
    "examples": [
      {
        "kr": "저는 매일 아침 지하철로 회사에 가요.",
        "romaji": "Jeoneun maeil achim jihacheollo hoesae gayo.",
        "en": "I go to the office by subway every morning.",
        "grammar_audio": "/audio/korean/grammar/s_으로_euro_Towards_by_means_of_20231230_저는_매일_아침_지하철로_회사에_가요.mp3"
      },
      {
        "kr": "나는 이 문제를 해결하기 위해 새로운 방법으로 시도했어요.",
        "romaji": "Naneun i munjeeul haegyeolhagi wihae saeroun bangbeobeuro sidohaesseoyo.",
        "en": "I tried a new method to solve this problem.",
        "grammar_audio": "/audio/korean/grammar/s_으로_euro_Towards_by_means_of_20231230_나는_이_문제를_해결하기_위해_새로운_방법으로_시도했어요.mp3"
      },
      {
        "kr": "저는 친구를 공항으로 배웠어요.",
        "romaji": "Jeoneun chingureul gonghangeuro baewosseoyo.",
        "en": "I took my friend to the airport.",
        "grammar_audio": "/audio/korean/grammar/s_으로_euro_Towards_by_means_of_20231230_저는_친구를_공항으로_배웠어요.mp3"
      },
      {
        "kr": "여행 계획을 세우는 것은 종이와 펜으로 했어요.",
        "romaji": "Yeohaeng gyehoegeul seuneun geoseun jongiwa pen euro haesseoyo.",
        "en": "I planned the trip with paper and pen.",
        "grammar_audio": "/audio/korean/grammar/s_으로_euro_Towards_by_means_of_20231230_여행_계획을_세우는_것은_종이와_펜으로_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)로서 [(eu)roseo] (As)",
    "short_explanation": "This is used to mean 'as' or 'in the capacity of'.",
    "long_explanation": "The Korean grammar point '~(으)로서 [(eu)roseo]' is used when you want to express the concept of doing something or existing in the capacity or status of something or someone. This is akin to the English preposition 'as'. The rule to remember is, if the noun ends with a consonant, we use 으로서, and if the noun ends with a vowel, we use 로서.",
    "formation": "‘Consonant-ending noun’ + 으로서, ‘Vowel-ending noun’ + 로서",
    "examples": [
      {
        "kr": "기자로서의 역할을 최선으로 다하려고 노력하고 있어요.",
        "romaji": "Gijaroseo-ui yeoghaleul choeseoneuro daharyeogo noryeokhago issoyo.",
        "en": "I'm trying to do my best in my role as a journalist.",
        "grammar_audio": "/audio/korean/grammar/s_으로서_euroseo_As_20231230_기자로서의_역할을_최선으로_다하려고_노력하고_있어요.mp3"
      },
      {
        "kr": "나는 한 학생으로서 나의 의무를 다해야 해.",
        "romaji": "Naneun han haksaengeuroseo na-ui uimureul dahayeya hae.",
        "en": "I, as a student, have to fulfill my duties.",
        "grammar_audio": "/audio/korean/grammar/s_으로서_euroseo_As_20231230_나는_한_학생으로서_나의_의무를_다해야_해.mp3"
      },
      {
        "kr": "마지막으로 국민으로서 아주 중요한 일을 하여야 합니다.",
        "romaji": "Majimag-euro gungmin-euroseo aju jungyohan il-eul hayeoya hapnida.",
        "en": "Lastly, as a citizen, I have a very important task to do.",
        "grammar_audio": "/audio/korean/grammar/s_으로서_euroseo_As_20231230_마지막으로_국민으로서_아주_중요한_일을_하여야_합니다.mp3"
      },
      {
        "kr": "어머니로서 그녀는 항상 가족을 위해 최선을 다합니다.",
        "romaji": "Eomeoniroseo geunyeoneun hangsang gajogeul wihae choeseoneul dahabnida.",
        "en": "As a mother, she always does her best for her family.",
        "grammar_audio": "/audio/korean/grammar/s_으로서_euroseo_As_20231230_어머니로서_그녀는_항상_가족을_위해_최선을_다합니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)로써 [(eu)rosseo] (By, as)",
    "short_explanation": "Used to express the means or method of something; similar to 'by', 'as', 'via' in English.",
    "long_explanation": "'~(으)로써 [(eu)rosseo]' is a postposition used in Korean to indicate the method or means by which something occurs or the capacity in which a person or thing is acting. It is used when you want to put emphasis on the method, means, or capacity, not the agent or the doer of the action. It expresses the sense of 'by means of', 'with', 'as', 'via' in English.",
    "formation": "Noun + ~(으)로써",
    "examples": [
      {
        "kr": "저는 이 성과를 이루기 위해 노력으로써 성공했습니다.",
        "romaji": "Jeoneun i seonggwaleul irugi wihae noryeogeuroseo seonggongaessseubnida.",
        "en": "I have achieved this result by means of effort.",
        "grammar_audio": "/audio/korean/grammar/s_으로써_eurosseo_By_as_20231230_저는_이_성과를_이루기_위해_노력으로써_성공했습니다.mp3"
      },
      {
        "kr": "그는 시간 관리로써 스스로를 통제하는 방법을 배웠습니다.",
        "romaji": "Geuneun sigan gwonliloseo seuseuloreul tongjehaneun bangbeobeul baewassseubnida.",
        "en": "He learned the method of controlling himself through time management.",
        "grammar_audio": "/audio/korean/grammar/s_으로써_eurosseo_By_as_20231230_그는_시간_관리로써_스스로를_통제하는_방법을_배웠습니다.mp3"
      },
      {
        "kr": "이 숙제는 그녀의 가르침으로써 완성했습니다.",
        "romaji": "I sukjeneun geunyeoui gareuchimeuroseo wanseonghaetsseubnida.",
        "en": "I have completed this homework by her teachings.",
        "grammar_audio": "/audio/korean/grammar/s_으로써_eurosseo_By_as_20231230_이_숙제는_그녀의_가르침으로써_완성했습니다.mp3"
      },
      {
        "kr": "감독으로써 그는 영화를 완성했습니다.",
        "romaji": "Gamdogeuroseo geuneun yeonghwareul wanseonghaessseubnida.",
        "en": "As a director, he has completed the film.",
        "grammar_audio": "/audio/korean/grammar/s_으로써_eurosseo_By_as_20231230_감독으로써_그는_영화를_완성했습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)려고 하다 [(eu)ryeogo hada] (To try to)",
    "short_explanation": "This structure is commonly used to express 'trying to do' something or 'intending to' do something.",
    "long_explanation": "'~(으)려고 하다 [(eu)ryeogo hada]' is a useful grammar pattern in Korean that is used to indicate an intention or a plan to perform an action in the future. It gives a nuance similar to the English expressions 'I am going to' or 'I am planning to'. This can also be used to share one's aim or goal that they intend to achieve.",
    "formation": "Verb Stem + 려고 하다 (if the last syllable does not end in a vowel) / Verb Stem + 으려고 하다 (if the last syllable ends in a vowel)",
    "examples": [
      {
        "kr": "저는 한국어를 더 잘하려고 하다 매일 연습을 많이 합니다.",
        "romaji": "Jeoneun hangugeoreul deo jalharyeogo hada maeil yeonseubeul manhi habnida.",
        "en": "I practice every day because I am trying to improve my Korean language.",
        "grammar_audio": "/audio/korean/grammar/s_으려고_하다_euryeogo_hada_To_try_to_20231230_저는_한국어를_더_잘하려고_하다_매일_연습을_많이_합니다.mp3"
      },
      {
        "kr": "우리 어머니는 맛있는 저녁 식사를 준비하려고 하다 요리공부를 합니다.",
        "romaji": "Uri eomeonineun masitneun jeonyeok siksa-reul junbiharyeogo hada yorigongbu-reul habnida.",
        "en": "My mother studies cooking because she's trying to prepare a delicious dinner.",
        "grammar_audio": "/audio/korean/grammar/s_으려고_하다_euryeogo_hada_To_try_to_20231230_우리_어머니는_맛있는_저녁_식사를_준비하려고_하다_요리공부를_합니다.mp3"
      },
      {
        "kr": "동생은 더 큰 키를 위해 매일 운동을 하려고 하다.",
        "romaji": "Dongsaeng-eun deo keun ki-reul wihae maeil undong-eul haryeogo hada.",
        "en": "My younger sibling exercises every day in an attempt to grow taller.",
        "grammar_audio": "/audio/korean/grammar/s_으려고_하다_euryeogo_hada_To_try_to_20231230_동생은_더_큰_키를_위해_매일_운동을_하려고_하다.mp3"
      },
      {
        "kr": "친구가 알려준 새로운 앱을 사용하려고 하다 제 전화를 업데이트 했습니다.",
        "romaji": "Chinguga allyeojun saeroun aebeul sayongharyeogo hada je jeonhwareul eopdeiteu haessseubnida.",
        "en": "I updated my phone to try the new app that my friend recommended.",
        "grammar_audio": "/audio/korean/grammar/s_으려고_하다_euryeogo_hada_To_try_to_20231230_친구가_알려준_새로운_앱을_사용하려고_하다_제_전화를_업데이트_했습니다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)리라 [(eu)rira] (Probably)",
    "short_explanation": "This grammar form is used to express a supposition or assumption by the speaker, similar to 'probably' in English.",
    "long_explanation": "'~(으)리라 [(eu)rira]' is a Korean grammar form that is used when the speaker wants to make a supposition or assumption about something, similar to 'probably' in English. This form is frequently used in daily conversations and writings when the speaker has a belief about a certain outcome but isn't completely sure. Therefore, sentences that include this grammar pattern can be seen as educated guesses.",
    "formation": "Verb stem + (으)리라 (If the verb stem’s last vowel is 아/오, use 아리라. If not, use 으리라)",
    "examples": [
      {
        "kr": "그가 아마 내일 출근하리라 생각이 들어요.",
        "romaji": "Geuga ama naeil chulgeunharira saenggagi deuleoyo.",
        "en": "I suppose he will probably come to work tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_으리라_eurira_Probably_20231230_그가_아마_내일_출근하리라_생각이_들어요.mp3"
      },
      {
        "kr": "기말고사 성적이 좋으리라 확신이 있어요.",
        "romaji": "Gimalgosa seongjeogi joeurira hwaksini isseoyo.",
        "en": "I am convinced that my final exam scores will probably be good.",
        "grammar_audio": "/audio/korean/grammar/s_으리라_eurira_Probably_20231230_기말고사_성적이_좋으리라_확신이_있어요.mp3"
      },
      {
        "kr": "비가 오리라 생각하고 우산을 가져왔어요.",
        "romaji": "Biga orira saenggakago usaneul gajyeowasseoyo.",
        "en": "I brought an umbrella thinking it would probably rain.",
        "grammar_audio": "/audio/korean/grammar/s_으리라_eurira_Probably_20231230_비가_오리라_생각하고_우산을_가져왔어요.mp3"
      },
      {
        "kr": "저는 회사에 빠르게 승진하리라 예상했어요.",
        "romaji": "Jeoneun hoesae ppareuge seungjinharira yesanghaesseoyo.",
        "en": "I expected that I would probably be promoted quickly at the company.",
        "grammar_audio": "/audio/korean/grammar/s_으리라_eurira_Probably_20231230_저는_회사에_빠르게_승진하리라_예상했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)실 거예요 [(eu)sil geoyeyo] (You will probably)",
    "short_explanation": "This grammar point is used to express an educated guess or assumption about a future action pertaining to a third person.",
    "long_explanation": "'~(으)실 거예요 [(eu)sil geoyeyo]' is a future tense form used in the Korean language to talk about a third person's probable or expected future action or state. It is used when the speaker is assuming or making an educated guess about someone's future action based on certain information. It is also used to express a plan or intention of a third person in a polite and formal way.",
    "formation": "Verb stem + (으)실 거예요 [(eu)sil geoyeyo]",
    "examples": [
      {
        "kr": "어머니는 내일 아침에 일찍 나가실 거예요, 미리 아침밥을 준비해 두세요.",
        "romaji": "Eomeonineun naeil achimae iljjik nagasil geoyeyo, miri achimbabeul junbihae duseyo.",
        "en": "Mother will probably leave early tomorrow morning, so prepare the breakfast in advance.",
        "grammar_audio": "/audio/korean/grammar/s_으실_거예요_eusil_geoyeyo_You_will_probably_20231230_어머니는_내일_아침에_일찍_나가실_거예요_미리_아침밥을_준비해_두세요.mp3"
      },
      {
        "kr": "선생님은 이 문제에 대해 많이 알고 계실 거예요.",
        "romaji": "Seonsaengnimeun i munjee daehae mani algo gyesil geoyeyo.",
        "en": "The teacher will probably know a lot about this problem.",
        "grammar_audio": "/audio/korean/grammar/s_으실_거예요_eusil_geoyeyo_You_will_probably_20231230_선생님은_이_문제에_대해_많이_알고_계실_거예요.mp3"
      },
      {
        "kr": "우리 부모님은 아마 다음 주에 회사에 갈 거라고 생각하실 거예요.",
        "romaji": "Uri bumonimeun ama daeum jue hoesae gal georago saenggakhasil geoyeyo.",
        "en": "Our parents will probably think that they will go to the company next week.",
        "grammar_audio": "/audio/korean/grammar/s_으실_거예요_eusil_geoyeyo_You_will_probably_20231230_우리_부모님은_아마_다음_주에_회사에_갈_거라고_생각하실_거예요.mp3"
      },
      {
        "kr": "대통령님은 내년에도 여기를 방문하실 거예요.",
        "romaji": "Daetongryeongnimeun naenyeonedo yeogireul bangmunhasil geoyeyo.",
        "en": "The president will probably visit here next year too.",
        "grammar_audio": "/audio/korean/grammar/s_으실_거예요_eusil_geoyeyo_You_will_probably_20231230_대통령님은_내년에도_여기를_방문하실_거예요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)면 좋겠다 [(eu)myeon jokgetda] (It would be good if)",
    "short_explanation": "Used to express a hope or wish for something to occur in the future.",
    "long_explanation": "'~(으)면 좋겠다 [(eu)myeon jokgetda]' is a structure used in Korean to articulate a hope, wish, or desire for a future event or situation. Essentially, it translates to 'it/that would be good if', indicating that the speaker would be pleased if the circumstance they mentioned comes true. It can be employed in both simple and hypothetical situations, expressing the speaker's yearning for a certain outcome.",
    "formation": "Verb-stem + (으)면 좋겠다",
    "examples": [
      {
        "kr": "내일 날씨가 좋으면 좋겠어요, 외출 계획이 있어서 맑은 하늘이 좋겠습니다.",
        "romaji": "Naeil nalssiga joh-eumyeon johgesseoyo, oe chul gye hwa gi iss-eoseo mal k-un haneul-i johgessseubnida.",
        "en": "It would be good if the weather is nice tomorrow, as I have plans to go out and would like a clear sky.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_jokgetda_It_would_be_good_if_20231230_내일_날씨가_좋으면_좋겠어요_외출_계획이_있어서_맑은_하늘이_좋겠습니다.mp3"
      },
      {
        "kr": "시험에서 잘 보면 좋겠다, 많은 노력을 들였으니까.",
        "romaji": "Siheom-eseo jal bomyeon johketda, manheun noryeog-eul deulyeoss-eunikka.",
        "en": "I wish I perform well in the exam, as I have put in a lot of effort.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_jokgetda_It_would_be_good_if_20231230_시험에서_잘_보면_좋겠다_많은_노력을_들였으니까.mp3"
      },
      {
        "kr": "치킨을 먹으면 좋겠다, 치킨이 너무 좋아해서.",
        "romaji": "Chikin-eul meok-eumyeon johketda, chikin-i neomu joahaseo.",
        "en": "I wish to eat chicken, because I really like chicken.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_jokgetda_It_would_be_good_if_20231230_치킨을_먹으면_좋겠다_치킨이_너무_좋아해서.mp3"
      },
      {
        "kr": "여행을 갈 수 있으면 좋겠다, 집에 갖혀 있어서 너무 지루해.",
        "romaji": "Yeohaeng-eul gal su iss-eumyeon johketda, jib-e gachyeo iss-eoseo neomu jiluhae.",
        "en": "It would be good if I can go on a vacation, as it is so boring to be stuck at home.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_jokgetda_It_would_be_good_if_20231230_여행을_갈_수_있으면_좋겠다_집에_갖혀_있어서_너무_지루해.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)면서도 [(eu)myeonseodo] (While, although)",
    "short_explanation": "Used to express 'while' or 'although', indicating a situation or action that happens concurrently with another, or contrary to expectation.",
    "long_explanation": "The grammar point ~(으)면서도 [(eu)myeonseodo] is used in Korean to indicate that an event or situation is happening while another is also taking place, or when something is contrary to expectation. It can be translated as 'while' or 'although'. This form can be used with both action verbs and descriptive verbs. With this grammar pattern, you can express the continuation of two situations at the same time or describe a contrastive situation.",
    "formation": "Verb-stem + (으)면서도",
    "examples": [
      {
        "kr": "그는 화가 나면서도 미소를 지었다.",
        "romaji": "Geuneun hwaga namyeonseodo misoreul jieossda.",
        "en": "Although he was angry, he smiled.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_그는_화가_나면서도_미소를_지었다.mp3"
      },
      {
        "kr": "그녀는 아프면서도 학교에 갔다.",
        "romaji": "Geunyeoneun apeumyeonseodo hakgyoe gassda.",
        "en": "Although she was sick, she went to school.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_그녀는_아프면서도_학교에_갔다.mp3"
      },
      {
        "kr": "비가 와도, 방송은 계속해서 진행 중이었어요.",
        "romaji": "Biga wado, bangsongeun gyesokhaeseo jinhaeng jungeosseoyo.",
        "en": "Although it was raining, the broadcast continued.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_비가_와도_방송은_계속해서_진행_중이었어요.mp3"
      },
      {
        "kr": "이 어린아이는 영화를 보면서도 언제나 놀기 위한 계획을 세우고 있었다.",
        "romaji": "I eoriniaeneun yeonghwareul bomyeonseodo eonjena nolgi wihan gyehoegreul seugo isseossda.",
        "en": "While watching the movie, this little child was always planning to play.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_이_어린아이는_영화를_보면서도_언제나_놀기_위한_계획을_세우고_있었다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)니까 [(eu)nikka] (Because, Since)",
    "short_explanation": "Used to express cause and effect, or to provide a reason or explanation.",
    "long_explanation": "'~(으)니까 [(eu)nikka]' is a conjunction used in Korean to express the relationship of cause and effect between two clauses, similar to 'because' or 'since' in English. It attaches to the verb stem, stating the reason why something is or will be in a certain state, or explaining the cause of an action or situation.",
    "formation": "Verb-으니까 / Adj-으니까",
    "examples": [
      {
        "kr": "점심 먹었으니까 지금은 배가 고프지 않아요.",
        "romaji": "Jomsim meogeoss-eunikka jigeum-eun baega gopeuji anh-ayo.",
        "en": "Because I had lunch, I'm not hungry now.",
        "grammar_audio": "/audio/korean/grammar/s_으니까_eunikka_Because_Since_20231230_점심_먹었으니까_지금은_배가_고프지_않아요.mp3"
      },
      {
        "kr": "은행에 갔으니까 돈을 인출 할 수 있었어요.",
        "romaji": "Eunhaeng-e gass-eunikka don-eul inchul hal su iss-eoss-eoyo.",
        "en": "Since I went to the bank, I was able to withdraw money.",
        "grammar_audio": "/audio/korean/grammar/s_으니까_eunikka_Because_Since_20231230_은행에_갔으니까_돈을_인출_할_수_있었어요.mp3"
      },
      {
        "kr": "조용히 공부하고 있으니까 방해하지 마세요.",
        "romaji": "Joyonghi gongbuha-go iss-eunikka banghaehaji maseyo.",
        "en": "I am studying quietly, so do not disturb me.",
        "grammar_audio": "/audio/korean/grammar/s_으니까_eunikka_Because_Since_20231230_조용히_공부하고_있으니까_방해하지_마세요.mp3"
      },
      {
        "kr": "비가 오고 있으니까 우산을 가져가세요.",
        "romaji": "Bi-ga ogo iss-eunikka usan-eul gajyeogaseyo.",
        "en": "Because it's raining, take an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_으니까_eunikka_Because_Since_20231230_비가_오고_있으니까_우산을_가져가세요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)다 보니 [(eu)da boni] (Seeing that, as)",
    "short_explanation": "Used to show the reason or cause of a certain result or situation based on a continuous action or state.",
    "long_explanation": "'~(으)다 보니 [(eu)da boni]' is a grammatical construct in Korean that expresses a result or condition that naturally occurred or was realized through continuous action or state. It is similar to the English expressions 'seeing that', 'as', or 'since'. It expresses an idea that one thing naturally or inevitably leads to another.",
    "formation": "Verb-(으)다 보니",
    "examples": [
      {
        "kr": "빨리 왔다 보니 시작하기 전에 잠시 쉬어도 돼.",
        "romaji": "Ppalli watda boni sijakhagi jeon-e jamsi swieodo dwae.",
        "en": "Seeing that I've come early, it's okay to rest a bit before we start.",
        "grammar_audio": "/audio/korean/grammar/s_으다_보니_euda_boni_Seeing_that_as_20231230_빨리_왔다_보니_시작하기_전에_잠시_쉬어도_돼.mp3"
      },
      {
        "kr": "한 달 동안 매일 운동하다 보니 체중이 좀 빠졌어요.",
        "romaji": "Han dal dongan maeil undonghada boni chejungi jom ppajyeoss-eoyo.",
        "en": "Seeing that I have exercised every day for a month, I lost some weight.",
        "grammar_audio": "/audio/korean/grammar/s_으다_보니_euda_boni_Seeing_that_as_20231230_한_달_동안_매일_운동하다_보니_체중이_좀_빠졌어요.mp3"
      },
      {
        "kr": "꾸준히 공부하다 보니 점점 한국어가 늘어나는 것을 느꼈어요.",
        "romaji": "Kkujunhi gongbuhada boni jeomjeom hanguk-eoga neuleonaneun geoseul neukkyeoss-eoyo.",
        "en": "Seeing that I was studying regularly, I felt my Korean getting better.",
        "grammar_audio": "/audio/korean/grammar/s_으다_보니_euda_boni_Seeing_that_as_20231230_꾸준히_공부하다_보니_점점_한국어가_늘어나는_것을_느꼈어요.mp3"
      },
      {
        "kr": "매일 아침 일찍 일어나다 보니 점심을 먹으면 바로 피곤해져요.",
        "romaji": "Maeil achim iljjik ileonada boni jeomsimeul meogeumyeon baleo pigonhaejyeoyo.",
        "en": "Seeing that I wake up early every morning, I get tired right after eating lunch.",
        "grammar_audio": "/audio/korean/grammar/s_으다_보니_euda_boni_Seeing_that_as_20231230_매일_아침_일찍_일어나다_보니_점심을_먹으면_바로_피곤해져요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)다가 [(eu)daga] (And then, but)",
    "short_explanation": "Expresses a sequence of actions or represents a contrast in situations.",
    "long_explanation": "'~(으)다가 [(eu)daga]' is a commonly used Korean grammar point that represents sequencing of actions or contrasting situations. When used in sentences, it means 'and then' or 'but' in English and signifies first one action followed by another. Also, it can be used to indicate a shift or change from the initial situation or status.",
    "formation": "Verb stem + 다가 / Verb stem + 으다가 (If the verb stem ends in a consonant)",
    "examples": [
      {
        "kr": "나는 책을 읽다가 잠이 들어버렸어요, 그래서 마지막 부분을 읽지 못했어요.",
        "romaji": "Naneun chaegeul ilgdaga jami deureobeoryeosseoyo, geuraeseo majimak bubuneul ilgji mothae:aess-eoyo.",
        "en": "I was reading a book and then fell asleep, so I wasn't able to read the last part.",
        "grammar_audio": "/audio/korean/grammar/s_으다가_eudaga_And_then_but_20231230_나는_책을_읽다가_잠이_들어버렸어요_그래서_마지막_부분을_읽지_못했어요.mp3"
      },
      {
        "kr": "우리는 영화를 보다가 갑자기 전기가 나가서 끝부분을 볼 수 없었어요.",
        "romaji": "Urineun yeonghwareul bodaga gapjagi jeongiga nagaseo kkeutbubuneul bol su eobseosseoyo.",
        "en": "We were watching a movie but suddenly the power went out so we couldn't see the end.",
        "grammar_audio": "/audio/korean/grammar/s_으다가_eudaga_And_then_but_20231230_우리는_영화를_보다가_갑자기_전기가_나가서_끝부분을_볼_수_없었어요.mp3"
      },
      {
        "kr": "그는 말하다가 갑자기 웃음을 터뜨려서 모두를 놀라게 했어요.",
        "romaji": "Geuneun malhadaga gapjagi useumeul teotteureoseo modureul nollage haess-eoyo.",
        "en": "He was talking and then burst out laughing, surprising everyone.",
        "grammar_audio": "/audio/korean/grammar/s_으다가_eudaga_And_then_but_20231230_그는_말하다가_갑자기_웃음을_터뜨려서_모두를_놀라게_했어요.mp3"
      },
      {
        "kr": "난 집에 가다가 친구와 우연히 만나서 함께 저녁을 먹었어요.",
        "romaji": "Nan jibe gadaga chinguwa uyeonhi mannaseo hamkke jeonyeogeul meogeoss-eoyo.",
        "en": "I was on my way home and then met a friend by chance and had dinner together.",
        "grammar_audio": "/audio/korean/grammar/s_으다가_eudaga_And_then_but_20231230_난_집에_가다가_친구와_우연히_만나서_함께_저녁을_먹었어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)던 [(eu)deon] (Who used to)",
    "short_explanation": "This is used to describe an action or state that used to exist in the past but does not exist now.",
    "long_explanation": "'~(으)던 [(eu)deon]' is a Korean grammar point used when referring back to a past state or action that has since ended. It corresponds to 'who used to' or 'that used to' in English. It looks back on something from the present perspective. It implies that the action or state was continuous or habitual in the past.",
    "formation": "Verb-던 / Adjective-던",
    "examples": [
      {
        "kr": "나는 어릴 때 많이 울던 아이였어요. 그런데 지금은 별로 울지 않아요.",
        "romaji": "Naneun eoril ttae mani uldeon aiyeosseoyo. Geureonde jigeumeun byeollo ulji anhayo.",
        "en": "I used to be a child who cried a lot when I was young. But now, I hardly cry.",
        "grammar_audio": "/audio/korean/grammar/s_으던_eudeon_Who_used_to_20231230_나는_어릴_때_많이_울던_아이였어요_그런데_지금은_별로_울지_않아요.mp3"
      },
      {
        "kr": "그는 어렸을 때 언제나 사과를 좋아하던 사람이었어요. 하지만 지금은 사과를 싫어해요.",
        "romaji": "Geuneun eoryeosseul ttae eonjena sagwareul joahadeon saramieosseoyo. Hajiman jigeumeun sagwareul silheohaeyo.",
        "en": "He was a person who always used to like apples when he was a kid. But he dislikes apples now.",
        "grammar_audio": "/audio/korean/grammar/s_으던_eudeon_Who_used_to_20231230_그는_어렸을_때_언제나_사과를_좋아하던_사람이었어요_하지만_지금은_사과를_싫어해요.mp3"
      },
      {
        "kr": "우리 학교에는 많은 학생들이 수학을 싫어하던 선생님이 있었어요.",
        "romaji": "Uri hakgyoeneun maneun haksengdeuli suhageul silheohadeon seonsaengnim-i isseosseoyo.",
        "en": "There was a teacher at our school who many students used to hate for math.",
        "grammar_audio": "/audio/korean/grammar/s_으던_eudeon_Who_used_to_20231230_우리_학교에는_많은_학생들이_수학을_싫어하던_선생님이_있었어요.mp3"
      },
      {
        "kr": "그녀는 앞산에 살던 친절한 아주머니였습니다. 하지만 이젠 그녀를 볼 수 없어요.",
        "romaji": "Geunyeoneun apsane saldeon chinjeolhan ajumeoniyeosseumnida. Hajiman ijen geunyeoreul bol su eobseoyo.",
        "en": "She was a kind old lady who used to live in the mountainside. But now, we cannot see her anymore.",
        "grammar_audio": "/audio/korean/grammar/s_으던_eudeon_Who_used_to_20231230_그녀는_앞산에_살던_친절한_아주머니였습니다_하지만_이젠_그녀를_볼_수_없어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)려면 [(eu)ryeomyeon] (In order to)",
    "short_explanation": "Used to express the condition or criteria needed to realize a certain goal or result; 'in order to', 'if one wants to'.",
    "long_explanation": "'~(으)려면 [(eu)ryeomyeon]' is a grammar pattern used in Korean to set forth the conditions or criteria needed to achieve a particular outcome. It is equivalent to 'in order to' or 'if one wants to' in English. This grammar point projects a sense of prerequisite or conditionality and is generally used to emphasize that certain conditions must be met for something to happen.",
    "formation": "Verb stem + 으려면 / Verb ending in vowel + 려면",
    "examples": [
      {
        "kr": "한국어 TOPIK 시험에 합격하려면 많이 연습해야 합니다, 그렇지 않으면 성공할 수 없습니다.",
        "romaji": "Hangugeo TOPIK siheome habgyeokharyeomyeon mani yeonseubhaeya habnida, geureohji aneumyeon seonggonghal su eopsseumnida.",
        "en": "In order to pass the Korean TOPIK exam, you have to practice a lot, otherwise you can't succeed.",
        "grammar_audio": "/audio/korean/grammar/s_으려면_euryeomyeon_In_order_to_20231230_한국어_TOPIK_시험에_합격하려면_많이_연습해야_합니다_그렇지_않으면_성공할_수_없습니다.mp3"
      },
      {
        "kr": "헬스 클럽에서 몸매를 유지하려면 지속적으로 운동하고 건강한 식단을 유지해야 해요.",
        "romaji": "Heulseu keulleobeseo mommaereul yujiharyeomyeon jisokjeogeuro undonghago geonganghan sigdaneul yujihaeya haeyo.",
        "en": "In order to maintain a good figure at the gym, you have to continually exercise and keep a healthy diet.",
        "grammar_audio": "/audio/korean/grammar/s_으려면_euryeomyeon_In_order_to_20231230_헬스_클럽에서_몸매를_유지하려면_지속적으로_운동하고_건강한_식단을_유지해야_해요.mp3"
      },
      {
        "kr": "이 직업을 얻으려면 이 분야에서의 경험이 필요해요, 그렇지 않으면 충분히 경쟁력이 없을 거예요.",
        "romaji": "I jikeobeul eoduryeomyeon i bunyaeseoui gyeongheomi pilyohaeyo, geureohji aneumyeon chungbunhi gyeongjaengryeogi eopseul geoyeyo.",
        "en": "In order to get this job, you need experience in this field, otherwise you won't be competitive enough.",
        "grammar_audio": "/audio/korean/grammar/s_으려면_euryeomyeon_In_order_to_20231230_이_직업을_얻으려면_이_분야에서의_경험이_필요해요_그렇지_않으면_충분히_경쟁력이_없을_거예요.mp3"
      },
      {
        "kr": "이런 문제를 방지하려면 좀 더 세심한 계획이 필요해요, 그렇지 않으면 같은 문제를 다시 겪을 수 있어요.",
        "romaji": "Ireon munje-reul bangjiharyeomyeon jom deo sesimhan gyehoeki pilyohaeyo, geureohji aneumyeon gateun munjereul dashi gyeogeul su isseoyo.",
        "en": "To prevent such issues, a more meticulous plan is needed, otherwise we could face the same problems again.",
        "grammar_audio": "/audio/korean/grammar/s_으려면_euryeomyeon_In_order_to_20231230_이런_문제를_방지하려면_좀_더_세심한_계획이_필요해요_그렇지_않으면_같은_문제를_다시_겪을_수_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄹ 수록 [(eu)l surok] (The more)",
    "short_explanation": "Used to express an increase in degree, intensity, or extent; 'the more... the more', 'as... as possible'.",
    "long_explanation": "'~(으)ㄹ 수록 [(eu)l surok]' is a pattern used to express the correlation of increase or decrease between two actions or states in Korean, similar to 'the more... the more...' in English. It indicates that the degree, intensity, or extent of one action or state increases or decreases correspondingly to that of another action or state. It is frequently utilized in sentences to express a direct proportional relationship.",
    "formation": "Verb stem + ~(으)ㄹ수록",
    "examples": [
      {
        "kr": "운동을 할수록 건강해질 수 있어서 매일 아침에 조깅하고 있어요.",
        "romaji": "Undongeul halsurok geonganghaejil su isseoseo maeil achime joginghago isseoyo.",
        "en": "The more I exercise, the healthier I can become, so I am jogging every morning.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_수록_eul_surok_The_more_20231230_운동을_할수록_건강해질_수_있어서_매일_아침에_조깅하고_있어요.mp3"
      },
      {
        "kr": "공부를 많이 할수록 시험에서 더 좋은 점수를 얻을 수 있어요.",
        "romaji": "Gongbureul mani halsurok siheome deo joheun jeomsureul eodeul su isseoyo.",
        "en": "The more you study, the better score you can get on the exam.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_수록_eul_surok_The_more_20231230_공부를_많이_할수록_시험에서_더_좋은_점수를_얻을_수_있어요.mp3"
      },
      {
        "kr": "음식을 빨리 먹을수록 소화 장애가 더 심해질 수 있어요.",
        "romaji": "Eumsigeul palli meogeulsurok sohwa jangaega deo simhaejil su isseoyo.",
        "en": "The faster you eat, the more severe your digestive disorder can become.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_수록_eul_surok_The_more_20231230_음식을_빨리_먹을수록_소화_장애가_더_심해질_수_있어요.mp3"
      },
      {
        "kr": "시간이 지날수록 그리움이 더 깊어져요.",
        "romaji": "Sigani jinalsurok geuriumi deo gipeojyeoyo.",
        "en": "The longer time passes, the deeper my longing becomes.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_수록_eul_surok_The_more_20231230_시간이_지날수록_그리움이_더_깊어져요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄴ/는 중 [(eu)n/neun jung] (In the middle of)",
    "short_explanation": "Used to indicate 'in the process' or 'in the middle of' certain actions or states.",
    "long_explanation": "'~(으)ㄴ/는 중 [(eu)n/neun jung]' is a grammatical pattern used in Korean to express ongoing actions or statuses, much like the continuous tense in English. It is used when you want to imply that a person is in the middle of doing something or in the process of a certain state. It's often placed after a verb stem, and the form depends on whether the stem ends in a consonant (으)ㄴ 중 or a vowel 는 중.",
    "formation": "Verb stem + ~(으)ㄴ/는 중",
    "examples": [
      {
        "kr": "저는 지금 숙제를 하는 중이에요, 그래서 나중에 연락 드릴게요.",
        "romaji": "Jeoneun jigeum sukjerul haneun jungieyo, geuraeseo najunge yeonrag deurilgeyo.",
        "en": "I'm in the middle of doing my homework right now, so I'll contact you later.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_중_eun/neun_jung_In_the_middle_of_20231230_저는_지금_숙제를_하는_중이에요_그래서_나중에_연락_드릴게요.mp3"
      },
      {
        "kr": "오빠는 여자친구와 전화하는 중이라서 바쁜 것 같아요.",
        "romaji": "Oppaneun yeojachinguwa jeonhawahaneun jungiraseo bappun geot gat-ayo.",
        "en": "My older brother seems to be busy as he is in the middle of a call with his girlfriend.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_중_eun/neun_jung_In_the_middle_of_20231230_오빠는_여자친구와_전화하는_중이라서_바쁜_것_같아요.mp3"
      },
      {
        "kr": "우리 엄마는 계속 질문하는 중이라서, 집중이 잘 안되요.",
        "romaji": "Uri eommaneun gyesok jilmunhaneun jungiraseo, jipjungi jal andoeyo.",
        "en": "My mom keeps asking questions, so I'm not able to concentrate well.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_중_eun/neun_jung_In_the_middle_of_20231230_우리_엄마는_계속_질문하는_중이라서_집중이_잘_안되요.mp3"
      },
      {
        "kr": "그녀는 재미있는 영화를 보는 중이에요, 그래서 웃고 있어요.",
        "romaji": "Geunyeoneun jaemiissneun yeonghwareul boneun jungieyo, geuraeseo utgo isseoyo.",
        "en": "She is in the middle of watching an interesting movie, that's why she is laughing.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_중_eun/neun_jung_In_the_middle_of_20231230_그녀는_재미있는_영화를_보는_중이에요_그래서_웃고_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄴ/는 탓에 [(eu)n/neun tase] (Because of)",
    "short_explanation": "Used to express the cause of a negative result or situation; 'because of'.",
    "long_explanation": "'~(으)ㄴ/는 탓에 [(eu)n/neun tase]' is a grammar point in Korean that is used to express the cause of a negative result or situation. It is similar to 'because of' in English. This grammar point is typically used in sentences where the cause is clearly pointed out and it led to an unfavorable or undesirable outcome.",
    "formation": "Noun + ~(으)ㄴ/는 탓에 + Negative Outcome",
    "examples": [
      {
        "kr": "나무를 너무 많이 베어서 우리 동네의 환경이 나쁜 탓에 사람들이 많이 아파요.",
        "romaji": "Namureul neomu mani beoseoseo uri dongnaeui hwangyeongi nappeun tase saramdeuli mani apayo.",
        "en": "Because we cut down too many trees, the poor environment in our neighborhood is causing many people to get sick.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_탓에_eun/neun_tase_Because_of_20231230_나무를_너무_많이_베어서_우리_동네의_환경이_나쁜_탓에_사람들이_많이_아파요.mp3"
      },
      {
        "kr": "지난주에 너무 많이 먹은 탓에 이번 주에 체중이 늘었어요.",
        "romaji": "Jinanju-e neomu mani meogeun tase ibeon ju-e chejungi neuleosseoyo.",
        "en": "Because I ate too much last week, I gained weight this week.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_탓에_eun/neun_tase_Because_of_20231230_지난주에_너무_많이_먹은_탓에_이번_주에_체중이_늘었어요.mp3"
      },
      {
        "kr": "연습을 충분히 하지 않은 탓에 테스트에서 좋은 점수를 받지 못했어요.",
        "romaji": "Yeonseubeul chungbunhi haji anheun tase testeueseojoh-eun jeomsuleul badji moshaess-eoyo.",
        "en": "Because I did not practice enough, I did not receive a good score in the test.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_탓에_eun/neun_tase_Because_of_20231230_연습을_충분히_하지_않은_탓에_테스트에서_좋은_점수를_받지_못했어요.mp3"
      },
      {
        "kr": "엄마가 재료를 사러 가야 했는데 막차를 놓친 탓에 오늘은 집에서 요리를 할 수 없어요.",
        "romaji": "Eommaga jaeryoreul saleo gaya haetneunde magchaleul nohchin tase oneuleun jibeseo yorileul hal su eopseoyo.",
        "en": "Because mom missed the last bus to go shopping for ingredients, we are not able to cook at home today.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는_탓에_eun/neun_tase_Because_of_20231230_엄마가_재료를_사러_가야_했는데_막차를_놓친_탓에_오늘은_집에서_요리를_할_수_없어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄴ/는데다가 [(eu)n/neundedaga] (Moreover, additionally)",
    "short_explanation": "Used to add more information, similar to 'moreover' or 'additionally' in English.",
    "long_explanation": "'~(으)ㄴ/는데다가 [(eu)n/neundedaga]' is a compound grammar form that is used to add more detailed information on top of the information already provided. It's roughly equivalent to 'moreover', 'in addition to that', 'besides', 'what's more', or 'furthermore' in English. The idea here is that whatever is described in the part with '는데다가' is an extra, additional bit of information or characteristic on top of what has been already mentioned.",
    "formation": "(Verb/Adjective/Noun) + ~(으)ㄴ/는데다가 + Sentence",
    "examples": [
      {
        "kr": "이 카페는 분위기도 좋은데다가 커피 맛도 훌륭해요.",
        "romaji": "I kape-neun bunwigido joheunde daga keopimatdo hulryunghaeyo.",
        "en": "This cafe has a good atmosphere, moreover, the coffee tastes great.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데다가_eun/neundedaga_Moreover_additionally_20231230_이_카페는_분위기도_좋은데다가_커피_맛도_훌륭해요.mp3"
      },
      {
        "kr": "그 책은 재미있는데다가 유익하기까지 해요.",
        "romaji": "Geu chaeg-eun jaemissneunde daga yu-ik hakigikka jehaeyo.",
        "en": "That book is not only interesting but also informative.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데다가_eun/neundedaga_Moreover_additionally_20231230_그_책은_재미있는데다가_유익하기까지_해요.mp3"
      },
      {
        "kr": "이 핸드폰은 가격이 저렴한데다가 기능도 다양하게 있어요.",
        "romaji": "I haendeupon-eun gagyeogi jeoryeomhaneunde daga gineungdo dayanghage iss-eoyo.",
        "en": "This cell phone is not only cheap but also has a variety of features.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데다가_eun/neundedaga_Moreover_additionally_20231230_이_핸드폰은_가격이_저렴한데다가_기능도_다양하게_있어요.mp3"
      },
      {
        "kr": "그는 착한데다가 똑똑하기까지 해서, 모두가 그를 좋아해요.",
        "romaji": "Geuneun chaghanede daga ttokttok hakigungkkaji haeseo, moduga geul-eul johah-aeyo.",
        "en": "He is kind, and moreover, he is smart, so everyone likes him.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데다가_eun/neundedaga_Moreover_additionally_20231230_그는_착한데다가_똑똑하기까지_해서_모두가_그를_좋아해요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "100"
  },
  {
    "title": "~(으)ㄴ/는데도 불구하고 [(eu)n/neundedo bulguhago] (Despite, in spite of)",
    "short_explanation": "This grammar point is used to express 'despite' or 'in spite of'.",
    "long_explanation": "'~(으)ㄴ/는데도 불구하고' is a long conjunction used in the Korean language to introduce a counter-expected situation or outcome despite a certain given factor or situation. This form translates to 'despite' or 'in spite of' in English. Using it, we can indicate that the event in the latter clause happens regardless of the situation described in the former clause.",
    "formation": "Adjective/Verb in past or present tense + ~(으)ㄴ/는데도 불구하고",
    "examples": [
      {
        "kr": "비가 오는데도 불구하고 그녀는 나가서 재미있게 놀았어요.",
        "romaji": "Biga oneundedo bulguhago geunyeoneun nagaseo jaemiitge nolatseoyo.",
        "en": "Despite the rain, she went out and had a good time.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데도_불구하고_eun/neundedo_bulguhago_Despite_in_spite_of_20231230_비가_오는데도_불구하고_그녀는_나가서_재미있게_놀았어요.mp3"
      },
      {
        "kr": "그는 아픈데도 불구하고 학교에 갔어요.",
        "romaji": "Geuneun apeundedo bulguhago hakgyoe gasseoyo.",
        "en": "Despite being sick, he went to school.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데도_불구하고_eun/neundedo_bulguhago_Despite_in_spite_of_20231230_그는_아픈데도_불구하고_학교에_갔어요.mp3"
      },
      {
        "kr": "원하는 결과를 얻지 못한데도 불구하고 우리는 계속 노력했어요.",
        "romaji": "Wonhaneun gyeolgwareul eodji mothanedo bulguhago urineun gyesok noryeokhaesseoyo.",
        "en": "Despite not getting the results we wanted, we continued to make efforts.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데도_불구하고_eun/neundedo_bulguhago_Despite_in_spite_of_20231230_원하는_결과를_얻지_못한데도_불구하고_우리는_계속_노력했어요.mp3"
      },
      {
        "kr": "시험이 어려운데도 불구하고 그는 잘 했어요.",
        "romaji": "Siheomi eoryeounnedo bulguhago geuneun jal haesseoyo.",
        "en": "Despite the exam being difficult, he did well.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는데도_불구하고_eun/neundedo_bulguhago_Despite_in_spite_of_20231230_시험이_어려운데도_불구하고_그는_잘_했어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄴ/는지 모르겠다 [(eu)n/neunji moreugessda] (I'm not sure if)",
    "short_explanation": "Used to express uncertainty or a lack of confidence about something; 'I'm not sure if'.",
    "long_explanation": "'~(으)ㄴ/는지 모르겠다 [(eu)n/neunji moreugessda]' is a grammar structure which is used when the speaker is uncertain, unsure, unclear about something, or has a hazy knowledge of the matter being expressed. This grammar structure in Korean literally translates into English as 'I'm not sure if' or 'I don't know if'. The use of this structure highly depends on the ending of the verb/adjective.",
    "formation": "Verb or Adjective + ~(으)ㄴ/는지 + 모르겠다",
    "examples": [
      {
        "kr": "저는 장소를 정확히 기억하며 나갔는지 모르겠어요.",
        "romaji": "Jeoneun jangsoreul jeonghwakhage gieokhamyeo nagassneunji moreugessyo.",
        "en": "I'm not sure if I remembered the place correctly.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는지_모르겠다_eun/neunji_moreugessda_Im_not_sure_if_20231230_저는_장소를_정확히_기억하며_나갔는지_모르겠어요.mp3"
      },
      {
        "kr": "그가 아직도 나를 사랑하는지 모르겠어요.",
        "romaji": "Geuga ajikdo nareul saranghaneunji moreugesseoyo.",
        "en": "I'm not sure if he still loves me.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는지_모르겠다_eun/neunji_moreugessda_Im_not_sure_if_20231230_그가_아직도_나를_사랑하는지_모르겠어요.mp3"
      },
      {
        "kr": "비가 왔었는지 모르겠는데, 여기 젖어있어요.",
        "romaji": "Biga wassneunji moreugneunde, yeogi jeojeoisseoyo.",
        "en": "I'm not sure if it rained, but it's wet here.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는지_모르겠다_eun/neunji_moreugessda_Im_not_sure_if_20231230_비가_왔었는지_모르겠는데_여기_젖어있어요.mp3"
      },
      {
        "kr": "내일 학교에 갈 수 있는지 모르겠어요, 몸이 좀 아파요.",
        "romaji": "Naeil hakgyoe gal su issneunji moreugesseoyo, momi jom apayo.",
        "en": "I'm not sure if I can go to school tomorrow, I'm a bit sick.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄴ/는지_모르겠다_eun/neunji_moreugessda_Im_not_sure_if_20231230_내일_학교에_갈_수_있는지_모르겠어요_몸이_좀_아파요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)려는 참이다 [(eu)ryeoneun chamida] (I really want to)",
    "short_explanation": "This grammar point is used when the speaker expresses a strong desire or intention to do something and is often used when expressing feelings of frustration at not being able to do what one wants.",
    "long_explanation": "'~(으)려는 참이다' in Korean grammar is utilized when expressing one's strong desire or intention towards some action, especially used when the speaker is feeling a sense of frustration of not being able to do the action desired. It can be translated as 'I really want to…', 'I am dying to…'.  It is generally used for showing your strong intent or desire which you had to suppress for some reasons.",
    "formation": "Verb-으려는 + 참이다 / Verb-려는 + 참이다",
    "examples": [
      {
        "kr": "이 사람, 뭐라고 할려는 참이다. 그런데 말을 할 수가 없었다.",
        "romaji": "I saram, mworageo halleoneun chaminida. Geureonde maleul hal suga eopseotda.",
        "en": "I really wanted to say something to this person. But I couldn't say anything.",
        "grammar_audio": "/audio/korean/grammar/s_으려는_참이다_euryeoneun_chamida_I_really_want_to_20231230_이_사람_뭐라고_할려는_참이다_그런데_말을_할_수가_없었다.mp3"
      },
      {
        "kr": "반말할려는 참이었지만 그를 존경해서 말았다.",
        "romaji": "Banmalharyeoneun chamyeotjiman geureul johgyeonghaeseo maratda.",
        "en": "I really wanted to speak informally, but I held back out of respect for him.",
        "grammar_audio": "/audio/korean/grammar/s_으려는_참이다_euryeoneun_chamida_I_really_want_to_20231230_반말할려는_참이었지만_그를_존경해서_말았다.mp3"
      },
      {
        "kr": "야외에서 놀려는 참이지만 날씨가 너무 나빠서 할 수 없었다.",
        "romaji": "Yawoeseo nollyeoneun chamijiman nalssiga nomu napaseo hal su eopsotda.",
        "en": "I really wanted to play outside, but I couldn't because the weather was too bad.",
        "grammar_audio": "/audio/korean/grammar/s_으려는_참이다_euryeoneun_chamida_I_really_want_to_20231230_야외에서_놀려는_참이지만_날씨가_너무_나빠서_할_수_없었다.mp3"
      },
      {
        "kr": "그 영화를 볼려는 참이었지만 표가 매진이라 보지 못했다.",
        "romaji": "Geu yeonghwaleul boryeoneun chamyeotjiman pyoga maejinira boji motaetda.",
        "en": "I really wanted to watch that movie, but I couldn't because the tickets were sold out.",
        "grammar_audio": "/audio/korean/grammar/s_으려는_참이다_euryeoneun_chamida_I_really_want_to_20231230_그_영화를_볼려는_참이었지만_표가_매진이라_보지_못했다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ 것 같다 [(eu)l geot gatda] (It seems like)",
    "short_explanation": "This grammar is used to express a guess, assumption, or prediction.",
    "long_explanation": "'~(으)ㄹ 것 같다 [(eu)l geot gatda]' is used in Korean grammar to express that something seems like it would, could, or should be a certain way. It is a way of expressing a guess, assumption, or prediction, based on the available information. Whether you use 으 or not depends on the vowel in the final syllable of the preceding word. If the last syllable ends with a vowel, you drop the 으. If it ends with a consonant, you keep the 으.",
    "formation": "Verb stem + (으)ㄹ 것 같다 OR Adjective stem + (으)ㄹ 것 같다",
    "examples": [
      {
        "kr": "내일은 비가 올 것 같아요, 그래서 우산을 가져와야 할 것 같아요.",
        "romaji": "Naeireun biga ol geot gatayo, geuraeseo usaneul gayowaya hal geot gatayo.",
        "en": "It seems like it will rain tomorrow, so it seems like you should bring an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것_같다_eul_geot_gatda_It_seems_like_20231230_내일은_비가_올_것_같아요_그래서_우산을_가져와야_할_것_같아요.mp3"
      },
      {
        "kr": "그녀는 행복 할 것 같아요, 왜냐하면 그녀의 드림팀에 합류했으니까요.",
        "romaji": "Geunyeoneun haengbok hal geot gatayo, waenyahamyeon geunyeoui deurimtim-e habryuhaesseunikka yo.",
        "en": "It seems like she will be happy, because she has joined her dream team.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것_같다_eul_geot_gatda_It_seems_like_20231230_그녀는_행복_할_것_같아요_왜냐하면_그녀의_드림팀에_합류했으니까요.mp3"
      },
      {
        "kr": "이 지도를 보면 우리가 길을 잃을 것 같아요.",
        "romaji": "I jidoreul bomyeon uriga gireul ilheul geot gatayo.",
        "en": "Looking at this map, it seems like we will lose our way.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것_같다_eul_geot_gatda_It_seems_like_20231230_이_지도를_보면_우리가_길을_잃을_것_같아요.mp3"
      },
      {
        "kr": "이 제품의 인기가 높을 것 같아요, 왜냐하면 기능이 매우 우수하니까요.",
        "romaji": "I jepumui inki-ga nop-eul geot gatayo, waenyahamyeon gineungi maeu usuhago iss-eunikka yo.",
        "en": "It seems like this product will be popular because it has excellent features.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것_같다_eul_geot_gatda_It_seems_like_20231230_이_제품의_인기가_높을_것_같아요_왜냐하면_기능이_매우_우수하니까요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ 것이다 [(eu)l geosida] (Will likely)",
    "short_explanation": "Used to express probability, anticipation, or plan for the future; 'will likely', 'suppose to', 'plan to'.",
    "long_explanation": "'~(으)ㄹ 것이다 [(eu)l geosida]' is a grammar point used in Korean to indicate the speaker's prediction, expectation, or plan regarding the future. It is similar to expressing 'will', or 'is going to' in English. The speaker uses this form when they are relatively certain about what will happen, or what they plan to do in the future.",
    "formation": "Verb stem + ㄹ 것이다 (If the verb stem's last syllable ends with a vowel) / Verb stem + 을 것이다 (If the verb stem's last syllable ends with a consonant)",
    "examples": [
      {
        "kr": "내일은 날씨가 좋을 것이다, 그래서 다들 야외에서 시간을 보내려고 할 것이다.",
        "romaji": "Naeireun nalssiga joheul geosida, geuraeseo dadeul yaoeseo siganeul bonaeryeogo hal geosida.",
        "en": "The weather will likely be good tomorrow, so everyone will probably plan to spend time outdoors.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것이다_eul_geosida_Will_likely_20231230_내일은_날씨가_좋을_것이다_그래서_다들_야외에서_시간을_보내려고_할_것이다.mp3"
      },
      {
        "kr": "저는 내년에 대학교를 졸업할 것이다, 그리고 취업을 준비할 것이다.",
        "romaji": "Jeoneun naenyeone daehakgyoreul joleophal geosida, geurigo chwieobeul junbihal geosida.",
        "en": "I will likely graduate from university next year, and I will plan to prepare for employment.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것이다_eul_geosida_Will_likely_20231230_저는_내년에_대학교를_졸업할_것이다_그리고_취업을_준비할_것이다.mp3"
      },
      {
        "kr": "우리는 이번 주말에 캠핑을 갈 것이다, 그래서 캠핑용품을 살 것이다.",
        "romaji": "Urineun ibeon jumale kaempingeul gal geosida, geuraeseo kaempingyongpumeul sal geosida.",
        "en": "We will likely go camping this weekend, so we will plan to buy camping gear.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것이다_eul_geosida_Will_likely_20231230_우리는_이번_주말에_캠핑을_갈_것이다_그래서_캠핑용품을_살_것이다.mp3"
      },
      {
        "kr": "그녀는 피아노 연습을 많이 하고 있으니까, 곧 잘 칠 것이다.",
        "romaji": "Geunyeoneun piano yeonseubeul manhi hago isseunikka, got jal chil geosida.",
        "en": "As she is practicing the piano a lot, she will likely play well soon.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_것이다_eul_geosida_Will_likely_20231230_그녀는_피아노_연습을_많이_하고_있으니까_곧_잘_칠_것이다.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ 뿐만 아니라 [(eu)l ppunman anira] (Not only... but also...)",
    "short_explanation": "Used to express the concept of 'not only..., but also...', meaning that there is not just the first thing, but also the second.",
    "long_explanation": "'~(으)ㄹ 뿐만 아니라 [(eu)l ppunman anira]' is a Korean grammar pattern used to express the idea of 'not only this, but also that'. The construction helps to emphasize two or more actions or situations that are true. It's used to introduce a new piece of information that adds to, rather than contradicts, the previous statement. Note also that the verb or adjective that follows this pattern can be of either positive or negative meaning.",
    "formation": "Noun/Verb + ~(으)ㄹ 뿐만 아니라 + Sentence",
    "examples": [
      {
        "kr": "그는 일 잘하는 뿐만 아니라, 창조성까지 있어요, 그래서 모두에게 인정을 받았어요.",
        "romaji": "Geuneun il jalhaneun ppunman anira, changjoseongkkaji isseoyo, geuraeseo modeuege injongeul badasseoyo.",
        "en": "Not only does he work well, but he also has creativity, so he received recognition from everyone.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐만_아니라_eul_ppunman_anira_Not_only_but_also_20231230_그는_일_잘하는_뿐만_아니라_창조성까지_있어요_그래서_모두에게_인정을_받았어요.mp3"
      },
      {
        "kr": "이 레스토랑은 맛있는 음식을 제공하는 뿐만 아니라 훌륭한 서비스도 제공해요.",
        "romaji": "I reseutorangeun masissneun eumsigeul jegonghaneun ppunman anira hullyunghan seobiseudo jegonghaeyo.",
        "en": "This restaurant not only provides delicious food, but also provides excellent service.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐만_아니라_eul_ppunman_anira_Not_only_but_also_20231230_이_레스토랑은_맛있는_음식을_제공하는_뿐만_아니라_훌륭한_서비스도_제공해요.mp3"
      },
      {
        "kr": "그녀는 영어를 잘하는 뿐만 아니라 중국어, 일본어도 유창해요.",
        "romaji": "Geunyeo-neun yeong-eo-reul jal-haneun ppunman anira jung-gug-eo, ilbon-eodo yuchanghaeyo.",
        "en": "Not only is she fluent in English, but she also speaks Chinese and Japanese fluently.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐만_아니라_eul_ppunman_anira_Not_only_but_also_20231230_그녀는_영어를_잘하는_뿐만_아니라_중국어_일본어도_유창해요.mp3"
      },
      {
        "kr": "지민 씨는 요리를 잘하는 뿐만 아니라 정말 멋진 사진을 찍을 수 있어요.",
        "romaji": "Jimin ssi-neun yori-reul jal-haneun ppunman anira jeongmal meot-jin sajing-eul jjik-eul su iss-eoyo.",
        "en": "Not only can Jimin cook well, but he can also take really amazing photos.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐만_아니라_eul_ppunman_anira_Not_only_but_also_20231230_지민_씨는_요리를_잘하는_뿐만_아니라_정말_멋진_사진을_찍을_수_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ 뿐이다 [(eu)l ppunida] (Only, just)",
    "short_explanation": "Used to express 'only' or 'just'. Often used to emphasize the sole action or state.",
    "long_explanation": "'~(으)ㄹ 뿐이다 [(eu)l ppunida]' is a commonly used grammar point in Korean to stress on an action or state being the only one or just. This pattern is generally used in situations where the speaker intends to emphasize a certain condition or fact as the only existing one. The conjugation depends on the final vowel of the verb stem, using '을 뿐이다' after a verb stem ending in a consonant and 'ㄹ 뿐이다' after a verb stem ending in a vowel.",
    "formation": "Verb stem + ~(으)ㄹ 뿐이다",
    "examples": [
      {
        "kr": "그녀는 말할 뿐이지, 실제로 행동하지 않아요.",
        "romaji": "Geunyeoneun malhal ppuniji, siljero haengdonghaji anhayo.",
        "en": "She only talks, she doesn't actually act.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐이다_eul_ppunida_Only_just_20231230_그녀는_말할_뿐이지_실제로_행동하지_않아요.mp3"
      },
      {
        "kr": "나는 그녀에게 웃을 뿐이다, 실제로 어떠한 대화도 하지 않았어.",
        "romaji": "Naneun geunyeoege useul ppunida, siljero eotteohan daehwado haji anhass-eo.",
        "en": "I just smiled at her, I haven't actually had any conversation.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐이다_eul_ppunida_Only_just_20231230_나는_그녀에게_웃을_뿐이다_실제로_어떠한_대화도_하지_않았어.mp3"
      },
      {
        "kr": "아버지는 손님들과 대화할 뿐이지, 실제로 집안일을 도와주지 않아요.",
        "romaji": "Abeojineun sonnimdeulgwa daehwahal ppuniji, siljero jib-an-il-eul dowajujianhayo.",
        "en": "Father only converses with the guests, he doesn't actually help with housework.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐이다_eul_ppunida_Only_just_20231230_아버지는_손님들과_대화할_뿐이지_실제로_집안일을_도와주지_않아요.mp3"
      },
      {
        "kr": "그들은 영화를 보러 갈 뿐이다, 실제로 영화에 대해 이야기하지 않아.",
        "romaji": "Geudeuleun yeonghwa le boreo gal ppunida, siljelo yeonghwa-e daehae iyagihaji anha.",
        "en": "They're just going to watch a movie, they don't actually talk about the movie.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_뿐이다_eul_ppunida_Only_just_20231230_그들은_영화를_보러_갈_뿐이다_실제로_영화에_대해_이야기하지_않아.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ게요 [(eu)lgeyo] (I will, in the future)",
    "short_explanation": "Used to express an intention or promise about the future, with a nuance of the speaker’s determination.",
    "long_explanation": "'~(으)ㄹ게요 [(eu)lgeyo]' is a polite and commonly used form to show the speaker's intention, promise or plan to do something in the future. It is bonded to the stem of the verb to develop a future tense expression. It mainly conveys the speaker's strong determination to carry out the action. If a verb stem’s final syllable contains 아/오, 'ㄹ게요' is used. For all other vowel endings and consonant endings, use '을게요'. Participles, as opposed to verbs or adjectives, cannot be used with this form.",
    "formation": "Verb stem + ~(으)ㄹ게요 -> Use '을게요' for stems ending in vowels other than '아' or '오' or after consonants. Use 'ㄹ게요' for stems ending in '아' or '오'.",
    "examples": [
      {
        "kr": "제가 직접 전화해서 진행 상황을 알려 드릴게요.",
        "romaji": "Jega jigjeop jeonhwahae seojin tae ireum sangeul allyeo deurilgeyo.",
        "en": "I will call personally to let you know the progress.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게요_eulgeyo_I_will_in_the_future_20231230_제가_직접_전화해서_진행_상황을_알려_드릴게요.mp3"
      },
      {
        "kr": "이 짐은 제가 갖고 갈게요, 너무 무거우니까 걱정하지 마세요.",
        "romaji": "I jim eun je ga gotgo galgeyo, neomu mugeouni kka geokjeong haji mase yo.",
        "en": "I will carry this luggage, don't worry because it's too heavy.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게요_eulgeyo_I_will_in_the_future_20231230_이_짐은_제가_갖고_갈게요_너무_무거우니까_걱정하지_마세요.mp3"
      },
      {
        "kr": "과제를 내일까지 다 끝내고 보고서도 쓸게요.",
        "romaji": "gwaje reul naeil kkaji da ggeut naego bogoseo do seulgeyo.",
        "en": "I will finish all the tasks by tomorrow and also write the report.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게요_eulgeyo_I_will_in_the_future_20231230_과제를_내일까지_다_끝내고_보고서도_쓸게요.mp3"
      },
      {
        "kr": "오늘 저녁에 모두 모이면 제가 음식을 만들어서 가져올게요.",
        "romaji": "oneul jeonyeok e modu moimyeon je ga eumsik eul mandeuleoseo gajyeo olgeyo.",
        "en": "When we all gather tonight, I will make and bring the food.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게요_eulgeyo_I_will_in_the_future_20231230_오늘_저녁에_모두_모이면_제가_음식을_만들어서_가져올게요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ게 [(eu)lge] (I will, in the future)",
    "short_explanation": "Used to indicate that the speaker will do something in the future. It can also be used to suggest one's intention or promise.",
    "long_explanation": "'~(으)ㄹ게 [(eu)lge]' is a future tense ending in Korean that indicates the speaker's intention or promise to take a future action. It's commonly used in casual conversations among friends or individuals of similar age or status. It can also be used to express a decision that the speaker has made or to promise something to the listener.",
    "formation": "Verb stem + 으ㄹ게(If the verb stem ends with a consonant)/ㄹ게 (if the verb stem ends with a vowel)",
    "examples": [
      {
        "kr": "저는 내일부터 다이어트할게요, 그래서 오늘은 맛있는 음식을 마지막으로 먹을게요.",
        "romaji": "Jeoneun naeilbuteo daieoteuteulgeyo, geuraeseo oneuleun masissneun eumsigeul majimageuro meogeulgeyo.",
        "en": "I will start dieting from tomorrow, so I will eat delicious food for the last time today.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게_eulge_I_will_in_the_future_20231230_저는_내일부터_다이어트할게요_그래서_오늘은_맛있는_음식을_마지막으로_먹을게요.mp3"
      },
      {
        "kr": "너무 걱정하지 마세요, 저는 한국어 공부를 열심히 할게요.",
        "romaji": "Neomu geokjeonghaji maseyo, jeoneun hangugeo gongbureul yeolsimhi halgeyo.",
        "en": "Don't worry too much, I will study Korean diligently.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게_eulge_I_will_in_the_future_20231230_너무_걱정하지_마세요_저는_한국어_공부를_열심히_할게요.mp3"
      },
      {
        "kr": "미안해요, 지금부터 절대 늦지 않을게요.",
        "romaji": "Mianhaeyo, jigeumbuteo jeoldae neutji anheulgeyo.",
        "en": "I'm sorry, from now on I definitely won't be late.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게_eulge_I_will_in_the_future_20231230_미안해요_지금부터_절대_늦지_않을게요.mp3"
      },
      {
        "kr": "방 청소를 안 했어? 괜찮아, 나중에 제가 할게요.",
        "romaji": "Bang cheongsoeul an haesseo? Gwenchana, najunge jega halgeyo.",
        "en": "Didn't you clean the room? It's okay, I will do it later.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ게_eulge_I_will_in_the_future_20231230_방_청소를_안_했어_괜찮아_나중에_제가_할게요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ래 [(eu)llae] (I want to)",
    "short_explanation": "Used to express that the speaker wants to do something.",
    "long_explanation": "'~(으)ㄹ래 [(eu)llae]' is a Korean language grammar that is used when the speaker want to do something or suggest to do something, depending on the context. It is attached to the stem of the verb. The usage can differ with regards to formality, subject number, and the overall context of the sentence. It's equal to 'I want to ~' in English and is expressed in the informal tone.",
    "formation": "[Verb stem] + ~(으)ㄹ래",
    "examples": [
      {
        "kr": "저는 오늘 저녁에 바베큐를 먹을래, 체고하러 가고 싶어서.",
        "romaji": "Jeoneun oneul jeonyeoge babekyureul meogeullae, chegohareo gago sipheoseo.",
        "en": "I want to have BBQ for dinner today, because I want to go to a steakhouse.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래_eullae_I_want_to_20231230_저는_오늘_저녁에_바베큐를_먹을래_체고하러_가고_싶어서.mp3"
      },
      {
        "kr": "내일 친구들과 함께 영화를 볼래, 그 거 좋아하니까.",
        "romaji": "Naeil chingudeulgwa hamkke yeonghwareul bollae, geu geo joahanikka.",
        "en": "I want to watch a movie with my friends tomorrow, because I like it.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래_eullae_I_want_to_20231230_내일_친구들과_함께_영화를_볼래_그_거_좋아하니까.mp3"
      },
      {
        "kr": "우리 주말에 소풍 갈래? 날씨가 좋을 거니까.",
        "romaji": "Uri jumal-e sopung gallae? Nalssiga joeul geonikka.",
        "en": "Do we want to go for a picnic on the weekend? Because the weather will be good.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래_eullae_I_want_to_20231230_우리_주말에_소풍_갈래_날씨가_좋을_거니까.mp3"
      },
      {
        "kr": "나는 새로운 취미를 찾을래, 지금까지의 취미가 지루해져서.",
        "romaji": "Naneun saeroun chwimireul chajeullae, jigeumkkajiui chwimiga jiruhaejyeoseo.",
        "en": "I want to find a new hobby, because my current hobby has become boring.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ래_eullae_I_want_to_20231230_나는_새로운_취미를_찾을래_지금까지의_취미가_지루해져서.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ라고 [(eu)llago] (Intend to)",
    "short_explanation": "This grammar point is used to express someone's intention to do something.",
    "long_explanation": "'~(으)ㄹ라고 [(eu)llago]' is a Korean grammar point used to express a person's intention, plan, or determination to do something. It can be attached to the verb stem. When the verb stem ends with a vowel or a consonant 'ㄹ', we use 'ㄹ라고', but if the verb stem ends with any other consonant, we use '을라고'. Note that we use this grammar point when the speaker wants to express or report someone's intentions, whether it's his/her own or someone else’s.",
    "formation": "Verb stem + ㄹ라고 OR Verb stem + 을라고",
    "examples": [
      {
        "kr": "그는 내일 아침에 일찍 일어날라고 알람 시계를 설정했습니다.",
        "romaji": "Geuneun naeil achime iljjik ireonallago allam sigeireul seoltukhaessseubnida.",
        "en": "He set the alarm clock because he intends to wake up early tomorrow morning.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ라고_eullago_Intend_to_20231230_그는_내일_아침에_일찍_일어날라고_알람_시계를_설정했습니다.mp3"
      },
      {
        "kr": "지민이는 축구 대회에서 우승하려고 매일 연습하고 있어요.",
        "romaji": "Jiminieun chukgu daehoeeseo useungharyeogo maeil yeonseuphago isseoyo.",
        "en": "Jimin is practicing every day because he intends to win the soccer tournament.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ라고_eullago_Intend_to_20231230_지민이는_축구_대회에서_우승하려고_매일_연습하고_있어요.mp3"
      },
      {
        "kr": "서연이는 결혼할라고 집을 구입할 계획이에요.",
        "romaji": "Seoyeonineun gyeolhonhallago jibeul guiphal gyehoegeyo.",
        "en": "Seoyeon plans to buy a house because she intends to get married.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ라고_eullago_Intend_to_20231230_서연이는_결혼할라고_집을_구입할_계획이에요.mp3"
      },
      {
        "kr": "나는 이번 달에 새 차를 살라고 돈을 저축하고 있어요.",
        "romaji": "Naneun ibeon dare sae chareul sallago doneul jeochukhago isseoyo.",
        "en": "I am saving money because I intend to buy a new car this month.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ라고_eullago_Intend_to_20231230_나는_이번_달에_새_차를_살라고_돈을_저축하고_있어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ 테니까 [(eu)l tenikka] (Since I assume)",
    "short_explanation": "This pattern '(으)ㄹ 테니까' is used when speaker makes guess or assumption and provides advice or suggestion based on that assumption.",
    "long_explanation": "'~(으)ㄹ 테니까 [(eu)l tenikka]' is a Korean grammar point used to make assumptions about a situation or event based on the speaker's personal observations, beliefs, or predictions. Then, it shows the speaker's advice, suggestion, or response based on this assumption. The pattern can be used in future tense situations and generally indicates a higher degree of certainty.",
    "formation": "Verb-ㄹ 테니까 / Adjective-ㄹ 테니까",
    "examples": [
      {
        "kr": "너무 늦어지ㄹ 테니까 이제 집에 가는 것이 좋겠어요.",
        "romaji": "Neomu neujeojil tenikka ije jibe ganeun geosi jotgesseoyo.",
        "en": "You should probably go home now since it's going to get too late.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_테니까_eul_tenikka_Since_I_assume_20231230_너무_늦어지ㄹ_테니까_이제_집에_가는_것이_좋겠어요.mp3"
      },
      {
        "kr": "비가 올 테니까 우산을 가져가세요.",
        "romaji": "Biga ol tenikka usaneul gajyeogaseyo.",
        "en": "Take an umbrella because it's going to rain.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_테니까_eul_tenikka_Since_I_assume_20231230_비가_올_테니까_우산을_가져가세요.mp3"
      },
      {
        "kr": "내일 시험이 있을 테니까 오늘 밤은 공부하는 것이 좋겠어요.",
        "romaji": "Naeil siheomi isseul tenikka oneul bameun gongbuhaneun geosi jotgesseoyo.",
        "en": "Since there's a test tomorrow, it would be good to study tonight.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_테니까_eul_tenikka_Since_I_assume_20231230_내일_시험이_있을_테니까_오늘_밤은_공부하는_것이_좋겠어요.mp3"
      },
      {
        "kr": "그는 이미 알고 있을 테니까 걱정하지 마세요.",
        "romaji": "Geuneun imi algo isseul tenikka geokjeonghaji maseyo.",
        "en": "Don't worry because he probably already knows.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ_테니까_eul_tenikka_Since_I_assume_20231230_그는_이미_알고_있을_테니까_걱정하지_마세요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)ㄹ지라도 [(eu)ljirado] (Even if)",
    "short_explanation": "Used to express the meaning of 'even if'; it emphasizes the condition or situation regardless of its result or consequence.",
    "long_explanation": "'~(으)ㄹ지라도 [(eu)ljirado]' is a complex suffix used in Korean to signify 'even if' or 'although'. It is commonly used to mention a hypothetical scenario or condition, despite the potential negative or undesired outcome. This form shows that even in the worst case or scenario, the speaker will not change their decision, action, or thought. This emphasizes the speaker's determination or resolution.",
    "formation": "Verb Stem + 으ㄹ지라도 / Verb Stem + ㄹ지라도",
    "examples": [
      {
        "kr": "이 일이 얼마나 어려울지라도, 저는 반드시 해내겠어요.",
        "romaji": "I iri eolmana eoryeouljirado, jeoneun bandeusi haenaegesseoyo.",
        "en": "No matter how difficult this task may be, I will definitely finish it.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ지라도_euljirado_Even_if_20231230_이_일이_얼마나_어려울지라도_저는_반드시_해내겠어요.mp3"
      },
      {
        "kr": "자고 싶을지라도, 다가오는 시험 때문에 밤새 공부해야 해요.",
        "romaji": "Jago sipeuljirado, dagaoneun siheom ttaemune bamsae gongbuhaya haeyo.",
        "en": "Even though I want to sleep, I have to study all night because of the upcoming exam.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ지라도_euljirado_Even_if_20231230_자고_싶을지라도_다가오는_시험_때문에_밤새_공부해야_해요.mp3"
      },
      {
        "kr": "비가 오지 않을지라도, 우산을 항상 가지고 다녀야 해요.",
        "romaji": "Biga oji anheuljirado, usaneul hangsang gajigo danyeoya haeyo.",
        "en": "Even if it doesn't rain, you should always carry an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ지라도_euljirado_Even_if_20231230_비가_오지_않을지라도_우산을_항상_가지고_다녀야_해요.mp3"
      },
      {
        "kr": "날씨가 추울지라도, 저는 언제나 아이스크림을 먹고 싶어요.",
        "romaji": "Nalssiga chuuljirado, jeoneun eonjena aiseukeurimeul meokgo sipeoyo.",
        "en": "Even if the weather is cold, I always want to eat ice cream.",
        "grammar_audio": "/audio/korean/grammar/s_으ㄹ지라도_euljirado_Even_if_20231230_날씨가_추울지라도_저는_언제나_아이스크림을_먹고_싶어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)면서도 [(eu)myeonseodo] (While, although)",
    "short_explanation": "Used to express contrast or contradiction; 'While', 'although'.",
    "long_explanation": "'~(으)면서도 [(eu)myeonseodo]' is a conjunction used in Korean to express situations where the preceding and following clauses contradict each other or have unexpected results. In English, this would be similar to 'while' or 'although'. It is used to express the concurrent realization of two contrasting actions or situations.",
    "formation": "Verb stem + (으)면서도",
    "examples": [
      {
        "kr": "그녀는 아프면서도 일을 계속 했습니다. 아픔을 거뜬히 이겨내고 일을 마무리했습니다.",
        "romaji": "Geunyeoneun apeumyeonseodo ireul gyesok haetsseumnida. Apeumeul geotteunhi igyeonaego ileul mamurihaetseumnida.",
        "en": "Although she was sick, she continued to work. She overcame the pain and finished her work.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_그녀는_아프면서도_일을_계속_했습니다_아픔을_거뜬히_이겨내고_일을_마무리했습니다.mp3"
      },
      {
        "kr": "비가 오면서도 이 축제는 계속되었습니다. 모두들 즐거움에 흠뻑 빠져들었습니다.",
        "romaji": "Biga omyeonseodo i chukjeneun gyesokdoeeotsseumnida. Modudeul jeulgeoume heumppok ppajyeodeureotsseumnida.",
        "en": "Even though it was raining, the festival continued. Everyone was fully immersed in the fun.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_비가_오면서도_이_축제는_계속되었습니다_모두들_즐거움에_흠뻑_빠져들었습니다.mp3"
      },
      {
        "kr": "그는 실수를 하면서도 끝까지 이겨냈습니다. 그의 집중력과 끈기가 대단했습니다.",
        "romaji": "Geuneun silsureul hamyeonseodo ggeutkkaji igyeonaetsseumnida. Geuui jipunglyeokgwa ggeungiga daedanhaetsseumnida.",
        "en": "Even though he made a mistake, he succeeded to the end. His concentration and perseverance were great.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_그는_실수를_하면서도_끝까지_이겨냈습니다_그의_집중력과_끈기가_대단했습니다.mp3"
      },
      {
        "kr": "식사를 다하면서도 배가 고픈 것 같았습니다. 너무 많이 달려서 그런 것 같아요.",
        "romaji": "Sigsareul dahamyeonseodo baega gopeun geot gatatsseumnida. Neomu mani dallyeoseo geureon geot gatayo.",
        "en": "Although I had finished eating, I felt hungry. I think it's because I ran so much.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_although_20231230_식사를_다하면서도_배가_고픈_것_같았습니다_너무_많이_달려서_그런_것_같아요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)시면 [(eu)simyeon] (If you)",
    "short_explanation": "Used to express a condition or an assumption; 'if you' or 'when'.",
    "long_explanation": "'~(으)시면 [(eu)simyeon]' is a grammar point in Korean used to express a hypothetical situation or a condition. It falls under the broad 'if' conditional conjugation in Korean. It is used to express a polite form of 'if you' or 'when'. It involves the subject-action-object pattern where the action or the verb are conjugated accordingly followed by 시면 to form a conditional situation or proposal.",
    "formation": "Verb stem + (으)시면",
    "examples": [
      {
        "kr": "편하시면 오늘 저녁에 저에게 전화하시는 것 어때요?",
        "romaji": "Pyeonhasimyeon oneul jeonyeoge jeoege jeonhwahasineun geot eoddaeyo?",
        "en": "If you're free, how about calling me tonight?",
        "grammar_audio": "/audio/korean/grammar/s_으시면_eusimyeon_If_you_20231230_편하시면_오늘_저녁에_저에게_전화하시는_것_어때요.mp3"
      },
      {
        "kr": "수업이 끝나시면 자기소개를 시작해 주시면 감사하겠습니다.",
        "romaji": "Sueobi ggeut nasimyeon jaki sogae reul si jakhae jusimyeon gamsahabnida.",
        "en": "I would appreciate it if you could start self-introduction when the class is over.",
        "grammar_audio": "/audio/korean/grammar/s_으시면_eusimyeon_If_you_20231230_수업이_끝나시면_자기소개를_시작해_주시면_감사하겠습니다.mp3"
      },
      {
        "kr": "가능하시면, 내일 회의에 참석하실 수 있을까요?",
        "romaji": "Ganeung hasimyeon, naeil hoeuie chamseokhasil su isseulkka yo?",
        "en": "If it's possible, could you attend the meeting tomorrow?",
        "grammar_audio": "/audio/korean/grammar/s_으시면_eusimyeon_If_you_20231230_가능하시면_내일_회의에_참석하실_수_있을까요.mp3"
      },
      {
        "kr": "시간 나시면 사진 몇장을 보여주시면 감사할게요.",
        "romaji": "Siganna simyeon sajin myeot jang eul boyeo jusimyeon gamsahalggeyo.",
        "en": "If you have time, I would appreciate if you could show me a few photos.",
        "grammar_audio": "/audio/korean/grammar/s_으시면_eusimyeon_If_you_20231230_시간_나시면_사진_몇장을_보여주시면_감사할게요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)시겠어요 [(eu)sigesseoyo] (You will probably)",
    "short_explanation": "Used to express probability or expectation; 'you will probably'.",
    "long_explanation": "'~(으)시겠어요 [(eu)sigesseoyo]' is a grammar point in Korean that engenders the speaker's perception of the listener's probable action or state in the near future. The speaker uses this form when he/she anticipates or predicts what the listener will do or feel, incorporating a sense of respect or politeness toward the listener. It is frequently used in formal or polite settings.",
    "formation": "Verb + ~(으)시겠어요 ",
    "examples": [
      {
        "kr": "날씨가 꽤 춥습니다, 당신은 아마도 목도리를 두르시겠어요. ",
        "romaji": "Nalssiga kkwae chubseubnida, dangsineun amado mokdorireul dureusigesseoyo.",
        "en": "The weather is quite cold, you will probably wear a scarf.",
        "grammar_audio": "/audio/korean/grammar/s_으시겠어요_eusigesseoyo_You_will_probably_20231230_날씨가_꽤_춥습니다_당신은_아마도_목도리를_두르시겠어요_.mp3"
      },
      {
        "kr": "정말 바쁜 하루였죠, 피곤하시겠어요.",
        "romaji": "Jeongmal bappeun haruyeossjyo, pigonhasigesseoyo.",
        "en": "It was a really busy day, you must be tired.",
        "grammar_audio": "/audio/korean/grammar/s_으시겠어요_eusigesseoyo_You_will_probably_20231230_정말_바쁜_하루였죠_피곤하시겠어요.mp3"
      },
      {
        "kr": "이 분량의 일을 보니, 당신은 아마도 주말동안 일하시겠어요.",
        "romaji": "I bunryangui ireul boni, dangsineun amado jumaldongan ilhasigesseoyo.",
        "en": "Considering the amount of work, you will probably work over the weekend.",
        "grammar_audio": "/audio/korean/grammar/s_으시겠어요_eusigesseoyo_You_will_probably_20231230_이_분량의_일을_보니_당신은_아마도_주말동안_일하시겠어요.mp3"
      },
      {
        "kr": "날씨가 이렇게 더우니, 소프트드링크를 좋아하시겠어요.",
        "romaji": "Nalssiga ireohge deouni, sopeuteudeuringkeureul joahasigesseoyo.",
        "en": "The weather is so hot, you would probably like a soft drink.",
        "grammar_audio": "/audio/korean/grammar/s_으시겠어요_eusigesseoyo_You_will_probably_20231230_날씨가_이렇게_더우니_소프트드링크를_좋아하시겠어요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)시다 [(eu)sida] (Let's)",
    "short_explanation": "This grammar form is used to propose or suggest an activity with 'let's'.",
    "long_explanation": "'~(으)시다 [(eu)sida]' is a grammar point that suggests a certain action to the audience. It can be used when the speaker suggests or proposes to do something together with one or more people. The use of this form expresses the idea of 'Let's do something' in English. Its usage is governed by the final vowel of the preceding syllable, using '으시다' with verb stems ending in a consonant and '시다' with those ending in a vowel.",
    "formation": "Verb stem + 시다 (if verb stem ends in a vowel) / Verb stem + 으시다 (if verb stem ends in a consonant)",
    "examples": [
      {
        "kr": "오늘 저녁 식당에서 저녁을 먹으시다, 다른 모든 일들은 잊어버려요.",
        "romaji": "Oneul jeonyeok sikdangeseo jeonyeogeul meogeusida, dareun modeun ildeureun ijeobeoryeoyo.",
        "en": "Let's eat dinner at a restaurant tonight, forget about everything else.",
        "grammar_audio": "/audio/korean/grammar/s_으시다_eusida_Lets_20231230_오늘_저녁_식당에서_저녁을_먹으시다_다른_모든_일들은_잊어버려요.mp3"
      },
      {
        "kr": "우리 함께 산책하시다, 우리 모두에게 좋을 것 같아요.",
        "romaji": "Uri hamkke sanchaekhasida, uri modeuege joeul geot gatayo.",
        "en": "Let's take a walk together, it seems like it will be good for all of us.",
        "grammar_audio": "/audio/korean/grammar/s_으시다_eusida_Lets_20231230_우리_함께_산책하시다_우리_모두에게_좋을_것_같아요.mp3"
      },
      {
        "kr": "이 문제를 함께 해결하시다, 함께하면 더 쉬울 거예요.",
        "romaji": "I munjeleul hamkke haegyeolhasida, hamkkemyeon deo swil geoyeyo.",
        "en": "Let's solve this problem together, it will be easier if we do it together.",
        "grammar_audio": "/audio/korean/grammar/s_으시다_eusida_Lets_20231230_이_문제를_함께_해결하시다_함께하면_더_쉬울_거예요.mp3"
      },
      {
        "kr": "모두가 같이 여행 가시다, 같이 가면 더 즐거울 거예요.",
        "romaji": "Moduga gachi yeohaeng gasida, gachi gamyeon deo jeulgeoul geoyeyo.",
        "en": "Let's all go on a trip together, it will be more fun if we go together.",
        "grammar_audio": "/audio/korean/grammar/s_으시다_eusida_Lets_20231230_모두가_같이_여행_가시다_같이_가면_더_즐거울_거예요.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  },
  {
    "title": "~(으)십시오 [(eu)sipsio] (Please)",
    "short_explanation": "Used to express polite requests or commands; 'please'.",
    "long_explanation": "'~(으)십시오 [(eu)sipsio]' is a sentence ending that is used in Korean language to make a polite request or to give a polite command. It is considered a high formality level of speaking, and is often used in formal situations, such as addressing superiors or strangers. It's generally used with verbs and it changes slightly based on the final vowel of the verb stem.",
    "formation": "Verb stem + 으십시오 (if the verb stem ends with a consonant) | Verb stem + 십시오 (if the verb stem ends with a vowel)",
    "examples": [
      {
        "kr": "한 번 다시 생각해보십시오, 아마 그것이 옳은 선택일 것입니다.",
        "romaji": "Han beon dasi saenggakhaebosipsio, ama geugeosi olheun seontaegil geosibnida.",
        "en": "Please think it over again, it might be the right choice.",
        "grammar_audio": "/audio/korean/grammar/s_으십시오_eusipsio_Please_20231230_한_번_다시_생각해보십시오_아마_그것이_옳은_선택일_것입니다.mp3"
      },
      {
        "kr": "여기 앉으십시오, 저는 당신에게 말할 것이 있습니다.",
        "romaji": "Yeogi anjeusipsio, jeoneun dangshinege malhal geosi itsseumnida.",
        "en": "Please sit here, I have something to tell you.",
        "grammar_audio": "/audio/korean/grammar/s_으십시오_eusipsio_Please_20231230_여기_앉으십시오_저는_당신에게_말할_것이_있습니다.mp3"
      },
      {
        "kr": "집에 오셨다면, 먼저 손을 씻으십시오.",
        "romaji": "Jibe osyeotdamyeon, meonjeo soneul sseusipsio.",
        "en": "If you have come home, please wash your hands first.",
        "grammar_audio": "/audio/korean/grammar/s_으십시오_eusipsio_Please_20231230_집에_오셨다면_먼저_손을_씻으십시오.mp3"
      },
      {
        "kr": "궁금증이 있다면 그 질문을 이제 물어보십시오.",
        "romaji": "Gunggeumjeungi itsdamyeon geu jilmuneul ije mureobosipsio.",
        "en": "If you have any queries, please ask your question now.",
        "grammar_audio": "/audio/korean/grammar/s_으십시오_eusipsio_Please_20231230_궁금증이_있다면_그_질문을_이제_물어보십시오.mp3"
      }
    ],
    "p_tag": "TOPIK_2",
    "s_tag": "125"
  }
]