[
  {
    "title": "อาจ (àat) - Might, Perhaps",
    "short_explanation": "Expresses possibility as 'might' or 'perhaps'.",
    "long_explanation": "The word 'อาจ (àat)' is used in Thai language to express the possibility, similarly to the English 'might' or 'perhaps'. Its function is to suggest that a certain action or occurrence is possible, but not guaranteed. It is usually placed before verbs or adjectives in a sentence and can be used in a wide range of contexts to express the potential occurrence of an action or state.",
    "formation": "อาจ + Verb/Adjective",
    "examples": [
      {
        "th": "ฉัน อาจ ไป เที่ยวทะเล ใน อาทิตย์ หน้า ถ้า ฉัน มีเวลา",
        "romaji": "Chan àat pai thiaw tha le nai a-thit na ta chan mee we-laa",
        "en": "I might go to the seaside next week if I have time.",
        "grammar_audio": "/audio/thai/grammar/s_อาจ_àat_-_Might_Perhaps_20231230_ฉัน_อาจ_ไป_เที่ยวทะเล_ใน_อาทิตย์_หน้า_ถ้า_ฉัน_มีเวลา.mp3"
      },
      {
        "th": "เธอ อาจ รู้สึก ไม่สบาย หาก กิน อาหารรสจัด",
        "romaji": "Thoer àat ruseuk mai sabai hak gin a-haan rot jat",
        "en": "She might feel unwell if she eats spicy food.",
        "grammar_audio": "/audio/thai/grammar/s_อาจ_àat_-_Might_Perhaps_20231230_เธอ_อาจ_รู้สึก_ไม่สบาย_หาก_กิน_อาหารรสจัด.mp3"
      },
      {
        "th": "เขา อาจ ผ่าน การ ทดสอบ หาก อ่านหนังสือ อย่าง เข้มข้น",
        "romaji": "Khao àat phan kaan thot sop hak aan nang-sue yang khem khon",
        "en": "He might pass the test if he studies intensively.",
        "grammar_audio": "/audio/thai/grammar/s_อาจ_àat_-_Might_Perhaps_20231230_เขา_อาจ_ผ่าน_การ_ทดสอบ_หาก_อ่านหนังสือ_อย่าง_เข้มข้น.mp3"
      },
      {
        "th": "หาก ฉัน ไม่ ได้ ตอบ เมล แสดงว่า ฉัน อาจ สิ้นสุด ปฏิทิน ของ ฉัน",
        "romaji": "Hak chan mai dai top emel sa-daeng wa chan àat sin sut pa-thi-thin kong chan",
        "en": "If I don't respond to the email, it might mean I may have ended my calendar.",
        "grammar_audio": "/audio/thai/grammar/s_อาจ_àat_-_Might_Perhaps_20231230_หาก_ฉัน_ไม่_ได้_ตอบ_เมล_แสดงว่า_ฉัน_อาจ_สิ้นสุด_ปฏิทิน_ของ_ฉัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ต้อง (tâwng) - Must, have to",
    "short_explanation": "Indicates obligation or necessity; 'must' or 'have to'.",
    "long_explanation": "In Thai, 'ต้อง (tâwng)' is used to express obligation or necessity, similar to the English 'must' or 'have to'. It is generally placed before the main verb in a sentence to denote the necessity or required action. 'ต้อง (tâwng)' can be used in various contexts to show varying degrees of obligation, from formal rules to strong personal recommendations.",
    "formation": "ต้อง + Verb",
    "examples": [
      {
        "th": "ถ้า คุณ ต้องการ ผ่าน การทดสอบ นี้ คุณ ต้อง รีบ งาน ภาษา ไทย ของ คุณ ทุกวัน",
        "romaji": "Thâa khun tôrng gaan phàan gaan thót sàwp nii, khun tâwng reep ngan paa-săa Thai khǒng khun thúk wan",
        "en": "If you want to pass this test, you must study your Thai language homework every day.",
        "grammar_audio": "/audio/thai/grammar/s_ต้อง_tâwng_-_Must_have_to_20231230_ถ้า_คุณ_ต้องการ_ผ่าน_การทดสอบ_นี้_คุณ_ต้อง_รีบ_งาน_ภาษา_ไทย_ของ_คุณ_ทุกวัน.mp3"
      },
      {
        "th": "หาก คุณ ปรารถนา ที่จะ ผ่าน ข้อสอบ CU-TFL, คุณ ต้อง เคารพ กฎ ประจำ รามวิทยาลัย จุฬาลงกรณ์",
        "romaji": "Hàak khun bpràa-rà-thá-naa thîi jà phàan kâw sàwp CU-TFL, khun tâwng kaao-róp gòt bprà-jam raam wit-thá-ya-lai Chula",
        "en": "If you aspire to pass the CU-TFL exam, you must respect the rules of Chulalongkorn University.",
        "grammar_audio": "/audio/thai/grammar/s_ต้อง_tâwng_-_Must_have_to_20231230_หาก_คุณ_ปรารถนา_ที่จะ_ผ่าน_ข้อสอบ_CU-TFL_คุณ_ต้อง_เคารพ_กฎ_ประจำ_รามวิทยาลัย_จุฬาลงกรณ์.mp3"
      },
      {
        "th": "เรา ต้อง ออก แรง ไป กับ เราเอง ถ้า เรา ต้องการ ปรับปรุง เรื่อง พูด พฤษภาคม ภาษา ไทย",
        "romaji": "Rao tâwng àwk raeng bpai gàp rao eng thâa rao tôrng gaan bpàd bpŭng reûang pôot phrûet-sà-phâa kŏm paa-săa Thai",
        "en": "We must push ourselves if we want to improve our Thai speaking skills.",
        "grammar_audio": "/audio/thai/grammar/s_ต้อง_tâwng_-_Must_have_to_20231230_เรา_ต้อง_ออก_แรง_ไป_กับ_เราเอง_ถ้า_เรา_ต้องการ_ปรับปรุง_เรื่อง_พูด_พฤษภาคม_ภาษา_ไทย.mp3"
      },
      {
        "th": "ถ้า คุณ ต้องการ สอบผ่าน การทดสอบ นี้, คุณ ต้อง ฝึกฝน การอ่าน และ การ เขียน ภาษา ไทย ทุกวัน",
        "romaji": "Thâa khun tôrng gaan sàwp phàan gaan thót sàwp nii, khun tâwng fûek-fŏn gaan àan láe gaan khiian paa-săa Thai thúk wan",
        "en": "If you want to pass this test, you must practice reading and writing Thai every day.",
        "grammar_audio": "/audio/thai/grammar/s_ต้อง_tâwng_-_Must_have_to_20231230_ถ้า_คุณ_ต้องการ_สอบผ่าน_การทดสอบ_นี้_คุณ_ต้อง_ฝึกฝน_การอ่าน_และ_การ_เขียน_ภาษา_ไทย_ทุกวัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ควร (khuan) - Should (giving advice)",
    "short_explanation": "Indicates a recommendation or suggestion, similar to 'should' in English.",
    "long_explanation": "The word 'ควร (khuan)' is used in Thai to give advice or make a suggestion, much like the English equivalent 'should'. It is most commonly used to indicate that the speaker believes a particular action would be beneficial or appropriate. It is often used in suggestions and advice, and can be used with a wide variety of verbs.",
    "formation": "'ควร' + Verb or 'ควร' + Noun",
    "examples": [
      {
        "th": "คุณ ควร นอน พัก พอ ชั่ว ข้าง เพื่อ สุขภาพ ที่ ดี",
        "romaji": "Khun khuan non pak pho chua khang phuea suk-kha-phap thi di",
        "en": "You should get enough sleep for good health.",
        "grammar_audio": "/audio/thai/grammar/s_ควร_khuan_-_Should_giving_advice_20231230_คุณ_ควร_นอน_พัก_พอ_ชั่ว_ข้าง_เพื่อ_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "เรา ควร ทำ การ บ้าน ที่ ได้ รับ จาก ครู ก่อน",
        "romaji": "Rao khuan tham kan baan thi dai rap jak khru kon",
        "en": "We should do the homework that we got from the teacher first.",
        "grammar_audio": "/audio/thai/grammar/s_ควร_khuan_-_Should_giving_advice_20231230_เรา_ควร_ทำ_การ_บ้าน_ที่_ได้_รับ_จาก_ครู_ก่อน.mp3"
      },
      {
        "th": "คุณ ควร กิน ผัก และ ผลไม้ ทุก วัน เพื่อ ร่างกาย ที่ แข็งแรง",
        "romaji": "Khun khuan gin pak lae phonlamai thuk wan phuea rang-gai thi kaeng raeng",
        "en": "You should eat vegetables and fruits every day for a strong body.",
        "grammar_audio": "/audio/thai/grammar/s_ควร_khuan_-_Should_giving_advice_20231230_คุณ_ควร_กิน_ผัก_และ_ผลไม้_ทุก_วัน_เพื่อ_ร่างกาย_ที่_แข็งแรง.mp3"
      },
      {
        "th": "เรา ควร ประหยัด น้ำ เพื่อ รักษา สิ่ง แวด ล้อม",
        "romaji": "Rao khuan pra-yat nam phuea rak sa sing waet lom",
        "en": "We should save water to take care of the environment.",
        "grammar_audio": "/audio/thai/grammar/s_ควร_khuan_-_Should_giving_advice_20231230_เรา_ควร_ประหยัด_น้ำ_เพื่อ_รักษา_สิ่ง_แวด_ล้อม.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "น่า (nâa) - Seems, looks like (making speculations)",
    "short_explanation": "Indicates speculations about the state or desirability of something; 'seems' or 'looks like'.",
    "long_explanation": "The term 'น่า (nâa)' is often used in Thai language when making speculations or expressing subjective observations. It can be translated into English as 'seems', 'looks like', or in certain contexts, showing desirability such as 'worthy of' or 'deserving'. It is put before verbs, adjectives, or phrases to express the speaker's impression or interpretation about the state of something or someone.",
    "formation": "น่า + Adjective/Verb",
    "examples": [
      {
        "th": "การ ดูแล สุขภาพ เป็นสิ่ง ที่ น่า ให้ความสำคัญ",
        "romaji": "Kan du lae suk kha phap pen sing thi nâa hai khwam samkhan",
        "en": "Taking care of health is something that seems important.",
        "grammar_audio": "/audio/thai/grammar/s_น่า_nâa_-_Seems_looks_like_making_speculations_20231230_การ_ดูแล_สุขภาพ_เป็นสิ่ง_ที่_น่า_ให้ความสำคัญ.mp3"
      },
      {
        "th": "ความยากลำบาก ที่ ผ่านมา ทำให้ ฉัน เรียนรู้ และ โตขึ้น มัน ดู น่า ยินดี",
        "romaji": "Kwam yak lambak thi phan ma tham hai chan riarn ru lae to khun, man du nâa yin dee",
        "en": "The hardships I've been through have made me learn and grow, it seems pleasing.",
        "grammar_audio": "/audio/thai/grammar/s_น่า_nâa_-_Seems_looks_like_making_speculations_20231230_ความยากลำบาก_ที่_ผ่านมา_ทำให้_ฉัน_เรียนรู้_และ_โตขึ้น_มัน_ดู_น่า_ยินดี.mp3"
      },
      {
        "th": "เขา มัก ยิ้มกว้าง ทุกครั้ง ที่ เห็น คุณ ดู น่า รัก",
        "romaji": "Khao mak yim kwang thuk krang thi hen khun, du nâa rak",
        "en": "He always smiles broadly every time he sees you, you seem cute.",
        "grammar_audio": "/audio/thai/grammar/s_น่า_nâa_-_Seems_looks_like_making_speculations_20231230_เขา_มัก_ยิ้มกว้าง_ทุกครั้ง_ที่_เห็น_คุณ_ดู_น่า_รัก.mp3"
      },
      {
        "th": "หนังสือ ที่ คุณ แนะนำ ดู น่า อ่าน",
        "romaji": "Nang sue thi khun nae nam du nâa an",
        "en": "The book you recommended looks like a good read.",
        "grammar_audio": "/audio/thai/grammar/s_น่า_nâa_-_Seems_looks_like_making_speculations_20231230_หนังสือ_ที่_คุณ_แนะนำ_ดู_น่า_อ่าน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ถูก (thùuk) - Passive voice marker; also means 'to be hit by'",
    "short_explanation": "It is used to put the action onto the subject; also mean 'to be hit by' when used with certain verbs.",
    "long_explanation": "In Thai language, 'ถูก (thùuk)' predominately functions as a passive voice marker, which shifts the action onto the subject. This is much like how 'by' is used in English to show what or who is doing the action to the subject. Besides passive voice, 'ถูก (thùuk)' can be also used with certain verbs to mean 'to be hit by' in a range of contexts.",
    "formation": "Subject + ถูก + Actor/Performer + Verb",
    "examples": [
      {
        "th": "ฉัน ถูก แม่ ต่างหู ขอ เงิน ฉัน",
        "romaji": "Chan thùuk mae taang hoo khor ngern chan",
        "en": "I was asked for money by my mom.",
        "grammar_audio": "/audio/thai/grammar/s_ถูก_thùuk_-_Passive_voice_marker_also_means_to_be_hit_by_20231230_ฉัน_ถูก_แม่_ต่างหู_ขอ_เงิน_ฉัน.mp3"
      },
      {
        "th": "สตีเฟน ถูก หมา ของ เขา กัด",
        "romaji": "Stephen thùuk maa kong khao gat",
        "en": "Stephen was bitten by his dog.",
        "grammar_audio": "/audio/thai/grammar/s_ถูก_thùuk_-_Passive_voice_marker_also_means_to_be_hit_by_20231230_สตีเฟน_ถูก_หมา_ของ_เขา_กัด.mp3"
      },
      {
        "th": "นักศึกษา ถูก อาจารย์ ตรวจ การบ้าน",
        "romaji": "Nak suksa thùuk aa jaan dtua jaa gaan baan",
        "en": "The student was checked homework by the teacher.",
        "grammar_audio": "/audio/thai/grammar/s_ถูก_thùuk_-_Passive_voice_marker_also_means_to_be_hit_by_20231230_นักศึกษา_ถูก_อาจารย์_ตรวจ_การบ้าน.mp3"
      },
      {
        "th": "ฉัน ถูก รถบัส เกิด อุบัติเหตุ",
        "romaji": "Chan thùuk rot bus goot u-bat-ti-het",
        "en": "I was hit by a bus accident.",
        "grammar_audio": "/audio/thai/grammar/s_ถูก_thùuk_-_Passive_voice_marker_also_means_to_be_hit_by_20231230_ฉัน_ถูก_รถบัส_เกิด_อุบัติเหตุ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แม้ (mâe) - Even if, although",
    "short_explanation": "Expresses the contrast of two situations, equivalent to English 'even if' or 'although'.",
    "long_explanation": "The term 'แม้ (mâe)' is often used in Thai to express the contrasting relationship between two situations or actions. It is typically used at the beginning of a sentence, being equivalent to the English 'even if' or 'although'. Usually, this term is combined with other words like 'แม้ว่า (mâe wâa)' or 'แม้จะ (mâe jà)' for a more formal context.",
    "formation": "แม้ + Statement 1 + ก็ (optional) + Statement 2",
    "examples": [
      {
        "th": "แม้ ว่า เขา จะ แก่ แต่ เขา ยัง มี น้ำใจ และ กำลังใจ สูง",
        "romaji": "Mâe wâa khao ja gàe tàe khao yang mee nám jai lae gam-lang-jai soong",
        "en": "Even though he is old, he still has high spirits and energy.",
        "grammar_audio": "/audio/thai/grammar/s_แม้_mâe_-_Even_if_although_20231230_แม้_ว่า_เขา_จะ_แก่_แต่_เขา_ยัง_มี_น้ำใจ_และ_กำลังใจ_สูง.mp3"
      },
      {
        "th": "แม้ จะ เหนื่อย แต่ เรา ยัง ต้อง ทำงาน",
        "romaji": "Mâe jà nùeuy tàe rao yang dtông tham-ngaan",
        "en": "Even though we are tired, we still have to work.",
        "grammar_audio": "/audio/thai/grammar/s_แม้_mâe_-_Even_if_although_20231230_แม้_จะ_เหนื่อย_แต่_เรา_ยัง_ต้อง_ทำงาน.mp3"
      },
      {
        "th": "แม้ ว่า จะ บ้าน ของ เขา จะ เล็ก แต่ มัน มี ความ อบอุ่น",
        "romaji": "Mâe wâa jà baan kong khao jà lék tàe man mee khwam ob-oon",
        "en": "Even if his house is small, it is warm.",
        "grammar_audio": "/audio/thai/grammar/s_แม้_mâe_-_Even_if_although_20231230_แม้_ว่า_จะ_บ้าน_ของ_เขา_จะ_เล็ก_แต่_มัน_มี_ความ_อบอุ่น.mp3"
      },
      {
        "th": "แม้ ว่า วัน นี้ จะ ฝน ตก แต่ เรา ยังไง ก็ ต้อง ไป ทำงาน",
        "romaji": "Mâe wâa wan née jà fŏn dtòk tàe rao yang-ngai gôr dtông bpai tham-ngaan",
        "en": "Even if it is raining today, we still have to go to work.",
        "grammar_audio": "/audio/thai/grammar/s_แม้_mâe_-_Even_if_although_20231230_แม้_ว่า_วัน_นี้_จะ_ฝน_ตก_แต่_เรา_ยังไง_ก็_ต้อง_ไป_ทำงาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ใช่ (châi) - Is it?, correct, right",
    "short_explanation": "It is used to confirm something or to ask a question, it equates to the English 'Is it?, correct, right'.",
    "long_explanation": "The term 'ใช่ (châi)' is a commonly used word in the Thai language, it may be inserted to confirm the information previously mentioned or to form a question. This can be helpful when you are unsure of something, or you cannot recall certain information and need confirmation. The usage of 'ใช่' closely resembles the English 'Is it? Correct, right'.",
    "formation": "Statement + ใช่ + Question Word OR Statement + ใช่",
    "examples": [
      {
        "th": "คุณ มา จาก กรุงเทพฯ ใช่ ไหม",
        "romaji": "Khun ma ja krung thep châi mai",
        "en": "You are from Bangkok, right?",
        "grammar_audio": "/audio/thai/grammar/s_ใช่_châi_-_Is_it_correct_right_20231230_คุณ_มา_จาก_กรุงเทพฯ_ใช่_ไหม.mp3"
      },
      {
        "th": "นั่น ใช่ รถ ของ คุณ หรือ ไม่",
        "romaji": "Nun châi rot kong khun reu mai",
        "en": "Is that your car?",
        "grammar_audio": "/audio/thai/grammar/s_ใช่_châi_-_Is_it_correct_right_20231230_นั่น_ใช่_รถ_ของ_คุณ_หรือ_ไม่.mp3"
      },
      {
        "th": "ร้าน ขาย ของชำ ที่ แนะนำ ให้ คุณ นั่น ใช่ ร้าน โอ ทัพ ใช่ มั้ย",
        "romaji": "Ran kai khong cham thi nae nam hai khun nun châi ran o thap châi mâi",
        "en": "Is the grocery store I recommended to you, Otop shop, right?",
        "grammar_audio": "/audio/thai/grammar/s_ใช่_châi_-_Is_it_correct_right_20231230_ร้าน_ขาย_ของชำ_ที่_แนะนำ_ให้_คุณ_นั่น_ใช่_ร้าน_โอ_ทัพ_ใช่_มั้ย.mp3"
      },
      {
        "th": "อาหาร ที่ สั่ง มา ใช่ ที่ คุณ ต้องการ มั้ย",
        "romaji": "Aa haan thi sang ma châi thi khun tong kan mâi",
        "en": "Is the food that was ordered what you wanted?",
        "grammar_audio": "/audio/thai/grammar/s_ใช่_châi_-_Is_it_correct_right_20231230_อาหาร_ที่_สั่ง_มา_ใช่_ที่_คุณ_ต้องการ_มั้ย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ปลาย (plaai) - End (of a period), tip",
    "short_explanation": "Indicates the end of a time period or a physical edge or tip.",
    "long_explanation": "The word 'ปลาย (plaai)' is used in Thai to denote the end of a time period, like a week or a month, or the close of a physical edge, border, or tip. It can refer to both temporal endings, such as the end of a day, and spatial endpoints, such as the tip of a pen or the edge of a cliff.",
    "formation": "ปลาย + Noun",
    "examples": [
      {
        "th": "ช่วง เวลา ที่ ดี ที่สุด สำหรับ การ เดินทาง ไป ประเทศ นี้ คือ ใน ระหว่าง เดือน ตุลาคม ถึง ปลาย เดือน พฤศจิกายน",
        "romaji": "Chuang welaa thi di thisut samhrap gaan dern thaang pai prathet nee keu nai ra-huang duan thulaakhom theung plaai duan phruchikayon",
        "en": "The best time to travel to this country is between October and the end of November.",
        "grammar_audio": "/audio/thai/grammar/s_ปลาย_plaai_-_End_of_a_period_tip_20231230_ช่วง_เวลา_ที่_ดี_ที่สุด_สำหรับ_การ_เดินทาง_ไป_ประเทศ_นี้_คือ_ใน_ระหว่าง_เดือน_ตุลาคม_ถึง_ปลาย_เดือน_พฤศจิกายน.mp3"
      },
      {
        "th": "คุณ ต้อง ตัด ปลาย ผม ของ คุณ หลาย ครั้ง ใน ปี เพื่อ ให้ มัน ดู สุขภาพดี",
        "romaji": "Khun dtong dtat plaai phom kong khun lai khrang nai pi pheua hai man du suk-khaphap di",
        "en": "You need to cut the ends of your hair several times a year to keep it looking healthy.",
        "grammar_audio": "/audio/thai/grammar/s_ปลาย_plaai_-_End_of_a_period_tip_20231230_คุณ_ต้อง_ตัด_ปลาย_ผม_ของ_คุณ_หลาย_ครั้ง_ใน_ปี_เพื่อ_ให้_มัน_ดู_สุขภาพดี.mp3"
      },
      {
        "th": "เธอ ทำ รายงาน ตั้งแต่ เช้า จน ถึง ปลาย วัน",
        "romaji": "Thoe tham raay-ngaan dtang-tae chao jon theung plaai wan",
        "en": "She has been working on the report from morning until the end of the day.",
        "grammar_audio": "/audio/thai/grammar/s_ปลาย_plaai_-_End_of_a_period_tip_20231230_เธอ_ทำ_รายงาน_ตั้งแต่_เช้า_จน_ถึง_ปลาย_วัน.mp3"
      },
      {
        "th": "เขา นั่ง ที่ ปลาย โต๊ะ",
        "romaji": "Khao nang thi plaai dto",
        "en": "He sits at the end of the table.",
        "grammar_audio": "/audio/thai/grammar/s_ปลาย_plaai_-_End_of_a_period_tip_20231230_เขา_นั่ง_ที่_ปลาย_โต๊ะ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ซึ่ง (sûeng) - Which, who (relative pronoun)",
    "short_explanation": "Used as relative pronoun equivalent to English 'which' or 'who'; often translates indirect object pronouns.",
    "long_explanation": "In Thai, 'ซึ่ง (sûeng)' is commonly used as a relative pronoun, similar to the English 'which' or 'who'. It is usually used to introduce information about something or someone already mentioned in a sentence, acting as a connector between the main clause and a subordinate clause. Interestingly, 'ซึ่ง' does not distinguish between animate and inanimate or between people and objects, unlike English relative pronouns.",
    "formation": "Subject + Verb + ซึ่ง + Subordinate clause",
    "examples": [
      {
        "th": "ทัวร์ที่ ฉัน เลือก ซึ่ง ไป แวะ ที่ หลาย สถานที่ ท่องเที่ยว สำหรับ คน รัก ธรรมชาติ",
        "romaji": "Tua thi chan leuak sûeng pai wae thi lai sathan thi tong tiao sam-rap khon rak thamma-chat",
        "en": "The tour I chose, which visits many tourist spots for nature lovers.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_who_relative_pronoun_20231230_ทัวร์ที่_ฉัน_เลือก_ซึ่ง_ไป_แวะ_ที่_หลาย_สถานที่_ท่องเที่ยว_สำหรับ_คน_รัก_ธรรมชาติ.mp3"
      },
      {
        "th": "นักเรียน ที่ จบ กวดวิชา นี้ ซึ่ง สามารถ เข้า มหาวิทยาลัย ด้วย คะแนน สูง",
        "romaji": "Nakrien thi job kuat wi cha nii sûeng sa-mart khao maha-wit-tha-ya-lai duay ka-naen sung",
        "en": "Student who graduated this tutoring course, who can enter the university with high scores.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_who_relative_pronoun_20231230_นักเรียน_ที่_จบ_กวดวิชา_นี้_ซึ่ง_สามารถ_เข้า_มหาวิทยาลัย_ด้วย_คะแนน_สูง.mp3"
      },
      {
        "th": "ฉัน ชื่นชอบ ลาก่อน ซึ่ง เป็น หนังสือ ที่ น่า สนใจ และ ท้าทาย",
        "romaji": "Chan chuen chaop la gon sûeng pen nang sue thi na son jai lae tha thai",
        "en": "I like 'Goodbye', which is an interesting and challenging book.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_who_relative_pronoun_20231230_ฉัน_ชื่นชอบ_ลาก่อน_ซึ่ง_เป็น_หนังสือ_ที่_น่า_สนใจ_และ_ท้าทาย.mp3"
      },
      {
        "th": "เขา กำลัง รอ บทวิจารณ์ จาก ลูกค้า ซึ่ง บริการ ที่ พวกเขา ให้",
        "romaji": "Khao kam lang ror bot wi-ja-nan jak luk kha sûeng bo-ri-kan thi phuak khao hai",
        "en": "They are awaiting a review from the customer who they served.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_who_relative_pronoun_20231230_เขา_กำลัง_รอ_บทวิจารณ์_จาก_ลูกค้า_ซึ่ง_บริการ_ที่_พวกเขา_ให้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "เมื่อไร (mûea rai) - When",
    "short_explanation": "Used to ask about a specific time; 'when'.",
    "long_explanation": "The term 'เมื่อไร (mûea rai)' is used in Thai to ask about a specific time similar to the English 'when'. It is placed at the end of questions to ask about the timing or scheduling of an event. The word is versatile and it can be utilized to inquire about a range of activities, occasions, or any time-bound entities.",
    "formation": "Question + เมื่อไร",
    "examples": [
      {
        "th": "คุณ จะ กลับ บ้าน เมื่อไร",
        "romaji": "Khun ja glap baan mûea rai",
        "en": "When will you return home?",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mûea_rai_-_When_20231230_คุณ_จะ_กลับ_บ้าน_เมื่อไร.mp3"
      },
      {
        "th": "ร้าน นี้ จะ เปิด ประตู เมื่อไร",
        "romaji": "Raan nee ja bpert pradoo mûea rai",
        "en": "When will this shop open?",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mûea_rai_-_When_20231230_ร้าน_นี้_จะ_เปิด_ประตู_เมื่อไร.mp3"
      },
      {
        "th": "วันเกิด ของ คุณ เป็น เมื่อไร",
        "romaji": "Wan gert kong khun pen mûea rai",
        "en": "When is your birthday?",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mûea_rai_-_When_20231230_วันเกิด_ของ_คุณ_เป็น_เมื่อไร.mp3"
      },
      {
        "th": "คุณ จะ จ่าย เงิน เมื่อไร",
        "romaji": "Khun ja jai ngern mûea rai",
        "en": "When will you pay the money?",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mûea_rai_-_When_20231230_คุณ_จะ_จ่าย_เงิน_เมื่อไร.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ประมาณ (pra-maan) - About, approximately",
    "short_explanation": "Used to indicate an approximation or estimate; 'about' or 'approximately'.",
    "long_explanation": "In Thai, 'ประมาณ (pra-maan)' isused to show that the subsequent number or measure is an estimate or approximation. This concept is similar to the English words 'about' or 'approximately'. It can be used with a variety of contexts, including time, quantity, size, or any other numerical measurements. Typically, it is used at the beginning of sentences or just in front of the estimated figure.",
    "formation": "ประมาณ + (Number/Quantity/Time/Size)",
    "examples": [
      {
        "th": "ฉัน อยู่ ที่ นี่ ประมาณ สาม วัน แล้ว",
        "romaji": "Chan yu thi ni pra-maan saam wan laew",
        "en": "I have been here for about three days.",
        "grammar_audio": "/audio/thai/grammar/s_ประมาณ_pra-maan_-_About_approximately_20231230_ฉัน_อยู่_ที่_นี่_ประมาณ_สาม_วัน_แล้ว.mp3"
      },
      {
        "th": "หนังสือ นี้ มี จำนวน หน้า ประมาณ ห้า เศษ ร้อย",
        "romaji": "Nang sue nee mee jam-nuan naa pra-maan ha sate roy",
        "en": "This book has approximately five hundred pages.",
        "grammar_audio": "/audio/thai/grammar/s_ประมาณ_pra-maan_-_About_approximately_20231230_หนังสือ_นี้_มี_จำนวน_หน้า_ประมาณ_ห้า_เศษ_ร้อย.mp3"
      },
      {
        "th": "เขา วัด ความ กว้าง ของ ห้อง ประมาณ สอง เมตร",
        "romaji": "Khao wat kwaam kwaang kong hong pra-maan song met",
        "en": "He measured the room to be approximately two meters wide.",
        "grammar_audio": "/audio/thai/grammar/s_ประมาณ_pra-maan_-_About_approximately_20231230_เขา_วัด_ความ_กว้าง_ของ_ห้อง_ประมาณ_สอง_เมตร.mp3"
      },
      {
        "th": "ค่า อาหาร สำหรับ แขก ประมาณ สิบ คน คือ ประมาณ ห้า พัน บาท",
        "romaji": "Khaa a-han sam-rap khaek pra-maan sip kon keu pra-maan ha phan baht",
        "en": "The cost of food for approximately ten guests is about five thousand baht.",
        "grammar_audio": "/audio/thai/grammar/s_ประมาณ_pra-maan_-_About_approximately_20231230_ค่า_อาหาร_สำหรับ_แขก_ประมาณ_สิบ_คน_คือ_ประมาณ_ห้า_พัน_บาท.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ระยะ (rá-yà) - Distance, period (of time)",
    "short_explanation": "Commonly used to indicate 'distance' or 'period of time'.",
    "long_explanation": "The term 'ระยะ (rá-yà)' is commonly used in Thai to express the concept of 'distance' or 'period of time'. Similar to the English words of 'distance' and 'duration', it allows us to specify how far apart two things are or how long a certain period lasts. It is usually prefaced by a noun or pronoun and followed by a description of the distance or time period.",
    "formation": "Noun or Pronoun + ระยะ + Description of Distance or Time Period",
    "examples": [
      {
        "th": "การ เดินทาง จาก บ้าน ของ ฉัน ไป สนามบิน ใช้เวลา ประมาณ หนึ่ง ระยะ",
        "romaji": "Kan den thang jak ban kong chan pai sanam bin chai-wela pra-man neung rá-yà",
        "en": "The journey from my house to the airport is about one period (distance of time).",
        "grammar_audio": "/audio/thai/grammar/s_ระยะ_rá-yà_-_Distance_period_of_time_20231230_การ_เดินทาง_จาก_บ้าน_ของ_ฉัน_ไป_สนามบิน_ใช้เวลา_ประมาณ_หนึ่ง_ระยะ.mp3"
      },
      {
        "th": "ฉัน ยัง รู้สึก สะเทือนใจ ทุก ครั้ง ที่ ต้อง เดิน ผ่าน ระยะ ทาง ที่ สูง และ ลาดชัน",
        "romaji": "Chan yang rue-suek sa-thuen-jai thuk krang thi thong dern phan rá-yà thang thi sung lae la-dan",
        "en": "I am still shaken every time I have to walk a distance (of physical space) that is high and steep.",
        "grammar_audio": "/audio/thai/grammar/s_ระยะ_rá-yà_-_Distance_period_of_time_20231230_ฉัน_ยัง_รู้สึก_สะเทือนใจ_ทุก_ครั้ง_ที่_ต้อง_เดิน_ผ่าน_ระยะ_ทาง_ที่_สูง_และ_ลาดชัน.mp3"
      },
      {
        "th": "เธอ อยู่ ที่ ระยะ ทาง ห่างเหิน จาก ที่ฉัน อยู่",
        "romaji": "Thoe yoo thi rá-yà thang hang-hen jak thi chan yoo",
        "en": "She is at a distance far away from where I am.",
        "grammar_audio": "/audio/thai/grammar/s_ระยะ_rá-yà_-_Distance_period_of_time_20231230_เธอ_อยู่_ที่_ระยะ_ทาง_ห่างเหิน_จาก_ที่ฉัน_อยู่.mp3"
      },
      {
        "th": "ฉัน ต้อง ฝึกซ้อม อย่าง หนัก เพื่อ เป็น นักแข่งขัน วิ่ง ระยะ ยาว",
        "romaji": "Chan thong feuk-som yang nak phuea pen nak-khaeng-kan wing rá-yà yao",
        "en": "I have to train hard to be a long-distance runner.",
        "grammar_audio": "/audio/thai/grammar/s_ระยะ_rá-yà_-_Distance_period_of_time_20231230_ฉัน_ต้อง_ฝึกซ้อม_อย่าง_หนัก_เพื่อ_เป็น_นักแข่งขัน_วิ่ง_ระยะ_ยาว.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "เปลี่ยน (plìian) - To change, to alter",
    "short_explanation": "Used to express the action of making something different; 'to change', 'to alter'.",
    "long_explanation": "The term 'เปลี่ยน (plìian)' is used in Thai language to express the action of making something different, or causing it to become different. This is equivalent to the English 'to change' or 'to alter'. It can be used in various contexts, whether it's about changing clothes, changing one's mind, or other instances that denote something becoming different than it was.",
    "formation": "Subject + เปลี่ยน + Object",
    "examples": [
      {
        "th": "ใน คืนนั้น ฉัน รู้สึก ว่า ชีวิต ของ ฉัน เปลี่ยน ไป",
        "romaji": "Nai kheun nun, chan ru suke wa chiwit kong chan plìian pai",
        "en": "That night, I felt my life had changed.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_plìian_-_To_change_to_alter_20231230_ใน_คืนนั้น_ฉัน_รู้สึก_ว่า_ชีวิต_ของ_ฉัน_เปลี่ยน_ไป.mp3"
      },
      {
        "th": "เธอ สามารถ เปลี่ยน การ คิด ของ ฉัน ได้",
        "romaji": "Thoe sa-marht plìian kan khit kong chan dai",
        "en": "You can change my way of thinking.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_plìian_-_To_change_to_alter_20231230_เธอ_สามารถ_เปลี่ยน_การ_คิด_ของ_ฉัน_ได้.mp3"
      },
      {
        "th": "เขา ต้อง เปลี่ยน เสื้อ ที่ ชื้น เปียก จาก ฝน",
        "romaji": "Khao tong plìian seu thi chuen piak jak fohn",
        "en": "He needs to change his shirt that got wet from the rain.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_plìian_-_To_change_to_alter_20231230_เขา_ต้อง_เปลี่ยน_เสื้อ_ที่_ชื้น_เปียก_จาก_ฝน.mp3"
      },
      {
        "th": "อย่า สํานึก ว่า ถ้า คุณ เปลี่ยน ตัวเอง คนอื่น จะ เปลี่ยน ความ คิด ได้",
        "romaji": "Yah sam nuke wa tha khun plìian tua eng, khon eun ja plìian khwam khit dai",
        "en": "Don't think that if you change yourself, others can change their minds.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_plìian_-_To_change_to_alter_20231230_อย่า_สํานึก_ว่า_ถ้า_คุณ_เปลี่ยน_ตัวเอง_คนอื่น_จะ_เปลี่ยน_ความ_คิด_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แทน (thæn) - Instead",
    "short_explanation": "Used to express substitution, 'instead of'.",
    "long_explanation": "The term 'แทน (thæn)' is commonly used in Thai language to express the idea of 'instead of' or substitution. It is typically used in the form of 'แทนที่...จะ...' (thæn thi...ja...) to indicate that one action or thing is a substitute for another action or thing. Less commonly, it can also be used without 'จะ' (ja) to emphasize the contrast between the two actions or things. In these cases, it is always placed at the beginning of the sentence.",
    "formation": "'แทนที่' + action/thing to be replaced + 'จะ' + action/thing that replaces",
    "examples": [
      {
        "th": "แทนที่ จะ กิน ของหวาน, เธอ เลือก ทาน ผลไม้ แทน",
        "romaji": "Thæn thi ja gin kong wan, thoe lueak thaan phonlamai thæn",
        "en": "Instead of eating sweets, she chooses to eat fruit.",
        "grammar_audio": "/audio/thai/grammar/s_แทน_thæn_-_Instead_20231230_แทนที่_จะ_กิน_ของหวาน_เธอ_เลือก_ทาน_ผลไม้_แทน.mp3"
      },
      {
        "th": "แทนที่ จะ ไป เที่ยว ที่ ชายหาด, เรา ไป เที่ยว ที่ ดอย แทน",
        "romaji": "Thæn thi ja pai tiew thi chaay had, rao pai tiew thi doi thæn",
        "en": "Instead of going to the beach, we went to the mountains.",
        "grammar_audio": "/audio/thai/grammar/s_แทน_thæn_-_Instead_20231230_แทนที่_จะ_ไป_เที่ยว_ที่_ชายหาด_เรา_ไป_เที่ยว_ที่_ดอย_แทน.mp3"
      },
      {
        "th": "แทนที่ จะ ปล่อย วันหยุด เป็น เวลา ที่ สูญเปล่า, เขา ศึกษา ภาษาอังกฤษ แทน",
        "romaji": "Thæn thi ja ploi wan yut pen welaa thi suan plao, khao sueksaa phasa angkrit thæn",
        "en": "Instead of wasting his holidays, he studied English.",
        "grammar_audio": "/audio/thai/grammar/s_แทน_thæn_-_Instead_20231230_แทนที่_จะ_ปล่อย_วันหยุด_เป็น_เวลา_ที่_สูญเปล่า_เขา_ศึกษา_ภาษาอังกฤษ_แทน.mp3"
      },
      {
        "th": "แทนที่ จะ ใช้ เงิน ซื้อ ของเล่น ให้ น้อง ของ ฉัน, ฉัน ซื้อ หนังสือ แทน",
        "romaji": "Thæn thi ja chai ngern sue kong len hai nong kong chan, chan sue nangsue thæn",
        "en": "Instead of using money to buy toys for my little brother, I bought books instead.",
        "grammar_audio": "/audio/thai/grammar/s_แทน_thæn_-_Instead_20231230_แทนที่_จะ_ใช้_เงิน_ซื้อ_ของเล่น_ให้_น้อง_ของ_ฉัน_ฉัน_ซื้อ_หนังสือ_แทน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "จนกว่า (jon kwâa) - Until (specific condition is met)",
    "short_explanation": "Indicates the continuation or persistence of an action or state up to a particular condition or point in time; 'until' in English.",
    "long_explanation": "The phrase 'จนกว่า (jon kwâa)' is often used in Thai to denote the continuation of an action or state until a certain condition is met or a point in time is reached. It is typically used in conjunction with verbs and statements to form causal and conditional sentences. The structure is often 'action or state + จนกว่า + condition'",
    "formation": "Action/State + จนกว่า + Condition",
    "examples": [
      {
        "th": "เธอ หยุด ไม่ พูด จนกว่า กิน ข้าว เสร็จ",
        "romaji": "Thoe yut mai pood jon kwâa gin khao set",
        "en": "You didn't stop talking until you finished eating.",
        "grammar_audio": "/audio/thai/grammar/s_จนกว่า_jon_kwâa_-_Until_specific_condition_is_met_20231230_เธอ_หยุด_ไม่_พูด_จนกว่า_กิน_ข้าว_เสร็จ.mp3"
      },
      {
        "th": "เขา อ่าน หนังสือ ตลอด คืน จนกว่า รู้ ทุก คำ",
        "romaji": "Khao an nang-seu tlot khuen jon kwâa ru thuk kham",
        "en": "He read the book all night until he knew every word.",
        "grammar_audio": "/audio/thai/grammar/s_จนกว่า_jon_kwâa_-_Until_specific_condition_is_met_20231230_เขา_อ่าน_หนังสือ_ตลอด_คืน_จนกว่า_รู้_ทุก_คำ.mp3"
      },
      {
        "th": "ฉัน ขับ รถ ไป ที่ ผู้ใหญ่ บ้าน จนกว่า ถึง ที่ หมาย",
        "romaji": "Chan khap rot pai thi phu-yai ban jon kwâa theung thi maai",
        "en": "I drove to the elder's house until I reached the destination.",
        "grammar_audio": "/audio/thai/grammar/s_จนกว่า_jon_kwâa_-_Until_specific_condition_is_met_20231230_ฉัน_ขับ_รถ_ไป_ที่_ผู้ใหญ่_บ้าน_จนกว่า_ถึง_ที่_หมาย.mp3"
      },
      {
        "th": "เขา ทำงาน อย่าง หนัก จนกว่า ทำ ให้ สำเร็จ",
        "romaji": "Khao tham-ngan yang nak jon kwâa tam hai samret",
        "en": "He worked very hard until he succeeded.",
        "grammar_audio": "/audio/thai/grammar/s_จนกว่า_jon_kwâa_-_Until_specific_condition_is_met_20231230_เขา_ทำงาน_อย่าง_หนัก_จนกว่า_ทำ_ให้_สำเร็จ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ทั้ง (tháng) - Both, all, entire",
    "short_explanation": "Indicates inclusion of all elements or participants in a group; 'both', 'all', 'entire' in English.",
    "long_explanation": "The term 'ทั้ง (tháng)' is generally used in Thai to express the inclusion of all elements in a group or set, very much similar to English 'both', 'all', or 'entire'. When used with a verb, it emphasizes the action extends to all members of a group or the entirety of something. When used before nouns, adjectives, or pronouns, 'ทั้ง' equates to the English term 'both' and refers to all the items or everyone in a group without exception.",
    "formation": "ทั้ง + noun/pronoun/verb",
    "examples": [
      {
        "th": "ทั้ง น้ำ และ น้ำแข็ง ทั้ง สอง ถูก ใช้ ใน การ ทำ ค็อกเทล",
        "romaji": "tháng nam lae nam khaeng tháng song thuk chai nai kan tham kokteil",
        "en": "Both water and ice are used in making cocktails.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้ง_tháng_-_Both_all_entire_20231230_ทั้ง_น้ำ_และ_น้ำแข็ง_ทั้ง_สอง_ถูก_ใช้_ใน_การ_ทำ_ค็อกเทล.mp3"
      },
      {
        "th": "เขา ทั้ง สอง ได้ รับ ประทาน อาหาร ทั้ง หมด ที่ หน้า ต่าง ที่ มอง ออก ไป รับ ลม สด",
        "romaji": "khao tháng song dai rap prathan a-han tháng mot thi na tang thi mong ok pai rap lom sot",
        "en": "Both of them ate all the food at a window looking out to the fresh air.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้ง_tháng_-_Both_all_entire_20231230_เขา_ทั้ง_สอง_ได้_รับ_ประทาน_อาหาร_ทั้ง_หมด_ที่_หน้า_ต่าง_ที่_มอง_ออก_ไป_รับ_ลม_สด.mp3"
      },
      {
        "th": "เธอ ทั้ง สอง ดู คนละครึ่ง ส่วน ของ หนังสือ ทั้งหมด",
        "romaji": "thoe tháng song du kon-la-khrung suan khong nangsue tháng mot",
        "en": "Both of them are looking at half of the entire book.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้ง_tháng_-_Both_all_entire_20231230_เธอ_ทั้ง_สอง_ดู_คนละครึ่ง_ส่วน_ของ_หนังสือ_ทั้งหมด.mp3"
      },
      {
        "th": "ทั้ง พ่อ และ แม่ ของ เขา ทั้ง สอง เที่ยว ไป ทั่ว โลก",
        "romaji": "tháng phor lae mae khong khao tháng song thiaw pai thua lok",
        "en": "Both his father and mother travel around the world.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้ง_tháng_-_Both_all_entire_20231230_ทั้ง_พ่อ_และ_แม่_ของ_เขา_ทั้ง_สอง_เที่ยว_ไป_ทั่ว_โลก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แต่ง (dtɛ̀ɛng) - To decorate / Forming words",
    "short_explanation": "It means 'to decorate' and is also used to refer to forming words with certain prefixes or suffixes.",
    "long_explanation": "The term 'แต่ง (dtɛ̀ɛng)' in Thai is primarily used to denote 'to decorate' or to make something more attractive. It may refer to decorating a room, a cake, a person, etc. When we talk about language, 'แต่ง' also refers to forming words using certain prefixes or suffixes. It does not completely change the original meaning but adds some extra notion or emphasizes certain aspects.",
    "formation": "Statement + แต่ง",
    "examples": [
      {
        "th": "เธอ แต่ง ห้องนอน ด้วย ดอกไม้ สวยๆ และ โคมไฟ เล็กๆ",
        "romaji": "Thoe dtɛ̀ɛng hong non duay dok mai suay suay lae khom fai lek lek",
        "en": "She decorated the bedroom with beautiful flowers and small lamps.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ง_dtɛ̀ɛng_-_To_decorate_/_Forming_words_20231230_เธอ_แต่ง_ห้องนอน_ด้วย_ดอกไม้_สวยๆ_และ_โคมไฟ_เล็กๆ.mp3"
      },
      {
        "th": "ฉัน ชอบ คำ ที่ เขา แต่ง ออกมา มัน ทำให้ จดหมาย ดู พิเศษ มาก",
        "romaji": "Chan chop kham thi khao dtɛ̀ɛng aok ma, man tam hai jod maai du pi-set mak",
        "en": "I like the words that he forms; it makes the letter look very special.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ง_dtɛ̀ɛng_-_To_decorate_/_Forming_words_20231230_ฉัน_ชอบ_คำ_ที่_เขา_แต่ง_ออกมา_มัน_ทำให้_จดหมาย_ดู_พิเศษ_มาก.mp3"
      },
      {
        "th": "แม่ ชอบ แต่ง ตัว ด้วย เสื้อผ้า ที่ มี ลาย ดอกไม้",
        "romaji": "Mae chop dtɛ̀ɛng tua duay seu pha thi mee lai dok mai",
        "en": "My mother likes to dress up in clothes with floral prints.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ง_dtɛ̀ɛng_-_To_decorate_/_Forming_words_20231230_แม่_ชอบ_แต่ง_ตัว_ด้วย_เสื้อผ้า_ที่_มี_ลาย_ดอกไม้.mp3"
      },
      {
        "th": "คำ ที่ สร้าง ขึ้น จาก การ แต่ง ช่วย ให้ เรื่องราว ซับซ้อน มาก ขึ้น",
        "romaji": "Kham thi sang kheun jak kan dtɛ̀ɛng chuay hai rueang rao sap son mak kheun",
        "en": "The words created from forming help to make the story more complex.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ง_dtɛ̀ɛng_-_To_decorate_/_Forming_words_20231230_คำ_ที่_สร้าง_ขึ้น_จาก_การ_แต่ง_ช่วย_ให้_เรื่องราว_ซับซ้อน_มาก_ขึ้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ร่วม (rûam) - Together, to participate",
    "short_explanation": "Expresses the idea of doing something collectively or to participate in an action together with others.",
    "long_explanation": "The word 'ร่วม (rûam)' is used a lot in Thai to communicate the concept of doing something together with others, or of participation in an activity or event. Placed before verbs, it gives the added sense of joint or cooperative action, similar to the English word 'together'. It can also be used with a range of activities to group people in a common task or engagement.",
    "formation": "'ร่วม' + Verb",
    "examples": [
      {
        "th": "เขา ร่วม ทำ งานกับ เรา ใน โครงการ นี้",
        "romaji": "Khao rûam tham ngan kap rao nai krohng-gan nee",
        "en": "He is working together with us on this project.",
        "grammar_audio": "/audio/thai/grammar/s_ร่วม_rûam_-_Together_to_participate_20231230_เขา_ร่วม_ทำ_งานกับ_เรา_ใน_โครงการ_นี้.mp3"
      },
      {
        "th": "ฉัน ชอบ ร่วม สนุกสนาน กับ เพื่อน ๆ ใน งานปาร์ตี้",
        "romaji": "Chan chorp rûam sanuk-sanarn kap pheuan pheuan nai ngan paarty",
        "en": "I like to have fun together with friends at parties.",
        "grammar_audio": "/audio/thai/grammar/s_ร่วม_rûam_-_Together_to_participate_20231230_ฉัน_ชอบ_ร่วม_สนุกสนาน_กับ_เพื่อน_ๆ_ใน_งานปาร์ตี้.mp3"
      },
      {
        "th": "เรา ทั้ง หมู่ เป็น ทีม ที่ ดี และ ร่วม กัน ทำงาน อย่าง มืออาชีพ",
        "romaji": "Rao thang mu pen team thi di lae rûam gan tham-ngan yang mue-aa-chêep",
        "en": "We are a good team and work together professionally.",
        "grammar_audio": "/audio/thai/grammar/s_ร่วม_rûam_-_Together_to_participate_20231230_เรา_ทั้ง_หมู่_เป็น_ทีม_ที่_ดี_และ_ร่วม_กัน_ทำงาน_อย่าง_มืออาชีพ.mp3"
      },
      {
        "th": "พวกเขา ตัดสินใจ ร่วม ซื้อ บ้าน และ อาศัย อยู่ ด้วยกัน",
        "romaji": "Phuak khao tat sin jai rûam seu baan lae a-sai yu duay gan",
        "en": "They decided to buy a house together and live together.",
        "grammar_audio": "/audio/thai/grammar/s_ร่วม_rûam_-_Together_to_participate_20231230_พวกเขา_ตัดสินใจ_ร่วม_ซื้อ_บ้าน_และ_อาศัย_อยู่_ด้วยกัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แสดง (sǎ-daeng) - To show, to indicate",
    "short_explanation": "Indicates the action of showing or indicating something, an opinion, or an emotion.",
    "long_explanation": "The verb 'แสดง (sǎ-daeng)' is used in Thai to show or indicate something, whether it's an object, an opinion, or an emotion. It can be used in a variety of contexts and can be paired with various nouns and adjectives. It is typically placed before the noun or idea that is being shown or indicated.",
    "formation": "แสดง + [Object/Opinion/Emotion]",
    "examples": [
      {
        "th": "คุณ สามารถ แสดง ความคิดเห็น ของ คุณ โดย เขียน ลง ใน หนังสือ",
        "romaji": "Khun sa maat sǎ-daeng khwaam khit hen kong khun doy khiian long nai nang seu",
        "en": "You can show your opinion by writing it in the book.",
        "grammar_audio": "/audio/thai/grammar/s_แสดง_sǎ-daeng_-_To_show_to_indicate_20231230_คุณ_สามารถ_แสดง_ความคิดเห็น_ของ_คุณ_โดย_เขียน_ลง_ใน_หนังสือ.mp3"
      },
      {
        "th": "เธอ แสดง ความสุข โดย การ ยิ้ม อย่าง สดใส",
        "romaji": "Thoe sǎ-daeng khwaam sook doy kaan yim yaang sot sai",
        "en": "She shows her happiness by a bright smile.",
        "grammar_audio": "/audio/thai/grammar/s_แสดง_sǎ-daeng_-_To_show_to_indicate_20231230_เธอ_แสดง_ความสุข_โดย_การ_ยิ้ม_อย่าง_สดใส.mp3"
      },
      {
        "th": "ภาพ นี้ แสดง ถึง ความ เศร้า ของ ผู้ที่ สูญ เสีย รัก ใน ชีวิต",
        "romaji": "Phaap nee sǎ-daeng theung khwaam sao kong phuu thi sooon siia rak nai chee wit",
        "en": "This picture shows the sadness of someone who lost love in their life.",
        "grammar_audio": "/audio/thai/grammar/s_แสดง_sǎ-daeng_-_To_show_to_indicate_20231230_ภาพ_นี้_แสดง_ถึง_ความ_เศร้า_ของ_ผู้ที่_สูญ_เสีย_รัก_ใน_ชีวิต.mp3"
      },
      {
        "th": "ผู้แต่ง แสดง ความรู้สึก จาก การเขียน เรื่องราว ใน หนังสือ เล่ม นี้",
        "romaji": "Phuu dtaeng sǎ-daeng khwaam roo seuk jaak kaan khiian reuang raw nai nang seu lem nee",
        "en": "The author shows feelings through the story written in this book.",
        "grammar_audio": "/audio/thai/grammar/s_แสดง_sǎ-daeng_-_To_show_to_indicate_20231230_ผู้แต่ง_แสดง_ความรู้สึก_จาก_การเขียน_เรื่องราว_ใน_หนังสือ_เล่ม_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "โดย (dooi) - By, via",
    "short_explanation": "Used as a preposition indicating the method or means by which something is done.",
    "long_explanation": "The word 'โดย (dooi)' is used in Thai as a preposition to indicate the method or means through which something is accomplished or done. It is often used in sentences to describe the process, tool, or method used to achieve or do something. In context, it is close to the English prepositions 'by' or 'via'.",
    "formation": "[Action] + โดย + [Method/Means]",
    "examples": [
      {
        "th": "ฉัน ไป โรงเรียน โดย การ เดินทาง ด้วย รถ ประจำทาง",
        "romaji": "Chan pai roong rian dooi gan dern thaang duay rot pra jam thaang",
        "en": "I go to school by travelling by bus.",
        "grammar_audio": "/audio/thai/grammar/s_โดย_dooi_-_By_via_20231230_ฉัน_ไป_โรงเรียน_โดย_การ_เดินทาง_ด้วย_รถ_ประจำทาง.mp3"
      },
      {
        "th": "ผม เรียน ภาษา ไทย โดย การ ฝึก ทุก วัน",
        "romaji": "Phom rien paasaa thai dooi gan feuk took wan",
        "en": "I learn Thai by practicing every day.",
        "grammar_audio": "/audio/thai/grammar/s_โดย_dooi_-_By_via_20231230_ผม_เรียน_ภาษา_ไทย_โดย_การ_ฝึก_ทุก_วัน.mp3"
      },
      {
        "th": "เขา ทำ อาหาร โดย การ ใช้ สูตร ที่ ถูก ส่ง มา จาก แม่ ของ เขา",
        "romaji": "Khao tam a-haan dooi gan chai soot thi tuuk song maa jaak mae kong khao",
        "en": "He cooks food by using the recipe sent by his mother.",
        "grammar_audio": "/audio/thai/grammar/s_โดย_dooi_-_By_via_20231230_เขา_ทำ_อาหาร_โดย_การ_ใช้_สูตร_ที่_ถูก_ส่ง_มา_จาก_แม่_ของ_เขา.mp3"
      },
      {
        "th": "ไฟฟ้า ถูก ผลิต ขึ้น โดย การ เผา ถ่านหิน",
        "romaji": "Fai fa thuuk plit kheun dooi gan phao than hin",
        "en": "Electricity is produced by burning coal.",
        "grammar_audio": "/audio/thai/grammar/s_โดย_dooi_-_By_via_20231230_ไฟฟ้า_ถูก_ผลิต_ขึ้น_โดย_การ_เผา_ถ่านหิน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ซึ่งกันและกัน (sûeng gan láe gan) - Each other, one another",
    "short_explanation": "This term is used for mutual or reciprocal actions.",
    "long_explanation": "The phrase 'ซึ่งกันและกัน (sûeng gan láe gan)' is used in Thai to convey the concept of mutuality or reciprocality, similar to 'each other' or 'one another' in English. It is typically used in sentences that describe actions that are performed by two or more subjects towards each other. It is often placed after the action verb for clarity.",
    "formation": "Subject + Verb + ซึ่งกันและกัน",
    "examples": [
      {
        "th": "ทั้งคู่ มอง หน้า ซึ่งกันและกัน ด้วย รอยยิ้ม",
        "romaji": "Thang khûu mong na sûeng gan láe gan duay roi yim",
        "en": "They both looked at each other with smiles.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sûeng_gan_láe_gan_-_Each_other_one_another_20231230_ทั้งคู่_มอง_หน้า_ซึ่งกันและกัน_ด้วย_รอยยิ้ม.mp3"
      },
      {
        "th": "พวกเขา ร่วมมือ ซึ่งกันและกัน เพื่อ จัดทำ งาน ศิลปะ",
        "romaji": "phuak khao ruam mue sûeng gan láe gan phuea jat tam ngan sinlapa",
        "en": "They cooperated with each other to create the art work.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sûeng_gan_láe_gan_-_Each_other_one_another_20231230_พวกเขา_ร่วมมือ_ซึ่งกันและกัน_เพื่อ_จัดทำ_งาน_ศิลปะ.mp3"
      },
      {
        "th": "เด็ก ๆ ผ่าน ลูกบอล ซึ่งกันและกัน ใน การ เล่น ลูกบอล",
        "romaji": "dek dek phan luk bon sûeng gan láe gan nai kan len luk bon",
        "en": "The kids passed the ball to each other while playing football.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sûeng_gan_láe_gan_-_Each_other_one_another_20231230_เด็ก_ๆ_ผ่าน_ลูกบอล_ซึ่งกันและกัน_ใน_การ_เล่น_ลูกบอล.mp3"
      },
      {
        "th": "ทุกคน สร้าง ความทรงจำ ที่ ดี ซึ่งกันและกัน ใน งานปาร์ตี้ นี้",
        "romaji": "thuk khon sang khwam song jam thi di sûeng gan láe gan nai ngan paati ni",
        "en": "Everyone made good memories with each other at this party.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sûeng_gan_láe_gan_-_Each_other_one_another_20231230_ทุกคน_สร้าง_ความทรงจำ_ที่_ดี_ซึ่งกันและกัน_ใน_งานปาร์ตี้_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แค่ไหน (kâe nǎi) - How much/many (degree of an adjective)",
    "short_explanation": "In Thai, 'แค่ไหน (kâe nǎi)' is used to ask about the degree or extent of something. It is similar to the English 'how much' or 'how many'.",
    "long_explanation": "The phrase 'แค่ไหน (kâe nǎi)' is used to inquire about the degree or extent to which a certain condition or quality is available or applies. It can be used with adjectives and is often included in questions. When used in a sentence, it commonly follows the adjective or verb it is measuring. This grammar point is akin to asking 'how much' or 'how many' in English when referring to the intensity or degree of an adjective. It adds a level of detail and specificity to the question being asked.",
    "formation": "Adjective/Verb + แค่ไหน",
    "examples": [
      {
        "th": "เธอ รัก ฉัน แค่ไหน",
        "romaji": "Thoe rak chan kâe nǎi",
        "en": "How much do you love me?",
        "grammar_audio": "/audio/thai/grammar/s_แค่ไหน_kâe_nǎi_-_How_much/many_degree_of_an_adjective_20231230_เธอ_รัก_ฉัน_แค่ไหน.mp3"
      },
      {
        "th": "รถ คัน นี้ แพง แค่ไหน",
        "romaji": "Rot kan nii paeng kâe nǎi",
        "en": "How expensive is this car?",
        "grammar_audio": "/audio/thai/grammar/s_แค่ไหน_kâe_nǎi_-_How_much/many_degree_of_an_adjective_20231230_รถ_คัน_นี้_แพง_แค่ไหน.mp3"
      },
      {
        "th": "คุณ ยินดี ที่ได้ พบ ฉัน แค่ไหน",
        "romaji": "Kun yin di thi dai phop chan kâe nǎi",
        "en": "How happy are you to meet me?",
        "grammar_audio": "/audio/thai/grammar/s_แค่ไหน_kâe_nǎi_-_How_much/many_degree_of_an_adjective_20231230_คุณ_ยินดี_ที่ได้_พบ_ฉัน_แค่ไหน.mp3"
      },
      {
        "th": "เรา ต้อง เดินทาง ไกล แค่ไหน ถึง จะ ถึง ที่ หมาย",
        "romaji": "Rao tong deon tang klai kâe nǎi theung ja theung thi mhai",
        "en": "How far do we have to travel to reach our destination?",
        "grammar_audio": "/audio/thai/grammar/s_แค่ไหน_kâe_nǎi_-_How_much/many_degree_of_an_adjective_20231230_เรา_ต้อง_เดินทาง_ไกล_แค่ไหน_ถึง_จะ_ถึง_ที่_หมาย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ขณะ (khà-nà) - Moment, time, during",
    "short_explanation": "'ขณะ' in Thai is used to denote the English equivalents of 'moment', 'time', or 'during'. It describes a specific point in time or the duration of an event.",
    "long_explanation": "The Thai word 'ขณะ' (khà-nà) is a versatile term that is often used in different contexts to describe a specific time, moment, or the duration of an action or event. In English, this can be translated to 'moment', 'time', or 'during'. It is commonly used at the beginning of a sentence and can be used with a variety of verbs to indicate the time an action takes place or the duration of an event.",
    "formation": "ขณะ + action or event",
    "examples": [
      {
        "th": "ขณะ ที่ ฉัน กำลัง เดิน อยู่ ที่ สวนสาธารณะ ฉัน ได้ เห็น นก สวยๆ",
        "romaji": "Kha-na thi chan kam-lang deun yu thi suan-sa-tha-ranik, chan dai hen nok suay suay",
        "en": "While I was walking in the park, I saw a beautiful bird.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะ_khà-nà_-_Moment_time_during_20231230_ขณะ_ที่_ฉัน_กำลัง_เดิน_อยู่_ที่_สวนสาธารณะ_ฉัน_ได้_เห็น_นก_สวยๆ.mp3"
      },
      {
        "th": "ขณะ ที่ เธอ กำลัง ปรุง อาหาร ฉัน ได้ ช่วย อ่าน สูตร ให้ เธอ",
        "romaji": "Kha-na thi thoe kam-lang prung a-han, chan dai chuai an suan hai thoe",
        "en": "While she was cooking, I helped her by reading the recipe.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะ_khà-nà_-_Moment_time_during_20231230_ขณะ_ที่_เธอ_กำลัง_ปรุง_อาหาร_ฉัน_ได้_ช่วย_อ่าน_สูตร_ให้_เธอ.mp3"
      },
      {
        "th": "ขณะ ที่ ฝน ตก ฉัน ก็ ยัง ต้อง ไป ทำงาน",
        "romaji": "Kha-na thi fohn tok, chan gor yang tong pai tham-ngan",
        "en": "Even when it's raining, I still have to go to work.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะ_khà-nà_-_Moment_time_during_20231230_ขณะ_ที่_ฝน_ตก_ฉัน_ก็_ยัง_ต้อง_ไป_ทำงาน.mp3"
      },
      {
        "th": "ขณะ ที่ เขา กำลัง อ่าน หนังสือ ฉัน ก็ ได้ ฟัง เพลง",
        "romaji": "Kha-na thi khao kam-lang an nang-sue, chan gor dai fang pleng",
        "en": "While he was reading a book, I was listening to music.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะ_khà-nà_-_Moment_time_during_20231230_ขณะ_ที่_เขา_กำลัง_อ่าน_หนังสือ_ฉัน_ก็_ได้_ฟัง_เพลง.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "ว่า (wâa) - Quotation marker; used to introduce reported speech",
    "short_explanation": "Used to introduce reported speech or thought.",
    "long_explanation": "The term 'ว่า (wâa)' is commonly used in Thai to introduce reported speech or thoughts. It is similar to English 'that' in indirect speech. You can use it to report what someone else has previously said, or to express your own thoughts in speech. The typical sentence structure is '(someone) say / think + ว่า + (what has been said or thought)'.",
    "formation": "Speaker / Thinker / Subject + Verb + ว่า + Statement",
    "examples": [
      {
        "th": "แม่ บอก ฉัน ว่า อย่า ลืม ทาน ยา",
        "romaji": "Mae bok chan wâa yaa leum than yaa",
        "en": "My mother told me not to forget to take medicine.",
        "grammar_audio": "/audio/thai/grammar/s_ว่า_wâa_-_Quotation_marker_used_to_introduce_reported_speech_20231230_แม่_บอก_ฉัน_ว่า_อย่า_ลืม_ทาน_ยา.mp3"
      },
      {
        "th": "ครู จึง บอก นักเรียน ว่า การ อ่าน หนังสือ เป็น สิ่ง ที่ จำเป็น",
        "romaji": "Khru jeung bok nakrian wâa kan aan nang sue pen sing thi jam pen",
        "en": "The teacher therefore told the students that reading books is necessary.",
        "grammar_audio": "/audio/thai/grammar/s_ว่า_wâa_-_Quotation_marker_used_to_introduce_reported_speech_20231230_ครู_จึง_บอก_นักเรียน_ว่า_การ_อ่าน_หนังสือ_เป็น_สิ่ง_ที่_จำเป็น.mp3"
      },
      {
        "th": "เขา คิด ว่า การ ทำ งาน นี้ ค่อนข้าง ยาก",
        "romaji": "Khao khit wâa kan tham ngan ni khon khaang yaak",
        "en": "He thinks that this job is quite difficult.",
        "grammar_audio": "/audio/thai/grammar/s_ว่า_wâa_-_Quotation_marker_used_to_introduce_reported_speech_20231230_เขา_คิด_ว่า_การ_ทำ_งาน_นี้_ค่อนข้าง_ยาก.mp3"
      },
      {
        "th": "ฉัน รู้สึก ว่า ฉัน พร้อม สำหรับ การ สอบ",
        "romaji": "Chan ru seuk wâa chan prom sambab kan sob",
        "en": "I feel that I am ready for the examination.",
        "grammar_audio": "/audio/thai/grammar/s_ว่า_wâa_-_Quotation_marker_used_to_introduce_reported_speech_20231230_ฉัน_รู้สึก_ว่า_ฉัน_พร้อม_สำหรับ_การ_สอบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "จึง (jeung) - Therefore, as a result",
    "short_explanation": "Used to express the cause-effect relationship between two statements; 'therefore' or 'as a result'.",
    "long_explanation": "The term 'จึง (jeung)' is commonly used in the Thai language and is similar to the English words 'therefore' or 'as a result'. It acts as a conjunction linking two sentences or clauses together, establishing a cause-effect relationship between them. Typically, it is placed at the beginning of the second clause to link it to the first clause, which states the reason or cause.",
    "formation": "Reason + จึง + Result",
    "examples": [
      {
        "th": "ฉัน เป็น แฟน ฟุตบอล จึง ชอบ ดู การ แข่งขัน บน ทีวี",
        "romaji": "Chan pen fan football jeung chob du kan kaeng kan bon TV",
        "en": "I am a football fan, therefore, I like to watch the matches on TV.",
        "grammar_audio": "/audio/thai/grammar/s_จึง_jeung_-_Therefore_as_a_result_20231230_ฉัน_เป็น_แฟน_ฟุตบอล_จึง_ชอบ_ดู_การ_แข่งขัน_บน_ทีวี.mp3"
      },
      {
        "th": "วันนี้ ฝนตก หนัก จึง ต้อง ยกเลิก การ จัด ปิกนิก",
        "romaji": "Wan ni fonn tok nak, jeung tong yok lek kan jat piknik",
        "en": "Today the rain is heavy, so the picnic has to be cancelled.",
        "grammar_audio": "/audio/thai/grammar/s_จึง_jeung_-_Therefore_as_a_result_20231230_วันนี้_ฝนตก_หนัก_จึง_ต้อง_ยกเลิก_การ_จัด_ปิกนิก.mp3"
      },
      {
        "th": "เขา ต้องการ หา งาน ที่ ผ่านอนูลูกจ้าง จึง ต้อง ศึกษา ให้ จบ มหาลัย",
        "romaji": "Khao tong gan ha ngan thi pan anu lok chang jeung tong suksa hai job mahalai",
        "en": "He wants to get a job that has employee benefits, therefore, he needs to graduate from university.",
        "grammar_audio": "/audio/thai/grammar/s_จึง_jeung_-_Therefore_as_a_result_20231230_เขา_ต้องการ_หา_งาน_ที่_ผ่านอนูลูกจ้าง_จึง_ต้อง_ศึกษา_ให้_จบ_มหาลัย.mp3"
      },
      {
        "th": "ฉัน ไม่ อยาก ทำ งาน ต่อจึง ตัดสินใจ พัก การ ทำงาน สัก พักฯ",
        "romaji": "Chan mai yak tam ngan tor, jeung tat sin jai pak kan tam ngan sak pak",
        "en": "I don't want to work anymore, so I have decided to take a break from work.",
        "grammar_audio": "/audio/thai/grammar/s_จึง_jeung_-_Therefore_as_a_result_20231230_ฉัน_ไม่_อยาก_ทำ_งาน_ต่อจึง_ตัดสินใจ_พัก_การ_ทำงาน_สัก_พักฯ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "25"
  },
  {
    "title": "แม้ว่า (mâe wâa) - Even though, although",
    "short_explanation": "Indicates a contrasting clause; 'even though' or 'although'.",
    "long_explanation": "The term 'แม้ว่า (mâe wâa)' is used in Thai to introduce a subordinate clause that states a fact or a condition, but it also implies that the main clause will contrast with this fact or condition. This is similar to the English 'even though' or 'although'. It is typically placed at the start of sentences to indicate that, despite the situation described in the clause that follows, the situation described in the main clause still holds true.",
    "formation": "แม้ว่า + Subordinate Clause + Main Clause",
    "examples": [
      {
        "th": "แม้ว่า ผม จะ อยู่ ไกล แต่ ผม ยังคง คิดถึง คุณ เสมอ",
        "romaji": "Mâe wâa phom ja yu glai, tae phom yang kong kit thung khun sà-mǒer",
        "en": "Even though I'm far away, I always miss you.",
        "grammar_audio": "/audio/thai/grammar/s_แม้ว่า_mâe_wâa_-_Even_though_although_20231230_แม้ว่า_ผม_จะ_อยู่_ไกล_แต่_ผม_ยังคง_คิดถึง_คุณ_เสมอ.mp3"
      },
      {
        "th": "แม้ว่า เขา จะ ยัง เล็ก แต่ เขา มี ความสามารถ ใน การ วาดภาพ ที่ ชั้นเยี่ยม",
        "romaji": "Mâe wâa khao ja yang lek tae khao mee khwaam saamaart nai gaan waat phaap thi chan yiam",
        "en": "Even though he is still young, he is excellent at drawing.",
        "grammar_audio": "/audio/thai/grammar/s_แม้ว่า_mâe_wâa_-_Even_though_although_20231230_แม้ว่า_เขา_จะ_ยัง_เล็ก_แต่_เขา_มี_ความสามารถ_ใน_การ_วาดภาพ_ที่_ชั้นเยี่ยม.mp3"
      },
      {
        "th": "แม้ว่า วันนี้ จะ ร้อน แต่ ผม ยังคง ไป เล่น ฟุตบอล",
        "romaji": "Mâe wâa wan ni ja ron, tae phom yang kong pai len footbon",
        "en": "Even though today is hot, I will still go play football.",
        "grammar_audio": "/audio/thai/grammar/s_แม้ว่า_mâe_wâa_-_Even_though_although_20231230_แม้ว่า_วันนี้_จะ_ร้อน_แต่_ผม_ยังคง_ไป_เล่น_ฟุตบอล.mp3"
      },
      {
        "th": "แม้ว่า ผม จะ ไม่ ชอบ รายวิชา นี้ แต่ ผม ต้อง พยายาม อ่าน เพื่อ สอบ",
        "romaji": "Mâe wâa phom ja mai chop rai wichaa ni tae phom tong pha ya yaam an phuea sob",
        "en": "Even though I don't like this subject, I have to try to read for the exam.",
        "grammar_audio": "/audio/thai/grammar/s_แม้ว่า_mâe_wâa_-_Even_though_although_20231230_แม้ว่า_ผม_จะ_ไม่_ชอบ_รายวิชา_นี้_แต่_ผม_ต้อง_พยายาม_อ่าน_เพื่อ_สอบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "เผื่อ (phèua) - In case, for the sake of",
    "short_explanation": "Expresses preparation for a possible future situation or an intention; 'in case', 'for the sake of'.",
    "long_explanation": "The term 'เผื่อ (phèua)' is frequently used in Thai language to denote preparation or anticipation for a possible future event or scenario, or to declare an intention. It carries the sense of 'in case' or 'for the sake of' in English. While it can be used with varying verb forms, phrases, and adjectives, it is generally placed at the start of a clause or a sentence to set the context or purpose for the subsequent action or state described.",
    "formation": "เผื่อ + Statement",
    "examples": [
      {
        "th": "เผื่อ ฉัน มา สาย ให้ คุณ ส่ง การ บ้าน ให้ ฉัน",
        "romaji": "Phèua chan ma sai, hai khun song kan baan hai chan",
        "en": "In case I come late, you can submit homework for me.",
        "grammar_audio": "/audio/thai/grammar/s_เผื่อ_phèua_-_In_case_for_the_sake_of_20231230_เผื่อ_ฉัน_มา_สาย_ให้_คุณ_ส่ง_การ_บ้าน_ให้_ฉัน.mp3"
      },
      {
        "th": "เขา ซื้อ ของ ที่ ญี่ปุ่น เผื่อ ส่ง การ ทำ งาน อีก สัปดาห์",
        "romaji": "Khao sue khong thi Yinipun phèua song kan tham ngan eek sapda",
        "en": "He buys things in Japan in case he has to work another week.",
        "grammar_audio": "/audio/thai/grammar/s_เผื่อ_phèua_-_In_case_for_the_sake_of_20231230_เขา_ซื้อ_ของ_ที่_ญี่ปุ่น_เผื่อ_ส่ง_การ_ทำ_งาน_อีก_สัปดาห์.mp3"
      },
      {
        "th": "ฉัน รับ อาหาร เผื่อ ครอบครัว กิน ใน บ่าย",
        "romaji": "Chan rap ahaan phèua khrop khrua gin nai bai",
        "en": "I order food in case the family wants to eat in the afternoon.",
        "grammar_audio": "/audio/thai/grammar/s_เผื่อ_phèua_-_In_case_for_the_sake_of_20231230_ฉัน_รับ_อาหาร_เผื่อ_ครอบครัว_กิน_ใน_บ่าย.mp3"
      },
      {
        "th": "เธอ ควร อ่าน หนังสือ เผื่อ ที่ ต้อง แข่งขัน เรื่อง ความรู้",
        "romaji": "Thoe khuan aan nang sue phèua thi tong khaeng kan reuang khwam roo",
        "en": "She should read books in case she has to compete in knowledge.",
        "grammar_audio": "/audio/thai/grammar/s_เผื่อ_phèua_-_In_case_for_the_sake_of_20231230_เธอ_ควร_อ่าน_หนังสือ_เผื่อ_ที่_ต้อง_แข่งขัน_เรื่อง_ความรู้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "อีก (ìik) - Again, more, another",
    "short_explanation": "'อีก (ìik)' is used in Thai to indicate repetition, addition, or a further amount of something. It can be translated into English as 'again', 'more' or 'another'.",
    "long_explanation": "In Thai, 'อีก (ìik)' is often used to express the idea of addition or repetition. It is commonly placed after a verb, a noun or an adjective, to imply 'again', 'another' or 'more'. It's a versatile word that can be used in various contexts to indicate an additional or further amount or extent of something, or the repeating of an action.",
    "formation": "verb/noun/adjective + อีก",
    "examples": [
      {
        "th": "ฉัน ต้องการ อีก แก้ว น้ำ หนึ่ง",
        "romaji": "Chan tongkan ìik gaeo nahm neung",
        "en": "I want another glass of water.",
        "grammar_audio": "/audio/thai/grammar/s_อีก_ìik_-_Again_more_another_20231230_ฉัน_ต้องการ_อีก_แก้ว_น้ำ_หนึ่ง.mp3"
      },
      {
        "th": "เธอ ต้อง ทำ การบ้าน อีก หลาย หน้า",
        "romaji": "Thoe tong tham ganbaan ìik lai na",
        "en": "You have to do several more pages of homework.",
        "grammar_audio": "/audio/thai/grammar/s_อีก_ìik_-_Again_more_another_20231230_เธอ_ต้อง_ทำ_การบ้าน_อีก_หลาย_หน้า.mp3"
      },
      {
        "th": "การ ทำงาน หนัก นี้ ทำให้ ฉัน รู้สึก จะ อ่อนเพลีย อีก",
        "romaji": "Gan tham-ngan nak ni tham hai chan ruu suk ja on-pliia ìik",
        "en": "This hard work makes me feel tired again.",
        "grammar_audio": "/audio/thai/grammar/s_อีก_ìik_-_Again_more_another_20231230_การ_ทำงาน_หนัก_นี้_ทำให้_ฉัน_รู้สึก_จะ_อ่อนเพลีย_อีก.mp3"
      },
      {
        "th": "ถ้า มึน แล้ว ควร นั่ง แปด นาที รส สตรอว์ แบ รี่ อีก",
        "romaji": "Tha muen laew khuan nang pad naa thee rod straw bae-rii ìik",
        "en": "If you're dizzy, you should sit for another 8 minutes and then taste the strawberry.",
        "grammar_audio": "/audio/thai/grammar/s_อีก_ìik_-_Again_more_another_20231230_ถ้า_มึน_แล้ว_ควร_นั่ง_แปด_นาที_รส_สตรอว์_แบ_รี่_อีก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ก่อน (gòrn) - Before",
    "short_explanation": "Indicates an action taking place before another; 'before'.",
    "long_explanation": "The term 'ก่อน (gòrn)' is a Thai word used to refer to an action that happens prior to another. In other words, it is equivalent to 'before' in English. Unlike English where 'before' can be positioned either at the beginning or end of a sentence, 'ก่อน' is usually placed at the end of a clause or sentence.",
    "formation": "Statement that explains what happened first + ก่อน + Statement that explains what happened next",
    "examples": [
      {
        "th": "ฉัน ต้อง ทำ การบ้าน ก่อน ที่ จะ ไป เล่น กับ เพื่อน",
        "romaji": "Chan tong tham kan baan gòrn thi ja pai len gab pheuan",
        "en": "I have to do my homework before I go to play with my friends.",
        "grammar_audio": "/audio/thai/grammar/s_ก่อน_gòrn_-_Before_20231230_ฉัน_ต้อง_ทำ_การบ้าน_ก่อน_ที่_จะ_ไป_เล่น_กับ_เพื่อน.mp3"
      },
      {
        "th": "เขา เตรียม เสื้อผ้า ก่อน ที่ จะ ไป ทำงาน",
        "romaji": "Khao triam seu pha gòrn thi ja pai tham ngan",
        "en": "He prepares his clothes before he goes to work.",
        "grammar_audio": "/audio/thai/grammar/s_ก่อน_gòrn_-_Before_20231230_เขา_เตรียม_เสื้อผ้า_ก่อน_ที่_จะ_ไป_ทำงาน.mp3"
      },
      {
        "th": "เธอ ต้อง ปิด ทีวี ก่อน ที่ จะ ไป นอน",
        "romaji": "Thoe tong pit ti vi gòrn thi ja pai non",
        "en": "She has to turn off the TV before going to bed.",
        "grammar_audio": "/audio/thai/grammar/s_ก่อน_gòrn_-_Before_20231230_เธอ_ต้อง_ปิด_ทีวี_ก่อน_ที่_จะ_ไป_นอน.mp3"
      },
      {
        "th": "พวกเรา ต้อง ซักพัก ก่อน ที่ จะ คืน การเป็น ใน การ ทำงาน",
        "romaji": "Phuak rao tong sak pak gòrn thi ja kheun kan pen nai kan tham ngan",
        "en": "We need to rest before returning to work.",
        "grammar_audio": "/audio/thai/grammar/s_ก่อน_gòrn_-_Before_20231230_พวกเรา_ต้อง_ซักพัก_ก่อน_ที่_จะ_คืน_การเป็น_ใน_การ_ทำงาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "หลังจาก (lǎng jàak) - After",
    "short_explanation": "Used to refer to the sequence of events, 'after'.",
    "long_explanation": "The term 'หลังจาก (lǎng jàak)' is commonly used in Thai to indicate the sequence of events, similar to the English 'after'. It is typically used at the start of a sentence or clause to show that the action in the main clause happened after the action in the clause that follows 'หลังจาก (lǎng jàak)'.",
    "formation": "'หลังจาก' + Clause 1, Main Clause",
    "examples": [
      {
        "th": "หลังจาก ที่ เขา กิน ข้าว เขา จึง ไป นอน",
        "romaji": "Lǎng jàak thi khao gin khao, khao jeung pai non",
        "en": "After he ate, he went to sleep.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจาก_lǎng_jàak_-_After_20231230_หลังจาก_ที่_เขา_กิน_ข้าว_เขา_จึง_ไป_นอน.mp3"
      },
      {
        "th": "หลังจาก ที่ เธอ ได้ รับ การ แต่งตั้ง ฉัน ได้ ส่ง ของ ขวัญ ให้ เธอ",
        "romaji": "Lǎng jàak thi thoe dai rap kan taeng tang, chan dai song khong khwan hai thoe.",
        "en": "After she got promoted, I sent her a gift.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจาก_lǎng_jàak_-_After_20231230_หลังจาก_ที่_เธอ_ได้_รับ_การ_แต่งตั้ง_ฉัน_ได้_ส่ง_ของ_ขวัญ_ให้_เธอ.mp3"
      },
      {
        "th": "หลังจาก ที่ ฝน หยุด ตก เรา ก็ ออก ไป เดิน เล่น",
        "romaji": "Lǎng jàak thi fon yut tok, rao ko otk pai deon len.",
        "en": "After the rain stopped, we went out for a walk.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจาก_lǎng_jàak_-_After_20231230_หลังจาก_ที่_ฝน_หยุด_ตก_เรา_ก็_ออก_ไป_เดิน_เล่น.mp3"
      },
      {
        "th": "หลังจาก ที่ ฉัน ทำ งาน จบ ฉัน จะ ซื้อ โทสัญญาณ มา กิน",
        "romaji": "Lǎng jàak thi chan tham ngan jop, chan ja sue tos sun yahn ma gin.",
        "en": "After I finish work, I will buy a sandwich to eat.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจาก_lǎng_jàak_-_After_20231230_หลังจาก_ที่_ฉัน_ทำ_งาน_จบ_ฉัน_จะ_ซื้อ_โทสัญญาณ_มา_กิน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ขณะนี้ (khà-nà níi) - Currently, at this moment",
    "short_explanation": "Indicates the present moment or current situation; 'currently' or 'at this moment'.",
    "long_explanation": "The term 'ขณะนี้ (khà-nà níi)' is frequently used in Thai language to refer to the present time or the existing state of affairs, similar to 'currently' or 'at this moment' in English. It's mostly used at the beginning or in the middle of a sentence to express the immediate timing of an action, condition, or event.",
    "formation": "ขณะนี้ + Statement",
    "examples": [
      {
        "th": "ขณะนี้ ฉัน กำลัง ศึกษา ภาษา ไทย ที่ มหาวิทยาลัย",
        "romaji": "Khà-nà níi chan kamlang seuk-saa phaasaa thai thi mahaawittayaalay",
        "en": "I am currently studying Thai at University.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนี้_khà-nà_níi_-_Currently_at_this_moment_20231230_ขณะนี้_ฉัน_กำลัง_ศึกษา_ภาษา_ไทย_ที่_มหาวิทยาลัย.mp3"
      },
      {
        "th": "ขณะนี้ พ่อแม่ ของ เขา มา กรุงเทพฯ ที่ ประเทศ ไทย",
        "romaji": "Khà-nà níi phor-mâae kong khao maa krung-thep thi prathes thai",
        "en": "His parents are in Bangkok, Thailand at the moment.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนี้_khà-nà_níi_-_Currently_at_this_moment_20231230_ขณะนี้_พ่อแม่_ของ_เขา_มา_กรุงเทพฯ_ที่_ประเทศ_ไทย.mp3"
      },
      {
        "th": "ตอนนี้, กองทัพ ที่ ขณะนี้ ต้องการ ความ ช่วยเหลือ เร่งด่วน",
        "romaji": "Ton-nií, kong-thap thi khà-nà níi tong-karn khwam chuay-leua reng-duan",
        "en": "The army currently needs urgent help.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนี้_khà-nà_níi_-_Currently_at_this_moment_20231230_ตอนนี้_กองทัพ_ที่_ขณะนี้_ต้องการ_ความ_ช่วยเหลือ_เร่งด่วน.mp3"
      },
      {
        "th": "ขณะนี้ ที่ ครู สอน ภาษา ไทย ให้ เรา",
        "romaji": "Khà-nà níi thi khruu son phaasaa thai hai rao",
        "en": "The teacher is currently teaching us Thai.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนี้_khà-nà_níi_-_Currently_at_this_moment_20231230_ขณะนี้_ที่_ครู_สอน_ภาษา_ไทย_ให้_เรา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ในที่สุด (nai thîi sùt) - Finally, at last",
    "short_explanation": "Indicates an action or state that arrives or is achieved after a long period or at the end of a process.",
    "long_explanation": "The term 'ในที่สุด (nai thîi sùt)' is used in Thai to express that something happens after a long time or as the result of a process or series of events. It is equivalent to the English phrases 'finally' or 'at last'. It is typically placed at the beginning of sentences but can also function within sentences, usually coming before verbs or verb phrases.",
    "formation": "ในที่สุด + Statement",
    "examples": [
      {
        "th": "ใน ที่ สุด ผม ได้ ทำ งาน สำเร็จ รูป แล้ว",
        "romaji": "Nai thîi sùt, phom dai tham ngan samret roop laeo",
        "en": "Finally, I have completed my work.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Finally_at_last_20231230_ใน_ที่_สุด_ผม_ได้_ทำ_งาน_สำเร็จ_รูป_แล้ว.mp3"
      },
      {
        "th": "หลังจาก ที่ พวกเรา ได้ ผ่าน ผู้หญิง หลาย คน ใน ที่ สุด เขา ได้ เจอ คู่ ชีวิต ที่ หมาย ปอง มา ตลอด ทั้ง ชีวิต",
        "romaji": "Lang jak thi phuak rao dai paen phu ying lai kon, nai thîi sùt, khao dai jae khu chiwit thi ham pong ma talot thang chiwit",
        "en": "After we went through many women, finally, he found the life partner he's been looking for throughout his life.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Finally_at_last_20231230_หลังจาก_ที่_พวกเรา_ได้_ผ่าน_ผู้หญิง_หลาย_คน_ใน_ที่_สุด_เขา_ได้_เจอ_คู่_ชีวิต_ที่_หมาย_ปอง_มา_ตลอด_ทั้ง_ชีวิต.mp3"
      },
      {
        "th": "ใน ที่ สุด ฤดู ร้อน ก็ มาถึง",
        "romaji": "Nai thîi sùt, reu do ron go ma thuang",
        "en": "Finally, the summer has arrived.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Finally_at_last_20231230_ใน_ที่_สุด_ฤดู_ร้อน_ก็_มาถึง.mp3"
      },
      {
        "th": "ใน ที่ สุด ฉัน ก็ มาถึง สถานที่ ที่ ฉัน ต้องการ",
        "romaji": "Nai thîi sùt, chan go ma thuang sa than thi thi chan tong kan",
        "en": "Finally, I arrived at the place I wanted to.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Finally_at_last_20231230_ใน_ที่_สุด_ฉัน_ก็_มาถึง_สถานที่_ที่_ฉัน_ต้องการ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ด้วยกัน (dûai gan) - Together",
    "short_explanation": "This is used to express 'together' or 'with' in Thai.",
    "long_explanation": "The phrase 'ด้วยกัน (dûai gan)' is a commonly used term in Thai language that expresses the idea of doing something together with someone else, or having something occur together with other things. It is typically used at the end of a sentence after a verb to indicate the collective or shared nature of an action. Also, it can be used in conjunction with expressions of location to denote that multiple things or people are in the same place together.",
    "formation": "Verb/Location + ด้วยกัน",
    "examples": [
      {
        "th": "เรา ทำงาน ด้วยกัน ที่ ออฟฟิศ ทุกวัน",
        "romaji": "Rao tham ngan dûai gan thi office thuk wan",
        "en": "We work together at the office every day.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûai_gan_-_Together_20231230_เรา_ทำงาน_ด้วยกัน_ที่_ออฟฟิศ_ทุกวัน.mp3"
      },
      {
        "th": "ทุกคน รวมตัว กัน มา กินข้าว ด้วยกัน",
        "romaji": "Thuk khon ruam tua gan ma kin khao dûai gan",
        "en": "Everyone came together to eat together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûai_gan_-_Together_20231230_ทุกคน_รวมตัว_กัน_มา_กินข้าว_ด้วยกัน.mp3"
      },
      {
        "th": "เขา และ เธอ ไป ปิกนิก ที่ สวน ด้วยกัน",
        "romaji": "Khao lae thoe pai pik nik thi suan dûai gan",
        "en": "He and she went to picnic in the park together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûai_gan_-_Together_20231230_เขา_และ_เธอ_ไป_ปิกนิก_ที่_สวน_ด้วยกัน.mp3"
      },
      {
        "th": "วันนี้ ทั้งครอบครัว มา ช้อปปิ้ง ที่ ห้าง ด้วยกัน",
        "romaji": "Wan ni tang khrop khrua ma chawp ping thi hâng dûai gan",
        "en": "Today, the whole family came to shop at the mall together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûai_gan_-_Together_20231230_วันนี้_ทั้งครอบครัว_มา_ช้อปปิ้ง_ที่_ห้าง_ด้วยกัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "เพื่อ (phʉ̂ʉa) - In order to, for the purpose of",
    "short_explanation": "Indicates 'for the purpose of' or 'in order to'.",
    "long_explanation": "The term 'เพื่อ (phʉ̂ʉa)' is frequently used in Thai to indicate purpose or the aim of an action, similar to the English 'in order to' or 'for the purpose of'. It is used to connect two phrases in a sentence, where the first phrase is the action and the second phrase is the intended outcome or purpose of that action. The structure is typically 'action + เพื่อ + purpose'.",
    "formation": "Action Phrase + เพื่อ + Purpose Phrase",
    "examples": [
      {
        "th": "ฉัน อ่าน หนังสือ เพื่อ เตรียมตัว สำหรับ การ สอบ",
        "romaji": "Chan aan nang-sue phʉ̂ʉa triam tua sam-rap gaan sàwp",
        "en": "I read a book in order to prepare for the exam.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อ_phʉ̂ʉa_-_In_order_to_for_the_purpose_of_20231230_ฉัน_อ่าน_หนังสือ_เพื่อ_เตรียมตัว_สำหรับ_การ_สอบ.mp3"
      },
      {
        "th": "เขา ทำ ความ สะอาด ห้อง เพื่อ รับเลี้ยง แขก",
        "romaji": "Khao tham khwaam sa-àat h̄ong phʉ̂ʉa ráp lîîyng khàek",
        "en": "He cleaned the room in order to host guests.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อ_phʉ̂ʉa_-_In_order_to_for_the_purpose_of_20231230_เขา_ทำ_ความ_สะอาด_ห้อง_เพื่อ_รับเลี้ยง_แขก.mp3"
      },
      {
        "th": "เธอ ออกกำลังกาย เพื่อ การ สุขภาพ ที่ ดี",
        "romaji": "Tho aok-kam-lang-gaai phʉ̂ʉa gaan su-kha-phāap thi di",
        "en": "She exercises in order to maintain good health.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อ_phʉ̂ʉa_-_In_order_to_for_the_purpose_of_20231230_เธอ_ออกกำลังกาย_เพื่อ_การ_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "เรา ทำงาน อย่าง หนัก เพื่อ สร้าง ชีวิต ที่ ดีขึ้น",
        "romaji": "Rao tham-ngan yang nak phʉ̂ʉa sâang chee-wít thi dîi kʉ̂n",
        "en": "We work hard in order to create a better life.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อ_phʉ̂ʉa_-_In_order_to_for_the_purpose_of_20231230_เรา_ทำงาน_อย่าง_หนัก_เพื่อ_สร้าง_ชีวิต_ที่_ดีขึ้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "รวมทั้ง (ruam tháng) - Including, as well as",
    "short_explanation": "Used to indicate 'including' or 'as well as' in a sentence.",
    "long_explanation": "The term 'รวมทั้ง (ruam tháng)' in Thai is used to mean 'including' or 'as well as'. It is used to add additional items or information in the sentence, similar to the English 'including' or 'as well as'. It is generally placed before the additional item or information that you want to include in your statement.",
    "formation": "Statement + รวมทั้ง + Additional Information",
    "examples": [
      {
        "th": "ฉัน ชอบ การ เล่น กีฬา รวมทั้ง ฟุตบอล บาสเกตบอล และ เทนนิส",
        "romaji": "Chan chorp kan len kee-la ruam tháng futbon basketbon lae tennis",
        "en": "I like playing sports including football, basketball, and tennis.",
        "grammar_audio": "/audio/thai/grammar/s_รวมทั้ง_ruam_tháng_-_Including_as_well_as_20231230_ฉัน_ชอบ_การ_เล่น_กีฬา_รวมทั้ง_ฟุตบอล_บาสเกตบอล_และ_เทนนิส.mp3"
      },
      {
        "th": "การ ท่องเที่ยว ที่ นี่ มี สิ่ง ที่น่าสนใจ มากมาย รวมทั้ง วัฒนธรรม อาหาร และ ประวัติศาสตร์",
        "romaji": "Kan thong thiao thi ni mee sing thi na son jai mak mai ruam tháng wat-tha-na-tham a-han lae pra-wat-sat",
        "en": "Traveling here has many interesting things including culture, food, and history.",
        "grammar_audio": "/audio/thai/grammar/s_รวมทั้ง_ruam_tháng_-_Including_as_well_as_20231230_การ_ท่องเที่ยว_ที่_นี่_มี_สิ่ง_ที่น่าสนใจ_มากมาย_รวมทั้ง_วัฒนธรรม_อาหาร_และ_ประวัติศาสตร์.mp3"
      },
      {
        "th": "ฉัน คิดถึง บ้านเกิด ของ ฉัน รวมทั้ง คุณยาย และ พี่สาว ของ ฉัน",
        "romaji": "Chan kit teung baan geert kong chan ruam tháng khun yai lae pi sao kong chan",
        "en": "I miss my hometown including my grandmother and my sister.",
        "grammar_audio": "/audio/thai/grammar/s_รวมทั้ง_ruam_tháng_-_Including_as_well_as_20231230_ฉัน_คิดถึง_บ้านเกิด_ของ_ฉัน_รวมทั้ง_คุณยาย_และ_พี่สาว_ของ_ฉัน.mp3"
      },
      {
        "th": "เขา เป็น นักกีฬา ที่ มีทักษะ ดี รวมทั้ง ฟุตบอล และ บาสเกตบอล",
        "romaji": "Khao pen nak kee-la thi mee tak-sa di ruam tháng futbon lae basketbon",
        "en": "He is an athlete with good skills including football and basketball.",
        "grammar_audio": "/audio/thai/grammar/s_รวมทั้ง_ruam_tháng_-_Including_as_well_as_20231230_เขา_เป็น_นักกีฬา_ที่_มีทักษะ_ดี_รวมทั้ง_ฟุตบอล_และ_บาสเกตบอล.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "แต่เมื่อ (dtàe mûea) - But when",
    "short_explanation": "Expresses a contrast with a previous situation; 'but when'.",
    "long_explanation": "The term 'แต่เมื่อ (dtàe mûea)' is used in Thai to express a contrast with a previous situation or condition. It is equivalent to the English phrase 'but when'. This phrase is usually used at the beginning of the sentence to introduce a contrasting condition or circumstance. It helps to structure the narrative by providing transition and opposition.",
    "formation": "แต่เมื่อ + Clause",
    "examples": [
      {
        "th": "แต่เมื่อ ฉัน ถาม เขา เกี่ยวกับ การ ทำงาน เขา เพียง ยิ้ม แล้ว ไม่ ตอบ",
        "romaji": "Dtàe mûea chan tham khao keeow gab gan tham ngan, khao piang yim laeo mai dtob",
        "en": "But when I asked him about work, he just smiled and did not answer.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เมื่อ_dtàe_mûea_-_But_when_20231230_แต่เมื่อ_ฉัน_ถาม_เขา_เกี่ยวกับ_การ_ทำงาน_เขา_เพียง_ยิ้ม_แล้ว_ไม่_ตอบ.mp3"
      },
      {
        "th": "แต่เมื่อ ฝน ตก เขา กลับ หัน ไปหา ฉัน",
        "romaji": "Dtàe mûea fon dtok, khao glab han pai ha chan",
        "en": "But when it rained, he turned to me.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เมื่อ_dtàe_mûea_-_But_when_20231230_แต่เมื่อ_ฝน_ตก_เขา_กลับ_หัน_ไปหา_ฉัน.mp3"
      },
      {
        "th": "แต่เมื่อ ตอน ค่ำ ขึ้น ฉัน กลับ รู้สึก หนาว",
        "romaji": "Dtàe mûea dton kham keun, chan glab roo seuk nao",
        "en": "But when evening came, I felt cold.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เมื่อ_dtàe_mûea_-_But_when_20231230_แต่เมื่อ_ตอน_ค่ำ_ขึ้น_ฉัน_กลับ_รู้สึก_หนาว.mp3"
      },
      {
        "th": "แต่เมื่อ เธอ ออกจาก บ้าน ฉัน รู้สึก ว่าง ว่าง",
        "romaji": "Dtàe mûea thoe ok jak baan, chan roo seuk waang waang",
        "en": "But when she left home, I felt empty.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เมื่อ_dtàe_mûea_-_But_when_20231230_แต่เมื่อ_เธอ_ออกจาก_บ้าน_ฉัน_รู้สึก_ว่าง_ว่าง.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ยิ่ง (yîng) - Even more, increasingly",
    "short_explanation": "Used to indicate an escalation or intensification; 'even more' or 'increasingly'.",
    "long_explanation": "The word 'ยิ่ง (yîng)' is used in the Thai language to demonstrate an increase or intensification in an action, quality, or state. It is comparable to the English phrases 'even more' or 'increasingly'. Typically, 'ยิ่ง' is placed before the verb, adjective, or adverb it is intensifying in the sentence. It is used to emphasize an extreme or comparative degree of a certain characteristic or action.",
    "formation": "ยิ่ง + Verb/Adjective/Adverb",
    "examples": [
      {
        "th": "ก quantoớ่ม เขา ยิ่ง รู้สึก ว่า เขา สูญเสีย ของ มหาศาล",
        "romaji": "quamt khao yîng ruu seuk wa khao sun sia kong ma ha saan",
        "en": "The more he thinks, the more he feels that he has lost a lot.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่ง_yîng_-_Even_more_increasingly_20231230_ก_quantoớ่ม_เขา_ยิ่ง_รู้สึก_ว่า_เขา_สูญเสีย_ของ_มหาศาล.mp3"
      },
      {
        "th": "ยิ่ง คุณ อ่าน หนังสือ มาก มาย คุณ ยิ่ง รู้ มาก เท่า นั้น",
        "romaji": "yîng khun aan nang suek maak maai, khun yîng ruu maak tao nan",
        "en": "The more books you read, the more you know.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่ง_yîng_-_Even_more_increasingly_20231230_ยิ่ง_คุณ_อ่าน_หนังสือ_มาก_มาย_คุณ_ยิ่ง_รู้_มาก_เท่า_นั้น.mp3"
      },
      {
        "th": "ยิ่ง ฝึก พูด ภาษา ไทย บ่อย คุณ ยิ่ง สามารถ พูด ได้ ดี",
        "romaji": "yîng fuk phut pha-sa thai boy, khun yîng sa-mart phut dai di",
        "en": "The more you practice speaking Thai, the better you can speak it.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่ง_yîng_-_Even_more_increasingly_20231230_ยิ่ง_ฝึก_พูด_ภาษา_ไทย_บ่อย_คุณ_ยิ่ง_สามารถ_พูด_ได้_ดี.mp3"
      },
      {
        "th": "ยิ่ง ฉัน คิด ฉัน ยิ่ง รู้สึก ว่า ฉัน รัก เธอ",
        "romaji": "yîng chan khid, chan yîng ruu seuk wa chan rak thoe",
        "en": "The more I think, the more I feel that I love you.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่ง_yîng_-_Even_more_increasingly_20231230_ยิ่ง_ฉัน_คิด_ฉัน_ยิ่ง_รู้สึก_ว่า_ฉัน_รัก_เธอ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ตั้งแต่ (táng dtàe) - Since, from",
    "short_explanation": "Indicates the starting point of a period of time; 'since', 'from'",
    "long_explanation": "The term 'ตั้งแต่ (táng dtàe)' in Thai is a preposition used to refer to the starting point of a period of time much like the English terms 'since' or 'from'. It is used in conjunction with time expressions or nouns to indicate the beginning of a period or range of time.",
    "formation": "ตั้งแต่ + Time Period/Noun",
    "examples": [
      {
        "th": "เขา อยู่ ที่ เมือง นี้ ตั้งแต่ เด็ก แล้ว",
        "romaji": "Khao yuu thi mueang nee táng dtàe dek laew",
        "en": "He has been living in this city since he was a child.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่_táng_dtàe_-_Since_from_20231230_เขา_อยู่_ที่_เมือง_นี้_ตั้งแต่_เด็ก_แล้ว.mp3"
      },
      {
        "th": "ฉัน รู้จัก เธอ ตั้งแต่ เรา อยู่ มหาวิทยาลัย",
        "romaji": "Chan rue jak thoe táng dtàe rao yuu maha witthayalai",
        "en": "I've known her since we were in university.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่_táng_dtàe_-_Since_from_20231230_ฉัน_รู้จัก_เธอ_ตั้งแต่_เรา_อยู่_มหาวิทยาลัย.mp3"
      },
      {
        "th": "เขา เริ่ม วิ่ง ตั้งแต่ รุ่งเช้า",
        "romaji": "Khao ruem wing táng dtàe rung chao",
        "en": "He has been running since early morning.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่_táng_dtàe_-_Since_from_20231230_เขา_เริ่ม_วิ่ง_ตั้งแต่_รุ่งเช้า.mp3"
      },
      {
        "th": "ฉัน รอ ของ เขา ตั้งแต่ เมื่อ สัปดาห์ ที่ ผ่าน มา",
        "romaji": "Chan ror khong khao táng dtàe muea sapda thi phan ma",
        "en": "I have been waiting for his stuff since last week.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่_táng_dtàe_-_Since_from_20231230_ฉัน_รอ_ของ_เขา_ตั้งแต่_เมื่อ_สัปดาห์_ที่_ผ่าน_มา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ใคร่ (khrài) - To desire, want",
    "short_explanation": "Expresses the sense of desiring or wanting something.",
    "long_explanation": "The term 'ใคร่ (khrài)' in Thai is equivalent to 'to desire' or 'to want' in English. This term is used to express the want or desire for something or some situation, and it is placed in front of the object or situation that is desired.",
    "formation": "ใคร่ + object/situation",
    "examples": [
      {
        "th": "ผม ใคร่ จะ ได้ พบ เธอ อีก ครั้ง",
        "romaji": "Phom khrài ja dai phob thoe eek krang",
        "en": "I desire to meet her again.",
        "grammar_audio": "/audio/thai/grammar/s_ใคร่_khrài_-_To_desire_want_20231230_ผม_ใคร่_จะ_ได้_พบ_เธอ_อีก_ครั้ง.mp3"
      },
      {
        "th": "เธอ ใคร่ กิน ช็อกโกแลต แต่ ยัง ไม่ มี เวลา ไป ซื้อ",
        "romaji": "Thoe khrài kin chok-go-laet tae yang mai mee welaa pai seue",
        "en": "She wants to eat chocolate but doesn't have time to buy it.",
        "grammar_audio": "/audio/thai/grammar/s_ใคร่_khrài_-_To_desire_want_20231230_เธอ_ใคร่_กิน_ช็อกโกแลต_แต่_ยัง_ไม่_มี_เวลา_ไป_ซื้อ.mp3"
      },
      {
        "th": "เขา ใคร่ มี เวลา ว่าง ใน ปี หน้า ให้ มาก ขึ้น",
        "romaji": "Khao khrài mee welaa waang nai bpee naa hai maak kheun",
        "en": "He desires to have more free time next year.",
        "grammar_audio": "/audio/thai/grammar/s_ใคร่_khrài_-_To_desire_want_20231230_เขา_ใคร่_มี_เวลา_ว่าง_ใน_ปี_หน้า_ให้_มาก_ขึ้น.mp3"
      },
      {
        "th": "เรา ใคร่ จะ ออก ไป เที่ยว ที่ ทะเล",
        "romaji": "Rao khrài ja ook pai thiao thi thale",
        "en": "We want to go on a trip to the sea.",
        "grammar_audio": "/audio/thai/grammar/s_ใคร่_khrài_-_To_desire_want_20231230_เรา_ใคร่_จะ_ออก_ไป_เที่ยว_ที่_ทะเล.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ใช้ (chái) - To use",
    "short_explanation": "The verb 'ใช้' (chái) means 'to use' in English and is used to indicate the action of using or consuming something.",
    "long_explanation": "'ใช้' (chái) is a commonly used verb in Thai that directly translates to 'use' in English. It's used to refer to the action of using or consuming something. It can also mean ‘to spend (time or money)’ in certain contexts. The sentence structure when using this verb is generally: 'Subject + ใช้ + Object'.",
    "formation": "Subject + ใช้ + Object",
    "examples": [
      {
        "th": "เขา ใช้ โทรศัพท์ มือ ถือ เพื่อ ติดต่อ กับ เพื่อน ของ เขา",
        "romaji": "khao chái toh-rá-sàp muue thuue phuea dtìt dtàw gàp pheuan khong khao",
        "en": "He uses a mobile phone to contact his friends.",
        "grammar_audio": "/audio/thai/grammar/s_ใช้_chái_-_To_use_20231230_เขา_ใช้_โทรศัพท์_มือ_ถือ_เพื่อ_ติดต่อ_กับ_เพื่อน_ของ_เขา.mp3"
      },
      {
        "th": "ฉัน ใช้ จักรยาน เพื่อ ไป ทำงาน ทุกวัน",
        "romaji": "chan chái jak-gra-yaan phuea pai tham-ngaan thúk wan",
        "en": "I use a bicycle to go to work every day.",
        "grammar_audio": "/audio/thai/grammar/s_ใช้_chái_-_To_use_20231230_ฉัน_ใช้_จักรยาน_เพื่อ_ไป_ทำงาน_ทุกวัน.mp3"
      },
      {
        "th": "เรา ควร ใช้ เวลา อย่าง มี ประสิทธิภาพ",
        "romaji": "rao khuan chái we-laa yaang mee bpra-sìt-ti-phâap",
        "en": "We should use our time efficiently.",
        "grammar_audio": "/audio/thai/grammar/s_ใช้_chái_-_To_use_20231230_เรา_ควร_ใช้_เวลา_อย่าง_มี_ประสิทธิภาพ.mp3"
      },
      {
        "th": "ผม ใช้ เงิน อย่าง รอบคอบ เพื่อ อนาคต ที่ ดี",
        "romaji": "phom chái ngoen yaang raawp-khaawp phuea a-naa-kót thîi dii",
        "en": "I use money wisely for a good future.",
        "grammar_audio": "/audio/thai/grammar/s_ใช้_chái_-_To_use_20231230_ผม_ใช้_เงิน_อย่าง_รอบคอบ_เพื่อ_อนาคต_ที่_ดี.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "กลับ (glàp) - To return, to go back",
    "short_explanation": "The term 'กลับ (glàp)' is used to indicate the action of returning or going back.",
    "long_explanation": "In Thai language, 'กลับ (glàp)' which translates to 'return' or 'go back' in English, is primarily used to denote a movement back to a prior location or condition. This could refer to a physical return to a specific place, or a return to a previous state or condition. The word ‘กลับ’ is quite flexible in Thai grammar as it can be used with or without prepositions depending upon the actual context.",
    "formation": "กลับ + Location/Condition",
    "examples": [
      {
        "th": "เมื่อ เย็น ฉัน ต้อง กลับ บ้าน",
        "romaji": "Meua yen, chan tong glàp baan",
        "en": "In the evening, I have to go back home.",
        "grammar_audio": "/audio/thai/grammar/s_กลับ_glàp_-_To_return_to_go_back_20231230_เมื่อ_เย็น_ฉัน_ต้อง_กลับ_บ้าน.mp3"
      },
      {
        "th": "ฉัน ต้องการ กลับ ไป โรงเรียน จะ หยิบ เอกสาร",
        "romaji": "Chan tong-gaan glàp pai roong-rien ja yip aek-saan",
        "en": "I want to go back to school to get the documents.",
        "grammar_audio": "/audio/thai/grammar/s_กลับ_glàp_-_To_return_to_go_back_20231230_ฉัน_ต้องการ_กลับ_ไป_โรงเรียน_จะ_หยิบ_เอกสาร.mp3"
      },
      {
        "th": "หลังจาก ที่ เขา เสร็จ งาน เขา จะ กลับ ไป ที่ บ้าน",
        "romaji": "Lang jàak thi khao set ngan, khao ja glàp pai thi baan",
        "en": "After he finishes work, he will return home.",
        "grammar_audio": "/audio/thai/grammar/s_กลับ_glàp_-_To_return_to_go_back_20231230_หลังจาก_ที่_เขา_เสร็จ_งาน_เขา_จะ_กลับ_ไป_ที่_บ้าน.mp3"
      },
      {
        "th": "ฉัน อยาก กลับ ไป เป็น คน เดิม",
        "romaji": "Chan yak glàp pai pen kon deim",
        "en": "I want to go back to being the same person.",
        "grammar_audio": "/audio/thai/grammar/s_กลับ_glàp_-_To_return_to_go_back_20231230_ฉัน_อยาก_กลับ_ไป_เป็น_คน_เดิม.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ส่วน (sùan) - Part, portion",
    "short_explanation": "Indicates a part or portion of a whole; 'part', 'portion'.",
    "long_explanation": "The term 'ส่วน (sùan)' is commonly used in Thai to refer to a part or portion of something that is considered a whole. It can be used to denote physical parts of a tangible item, or abstract parts of an idea, a group, or a collection. It is most often used after the noun it modifies. It is versatile and can be used with a wide range of nouns, adjectives, and phrases to express the concept of part or portion.",
    "formation": "Noun + ส่วน",
    "examples": [
      {
        "th": "ส่วน ใหญ่ ของ ผู้ ป่วย ที่ ติด เชื้อ ไวรัส โคโรน่า สายพันธุ์ ใหม่ มี อาการ คล้าย หวัด ธรรมดา",
        "romaji": "Sùan yai kong phu puay thi tid chuea virus Corona sai pan mai mee a-gaan klai wat tham ma da",
        "en": "A large part of the patients infected with the new coronavirus strain have symptoms similar to a common cold.",
        "grammar_audio": "/audio/thai/grammar/s_ส่วน_sùan_-_Part_portion_20231230_ส่วน_ใหญ่_ของ_ผู้_ป่วย_ที่_ติด_เชื้อ_ไวรัส_โคโรน่า_สายพันธุ์_ใหม่_มี_อาการ_คล้าย_หวัด_ธรรมดา.mp3"
      },
      {
        "th": "เขา จะ เตรียม อาหาร ส่วน ตนเอง แล้ว เอา ไป ทำงาน",
        "romaji": "Khao ja triam a-haan sùan ton eng laew ao pai tham ngan",
        "en": "He will prepare his own portion of food and take it to work.",
        "grammar_audio": "/audio/thai/grammar/s_ส่วน_sùan_-_Part_portion_20231230_เขา_จะ_เตรียม_อาหาร_ส่วน_ตนเอง_แล้ว_เอา_ไป_ทำงาน.mp3"
      },
      {
        "th": "ส่วน ที่ เหลือ ของ ข้าว นั้น ถูก นำ ไป ทำ ข้าว ปั้น หน้า",
        "romaji": "Sùan thi leua kong khao nan took nam pai tham khao pun na",
        "en": "The remaining portion of the rice was used to make sushi.",
        "grammar_audio": "/audio/thai/grammar/s_ส่วน_sùan_-_Part_portion_20231230_ส่วน_ที่_เหลือ_ของ_ข้าว_นั้น_ถูก_นำ_ไป_ทำ_ข้าว_ปั้น_หน้า.mp3"
      },
      {
        "th": "ส่วน ของ ต้องการ ให้ เรา ทำ อะไร สำหรับ งาน เลี้ยง นี้",
        "romaji": "Sùan kong tong gan hai rao tham a-rai sam-rap ngan liang nee",
        "en": "What part do they want us to do for this party?",
        "grammar_audio": "/audio/thai/grammar/s_ส่วน_sùan_-_Part_portion_20231230_ส่วน_ของ_ต้องการ_ให้_เรา_ทำ_อะไร_สำหรับ_งาน_เลี้ยง_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "อย่าง (yàang) - Kind, type, like (for giving examples)",
    "short_explanation": "'อย่าง' is used in Thai language to denote kind, type or to provide examples.",
    "long_explanation": "In Thai language, the term 'อย่าง (yàang)' is used to represent examples or to refer to a kind or type of something. It is often placed after a verb or an adjective and before a noun to show an example or type of the action or description. 'อย่าง' can translate to 'like' or 'such as' in English when providing examples, or 'kind' or 'type' when referring to different categories of things.",
    "formation": "Verb/Adjective + อย่าง + Noun",
    "examples": [
      {
        "th": "ฉัน ชอบ อาหาร อย่าง ผัด ไทย และ ต้ม ยำ กุ้ง",
        "romaji": "Chan chop a-han yàang phat thai lae tom yam goong",
        "en": "I like food like Pad Thai and Tom Yum Goong.",
        "grammar_audio": "/audio/thai/grammar/s_อย่าง_yàang_-_Kind_type_like_for_giving_examples_20231230_ฉัน_ชอบ_อาหาร_อย่าง_ผัด_ไทย_และ_ต้ม_ยำ_กุ้ง.mp3"
      },
      {
        "th": "เขา มี สัตว์เลี้ยง อย่าง แมว และ สุนัข",
        "romaji": "Khao mee sat-leing yàang maew lae sù-nák",
        "en": "He has pets like cats and dogs.",
        "grammar_audio": "/audio/thai/grammar/s_อย่าง_yàang_-_Kind_type_like_for_giving_examples_20231230_เขา_มี_สัตว์เลี้ยง_อย่าง_แมว_และ_สุนัข.mp3"
      },
      {
        "th": "ใน ห้องสมุด มี หนังสือ หลากหลาย อย่าง เช่น นวนิยาย วรรณคดี และ วิชาการ",
        "romaji": "Nai hong-sumut mee nang-seu laak-laai yàang chen nu-ni-yai wan-nak-dii lae wi-cha-gan",
        "en": "In the library, there are various kinds of books such as novels, literature, and academic books.",
        "grammar_audio": "/audio/thai/grammar/s_อย่าง_yàang_-_Kind_type_like_for_giving_examples_20231230_ใน_ห้องสมุด_มี_หนังสือ_หลากหลาย_อย่าง_เช่น_นวนิยาย_วรรณคดี_และ_วิชาการ.mp3"
      },
      {
        "th": "เธอ มี เพื่อน จาก หลากหลาย ประเทศ อย่าง ญี่ปุ่น จีน และ อเมริกา",
        "romaji": "Thor mee pheuan jaak laak-laai pra-tet yàang yee-pun jeen lae a-me-ri-ga",
        "en": "She has friends from various countries like Japan, China, and America.",
        "grammar_audio": "/audio/thai/grammar/s_อย่าง_yàang_-_Kind_type_like_for_giving_examples_20231230_เธอ_มี_เพื่อน_จาก_หลากหลาย_ประเทศ_อย่าง_ญี่ปุ่น_จีน_และ_อเมริกา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ถ้า (thâa) - If, in case of",
    "short_explanation": "Used to express conditions, similar to the English 'if'.",
    "long_explanation": "The term 'ถ้า (thâa)' is commonly used in Thai language to express conditional statements or hypothetical situations. It is similar to the English 'if' or 'in case of'. It is placed at the beginning of a sentence before stating the condition or hypothetical situation to be considered. It can be used with various types of verbs, adjectives, and phrases, thereby making it a versatile grammatical element in Thai.",
    "formation": "ถ้า + Condition Statement + Result Statement",
    "examples": [
      {
        "th": "ถ้า ฝน ตก ผม จะ ไม่ ไป ข้าง นอก",
        "romaji": "Thâa fŏn dtòk, phŏm jà mâi bpai kâang nôk",
        "en": "If it rains, I will not go outside.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้า_thâa_-_If_in_case_of_20231230_ถ้า_ฝน_ตก_ผม_จะ_ไม่_ไป_ข้าง_นอก.mp3"
      },
      {
        "th": "ถ้า เธอ ต้องการ ฉัน จะ ช่วย เธอ",
        "romaji": "Thâa thoe dtông gaan, chan ja chuay thoe",
        "en": "If you need, I will help you.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้า_thâa_-_If_in_case_of_20231230_ถ้า_เธอ_ต้องการ_ฉัน_จะ_ช่วย_เธอ.mp3"
      },
      {
        "th": "ถ้า คุณ มี เวลา คุณ ควร อ่าน หนังสือ นี้",
        "romaji": "Thâa khun mee weh-laa, khun kuan àan năng-sěo née",
        "en": "If you have time, you should read this book.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้า_thâa_-_If_in_case_of_20231230_ถ้า_คุณ_มี_เวลา_คุณ_ควร_อ่าน_หนังสือ_นี้.mp3"
      },
      {
        "th": "ถ้า ผม ไม่ มี งาน ทำ ผม จะ นอน ทั้งวัน",
        "romaji": "Thâa phŏm mâi mee ngan tam, phŏm ja nŏn táng-wan",
        "en": "If I don't have work, I will sleep all day.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้า_thâa_-_If_in_case_of_20231230_ถ้า_ผม_ไม่_มี_งาน_ทำ_ผม_จะ_นอน_ทั้งวัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "จริง (jĭng) - True, Really",
    "short_explanation": "Used to express certainty or affirmation; 'true' or 'really'.",
    "long_explanation": "The term 'จริง (jĭng)' in Thai language is used to express affirmation or certainty, roughly translating to 'true' or 'really' in English. It can be used with both positive and negative statements to confirm the truth of the statement. This word is usually placed at the end of the sentence but can also appear in the middle or at the start.",
    "formation": "Statement + จริง / จริง + Statement",
    "examples": [
      {
        "th": "คุณ อ่าน หนังสือ นั้น ทั้ง หมด จริง หรือ",
        "romaji": "Khun aan nangsue nan thang mot jĭng reu",
        "en": "Did you really read the whole book?",
        "grammar_audio": "/audio/thai/grammar/s_จริง_jĭng_-_True_Really_20231230_คุณ_อ่าน_หนังสือ_นั้น_ทั้ง_หมด_จริง_หรือ.mp3"
      },
      {
        "th": "เธอ จะ มา ไป ด้วย สวนสนุก วัน นี้ จริง ไหม",
        "romaji": "Thoe ja ma pai duay suan sonuk wan ni jĭng mai",
        "en": "Are you really going to the amusement park today?",
        "grammar_audio": "/audio/thai/grammar/s_จริง_jĭng_-_True_Really_20231230_เธอ_จะ_มา_ไป_ด้วย_สวนสนุก_วัน_นี้_จริง_ไหม.mp3"
      },
      {
        "th": "เรา ต้อง ดำเนินการ ตาม ที่ วางแผน ไว้ จริง",
        "romaji": "Rao tong dam nein gan taam thi wang phaen wai jĭng",
        "en": "We really have to proceed according to the plan.",
        "grammar_audio": "/audio/thai/grammar/s_จริง_jĭng_-_True_Really_20231230_เรา_ต้อง_ดำเนินการ_ตาม_ที่_วางแผน_ไว้_จริง.mp3"
      },
      {
        "th": "ฉัน รู้สึก ว่า เขา จริง จริง ชอบ คน คน นั้น",
        "romaji": "Chan ru suek wa khao jĭng jĭng chob khon khon nan",
        "en": "I feel that he really likes that person.",
        "grammar_audio": "/audio/thai/grammar/s_จริง_jĭng_-_True_Really_20231230_ฉัน_รู้สึก_ว่า_เขา_จริง_จริง_ชอบ_คน_คน_นั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "ทั้งนี้ (tháng níi) - Meanwhile, however",
    "short_explanation": "Indicates the simultaneous occurrence of two events, or introduces contrasting information; 'meanwhile' or 'however'.",
    "long_explanation": "The conjunction 'ทั้งนี้ (tháng níi)' is used frequently in Thai to denote simultaneous actions, similar to the English 'meanwhile'. It is also used to introduce new or contrasting information, conveying the meaning of 'however'. In most cases, it is placed at the beginning of a sentence or after a comma.",
    "formation": "ทั้งนี้ + Statement",
    "examples": [
      {
        "th": "ทั้งนี้ แม่ กำลัง ทำ อาหาร อยู่ ใน ครัว, บิดา ถือ หนังสือ อยู่ ที่ ห้อง นวด",
        "romaji": "tháng níi, mae kamlang tham a-han yùu nai khrua, bida thue nang sue yùu thi hong nuat",
        "en": "Meanwhile, the mother is cooking in the kitchen and the father is reading a book in the massage room.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_Meanwhile_however_20231230_ทั้งนี้_แม่_กำลัง_ทำ_อาหาร_อยู่_ใน_ครัว_บิดา_ถือ_หนังสือ_อยู่_ที่_ห้อง_นวด.mp3"
      },
      {
        "th": "เขา ชอบ ไป เที่ยว เมือง นอก, ทั้งนี้ ฉัน ชอบ ทำการบ้าน และ อ่านหนังสือ ที่ บ้าน",
        "romaji": "khao chôp pai thiiao mueang nôk, tháng níi, chǎn chôp tham gan-bâan læ àat nang-sǔue thi bâan",
        "en": "He likes to travel abroad, meanwhile, I prefer doing chores and reading books at home.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_Meanwhile_however_20231230_เขา_ชอบ_ไป_เที่ยว_เมือง_นอก_ทั้งนี้_ฉัน_ชอบ_ทำการบ้าน_และ_อ่านหนังสือ_ที่_บ้าน.mp3"
      },
      {
        "th": "ทั้งนี้ ฉัน ได้ ทำงาน กับ ทีม งาน ที่ ส่งเสริม ทักษะ ทาง คอมพิวเตอร์ ของ ฉัน",
        "romaji": "tháng níi, chǎn dâi tham-ngaan gàp team ngaan thi sòng-sǔeum thák-s̄ā thāng khôm phiw tǒr khǒng chǎn",
        "en": "Meanwhile, I was working with a team that enhanced my computer skills.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_Meanwhile_however_20231230_ทั้งนี้_ฉัน_ได้_ทำงาน_กับ_ทีม_งาน_ที่_ส่งเสริม_ทักษะ_ทาง_คอมพิวเตอร์_ของ_ฉัน.mp3"
      },
      {
        "th": "เขา ชอบ การ เล่น กีฬา แต่ ฉัน ไม่ ชอบ, ทั้งนี้ ฉัน ชอบ การ อ่านหนังสือ",
        "romaji": "khao chôp gaan len kee-laa dtae chǎn mâi chôp, tháng níi, chǎn chôp gaan àat nang-sǔue",
        "en": "He likes sports but I don't, however, I like reading books.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_Meanwhile_however_20231230_เขา_ชอบ_การ_เล่น_กีฬา_แต่_ฉัน_ไม่_ชอบ_ทั้งนี้_ฉัน_ชอบ_การ_อ่านหนังสือ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "แน่นอน (nâe-non) - Certainly, of course",
    "short_explanation": "This term is equivalent to 'certainly' or 'of course' in English, expressing strong assurance or affirmation.",
    "long_explanation": "'แน่นอน (nâe-non)' is a common Thai phrase used to express certainty or strong affirmation, similar to 'certainly' or 'of course' in English. It often appears at the beginning or end of a sentence, affirming the statement being made. It serves as a useful term for giving definite responses, making assurances, or emphasizing a fact. It is also frequently used in questions to solicit an affirmative response.",
    "formation": "Statement + แน่นอน",
    "examples": [
      {
        "th": "วัน นี้ เขา จะ มา เร็ว แน่นอน",
        "romaji": "Wan nii khao ja ma reo nâe-non",
        "en": "He will certainly come early today.",
        "grammar_audio": "/audio/thai/grammar/s_แน่นอน_nâe-non_-_Certainly_of_course_20231230_วัน_นี้_เขา_จะ_มา_เร็ว_แน่นอน.mp3"
      },
      {
        "th": "คุณ ต้อง ช่วย เรา แน่นอน ใช่ ไหม",
        "romaji": "Khun tong chuay rao nâe-non chai mai",
        "en": "You have to help us, right? Certainly.",
        "grammar_audio": "/audio/thai/grammar/s_แน่นอน_nâe-non_-_Certainly_of_course_20231230_คุณ_ต้อง_ช่วย_เรา_แน่นอน_ใช่_ไหม.mp3"
      },
      {
        "th": "ฉัน รัก เธอ อย่าง ไม่ มี ที่ สิ้นสุด แน่นอน",
        "romaji": "Chan rak thoe yang mai mee thi sin-sud nâe-non",
        "en": "I love you infinitely, of course.",
        "grammar_audio": "/audio/thai/grammar/s_แน่นอน_nâe-non_-_Certainly_of_course_20231230_ฉัน_รัก_เธอ_อย่าง_ไม่_มี_ที่_สิ้นสุด_แน่นอน.mp3"
      },
      {
        "th": "ถ้า คุณ ทำแบบนั้น คุณ จะ ประสบความสำเร็จ แน่นอน",
        "romaji": "Tha khun tham-baep-nan, khun ja pra-sop-kwam-sam-ret nâe-non",
        "en": "If you do that, you will certainly be successful.",
        "grammar_audio": "/audio/thai/grammar/s_แน่นอน_nâe-non_-_Certainly_of_course_20231230_ถ้า_คุณ_ทำแบบนั้น_คุณ_จะ_ประสบความสำเร็จ_แน่นอน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "เมื่อ (mûea) - When",
    "short_explanation": "Indicates a point in time, similar to the English 'when'.",
    "long_explanation": "The term 'เมื่อ (mûea)' in Thai is used to indicate a particular moment or period in time, such as when a specific event occurred. This can refer to either a point in the past or a situation that will happen in the future. It is typically placed at the start of the sentence.",
    "formation": "เมื่อ + event/statement",
    "examples": [
      {
        "th": "เมื่อ ฉัน ถึง ที่ บ้าน ฉัน พบ ว่า แมว ของ ฉัน นอน บน โซฟา",
        "romaji": "Mûea chan theung thi baan, chan phop wa maeo kong chan non bon sofa",
        "en": "When I got home, I found my cat sleeping on the sofa.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อ_mûea_-_When_20231230_เมื่อ_ฉัน_ถึง_ที่_บ้าน_ฉัน_พบ_ว่า_แมว_ของ_ฉัน_นอน_บน_โซฟา.mp3"
      },
      {
        "th": "เมื่อ อากาศ เริ่ม ร้อน ฉัน มักจะ ไป ว่ายน้ำ",
        "romaji": "Mûea a-kat reum ron, chan mak ja pai wai nam",
        "en": "When the weather starts to get hot, I usually go swimming.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อ_mûea_-_When_20231230_เมื่อ_อากาศ_เริ่ม_ร้อน_ฉัน_มักจะ_ไป_ว่ายน้ำ.mp3"
      },
      {
        "th": "เมื่อ ผม ทำ งาน เสร็จ ผม จะ อ่าน หนังสือ",
        "romaji": "Mûea phom tham ngan set, phom ja aan nang-sue",
        "en": "When I finish work, I read a book.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อ_mûea_-_When_20231230_เมื่อ_ผม_ทำ_งาน_เสร็จ_ผม_จะ_อ่าน_หนังสือ.mp3"
      },
      {
        "th": "เมื่อ เขา ได้ รับ อีเมล นั้น เขา สร้าง สุขใจ มาก",
        "romaji": "Mûea khao dai rap e-mail nan, khao sarng sukh jai maak",
        "en": "When he received that email, he was very happy.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อ_mûea_-_When_20231230_เมื่อ_เขา_ได้_รับ_อีเมล_นั้น_เขา_สร้าง_สุขใจ_มาก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "นับ (náp) - To count; since (time)",
    "short_explanation": "Used to indicate the process of counting from one number to another, or to mark the beginning of a time period 'since'.",
    "long_explanation": "The term 'นับ (náp)' is commonly used in Thai language for two main purposes. The first meaning is 'to count', used when enumerating items or numbers. The second meaning is 'since', referring to the period of time starting from a particular point in the past until now. When used as 'since', it is combined with a time phrase and usually used with the word 'มา' at the end of the sentence.",
    "formation": "1) Counting: Subject + นับ + Object; 2) Since: นับ + Time phrase + มา",
    "examples": [
      {
        "th": "คุณ สามารถ นับ ตั้งแต่ หนึ่ง ถึง สิบ ได้ ใช่ ไหม",
        "romaji": "Khun sa ma rat nap tang tae neung theung sip dai chai mai",
        "en": "Can you count from one to ten?",
        "grammar_audio": "/audio/thai/grammar/s_นับ_náp_-_To_count_since_time_20231230_คุณ_สามารถ_นับ_ตั้งแต่_หนึ่ง_ถึง_สิบ_ได้_ใช่_ไหม.mp3"
      },
      {
        "th": "นับ สัปดาห์ ที่ ผ่าน มา เขา สัญญา ว่า จะ หยุด ดื่ม แอลกอฮอล์",
        "romaji": "Nap sapda theung thi phan ma, khao san-ya wa ja yut deum alekohol",
        "en": "Since last week, he has promised to stop drinking alcohol.",
        "grammar_audio": "/audio/thai/grammar/s_นับ_náp_-_To_count_since_time_20231230_นับ_สัปดาห์_ที่_ผ่าน_มา_เขา_สัญญา_ว่า_จะ_หยุด_ดื่ม_แอลกอฮอล์.mp3"
      },
      {
        "th": "ผม ได้ เรียน ภาษา ไทย นับ เดือน ที่ ผ่าน มา",
        "romaji": "Phom dai rien phasa Thai nap duean thi phan ma",
        "en": "I have been learning Thai since last month.",
        "grammar_audio": "/audio/thai/grammar/s_นับ_náp_-_To_count_since_time_20231230_ผม_ได้_เรียน_ภาษา_ไทย_นับ_เดือน_ที่_ผ่าน_มา.mp3"
      },
      {
        "th": "นับ จาก วัน นี้ เรา จะ ใช้ นโยบาย ใหม่",
        "romaji": "Nap jak wan ni, rao ja chai ni-yo-bai mai",
        "en": "From this day onwards, we will use the new policy.",
        "grammar_audio": "/audio/thai/grammar/s_นับ_náp_-_To_count_since_time_20231230_นับ_จาก_วัน_นี้_เรา_จะ_ใช้_นโยบาย_ใหม่.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "บาง (baang) - Some, certain",
    "short_explanation": "Used to specify an indefinite quantity or number.",
    "long_explanation": "In Thai language, 'บาง (baang)' is used to indicate an unspecified quantity or number, which can be translated into English as 'some' or 'certain'. It is normally placed before the noun to specify that not all items are being referred to, but only an unspecified number or quantity of them. It's a term that is frequently used in everyday Thai conversation.",
    "formation": "บาง + Noun",
    "examples": [
      {
        "th": "ฉัน ชอบ บาง เพลง ที่ ขาย ใน ร้าน ดนตรี นี้",
        "romaji": "Chan chorp baang pleung thi kai nai raan dontri ni",
        "en": "I like some songs that are sold in this music store.",
        "grammar_audio": "/audio/thai/grammar/s_บาง_baang_-_Some_certain_20231230_ฉัน_ชอบ_บาง_เพลง_ที่_ขาย_ใน_ร้าน_ดนตรี_นี้.mp3"
      },
      {
        "th": "เธอ ควร เลือก บาง ชิ้น จาก คลัง ของ หนังสือ ของ เรา",
        "romaji": "Thoe khuan leuak baang chun jak klang kong nangsu kong rao",
        "en": "You should choose some books from our library.",
        "grammar_audio": "/audio/thai/grammar/s_บาง_baang_-_Some_certain_20231230_เธอ_ควร_เลือก_บาง_ชิ้น_จาก_คลัง_ของ_หนังสือ_ของ_เรา.mp3"
      },
      {
        "th": "บาง คน ใน ห้อง จะ รู้สึก อยาก หงุดหงิด ถ้า คุณ พูด แบบ นี้",
        "romaji": "Baang kon nai hong ja ru suke yaak ngud-ngid thaa khun phut baep ni",
        "en": "Some people in the room will feel annoyed if you talk like this.",
        "grammar_audio": "/audio/thai/grammar/s_บาง_baang_-_Some_certain_20231230_บาง_คน_ใน_ห้อง_จะ_รู้สึก_อยาก_หงุดหงิด_ถ้า_คุณ_พูด_แบบ_นี้.mp3"
      },
      {
        "th": "อาหาร ที่ ร้านนี้ ไม่ ค่อย ดี แต่ มี บาง เมนู ที่ โดดเด่น",
        "romaji": "Ahaan thi raan ni mai koi dee tae mee baang menu thi doden",
        "en": "The food at this restaurant isn't usually good, but some menus stand out.",
        "grammar_audio": "/audio/thai/grammar/s_บาง_baang_-_Some_certain_20231230_อาหาร_ที่_ร้านนี้_ไม่_ค่อย_ดี_แต่_มี_บาง_เมนู_ที่_โดดเด่น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "50"
  },
  {
    "title": "นอกจาก (nâawk jàak) - Besides, except",
    "short_explanation": "Expresses an exception or exclusion leaving everything else; 'besides', 'except'.",
    "long_explanation": "The term 'นอกจาก (nâawk jàak)' in Thai is used to express the idea of excluding something specifically mentioned, leaving everything else. This is quite similar to the English 'besides' or 'except', and is usually used with negative sentences. The phrase after 'นอกจาก' is what is being excluded.",
    "formation": "นอกจาก + Phrase (that is excluded) + Rest of Sentence",
    "examples": [
      {
        "th": "นอกจาก ที่ ฉัน จะ กิน ข้าว ฉัน ยัง ชอบ ดื่ม ชา โค้ก ด้วย",
        "romaji": "nâawk jàak thì chǎn jà gin khâaw, chǎn yang châawp deuum chaa khôhk dûuai",
        "en": "Besides eating rice, I also like drinking tea and coke.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจาก_nâawk_jàak_-_Besides_except_20231230_นอกจาก_ที่_ฉัน_จะ_กิน_ข้าว_ฉัน_ยัง_ชอบ_ดื่ม_ชา_โค้ก_ด้วย.mp3"
      },
      {
        "th": "นอกจาก เรียน ภาษา ไทย ฉัน ยัง สนใจ ใน การ เรียน ภาษาอื่น อีก หลายภาษา",
        "romaji": "nâawk jàak riian phaasǎa thai, chǎn yang sǎn jai nai kaan riian phaasǎa ûuen ìik laai phaasǎa",
        "en": "Besides studying Thai, I'm also interested in learning several other languages.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจาก_nâawk_jàak_-_Besides_except_20231230_นอกจาก_เรียน_ภาษา_ไทย_ฉัน_ยัง_สนใจ_ใน_การ_เรียน_ภาษาอื่น_อีก_หลายภาษา.mp3"
      },
      {
        "th": "นอกจาก ถนน นี้ ยัง มี ร้าน ค้า และ ร้าน อาหาร อีก มากมาย",
        "romaji": "nâawk jàak thă-non níi yang mee ráan kháa lae ráan aa-hăan ìik mâak maai",
        "en": "Besides this road, there are many shops and restaurants.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจาก_nâawk_jàak_-_Besides_except_20231230_นอกจาก_ถนน_นี้_ยัง_มี_ร้าน_ค้า_และ_ร้าน_อาหาร_อีก_มากมาย.mp3"
      },
      {
        "th": "นอกจาก ที่ เรา ต้อง ทำ งาน ใน ห้อง ถัง เรา ยัง ต้อง ทำ งาน ส่วนนักศึกษา ด้วย",
        "romaji": "nâawk jàak thì rao dtông tham ngan nai hǒng thǎng, rao yang dtông tham ngan sǔan nák sèuk sǎa dûai",
        "en": "Besides having to work in the storeroom, we also have to do the student's work.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจาก_nâawk_jàak_-_Besides_except_20231230_นอกจาก_ที่_เรา_ต้อง_ทำ_งาน_ใน_ห้อง_ถัง_เรา_ยัง_ต้อง_ทำ_งาน_ส่วนนักศึกษา_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "หาก (hàak) - If, in case that",
    "short_explanation": "Used to express a hypothetical or conditional situation, equivalent to 'if' or 'in case that' in English.",
    "long_explanation": "The term 'หาก (hàak)' is used in Thai language to express a hypothetical or conditional situation. Similar to the English words 'if' or 'in case that', it precedes the condition that leads to a certain outcome or consequence. This conjunction is commonly used to present possibilities or alternatives in a hypothetical situation.",
    "formation": "หาก + Condition + Outcome",
    "examples": [
      {
        "th": "หาก ฉัน ไม่ มี งาน ทำ ฉัน จะ ทำ อะไร ดี",
        "romaji": "Haak chan mai mee ngan tam, chan ja tam a rai di",
        "en": "If I don't have work, what should I do?",
        "grammar_audio": "/audio/thai/grammar/s_หาก_hàak_-_If_in_case_that_20231230_หาก_ฉัน_ไม่_มี_งาน_ทำ_ฉัน_จะ_ทำ_อะไร_ดี.mp3"
      },
      {
        "th": "หาก เธอ ไม่ สามารถ มา วันนี้ เธอ สามารถ มา วัน พรุ่งนี้ ได้",
        "romaji": "Haak thoe mai samart ma wan ni, thoe samart ma wan phrung ni dai",
        "en": "If you can't come today, you can come tomorrow.",
        "grammar_audio": "/audio/thai/grammar/s_หาก_hàak_-_If_in_case_that_20231230_หาก_เธอ_ไม่_สามารถ_มา_วันนี้_เธอ_สามารถ_มา_วัน_พรุ่งนี้_ได้.mp3"
      },
      {
        "th": "ฉัน จะ ไป แม้ว่า หาก ฉัน ต้อง ตื่น เช้า",
        "romaji": "Chan ja pai mae wa haak chan tong tuean chao",
        "en": "I will go even if I have to wake up early.",
        "grammar_audio": "/audio/thai/grammar/s_หาก_hàak_-_If_in_case_that_20231230_ฉัน_จะ_ไป_แม้ว่า_หาก_ฉัน_ต้อง_ตื่น_เช้า.mp3"
      },
      {
        "th": "หาก ฉัน มี โอกาส ฉัน จะ ทำ การ สมัครเข้า มหาวิทยาลัย นั้น",
        "romaji": "Haak chan mee o kas, chan ja tam kan som krat khao ma ha wit ya lai nan",
        "en": "If I have the chance, I will apply for that university.",
        "grammar_audio": "/audio/thai/grammar/s_หาก_hàak_-_If_in_case_that_20231230_หาก_ฉัน_มี_โอกาส_ฉัน_จะ_ทำ_การ_สมัครเข้า_มหาวิทยาลัย_นั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "แม้นว่า (mâen wâa) - Regardless of whether",
    "short_explanation": "'แม้นว่า' is a conjunction used in Thai to convey the meaning 'regardless of whether' or 'even if'.",
    "long_explanation": "The Thai term 'แม้นว่า (mâen wâa)' functions as a conjunction in sentences, and it can be translated to English as 'regardless of whether' or 'even if'. It is used to introduce a condition or circumstance which does not affect another fact or situation. Usually, it is used at the beginning of the sentence, followed by a clause, and leads to another clause that describes the unaffected situation or action.",
    "formation": "แม้นว่า + Clause 1 (condition) + Clause 2 (unaffected action)",
    "examples": [
      {
        "th": "แม้นว่า ฉัน จะ ไม่ มี เพียง พอ แต่ ฉัน ยัง สามารถ อยู่ อย่าง มี ความ สุข",
        "romaji": "Mâen wâa chan ja mai mee piang por tae chan yang sa maart yûu yaang mee kwam suk",
        "en": "Even if I don't have enough, I can still live happily.",
        "grammar_audio": "/audio/thai/grammar/s_แม้นว่า_mâen_wâa_-_Regardless_of_whether_20231230_แม้นว่า_ฉัน_จะ_ไม่_มี_เพียง_พอ_แต่_ฉัน_ยัง_สามารถ_อยู่_อย่าง_มี_ความ_สุข.mp3"
      },
      {
        "th": "แม้นว่า เธอ จะ กล้า ทำ อะไร ก็ตาม ใหญ่ ครั้ง นี้ ฉัน ยัง จะ สนับสนุน เธอ",
        "romaji": "Mâen wâa thoe ja glâa tham a-rai gaw tam yay krang nee, chan yang ja sna bap snun thoe",
        "en": "Regardless of whether you dare to do this big thing, I will still support you.",
        "grammar_audio": "/audio/thai/grammar/s_แม้นว่า_mâen_wâa_-_Regardless_of_whether_20231230_แม้นว่า_เธอ_จะ_กล้า_ทำ_อะไร_ก็ตาม_ใหญ่_ครั้ง_นี้_ฉัน_ยัง_จะ_สนับสนุน_เธอ.mp3"
      },
      {
        "th": "แม้นว่า วันนี้ จะ ไม่ ดี แต่ ฉัน ยัง เชื่อมั่น ว่า วัน พรุ่งนี้ จะ ดี ขึ้น",
        "romaji": "Mâen wâa wan nee ja mai dee, tae chan yang cheu man wa wan prung nee ja dee keun",
        "en": "Even if today is not good, I still believe that tomorrow will be better.",
        "grammar_audio": "/audio/thai/grammar/s_แม้นว่า_mâen_wâa_-_Regardless_of_whether_20231230_แม้นว่า_วันนี้_จะ_ไม่_ดี_แต่_ฉัน_ยัง_เชื่อมั่น_ว่า_วัน_พรุ่งนี้_จะ_ดี_ขึ้น.mp3"
      },
      {
        "th": "แม้นว่า คนทั้งหมด ไม่ อยู่ ด้วย ฉัน ยัง สามารถ ทำ งาน นี้ ได้",
        "romaji": "Mâen wâa kon tang mot mai yûu duai, chan yang sa maart tham ngan nee dai",
        "en": "Even if everyone is not with me, I can still do this job.",
        "grammar_audio": "/audio/thai/grammar/s_แม้นว่า_mâen_wâa_-_Regardless_of_whether_20231230_แม้นว่า_คนทั้งหมด_ไม่_อยู่_ด้วย_ฉัน_ยัง_สามารถ_ทำ_งาน_นี้_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ระหว่าง (rá-wàang) - Between, among",
    "short_explanation": "Indicates something that is in the middle of two or more things; 'between', 'among'.",
    "long_explanation": "The term 'ระหว่าง (rá-wàang)' is commonly used in Thai to indicate something that is in the middle of two or more things or places. It is similar to the English 'between' or 'among'. This term is usually used with nouns and is placed before the noun it refers to. In other cases, this word can be used as a conjunction to show that an action is ongoing.",
    "formation": "ระหว่าง + Noun",
    "examples": [
      {
        "th": "ระหว่าง ที่ ฉัน อาศัย อยู่ ใน กรุงเทพฯ ฉัน ได้ เรียนรู้ ภาษา ไทย มาก ขึ้น",
        "romaji": "rá-wàang thi chan a-sai yoo nai Krung Thep, chan dai rian-ruu pha-saa Thai maak kheun",
        "en": "While I was living in Bangkok, I learned more Thai.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่าง_rá-wàang_-_Between_among_20231230_ระหว่าง_ที่_ฉัน_อาศัย_อยู่_ใน_กรุงเทพฯ_ฉัน_ได้_เรียนรู้_ภาษา_ไทย_มาก_ขึ้น.mp3"
      },
      {
        "th": "เขา กำลัง ตัดสินใจ เลือก ระหว่าง ว่า จะ เรียน ที่ มหาวิทยาลัย ไหน",
        "romaji": "Khao gam lang tat sin jai leuak rá-wàang wa ja rian thi mahawitthayalai nai",
        "en": "He is deciding between which university to study at.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่าง_rá-wàang_-_Between_among_20231230_เขา_กำลัง_ตัดสินใจ_เลือก_ระหว่าง_ว่า_จะ_เรียน_ที่_มหาวิทยาลัย_ไหน.mp3"
      },
      {
        "th": "ฉัน ชอบ เดิน ระหว่าง สวนสาธารณะ ใน ช่วง เย็น",
        "romaji": "Chan chop dern rá-wàang suan-satharanai nai chuang yen",
        "en": "I like walking among the public parks in the evening.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่าง_rá-wàang_-_Between_among_20231230_ฉัน_ชอบ_เดิน_ระหว่าง_สวนสาธารณะ_ใน_ช่วง_เย็น.mp3"
      },
      {
        "th": "มี การ ประชุม ระหว่าง ฝ่าย บริหาร และ พนักงาน เพื่อ หารือ โครงการ ใหม่",
        "romaji": "Mee gan prachum rá-wàang fai borihan lae phanak-ngan phuea ha-ruue krong-kan mai",
        "en": "There is a meeting between the management and the employees to discuss the new project.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่าง_rá-wàang_-_Between_among_20231230_มี_การ_ประชุม_ระหว่าง_ฝ่าย_บริหาร_และ_พนักงาน_เพื่อ_หารือ_โครงการ_ใหม่.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ภายใน (phāi nai) - Within, inside",
    "short_explanation": "'ภายใน' is used to express the concept of 'within' or 'inside' something. It may refer to physical space, a set time period, or a given context or circumstance.",
    "long_explanation": "'ภายใน' which translates to 'within' or 'inside' in English is a common term used in Thai. It can refer to being 'inside' or 'within' a physical space. When talking about time, 'ภายใน' is used to express events or actions happening 'within' a set period. Additionally, 'ภายใน' could be used to imply 'within' a specific context or circumstance. Note, 'ภายใน' is often followed by a noun.",
    "formation": "ภายใน + noun",
    "examples": [
      {
        "th": "ภายใน ห้อง นั้น มี เพียง แค่ ฉัน และ เขา ที่ อยู่",
        "romaji": "phāi nai h̄̂xng nạn mī phīyng k̂æ̀ chạn læa khậ thī̀ yxụ̄̀",
        "en": "Within that room, there was only him and me.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phāi_nai_-_Within_inside_20231230_ภายใน_ห้อง_นั้น_มี_เพียง_แค่_ฉัน_และ_เขา_ที่_อยู่.mp3"
      },
      {
        "th": "ภายใน ช่วง หนึ่ง สัปดาห์ ฉัน ต้อง ส่ง งาน นั้น",
        "romaji": "phāi nai ch̀wng nụ̄̀ng s̄ạpdāh̄ chạn tngxng s̄̀ng ngān nạn",
        "en": "Within one week, I must submit that work.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phāi_nai_-_Within_inside_20231230_ภายใน_ช่วง_หนึ่ง_สัปดาห์_ฉัน_ต้อง_ส่ง_งาน_นั้น.mp3"
      },
      {
        "th": "ภายใน ระยะ เวลา เสมอ ฉัน อ่าน หนังสือ",
        "romaji": "phāi nai rạyyạ welā s̄ǎmǝ̂ chạn ̀ān h̄nạngs̄ụ̄̂x",
        "en": "Within a consistent period of time, I read books.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phāi_nai_-_Within_inside_20231230_ภายใน_ระยะ_เวลา_เสมอ_ฉัน_อ่าน_หนังสือ.mp3"
      },
      {
        "th": "ภายใน ครอบครัว ฉัน เรา คมั่ง หากลยุทธ์ ให้ ดี",
        "romaji": "phāi nai khrบkhrụ̄a chạn rao khạmŷng h̄ā kllyụth̄ị̂ h̄ị̀ dī",
        "en": "Within my family, we always strategize well.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phāi_nai_-_Within_inside_20231230_ภายใน_ครอบครัว_ฉัน_เรา_คมั่ง_หากลยุทธ์_ให้_ดี.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ภายนอก (phāi nâawk) - Outside, externally",
    "short_explanation": "Indicates external location, 'outside' or 'externally'.",
    "long_explanation": "The term 'ภายนอก (phāi nâawk)' is frequently used in Thai to indicate an external location, similar to 'outside' or 'externally' in English. It is placed before a noun or pronoun to denote the place or area surrounding the mentioned noun or pronoun.",
    "formation": "ภายนอก + Noun/Pronoun",
    "examples": [
      {
        "th": "ภายนอก อาคาร มี สนามหญ้า ขนาด ใหญ่ สำหรับ การ จอด รถ",
        "romaji": "Phāi nâawk aa khaan mee sa naam yaa khà nâat yài sǎm ràp gaan jòt roht",
        "en": "Outside the building there is a large lawn for parking cars.",
        "grammar_audio": "/audio/thai/grammar/s_ภายนอก_phāi_nâawk_-_Outside_externally_20231230_ภายนอก_อาคาร_มี_สนามหญ้า_ขนาด_ใหญ่_สำหรับ_การ_จอด_รถ.mp3"
      },
      {
        "th": "ฉัน เข้า ไป ใน บ้าน แล้ว ภายนอก ดู แล สวน สำหรับ ฉัน",
        "romaji": "Chan khâo pai nai baan láew phāi nâawk duu lae sŭan sǎm ràp chan",
        "en": "I went inside the house and you look after the garden outside for me.",
        "grammar_audio": "/audio/thai/grammar/s_ภายนอก_phāi_nâawk_-_Outside_externally_20231230_ฉัน_เข้า_ไป_ใน_บ้าน_แล้ว_ภายนอก_ดู_แล_สวน_สำหรับ_ฉัน.mp3"
      },
      {
        "th": "มัน มืด มาก ภายนอก บ้าน",
        "romaji": "Man meuud mâak phāi nâawk baan",
        "en": "It's very dark outside the house.",
        "grammar_audio": "/audio/thai/grammar/s_ภายนอก_phāi_nâawk_-_Outside_externally_20231230_มัน_มืด_มาก_ภายนอก_บ้าน.mp3"
      },
      {
        "th": "มี คน อยู่ ภายนอก ห้อง ของ เรา การ ทำ อะไร",
        "romaji": "Mee kon yùu phāi nâawk hâwng kông rao, gaan tham à-rai",
        "en": "There are people outside our room, what are they doing?",
        "grammar_audio": "/audio/thai/grammar/s_ภายนอก_phāi_nâawk_-_Outside_externally_20231230_มี_คน_อยู่_ภายนอก_ห้อง_ของ_เรา_การ_ทำ_อะไร.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ภายหลัง (phāi lǎng) - Later, in the future",
    "short_explanation": "Used to indicate an action or state that will occur later or in the future.",
    "long_explanation": "The Thai term 'ภายหลัง (phāi lǎng)' is typically used to indicate a future time or a forthcoming action. It is quite similar to the English terms 'later' or 'in the future'. It can be positioned at the beginning or end of a sentence. It is flexible and can be used with a wide variety of verbs, adjectives and phrases to express an action, state or event that will take place in future.",
    "formation": "Statement + ภายหลัง or ภายหลัง + Statement",
    "examples": [
      {
        "th": "ฉัน จะ ไป ค้างคาว ภายหลัง หลังจาก ทำงาน เสร็จ",
        "romaji": "Chan ja pai khang khao phāi lǎng lang jàak tham ngaan set",
        "en": "I will go camping later, after I finish my work.",
        "grammar_audio": "/audio/thai/grammar/s_ภายหลัง_phāi_lǎng_-_Later_in_the_future_20231230_ฉัน_จะ_ไป_ค้างคาว_ภายหลัง_หลังจาก_ทำงาน_เสร็จ.mp3"
      },
      {
        "th": "ภายหลัง อาจ จะ เจอกัน ใน งาน ปาร์ตี้",
        "romaji": "Phāi lǎng aj ja jeer kan nai ngaan party",
        "en": "We may meet at the party later.",
        "grammar_audio": "/audio/thai/grammar/s_ภายหลัง_phāi_lǎng_-_Later_in_the_future_20231230_ภายหลัง_อาจ_จะ_เจอกัน_ใน_งาน_ปาร์ตี้.mp3"
      },
      {
        "th": "เขา ดู เป็นคน ยุติธรรม แต่ ภายหลัง ฉัน พบ ว่า เขา ไม่ เป็นอย่าง ที่ คิด",
        "romaji": "Khao du pen khon yutitham tae phāi lǎng chan phob wa khao mai pen yang thi kit",
        "en": "He seems fair, but later, I found out he wasn't what I thought.",
        "grammar_audio": "/audio/thai/grammar/s_ภายหลัง_phāi_lǎng_-_Later_in_the_future_20231230_เขา_ดู_เป็นคน_ยุติธรรม_แต่_ภายหลัง_ฉัน_พบ_ว่า_เขา_ไม่_เป็นอย่าง_ที่_คิด.mp3"
      },
      {
        "th": "ภายหลัง นี้ ฉัน ต้องการ ที่จะ เรียน ภาษา ไทย อย่าง รอบคอบ",
        "romaji": "Phāi lǎng ni chan tong kan thi ja rian pha sa thai yang rob khop",
        "en": "In the future, I want to study Thai language thoroughly.",
        "grammar_audio": "/audio/thai/grammar/s_ภายหลัง_phāi_lǎng_-_Later_in_the_future_20231230_ภายหลัง_นี้_ฉัน_ต้องการ_ที่จะ_เรียน_ภาษา_ไทย_อย่าง_รอบคอบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ตลอด (dtà-làwt) - Throughout, continuously",
    "short_explanation": "Used to indicate a continued action or state over a period of time; 'throughout, continuously'.",
    "long_explanation": "The term 'ตลอด (dtà-làwt)' is commonly used in Thai to signify a consistent and continuous action or state over a certain period of time. Just like 'throughout' or 'continuously in English, 'ตลอด (dtà-làwt)' can be used with different verbs, adjectives, and expressions to represent an ongoing activity or condition.",
    "formation": "Statement + ตลอด",
    "examples": [
      {
        "th": "เขา ฝึกซ้อม ภาษา ไทย หนัก ตลอด ปี",
        "romaji": "Khao feuk som pha-sa Thai nak dtà-làwt pii",
        "en": "He has rigorously practiced Thai throughout the year.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอด_dtà-làwt_-_Throughout_continuously_20231230_เขา_ฝึกซ้อม_ภาษา_ไทย_หนัก_ตลอด_ปี.mp3"
      },
      {
        "th": "ฉัน ช่วย เตรียม อาหาร ให้ แม่ ตลอด เวลา",
        "romaji": "Chan chuay triam a-han hai mae dtà-làwt we-laa",
        "en": "I help prepare food for my mother all the time.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอด_dtà-làwt_-_Throughout_continuously_20231230_ฉัน_ช่วย_เตรียม_อาหาร_ให้_แม่_ตลอด_เวลา.mp3"
      },
      {
        "th": "เขา สามารถ ทำงาน ได้ ดี ใน แบบ ทีม ตลอด ปี",
        "romaji": "Khao samart tham-ngan dai dii nai baep team dtà-làwt pii",
        "en": "He can work well in a team setting throughout the year.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอด_dtà-làwt_-_Throughout_continuously_20231230_เขา_สามารถ_ทำงาน_ได้_ดี_ใน_แบบ_ทีม_ตลอด_ปี.mp3"
      },
      {
        "th": "ฉัน มักจะ ทำ สมัยรำลึก ไป ยาว ยาว แล้ว ทำ แบบ การ์ตูน ให้ บันทึก มัน ตลอด เวลา",
        "romaji": "Chan mak ja tham saatya-satarm-raluek pai yaao yao lae tham baep kahtoon hai ban-theuk man dtà-làwt we-laa",
        "en": "I tend to make elaborate memoirs and then animate them to keep a record of them all the time.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอด_dtà-làwt_-_Throughout_continuously_20231230_ฉัน_มักจะ_ทำ_สมัยรำลึก_ไป_ยาว_ยาว_แล้ว_ทำ_แบบ_การ์ตูน_ให้_บันทึก_มัน_ตลอด_เวลา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ตาม (dtaam) - According to, follow",
    "short_explanation": "Used to indicate 'following', 'according to', or 'as per' in Thai language.",
    "long_explanation": "The word 'ตาม (dtaam)' is used in Thai language to convey the English equals 'according to', 'as per', or 'follow'. It is commonly used before a reference or source to indicate that the action or statement is based on or follows from that reference. It is generally placed between the subject and the object or reference of the sentence.",
    "formation": "Subject + ตาม + Reference/Object",
    "examples": [
      {
        "th": "เขา ได้ ทำ งาน ตาม แผน ที่ เขา ได้ วาง ไว้",
        "romaji": "Khao dai tham ngaan dtaam phaen thi khao dai wang wai",
        "en": "He did the work according to the plan he had laid out.",
        "grammar_audio": "/audio/thai/grammar/s_ตาม_dtaam_-_According_to_follow_20231230_เขา_ได้_ทำ_งาน_ตาม_แผน_ที่_เขา_ได้_วาง_ไว้.mp3"
      },
      {
        "th": "เรา ควร ดำเนินการ ตาม คำแนะนำ ของ แพทย์",
        "romaji": "Rao kuan dam nein gaan dtaam kham nae nam kong phaet",
        "en": "We should proceed according to the doctor's advice.",
        "grammar_audio": "/audio/thai/grammar/s_ตาม_dtaam_-_According_to_follow_20231230_เรา_ควร_ดำเนินการ_ตาม_คำแนะนำ_ของ_แพทย์.mp3"
      },
      {
        "th": "ฉัน ต่อสู้ ตาม ความสามารถ ของ คุณ เลย",
        "romaji": "Chan dto suu dtaam khwam sa maat kong khun loei",
        "en": "I fight according to your abilities.",
        "grammar_audio": "/audio/thai/grammar/s_ตาม_dtaam_-_According_to_follow_20231230_ฉัน_ต่อสู้_ตาม_ความสามารถ_ของ_คุณ_เลย.mp3"
      },
      {
        "th": "เรา ทำ ของชำร่วย ตาม ประเพณี ไทย",
        "romaji": "Rao tham kong chum ruay dtaam pra pha nee Thai",
        "en": "We make favors according to Thai traditions.",
        "grammar_audio": "/audio/thai/grammar/s_ตาม_dtaam_-_According_to_follow_20231230_เรา_ทำ_ของชำร่วย_ตาม_ประเพณี_ไทย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "จนถึง (jon thǔeng) - Until, up to",
    "short_explanation": "This term is used to indicate a point or time up to which an action extends or a situation continues.",
    "long_explanation": "In the Thai language, 'จนถึง (jon thǔeng)' is used to denote the limit or extent up to which an action continues or a situation remains. It can be translated to 'until' or 'up to' in English. Generally, it is placed before the noun or time period marking the end point. It can be used with various types of verbs and scenarios to denote duration, extension, or limit of an action or situation.",
    "formation": "Statement + จนถึง",
    "examples": [
      {
        "th": "ฉัน จะ ทำงาน อย่าง หนัก จนถึง ขั้นตอน สุดท้าย เพื่อ ให้ ได้ผลงาน ที่ ดี",
        "romaji": "Chan ja tham ngaan yang nak jon thǔeng khan thon sut thai phuea hai dai pha-ngaan thi di",
        "en": "I will work hard until the final step to get a good result.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึง_jon_thǔeng_-_Until_up_to_20231230_ฉัน_จะ_ทำงาน_อย่าง_หนัก_จนถึง_ขั้นตอน_สุดท้าย_เพื่อ_ให้_ได้ผลงาน_ที่_ดี.mp3"
      },
      {
        "th": "เพื่อน ของ ฉัน อ่าน หนังสือ จนถึง ตี สาม ทุก คืน เพื่อ ทบทวน ให้ รู้ ทุก ที่",
        "romaji": "Pheuan kong chan aan nang sue jon thǔeng tee sam thuk khuen phuea thop thuan hai ru thuk thi",
        "en": "My friend reads books until three o'clock every night to review everything.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึง_jon_thǔeng_-_Until_up_to_20231230_เพื่อน_ของ_ฉัน_อ่าน_หนังสือ_จนถึง_ตี_สาม_ทุก_คืน_เพื่อ_ทบทวน_ให้_รู้_ทุก_ที่.mp3"
      },
      {
        "th": "เรา ใช้เวลา วันนี้ ทำงาน จนถึง ตอนบ่าย โมง เพื่อ ที่ จะ ทัน เสร็จ งาน",
        "romaji": "Rao chai we la wan ni tham ngan jon thǔeng thon baai mong phuea thi ja than set ngan",
        "en": "We use time today working until midday in order to finish the work on time.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึง_jon_thǔeng_-_Until_up_to_20231230_เรา_ใช้เวลา_วันนี้_ทำงาน_จนถึง_ตอนบ่าย_โมง_เพื่อ_ที่_จะ_ทัน_เสร็จ_งาน.mp3"
      },
      {
        "th": "นักเรียน ควร อ่าน และ ทบทวน หนังสือ จนถึง วันสอบ ล่วงหน้า อย่างน้อย สาม วัน",
        "romaji": "Nak rian khuan aan lae thop thuan nang sue jon thǔeng wan sob luang na ang noi sam wan",
        "en": "Students should read and review their books until at least three days before the exam day.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึง_jon_thǔeng_-_Until_up_to_20231230_นักเรียน_ควร_อ่าน_และ_ทบทวน_หนังสือ_จนถึง_วันสอบ_ล่วงหน้า_อย่างน้อย_สาม_วัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ทันที (than thii) - Immediately, right away",
    "short_explanation": "Indicates the immediate occurrence of an action; 'immediately', 'right away'.",
    "long_explanation": "The term 'ทันที (than thii)' is used in Thai to indicate the immediate occurrence of an action, equivalent to the English 'immediately' or 'right away'. It is usually placed after the verbs or actions to denote a sense of urgency or suddenness. This phrase is versatile and can be used with a variety of action words, transforming them to denote an immediate or timely quality.",
    "formation": "Action + ทันที",
    "examples": [
      {
        "th": "เมื่อ ฉัน ได้รับ จดหมาย นั้น ฉัน ไป หา เขา ทันที",
        "romaji": "Muea chan dai rap jot maa nai, chan pai ha khao than thii",
        "en": "When I received that letter, I went to see him immediately.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_right_away_20231230_เมื่อ_ฉัน_ได้รับ_จดหมาย_นั้น_ฉัน_ไป_หา_เขา_ทันที.mp3"
      },
      {
        "th": "ถ้า พ่อ รู้ ว่า เธอ ชนะ การ แข่งขัน เขา จะ ปลื้มใจ ทันที",
        "romaji": "Tha phor roo wa thoe cha na kan khaeng kan, khao ja pleum jai than thii",
        "en": "If dad knows you won the competition, he will be delighted right away.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_right_away_20231230_ถ้า_พ่อ_รู้_ว่า_เธอ_ชนะ_การ_แข่งขัน_เขา_จะ_ปลื้มใจ_ทันที.mp3"
      },
      {
        "th": "ทันที ที่ ฉัน เห็น มัน เฉา ฉัน รู้ ว่า ต้อง ทำ อะไร ทันที",
        "romaji": "Than thii thi chan hen man chao, chan roo wa tong tam a rai than thii",
        "en": "As soon as I saw it wilt, I knew what had to be done right away.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_right_away_20231230_ทันที_ที่_ฉัน_เห็น_มัน_เฉา_ฉัน_รู้_ว่า_ต้อง_ทำ_อะไร_ทันที.mp3"
      },
      {
        "th": "ผม อ้าปาก งง จาก คำ พูด ที่ ยาก ทันที",
        "romaji": "Phom a paak ngoong jak kam phut thi yak than thii",
        "en": "I was immediately puzzled by the difficult words.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_right_away_20231230_ผม_อ้าปาก_งง_จาก_คำ_พูด_ที่_ยาก_ทันที.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "บ่อย (bòi) - Often, frequently",
    "short_explanation": "Expresses the frequency of an occurrence or action; 'often' or 'frequently'.",
    "long_explanation": "The term 'บ่อย (bòi)' is frequently used in Thai to denote the regularity or frequency of an action or event, corresponding to the English words 'often' or 'frequently'. It's generally placed after the main statement or action to indicate its recurring nature. This word is versatile and pairs well with various verbs, adjectives and sentences, allowing learners to express a wide range of frequently occurring situations or actions.",
    "formation": "Statement + บ่อย",
    "examples": [
      {
        "th": "เขา มัก ไป ออกกำลังกาย หลังจาก ทำงาน บ่อย",
        "romaji": "Khao mak pai auk kam lang gai lang jak tham ngan bòi",
        "en": "He often goes to exercise after work.",
        "grammar_audio": "/audio/thai/grammar/s_บ่อย_bòi_-_Often_frequently_20231230_เขา_มัก_ไป_ออกกำลังกาย_หลังจาก_ทำงาน_บ่อย.mp3"
      },
      {
        "th": "ฉัน เดินทาง ไป สถานี รถไฟ บ่อย",
        "romaji": "Chan doin thang pai sa thani rot fai bòi",
        "en": "I often travel to the train station.",
        "grammar_audio": "/audio/thai/grammar/s_บ่อย_bòi_-_Often_frequently_20231230_ฉัน_เดินทาง_ไป_สถานี_รถไฟ_บ่อย.mp3"
      },
      {
        "th": "เรา ชอบ คุยกัน หลังจาก เรียน บ่อย",
        "romaji": "Rao chop khui kan lang jak rian bòi",
        "en": "We often chat after class.",
        "grammar_audio": "/audio/thai/grammar/s_บ่อย_bòi_-_Often_frequently_20231230_เรา_ชอบ_คุยกัน_หลังจาก_เรียน_บ่อย.mp3"
      },
      {
        "th": "เธอ แวะ มา ที่ ร้าน กาแฟ บ่อย",
        "romaji": "Thoe wae ma thi ran gaa fae bòi",
        "en": "She often stops by the coffee shop.",
        "grammar_audio": "/audio/thai/grammar/s_บ่อย_bòi_-_Often_frequently_20231230_เธอ_แวะ_มา_ที่_ร้าน_กาแฟ_บ่อย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "หา (hǎa) - To search for, to look for",
    "short_explanation": "Used for expressing the action of searching or looking for something or someone.",
    "long_explanation": "The term 'หา (hǎa)' is a basic Thai word used to describe the action of searching or looking for something. It can be used to denote the physical act of looking for something lost or misplaced, but it also applies to the general act of seeking something intangible or abstract, such as a solution, an answer, or a reason. This word usually precedes a noun, the object being searched for.",
    "formation": "หา + object",
    "examples": [
      {
        "th": "เขา กำลัง หา คีย์ รถ ที่ เขา ทำ หาย",
        "romaji": "Khao kamlang hǎa ki rot thi khao tham hai",
        "en": "He is looking for the car key that he lost.",
        "grammar_audio": "/audio/thai/grammar/s_หา_hǎa_-_To_search_for_to_look_for_20231230_เขา_กำลัง_หา_คีย์_รถ_ที่_เขา_ทำ_หาย.mp3"
      },
      {
        "th": "ฉัน กำลัง หา คำตอบ สำหรับ ปัญหา นี้",
        "romaji": "Chan kamlang hǎa kham tob samrub panha ni",
        "en": "I am looking for an answer to this problem.",
        "grammar_audio": "/audio/thai/grammar/s_หา_hǎa_-_To_search_for_to_look_for_20231230_ฉัน_กำลัง_หา_คำตอบ_สำหรับ_ปัญหา_นี้.mp3"
      },
      {
        "th": "เรา ควร หา วิธี ใหม่ ใน การ จัดการ กับ สถานการณ์",
        "romaji": "Rao khuan hǎa witi mai nai kan jat kan gab sathana kan",
        "en": "We should look for a new way to handle the situation.",
        "grammar_audio": "/audio/thai/grammar/s_หา_hǎa_-_To_search_for_to_look_for_20231230_เรา_ควร_หา_วิธี_ใหม่_ใน_การ_จัดการ_กับ_สถานการณ์.mp3"
      },
      {
        "th": "ทุกคน กำลัง หา คุณ อยู่ ค่าย มา นาน แล้ว",
        "romaji": "Thuk khon kamlang hǎa khun yu kai ma nan laeo",
        "en": "Everyone is looking for you, you've been gone for a while.",
        "grammar_audio": "/audio/thai/grammar/s_หา_hǎa_-_To_search_for_to_look_for_20231230_ทุกคน_กำลัง_หา_คุณ_อยู่_ค่าย_มา_นาน_แล้ว.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ประจำ (pra-jam) - Regular, routine, permanent",
    "short_explanation": "Used to show something is regular, routine or permanent.",
    "long_explanation": "The term 'ประจำ (pra-jam)' is used in Thai to denote something that is regular, routine or permanent, similar to the English 'regularly' or 'routinely'. It can be found in a wide array of contexts, from jobs, activities, to time expressions. When used in a sentence, 'ประจำ' typically pairs with a noun and is used after the subject of the sentence.",
    "formation": "Subject + ประจำ + Noun / Verb",
    "examples": [
      {
        "th": "ฉัน ขับรถ ไป ทำงาน ประจำ เมือง นี้",
        "romaji": "Chan kap rot pai tham ngan pra-jam meuang nee",
        "en": "I drive to work regularly in this city.",
        "grammar_audio": "/audio/thai/grammar/s_ประจำ_pra-jam_-_Regular_routine_permanent_20231230_ฉัน_ขับรถ_ไป_ทำงาน_ประจำ_เมือง_นี้.mp3"
      },
      {
        "th": "เขา มี หน้าที่ ตรวจสอบ คุณภาพ สินค้า ประจำ",
        "romaji": "Khao mee na that truat sob khun paap sin kha pra-jam",
        "en": "He has a regular duty to check the quality of the products.",
        "grammar_audio": "/audio/thai/grammar/s_ประจำ_pra-jam_-_Regular_routine_permanent_20231230_เขา_มี_หน้าที่_ตรวจสอบ_คุณภาพ_สินค้า_ประจำ.mp3"
      },
      {
        "th": "พอ เรียน เสร็จ ฉัน จะ ไป ออกกำลังกาย ใน สนาม ประจำ",
        "romaji": "Phor riian sret chan ja pai auk gamlang gai nai sa nam pra-jam",
        "en": "After I finish studying, I regularly go to the field to exercise.",
        "grammar_audio": "/audio/thai/grammar/s_ประจำ_pra-jam_-_Regular_routine_permanent_20231230_พอ_เรียน_เสร็จ_ฉัน_จะ_ไป_ออกกำลังกาย_ใน_สนาม_ประจำ.mp3"
      },
      {
        "th": "ทุก วัน อาทิตย์ ฉัน ขอบ คุณ พระเจ้า ที่ โบสถ์ ประจำ",
        "romaji": "Thuk wan aathit chan khorb khun phra jao thi bot pra-jam",
        "en": "Every Sunday, I thank God at the regular church.",
        "grammar_audio": "/audio/thai/grammar/s_ประจำ_pra-jam_-_Regular_routine_permanent_20231230_ทุก_วัน_อาทิตย์_ฉัน_ขอบ_คุณ_พระเจ้า_ที่_โบสถ์_ประจำ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "วันนี้ (wan níi) - Today",
    "short_explanation": "Refers to the present day; 'today'.",
    "long_explanation": "The term 'วันนี้ (wan níi)' is used in Thai language to refer to the present day, similar to the English 'today'. It is often used at the beginning or end of sentences. When used in conjunction with specific time phrases, it can denote the specific part of the day such as morning, afternoon or evening.",
    "formation": "วันนี้ + statement or Statement + วันนี้",
    "examples": [
      {
        "th": "วันนี้ ฉัน ต้อง ไป ทำงาน ถึง ดึก",
        "romaji": "wan níi chan dtong pai thamngaan theung deuk",
        "en": "Today, I have to work until late.",
        "grammar_audio": "/audio/thai/grammar/s_วันนี้_wan_níi_-_Today_20231230_วันนี้_ฉัน_ต้อง_ไป_ทำงาน_ถึง_ดึก.mp3"
      },
      {
        "th": "เขา ทำงาน ตั้งแต่ ช่วง ตอนเช้า วันนี้",
        "romaji": "Khao thamngaan dtang dtae chuang dton chao wan níi",
        "en": "He has been working since this morning.",
        "grammar_audio": "/audio/thai/grammar/s_วันนี้_wan_níi_-_Today_20231230_เขา_ทำงาน_ตั้งแต่_ช่วง_ตอนเช้า_วันนี้.mp3"
      },
      {
        "th": "ฉัน ว่าจะ ไม่ ไป ที่ โรงเรียน วันนี้",
        "romaji": "Chan wa ja mai pai thi rong rian wan níi",
        "en": "I think I won't go to school today.",
        "grammar_audio": "/audio/thai/grammar/s_วันนี้_wan_níi_-_Today_20231230_ฉัน_ว่าจะ_ไม่_ไป_ที่_โรงเรียน_วันนี้.mp3"
      },
      {
        "th": "วันนี้ อากาศ ดี จริง ๆ",
        "romaji": "wan níi a-gaht dii jing jing",
        "en": "The weather is really nice today.",
        "grammar_audio": "/audio/thai/grammar/s_วันนี้_wan_níi_-_Today_20231230_วันนี้_อากาศ_ดี_จริง_ๆ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "มั้ย (mái) - Question particle, isn't it?",
    "short_explanation": "A question particle used at the end of a sentence to turn it into a question; 'isn't it?', 'right?', or 'don't you?'",
    "long_explanation": "The term 'มั้ย (mái)' is used in Thai language to convert a statement into a question, similar to the English 'isn't it?', 'right?', or 'don't you?'. It is typically placed at the end of sentences. It is versatile and can be used with a wide range of sentences, transforming them into questions. This question particle does not alone indicate tone of surprise or disbelief like the English usage of 'right?' or 'isn't it?', hence context or added emphasis in speech could be used for that purpose.",
    "formation": "Statement + มั้ย",
    "examples": [
      {
        "th": "เธอ ไป ไปรษณีย์ วันนี้ มั้ย",
        "romaji": "thoe pai prasani wan ni mái",
        "en": "Did you go to the post office today?",
        "grammar_audio": "/audio/thai/grammar/s_มั้ย_mái_-_Question_particle_isnt_it_20231230_เธอ_ไป_ไปรษณีย์_วันนี้_มั้ย.mp3"
      },
      {
        "th": "นักเรียน ทุก คน ทำ การบ้าน ครบ แล้ว มั้ย",
        "romaji": "nakrian thuk kon tham kan baan krop laew mái",
        "en": "Has every student completed their homework?",
        "grammar_audio": "/audio/thai/grammar/s_มั้ย_mái_-_Question_particle_isnt_it_20231230_นักเรียน_ทุก_คน_ทำ_การบ้าน_ครบ_แล้ว_มั้ย.mp3"
      },
      {
        "th": "คุณ อยาก กิน ข้าว กับ ผม มั้ย",
        "romaji": "khun yak gin khao kab phom mái",
        "en": "Would you like to eat with me?",
        "grammar_audio": "/audio/thai/grammar/s_มั้ย_mái_-_Question_particle_isnt_it_20231230_คุณ_อยาก_กิน_ข้าว_กับ_ผม_มั้ย.mp3"
      },
      {
        "th": "ท่าน เหนื่อย จาก การ เดินทาง มั้ย",
        "romaji": "than neuy jak gan dern thang mái",
        "en": "Are you tired from the journey?",
        "grammar_audio": "/audio/thai/grammar/s_มั้ย_mái_-_Question_particle_isnt_it_20231230_ท่าน_เหนื่อย_จาก_การ_เดินทาง_มั้ย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ครั้ง (khráng) - Time (occasion, instance)",
    "short_explanation": "Denotes the term 'time' as in an instance or occasion when something happens.",
    "long_explanation": "The word 'ครั้ง (khráng)' is used frequently in Thai language to denote the term 'time' as in an instance or occasion when something happens. The term 'ครั้ง' can be placed after a verb or an adjective to convey a specific instance or occurrence. This usage is similar to the English usage of the word 'time' as in 'the first time', 'every time', or 'many times'.",
    "formation": "Verb/Adjective + ครั้ง",
    "examples": [
      {
        "th": "นี่ เป็น ครั้ง แรก ที่ ฉัน เดินทาง ไป ประเทศ อเมริกา",
        "romaji": "Ni pen khráng raek thi chan deinthang pai prathet Amerika",
        "en": "This is the first time I traveled to America.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้ง_khráng_-_Time_occasion_instance_20231230_นี่_เป็น_ครั้ง_แรก_ที่_ฉัน_เดินทาง_ไป_ประเทศ_อเมริกา.mp3"
      },
      {
        "th": "ฉัน เคย ผ่านพา สเกน ครั้ง หลาย เพื่อ ทดสอบ สุขภาพ",
        "romaji": "Chan koey phanpa scan khráng lai phuea totsop sukphap",
        "en": "I have undergone numerous scans for health checks.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้ง_khráng_-_Time_occasion_instance_20231230_ฉัน_เคย_ผ่านพา_สเกน_ครั้ง_หลาย_เพื่อ_ทดสอบ_สุขภาพ.mp3"
      },
      {
        "th": "ทุก ครั้ง ที่ เขา เห็น แมว แขน ของ เขา จะ ลุกขึ้น",
        "romaji": "Thuk khráng thi khao hen maew khaen kong khao ja luk khuen",
        "en": "Every time he sees a cat, his arms get goosebumps.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้ง_khráng_-_Time_occasion_instance_20231230_ทุก_ครั้ง_ที่_เขา_เห็น_แมว_แขน_ของ_เขา_จะ_ลุกขึ้น.mp3"
      },
      {
        "th": "ปี ที่ ผ่าน มา เป็น ครั้ง ที่ สอง ที่ ฉัน ผ่าน วันพักผ่อน ที่ เงียบสงบ",
        "romaji": "Pi thi phan ma pen khráng thi song thi chan phan wan phak phon thi ngyap song",
        "en": "Last year was the second time I had a peaceful rest day.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้ง_khráng_-_Time_occasion_instance_20231230_ปี_ที่_ผ่าน_มา_เป็น_ครั้ง_ที่_สอง_ที่_ฉัน_ผ่าน_วันพักผ่อน_ที่_เงียบสงบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ระหว่างที่ (rá-wàang thîi) - While, during the time that",
    "short_explanation": "This is commonly used to express 'while' or 'during the time that' indicating concurrent actions.",
    "long_explanation": "The term 'ระหว่างที่ (rá-wàang thîi)' is a conjunction used in Thai language to show two actions happening at the same time, similar to the English conjunction 'while' or 'during the time that'. It is generally placed at the start of the sentence or between two clauses to express simultaneous actions.",
    "formation": "Action 1 + ระหว่างที่ + Action 2",
    "examples": [
      {
        "th": "ระหว่างที่ ฉัน อยู่ ที่ กาแฟ กับ เพื่อน ฝน ก็ ตก",
        "romaji": "rá-wàang thîi chan yù tîi gaa-fae gàp pheūan, fǒn gâw tòk",
        "en": "While I was at the coffee shop with my friend, it rained.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่างที่_rá-wàang_thîi_-_While_during_the_time_that_20231230_ระหว่างที่_ฉัน_อยู่_ที่_กาแฟ_กับ_เพื่อน_ฝน_ก็_ตก.mp3"
      },
      {
        "th": "ระหว่างที่ เขา อยู่ ที่ งาน เขา ได้ รับ โทรศัพท์ จาก แฟน",
        "romaji": "rá-wàang thîi khao yù tîi ngaan, khao dâi ráp toh-rá-sàp jàak faen",
        "en": "While he was at work, he received a phone call from his girlfriend.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่างที่_rá-wàang_thîi_-_While_during_the_time_that_20231230_ระหว่างที่_เขา_อยู่_ที่_งาน_เขา_ได้_รับ_โทรศัพท์_จาก_แฟน.mp3"
      },
      {
        "th": "ระหว่างที่ เรา กำลัง ดู หนัง เขา ก็ หลับ ไป เลย",
        "romaji": "rá-wàang thîi rao gam-lang duu nǎng, khao gâw làp bpai loie",
        "en": "While we were watching a movie, he fell asleep.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่างที่_rá-wàang_thîi_-_While_during_the_time_that_20231230_ระหว่างที่_เรา_กำลัง_ดู_หนัง_เขา_ก็_หลับ_ไป_เลย.mp3"
      },
      {
        "th": "ระหว่างที่ ฉัน กำลัง ทำงาน โทรศัพท์ ก็ ร่วง ลง ไป บน พื้น",
        "romaji": "rá-wàang thîi chan gam-lang tham-ngaan, toh-rá-sàp gâw rûang long bpai bon pheun",
        "en": "While I was working, my phone fell onto the floor.",
        "grammar_audio": "/audio/thai/grammar/s_ระหว่างที่_rá-wàang_thîi_-_While_during_the_time_that_20231230_ระหว่างที่_ฉัน_กำลัง_ทำงาน_โทรศัพท์_ก็_ร่วง_ลง_ไป_บน_พื้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "แต่ละ (dtàe lá) - Each, every",
    "short_explanation": "Used for indicating each member of a group or every unit of time.",
    "long_explanation": "The term 'แต่ละ (dtàe lá)' is commonly used in Thai for expressing 'each' or 'every' before nouns or time words. When translating to English, it can be compared to words like 'each', 'every', or 'in each'. It is generally used to highlight individual elements within a group or emphasize an action happening regularly.",
    "formation": "แต่ละ + Noun/Time",
    "examples": [
      {
        "th": "ผม ไป วิ่ง ที่ สวน ใหญ่ แต่ละ วัน ค่ำคืน",
        "romaji": "Phom pai wing thi suan yai dtàe lá wan kham kheun",
        "en": "I go running in the park every evening.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_every_20231230_ผม_ไป_วิ่ง_ที่_สวน_ใหญ่_แต่ละ_วัน_ค่ำคืน.mp3"
      },
      {
        "th": "เรา ควร รดน้ำ ต้นไม้ แต่ละ วัน",
        "romaji": "Rao khuan rot nam ton mai dtàe lá wan",
        "en": "We should water the trees every day.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_every_20231230_เรา_ควร_รดน้ำ_ต้นไม้_แต่ละ_วัน.mp3"
      },
      {
        "th": "เขา กิน ผลไม้ แต่ละ หลัง เข้า อาหาร กลางวัน",
        "romaji": "Khao gin phon la mai dtàe lá lang kao a-han klang wan",
        "en": "He eats fruit after lunch every day.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_every_20231230_เขา_กิน_ผลไม้_แต่ละ_หลัง_เข้า_อาหาร_กลางวัน.mp3"
      },
      {
        "th": "ผม เช็ค อีเมล แต่ละ ชั่วโมง เพื่อ ไม่ พลาด ข่าว สำคัญ",
        "romaji": "Phom check email dtàe lá chua mong phuea mai plaad khaao sam kan",
        "en": "I check my email every hour so I don't miss important news.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_every_20231230_ผม_เช็ค_อีเมล_แต่ละ_ชั่วโมง_เพื่อ_ไม่_พลาด_ข่าว_สำคัญ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ซึ่ง (sûeng) - Which, that (relative pronoun)",
    "short_explanation": "Acts as a relative pronoun, similar to 'which', 'that', or 'who' in English.",
    "long_explanation": "The term 'ซึ่ง (sûeng)' in Thai acts as a relative pronoun, playing a similar role to 'which', 'that', or 'who' in English. It is used to introduce relative clauses, connecting the clause to a noun or pronoun referred earlier in a sentence. The relative clause then either explains or provides additional information about this noun or pronoun.",
    "formation": "Noun or pronoun + ซึ่ง  + Verb/Adjective",
    "examples": [
      {
        "th": "นักเรียน ซึ่ง ฉัน สอน อยู่ เพิ่ง ชนะ การ แข่งขัน วิทยาศาสตร์ ระดับ ชาติ",
        "romaji": "Nak rian sûeng chan sǒn yù pêrng chá-na gàan khaeng kan wít-yá-sǎt rá-dàp châat",
        "en": "The student whom I am teaching just won a national science competition.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_that_relative_pronoun_20231230_นักเรียน_ซึ่ง_ฉัน_สอน_อยู่_เพิ่ง_ชนะ_การ_แข่งขัน_วิทยาศาสตร์_ระดับ_ชาติ.mp3"
      },
      {
        "th": "คน นั้น ซึ่ง ฉัน รู้จัก เป็น นักเขียน ที่ มี ชื่อเสียง",
        "romaji": "Khon nán sûeng chan rú jàk pen nák-kîan thîi mii chûue-sǐang",
        "en": "That person, whom I know, is a famous writer.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_that_relative_pronoun_20231230_คน_นั้น_ซึ่ง_ฉัน_รู้จัก_เป็น_นักเขียน_ที่_มี_ชื่อเสียง.mp3"
      },
      {
        "th": "หนังสือ นั่ง อยู่ บน โต๊ะ ซึ่ง ฉัน ซื้อ มา คือ แนวทาง ของ ฉัน ใน อนาคต",
        "romaji": "Nang seu nung yù bon tó sûeng chan súe ma khue nae-wang khǒng chan nai a-nā-khǒt",
        "en": "The book that is on the table, which I bought, is my guide to the future.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_that_relative_pronoun_20231230_หนังสือ_นั่ง_อยู่_บน_โต๊ะ_ซึ่ง_ฉัน_ซื้อ_มา_คือ_แนวทาง_ของ_ฉัน_ใน_อนาคต.mp3"
      },
      {
        "th": "ผม อยู่ ใน โรงแรม ซึ่ง ฉัน พัก มา คืน นี้ หาก ไม่ มี ความ สะดวก",
        "romaji": "Phǒm yù nai rong-raem sûeng chan pák maa khuen níi hàak mâi mii khwaam să-dùeak",
        "en": "I am at the hotel where I stayed last night, if it is not inconvenient.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่ง_sûeng_-_Which_that_relative_pronoun_20231230_ผม_อยู่_ใน_โรงแรม_ซึ่ง_ฉัน_พัก_มา_คืน_นี้_หาก_ไม่_มี_ความ_สะดวก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ซับซ้อน (sáp sɔ́ɔn) - Complicated, complex",
    "short_explanation": "Expresses the state of being complicated or complex; 'complicated', 'complex'.",
    "long_explanation": "The term 'ซับซ้อน (sáp sɔ́ɔn)' is used to describe situations, things or problems that are not simple, but rather complicated or complex. It can be used to describe various concepts like problems, situations, relations, or feelings. It can be added before nouns, adjectives or verbs to specify the complexity or complicacy of the respective situation, thing or action.",
    "formation": "ซับซ้อน + Noun/Adjective/Verb",
    "examples": [
      {
        "th": "พวกเขา ต้องการ แก้ไข ปัญหา ที่ ซับซ้อน ให้ ถูกต้อง และ อย่าง เป็น ธรรม",
        "romaji": "Phuak khao tong kan kae kai pan ha thi sáp sɔ́ɔn hai thuk tong lae ang pen tham",
        "en": "They want to solve the complicated problem correctly and justly.",
        "grammar_audio": "/audio/thai/grammar/s_ซับซ้อน_sáp_sɔ́ɔn_-_Complicated_complex_20231230_พวกเขา_ต้องการ_แก้ไข_ปัญหา_ที่_ซับซ้อน_ให้_ถูกต้อง_และ_อย่าง_เป็น_ธรรม.mp3"
      },
      {
        "th": "ความสัมพันธ์ ระหว่าง เรา มัน เป็น เรื่อง ที่ ซับซ้อน มาก",
        "romaji": "Khwam sam-phan ra hua ng rao man pen rueang thi sáp sɔ́ɔn maak",
        "en": "The relationship between us is very complicated.",
        "grammar_audio": "/audio/thai/grammar/s_ซับซ้อน_sáp_sɔ́ɔn_-_Complicated_complex_20231230_ความสัมพันธ์_ระหว่าง_เรา_มัน_เป็น_เรื่อง_ที่_ซับซ้อน_มาก.mp3"
      },
      {
        "th": "การศึกษา ประวัติศาสตร์ ของ ประเทศนี้ มัน เป็น เรื่อง ที่ ซับซ้อน มาก",
        "romaji": "Kan sueksa pravatisat khong prathet nee man pen rueang thi sáp sɔ́ɔn maak",
        "en": "Studying the history of this country is a very complicated matter.",
        "grammar_audio": "/audio/thai/grammar/s_ซับซ้อน_sáp_sɔ́ɔn_-_Complicated_complex_20231230_การศึกษา_ประวัติศาสตร์_ของ_ประเทศนี้_มัน_เป็น_เรื่อง_ที่_ซับซ้อน_มาก.mp3"
      },
      {
        "th": "เชื่อ หรือ ไม่ เชื่อ แต่ ความรู้สึก ของ เธอ คือ เรื่อง ที่ ซับซ้อน ไม่ น้อย",
        "romaji": "Cheu reu mai cheu tae khwam rue seuk khong thoe kue rueang thi sáp sɔ́ɔn mai noi",
        "en": "Believe it or not, but her feelings are not a little complicated.",
        "grammar_audio": "/audio/thai/grammar/s_ซับซ้อน_sáp_sɔ́ɔn_-_Complicated_complex_20231230_เชื่อ_หรือ_ไม่_เชื่อ_แต่_ความรู้สึก_ของ_เธอ_คือ_เรื่อง_ที่_ซับซ้อน_ไม่_น้อย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "เกี่ยวกับ (gìao gàp) - About, related to",
    "short_explanation": "Expresses relation or linking to another person, thing, or topic; 'about' or 'related to'.",
    "long_explanation": "The term 'เกี่ยวกับ (gìao gàp)' is commonly used in Thai to connect different entities or concepts, similar to the English 'about' or 'related to'. It is typically used as a preposition to introduce the subject matter or topics of a conversation or discussion. It can also be used to indicate the relationship or connection between two entities.",
    "formation": "Statement + เกี่ยวกับ + Statement",
    "examples": [
      {
        "th": "เรื่องราว ที่ คุณ กำลัง พูด มัน เกี่ยวกับ อะไร",
        "romaji": "Rueang raw thi khun kam lang phut, man gìao gàp a rai",
        "en": "What is the story you're talking about?",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวกับ_gìao_gàp_-_About_related_to_20231230_เรื่องราว_ที่_คุณ_กำลัง_พูด_มัน_เกี่ยวกับ_อะไร.mp3"
      },
      {
        "th": "ผม อยาก ทราบ ข้อมูล เกี่ยวกับ คณะ วิศวกรรม",
        "romaji": "Phom yak sarap khor muam gìao gàp khana wisawa korn",
        "en": "I want to know about the engineering faculty.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวกับ_gìao_gàp_-_About_related_to_20231230_ผม_อยาก_ทราบ_ข้อมูล_เกี่ยวกับ_คณะ_วิศวกรรม.mp3"
      },
      {
        "th": "การ เรียน ภาษา ไทย มัน เกี่ยวกับ การ เข้าใจ วัฒนธรรม และ ประเพณี ของ ประเทศ",
        "romaji": "Kan rien phasa Thai man gìao gàp kan khao jai wattana tham lae prapeni khong prathet",
        "en": "Learning Thai has to do with understanding the country's culture and traditions.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวกับ_gìao_gàp_-_About_related_to_20231230_การ_เรียน_ภาษา_ไทย_มัน_เกี่ยวกับ_การ_เข้าใจ_วัฒนธรรม_และ_ประเพณี_ของ_ประเทศ.mp3"
      },
      {
        "th": "ผลงาน นี้ เกี่ยวกับ ประสบการณ์ ชีวิต ที่ ผม ได้ เจอ มา",
        "romaji": "Pholngan ni gìao gàp pra sob gaan chee wit thi phom dai jer ma",
        "en": "This work is about the life experiences I've had.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวกับ_gìao_gàp_-_About_related_to_20231230_ผลงาน_นี้_เกี่ยวกับ_ประสบการณ์_ชีวิต_ที่_ผม_ได้_เจอ_มา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "สมัย (sà-mai) - Era, period, time",
    "short_explanation": "'สมัย' is used to mention a period of time, an era, or to indicate when something took place.",
    "long_explanation": "In the Thai language, 'สมัย' is a noun that refers to a time period or era. It can be used to refer to a time period in history, such as 'ancient times' or 'the modern era', or it can represent a time that is personally significant, such as 'the time when I was a student'. This term is versatile and can be combined with other words to make it more specific, such as 'สมัยก่อน' ('samai kon') to mean 'in the old days' or 'สมัยนี้' ('samai nee') to mean 'in this era' or 'today'.",
    "formation": "สมัย + time-phrase",
    "examples": [
      {
        "th": "สมัย ที่ ฉัน เป็น นักเรียน ฉัน ชอบ เล่น กีฬา อย่าง มาก",
        "romaji": "Sà-mai thi chan pen nak-rian, chan chop len ki-la sa-yang maak",
        "en": "When I was a student, I liked to play sports a lot.",
        "grammar_audio": "/audio/thai/grammar/s_สมัย_sà-mai_-_Era_period_time_20231230_สมัย_ที่_ฉัน_เป็น_นักเรียน_ฉัน_ชอบ_เล่น_กีฬา_อย่าง_มาก.mp3"
      },
      {
        "th": "สมัย ก่อน คน ใช้ เครื่องมือ ทำงาน ที่ ทำด้วย ไม้ และ หิน",
        "romaji": "Sà-mai kon, khon chai krueang-mue tam-ngan thi tam-duay mai lae hin",
        "en": "In old times, people used tools made of wood and stone for work.",
        "grammar_audio": "/audio/thai/grammar/s_สมัย_sà-mai_-_Era_period_time_20231230_สมัย_ก่อน_คน_ใช้_เครื่องมือ_ทำงาน_ที่_ทำด้วย_ไม้_และ_หิน.mp3"
      },
      {
        "th": "เทคโนโลยี ที่ พัฒนา มา ใน สมัย นี้ ทำให้ การ สื่อสาร ง่าย ขึ้น มาก",
        "romaji": "Tek-no-lo-yi thi pat-tha-na ma nai sà-mai nee, tam hai gan sue-saan ngai kuen maak",
        "en": "The technology that has been developed in this era has made communication much easier.",
        "grammar_audio": "/audio/thai/grammar/s_สมัย_sà-mai_-_Era_period_time_20231230_เทคโนโลยี_ที่_พัฒนา_มา_ใน_สมัย_นี้_ทำให้_การ_สื่อสาร_ง่าย_ขึ้น_มาก.mp3"
      },
      {
        "th": "ศิลปะ และ วัฒนธรรม ใน สมัย โบราณ ถือ เป็น ทรัพย์สิน วัฒนธรรม ที่ มี คุณค่า สูง",
        "romaji": "Sin-lap lae wat-thana-tham nai sà-mai boran, theu pen sup-sin wat-thana-tham thi mee khun-kha suang",
        "en": "Art and culture in ancient times are considered cultural assets of high value.",
        "grammar_audio": "/audio/thai/grammar/s_สมัย_sà-mai_-_Era_period_time_20231230_ศิลปะ_และ_วัฒนธรรม_ใน_สมัย_โบราณ_ถือ_เป็น_ทรัพย์สิน_วัฒนธรรม_ที่_มี_คุณค่า_สูง.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "ฐานะ (thā-ná) - Status, position, situation",
    "short_explanation": "Indicates the status, position or the situation of someone or something.",
    "long_explanation": "The term 'ฐานะ (thā-ná)' is often used in Thai language to account for the status, position or situation of a person or entity. It is often used in conjunction with adjectives or verbs to clarify condition or status. In certain cases, 'ฐานะ' may also suggest the socio-economic status of an individual.",
    "formation": "Statement + ฐานะ",
    "examples": [
      {
        "th": "เธอ มี ฐานะ เป็น นักเรียน ที่ ดี ใน โรงเรียน และ นับถือ ใน คณะ ครู",
        "romaji": "Thoe mee thā-ná pen nak-rian thi di nai rong-rian lae nup-thueng nai khan khru",
        "en": "She has a status as a good student in school and respected in the faculty.",
        "grammar_audio": "/audio/thai/grammar/s_ฐานะ_thā-ná_-_Status_position_situation_20231230_เธอ_มี_ฐานะ_เป็น_นักเรียน_ที่_ดี_ใน_โรงเรียน_และ_นับถือ_ใน_คณะ_ครู.mp3"
      },
      {
        "th": "เขา มี ฐานะ ทาง การเงิน ที่ ร่ำรวย และ สามารถ มอบ ความสุข ต่าง ๆ ได้",
        "romaji": "Khao mee thā-ná thang kan-ngern thi ram-ruay lae sa-mart mawb khwam-sook tang tang dai",
        "en": "He has a wealthy financial position and can offer various kinds of happiness.",
        "grammar_audio": "/audio/thai/grammar/s_ฐานะ_thā-ná_-_Status_position_situation_20231230_เขา_มี_ฐานะ_ทาง_การเงิน_ที่_ร่ำรวย_และ_สามารถ_มอบ_ความสุข_ต่าง_ๆ_ได้.mp3"
      },
      {
        "th": "สมมุติฐานะ ทาง การเงิน ของ เขา อ่อนแอ ระบบ ต้อง เสียหาย",
        "romaji": "som-muti thā-ná thang kan-ngern khong kao on-ae ra-bob tong sia-haai",
        "en": "Assuming his financial situation is weak, the system would be damaged.",
        "grammar_audio": "/audio/thai/grammar/s_ฐานะ_thā-ná_-_Status_position_situation_20231230_สมมุติฐานะ_ทาง_การเงิน_ของ_เขา_อ่อนแอ_ระบบ_ต้อง_เสียหาย.mp3"
      },
      {
        "th": "ฉัน อยู่ ใน ฐานะ ที่ ไม่สามารถ ปฏิเสธ ข้อเสนอ นั้น ได้",
        "romaji": "Chan yu nai thā-ná thi mai samart pahdi-set kho-senorn nun dai",
        "en": "I am in a situation where I can't refuse that offer.",
        "grammar_audio": "/audio/thai/grammar/s_ฐานะ_thā-ná_-_Status_position_situation_20231230_ฉัน_อยู่_ใน_ฐานะ_ที่_ไม่สามารถ_ปฏิเสธ_ข้อเสนอ_นั้น_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "เช่น (chèn) - Such as, like, for instance",
    "short_explanation": "อนำสิ่งของ หรือ ตัวอย่าง ที่ เกี่ยวข้อง กับ สิ่งที่ กำลัง พูด ถึง มา ให้ ฟัง",
    "long_explanation": "เช่น นอกจากความหมายในภาษาอังกฤษว่า 'เช่น' หรือ 'เช่นเดียวกัน' แล้ว 'เช่น' ในภาษาไทยยังถูกใช้เพื่อยกตัวอย่างที่เกี่ยวข้องกับสิ่งที่กำลังถูกพูดถึง เช่นใช้เมื่อต้องการแสดงตัวอย่างเพิ่มเติมเกี่ยวกับสิ่งที่กำลังถูกพูดถึงหรือว่าถูกจัดเรียงเป็นหมวดหมู่หรือรายการ",
    "formation": "Statement + เช่น + Example(s)",
    "examples": [
      {
        "th": "ฉัน ชอบ ผลไม้ เช่น มะม่วง และ ส้ม",
        "romaji": "Chan chop phonlamai chèn ma-muang lae som.",
        "en": "I like fruits such as mangoes and oranges.",
        "grammar_audio": "/audio/thai/grammar/s_เช่น_chèn_-_Such_as_like_for_instance_20231230_ฉัน_ชอบ_ผลไม้_เช่น_มะม่วง_และ_ส้ม.mp3"
      },
      {
        "th": "เขา ชอบ ดนตรี จาก หลาย ประเทศ เช่น ญี่ปุ่น อินเดีย และ บราซิล",
        "romaji": "Khao chop dontri jak lai pratet chèn Yipun, India, lae Brasil.",
        "en": "He likes music from different countries such as Japan, India, and Brazil.",
        "grammar_audio": "/audio/thai/grammar/s_เช่น_chèn_-_Such_as_like_for_instance_20231230_เขา_ชอบ_ดนตรี_จาก_หลาย_ประเทศ_เช่น_ญี่ปุ่น_อินเดีย_และ_บราซิล.mp3"
      },
      {
        "th": "มี สถานที่ ที่ ฉัน อยาก ไป เช่น ปารีส โรม และ แอธเอนส์",
        "romaji": "Mee sathan thi, chan yak pai chèn Paris, Rome, lae Athens.",
        "en": "There are places I want to visit, such as Paris, Rome and Athens.",
        "grammar_audio": "/audio/thai/grammar/s_เช่น_chèn_-_Such_as_like_for_instance_20231230_มี_สถานที่_ที่_ฉัน_อยาก_ไป_เช่น_ปารีส_โรม_และ_แอธเอนส์.mp3"
      },
      {
        "th": "ซูซาน มี สัตว์ เลี้ยง หลาย ชนิด เช่น แมว สุนัข และ อัศวิน กระต่าย",
        "romaji": "Susan mee sat lieng lai chnid chèn maeo, sunak, lae atsawin kratay.",
        "en": "Susan has various pets such as cats, dogs, and rabbits.",
        "grammar_audio": "/audio/thai/grammar/s_เช่น_chèn_-_Such_as_like_for_instance_20231230_ซูซาน_มี_สัตว์_เลี้ยง_หลาย_ชนิด_เช่น_แมว_สุนัข_และ_อัศวิน_กระต่าย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "75"
  },
  {
    "title": "โดยเฉพาะ (dooi chê-phâw) - Especially, Particularly",
    "short_explanation": "This term is used to indicate special emphasis on a part of the sentence, similar to 'especially' or 'particularly' in English.",
    "long_explanation": "This term 'โดยเฉพาะ (dooi chê-phâw)' is used in Thai language to express the idea of 'especially' or 'particularly'. It is typically used after the subject or object in a sentence to indicate a special emphasis or importance about that part of the sentence. It is also often used to denote exception or to discriminate one thing from several others.",
    "formation": "Subject + โดยเฉพาะ",
    "examples": [
      {
        "th": "ผม ชอบ การ วาดภาพ โดยเฉพาะ ภาพสเก็ต",
        "romaji": "Phom chob gaan wat phap dooi chê-phâw phap saket",
        "en": "I like drawing, especially sketches.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooi_chê-phâw_-_Especially_Particularly_20231230_ผม_ชอบ_การ_วาดภาพ_โดยเฉพาะ_ภาพสเก็ต.mp3"
      },
      {
        "th": "เขา ชอบ กิน ผลไม้ โดยเฉพาะ ส้ม",
        "romaji": "Khao chob gin phon-lamai dooi chê-phâw som",
        "en": "He likes to eat fruits, especially oranges.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooi_chê-phâw_-_Especially_Particularly_20231230_เขา_ชอบ_กิน_ผลไม้_โดยเฉพาะ_ส้ม.mp3"
      },
      {
        "th": "เธอ ชอบ ดู ภาพยนตร์ โดยเฉพาะ ภาพยนตร์ รักแรกพบ",
        "romaji": "Thoe chob duu phap-ya-ntr dooi chê-phâw phap-ya-ntr rak raek pob",
        "en": "She likes to watch movies, especially romance movies.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooi_chê-phâw_-_Especially_Particularly_20231230_เธอ_ชอบ_ดู_ภาพยนตร์_โดยเฉพาะ_ภาพยนตร์_รักแรกพบ.mp3"
      },
      {
        "th": "วัน พุธ นี้ จะ ร้อน โดยเฉพาะ ใน ช่วงบ่าย",
        "romaji": "Wan phut nii ja ron dooi chê-phâw nai chuang baai",
        "en": "This Wednesday will be hot, especially in the afternoon.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooi_chê-phâw_-_Especially_Particularly_20231230_วัน_พุธ_นี้_จะ_ร้อน_โดยเฉพาะ_ใน_ช่วงบ่าย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เท่านั้น (thâo nán) - Only that much, just that",
    "short_explanation": "Expresses limitation or restriction to a certain extent or amount; 'only that much' or 'just that'.",
    "long_explanation": "The phrase 'เท่านั้น (thâo nán)' is typically used in Thai to convey the idea of limitation or restriction to a certain extent or quantity, similar to the English phrases 'only that much' or 'just that'. It occurs at the end of sentences, establishing a sense of limitation, conclusion or restriction on the preceding statement.",
    "formation": "Statement + เท่านั้น",
    "examples": [
      {
        "th": "เรา ทำ ได้ แค่ เรียนรู้ และ ปรับตัว ตาม สถานการณ์ เท่านั้น",
        "romaji": "Rao tham dai kae rian ru lae prab tua tam sa-tha-na-karn thâo nán",
        "en": "We can only learn and adapt according to the situation.",
        "grammar_audio": "/audio/thai/grammar/s_เท่านั้น_thâo_nán_-_Only_that_much_just_that_20231230_เรา_ทำ_ได้_แค่_เรียนรู้_และ_ปรับตัว_ตาม_สถานการณ์_เท่านั้น.mp3"
      },
      {
        "th": "ปริมาณ อาหาร ที่ เขา สามารถ รับประทาน ได้ ใน แต่ละ วัน คือ สอง จาน เท่านั้น",
        "romaji": "Pra-man a-han thi khao sa-marht rap prathan dai nai tae-la wan kheu song jan thâo nán",
        "en": "The amount of food he can eat each day is only two plates.",
        "grammar_audio": "/audio/thai/grammar/s_เท่านั้น_thâo_nán_-_Only_that_much_just_that_20231230_ปริมาณ_อาหาร_ที่_เขา_สามารถ_รับประทาน_ได้_ใน_แต่ละ_วัน_คือ_สอง_จาน_เท่านั้น.mp3"
      },
      {
        "th": "เธอ มี เวลา ว่าง สำหรับ การ อ่านหนังสือ แค่ ชั่วโมง หนึ่ง เท่านั้น",
        "romaji": "Thoe mee we-la wang sam-rap garn aan nung-sue kae chua mong neung thâo nán",
        "en": "She only has one hour of free time for reading books.",
        "grammar_audio": "/audio/thai/grammar/s_เท่านั้น_thâo_nán_-_Only_that_much_just_that_20231230_เธอ_มี_เวลา_ว่าง_สำหรับ_การ_อ่านหนังสือ_แค่_ชั่วโมง_หนึ่ง_เท่านั้น.mp3"
      },
      {
        "th": "ความต้องการ ของ ฉัน ง่าย มาก ฉัน ต้องการ ความ สุข แค่ เท่านั้น",
        "romaji": "Kwahm tong-garn kong chan ngaai maak, chan tong-garn kwahm suk kae thâo nán",
        "en": "My needs are very simple, I only want happiness.",
        "grammar_audio": "/audio/thai/grammar/s_เท่านั้น_thâo_nán_-_Only_that_much_just_that_20231230_ความต้องการ_ของ_ฉัน_ง่าย_มาก_ฉัน_ต้องการ_ความ_สุข_แค่_เท่านั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "จน (jon) - Until, till, to the extent that",
    "short_explanation": "Indicates a point in time or degree to which a certain action or condition continues.",
    "long_explanation": "The term 'จน (jon)' is commonly used in Thai to indicate a point until which an action or condition continues. It can refer to a period of time or degree. It is generally placed between two clauses where the first clause describes an action, and the second clause describes the result or consequence which takes place when the action in the first clause continues up to the point mentioned. It can also be used to describe an action that continues until a certain time.",
    "formation": "Action + จน + Result/Time",
    "examples": [
      {
        "th": "ฉัน เรียน ภาษา ไทย จน ฉัน สามารถ พูด ได้ เป็นอย่างดี",
        "romaji": "Chan rian phasa Thai jon chan samart phut dai pen yang dee",
        "en": "I studied Thai until I could speak it very well.",
        "grammar_audio": "/audio/thai/grammar/s_จน_jon_-_Until_till_to_the_extent_that_20231230_ฉัน_เรียน_ภาษา_ไทย_จน_ฉัน_สามารถ_พูด_ได้_เป็นอย่างดี.mp3"
      },
      {
        "th": "เขา ทำงาน อยู่ ที่ สำนักงาน จน ดึก",
        "romaji": "Khao tham ngan yu thi samnak ngan jon duek",
        "en": "He worked in the office till late.",
        "grammar_audio": "/audio/thai/grammar/s_จน_jon_-_Until_till_to_the_extent_that_20231230_เขา_ทำงาน_อยู่_ที่_สำนักงาน_จน_ดึก.mp3"
      },
      {
        "th": "เธอ อ่าน หนังสือ จน หลับ เข้า",
        "romaji": "Thoe an nang sue jon lap khao",
        "en": "She read a book until she fell asleep.",
        "grammar_audio": "/audio/thai/grammar/s_จน_jon_-_Until_till_to_the_extent_that_20231230_เธอ_อ่าน_หนังสือ_จน_หลับ_เข้า.mp3"
      },
      {
        "th": "เขา ออกกำลังกาย จน เหงื่อ ไหล ทุ่มน้ำท่วมตัว",
        "romaji": "Khao ok kam lang gai jon nguew lai thum nam thum tua",
        "en": "He exercised until he was drenched in sweat.",
        "grammar_audio": "/audio/thai/grammar/s_จน_jon_-_Until_till_to_the_extent_that_20231230_เขา_ออกกำลังกาย_จน_เหงื่อ_ไหล_ทุ่มน้ำท่วมตัว.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เชื่อ (chʉ̂ʉa) - To believe, to trust",
    "short_explanation": "Used for expressing the concept of belief or trust.",
    "long_explanation": "The word 'เชื่อ (chʉ̂ʉa)' in Thai language communicates the concept of belief or trust, similar to the English words 'to believe' or 'to trust'. This verb typically combines with other elements to form sentences, expressing a person's belief or trust in something or someone. It can also be used with negative constructs to express doubt or disbelief.",
    "formation": "Subject + เชื่อ + Object",
    "examples": [
      {
        "th": "ฉัน เชื่อ ว่า พวกเรา สามารถ ทำ ให้ สำเร็จ ได้",
        "romaji": "Chan chʉ̂ʉa wa phuak rao sa maat tam hai sam ret dai",
        "en": "I believe that we can succeed.",
        "grammar_audio": "/audio/thai/grammar/s_เชื่อ_chʉ̂ʉa_-_To_believe_to_trust_20231230_ฉัน_เชื่อ_ว่า_พวกเรา_สามารถ_ทำ_ให้_สำเร็จ_ได้.mp3"
      },
      {
        "th": "เขา ไม่ เชื่อ ใน ความ ซื่อสัตย์ ของ คน ที่ เขา ไม่ รู้จัก",
        "romaji": "Khao mai chʉ̂ʉa nai khwaam sʉ̂ʉ sat kong khon thi khao mai rʉʉ jak",
        "en": "He does not trust the honesty of people he doesn't know.",
        "grammar_audio": "/audio/thai/grammar/s_เชื่อ_chʉ̂ʉa_-_To_believe_to_trust_20231230_เขา_ไม่_เชื่อ_ใน_ความ_ซื่อสัตย์_ของ_คน_ที่_เขา_ไม่_รู้จัก.mp3"
      },
      {
        "th": "ฉัน เชื่อ ใน แรง กำลัง ของ ความมุ่งมั่น และ ความ สอดคล้อง",
        "romaji": "Chan chʉ̂ʉa nai raeng kam lang kong khwaam mung man lae khwaam sod khlong",
        "en": "I believe in the power of determination and consistency.",
        "grammar_audio": "/audio/thai/grammar/s_เชื่อ_chʉ̂ʉa_-_To_believe_to_trust_20231230_ฉัน_เชื่อ_ใน_แรง_กำลัง_ของ_ความมุ่งมั่น_และ_ความ_สอดคล้อง.mp3"
      },
      {
        "th": "เธอ ไม่ เชื่อ ว่า ฉัน สามารถ ทำ ได้",
        "romaji": "Thoe mai chʉ̂ʉa wa chan sa maat tam dai",
        "en": "She doesn't believe that I can do it.",
        "grammar_audio": "/audio/thai/grammar/s_เชื่อ_chʉ̂ʉa_-_To_believe_to_trust_20231230_เธอ_ไม่_เชื่อ_ว่า_ฉัน_สามารถ_ทำ_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เป็นต้นไป (pen dton bpai) - Onwards, and so forth",
    "short_explanation": "Used to indicate continuation from a certain point forward; 'onwards', 'and so forth'.",
    "long_explanation": "The phrase 'เป็นต้นไป (pen dton bpai)' is used in Thai language to indicate the continuation of an action, time, event, or condition from a certain point onwards. It is equivalent to the English terms 'onwards', 'and so forth', or 'etcetera'. This phrase is often placed after a specific point in time, number, or event to denote that everything following is included or continues in a similar manner.",
    "formation": "Specific point + เป็นต้นไป",
    "examples": [
      {
        "th": "วัน พุธ นี้ เป็นต้นไป ฉัน จะ เริ่ม เข้า สู่ คาบ เรียน ใหม่",
        "romaji": "Wan phut ni pen dton bpai, chan ja roem khao su kap rian mai",
        "en": "From this Wednesday onwards, I will start attending new classes.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dton_bpai_-_Onwards_and_so_forth_20231230_วัน_พุธ_นี้_เป็นต้นไป_ฉัน_จะ_เริ่ม_เข้า_สู่_คาบ_เรียน_ใหม่.mp3"
      },
      {
        "th": "กำหนดการ รายการ เริ่ม ต้น ตั้งแต่ ทาน อาหาร เที่ยง เป็นต้นไป",
        "romaji": "Gam not gaan rai ngaan roem dton tang tae tan a-haan tiang pen dton bpai",
        "en": "The schedule starts from lunch onwards.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dton_bpai_-_Onwards_and_so_forth_20231230_กำหนดการ_รายการ_เริ่ม_ต้น_ตั้งแต่_ทาน_อาหาร_เที่ยง_เป็นต้นไป.mp3"
      },
      {
        "th": "เขา ถูก ปรับ ปรุง ตำแหน่ง เป็น ผู้จัดการ โครงการ เค้าโครง เป็นต้นไป",
        "romaji": "Khao thuuk prapprung tam naeng pen phu chat gaan krong gaan khaao khroong pen dton bpai",
        "en": "He was promoted to be the project manager onwards.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dton_bpai_-_Onwards_and_so_forth_20231230_เขา_ถูก_ปรับ_ปรุง_ตำแหน่ง_เป็น_ผู้จัดการ_โครงการ_เค้าโครง_เป็นต้นไป.mp3"
      },
      {
        "th": "วัน เสาร์ นี้ เป็นต้นไป อาคาร สมทบ จะ ปิด ให้ เรา ทำการ ศึกษา อิสระ",
        "romaji": "Wan sao ni pen dton bpai, a-karn som thop ja pit hai rao tam gaan seuk sa is ra",
        "en": "From this Saturday onwards, the Associate Building will be closed for us to study independently.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dton_bpai_-_Onwards_and_so_forth_20231230_วัน_เสาร์_นี้_เป็นต้นไป_อาคาร_สมทบ_จะ_ปิด_ให้_เรา_ทำการ_ศึกษา_อิสระ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ส่ง (sòng) - To send, to deliver",
    "short_explanation": "Used to express the action of 'sending' or 'delivering' something.",
    "long_explanation": "ส่ง (sòng) is a Thai verb used when referring to the action of sending or delivering an object or a message. It is frequently used in situations where you need to send an item, a letter, or a package. It can also be used metaphorically to express sending feelings or thoughts.",
    "formation": "Noun (sender) + ส่ง + Noun (object) + ให้ + Noun (receiver)",
    "examples": [
      {
        "th": "แม่ ส่ง จดหมาย ให้ ฉัน ทุก สัปดาห์ ระหว่าง ที่ฉัน อยู่ ที่ มหาวิทยาลัย",
        "romaji": "Mae sòng jod maai hai chan thuk sap daah week ra waang thi chan yoo thi maha witthaya lai",
        "en": "My mother sends me a letter every week while I am at university.",
        "grammar_audio": "/audio/thai/grammar/s_ส่ง_sòng_-_To_send_to_deliver_20231230_แม่_ส่ง_จดหมาย_ให้_ฉัน_ทุก_สัปดาห์_ระหว่าง_ที่ฉัน_อยู่_ที่_มหาวิทยาลัย.mp3"
      },
      {
        "th": "ฉัน ส่ง ข้อความ รัก ผ่าน การ์ด วัน วาเลนไทน์ ให้ เธอ",
        "romaji": "Chan sòng khor kwam rak phaan gaat wan waa-len-thai hai thoe",
        "en": "I sent her a love message through a Valentine's Day card.",
        "grammar_audio": "/audio/thai/grammar/s_ส่ง_sòng_-_To_send_to_deliver_20231230_ฉัน_ส่ง_ข้อความ_รัก_ผ่าน_การ์ด_วัน_วาเลนไทน์_ให้_เธอ.mp3"
      },
      {
        "th": "บริษัท จะ ส่ง สินค้า ให้ คุณ ภายใน สาม วัน",
        "romaji": "Bo-ri-sat ja sòng sin khaa hai khun pai nai saam wan",
        "en": "The company will send the goods to you within three days.",
        "grammar_audio": "/audio/thai/grammar/s_ส่ง_sòng_-_To_send_to_deliver_20231230_บริษัท_จะ_ส่ง_สินค้า_ให้_คุณ_ภายใน_สาม_วัน.mp3"
      },
      {
        "th": "เธอ ส่ง รูปถ่าย วันหยุด ของ เธอ ให้ ฉัน เห็น",
        "romaji": "Thoe sòng rup thai wan yut kong thoe hai chan hen",
        "en": "She sent me a picture of her holiday.",
        "grammar_audio": "/audio/thai/grammar/s_ส่ง_sòng_-_To_send_to_deliver_20231230_เธอ_ส่ง_รูปถ่าย_วันหยุด_ของ_เธอ_ให้_ฉัน_เห็น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เพิ่ม (phôem) - To increase, to add",
    "short_explanation": "Used to express the idea of 'increasing' or 'adding' something.",
    "long_explanation": "The term 'เพิ่ม (phôem)' is used in Thai to express the act of increasing or adding something. It can be used with nouns or quantities to signify an addition or enhancement. It is usually placed before the noun or quantity that is being increased or added, and it often follows a verb.",
    "formation": "Verb + เพิ่ม + Noun/Quantity",
    "examples": [
      {
        "th": "ฉัน ต้อง ดื่ม น้ำ เพิ่ม ห้า แก้ว เพราะ อากาศ ร้อน มาก",
        "romaji": "Chan tong deum nam phôem ha gêw prôht a-gàht rôn mâak",
        "en": "I need to drink five more glasses of water because the weather is very hot.",
        "grammar_audio": "/audio/thai/grammar/s_เพิ่ม_phôem_-_To_increase_to_add_20231230_ฉัน_ต้อง_ดื่ม_น้ำ_เพิ่ม_ห้า_แก้ว_เพราะ_อากาศ_ร้อน_มาก.mp3"
      },
      {
        "th": "เขา เพิ่ม พนักงาน ใหม่ สอง คน ใน ทีม ของ เขา เพื่อ ความ มี ประสิทธิภาพ",
        "romaji": "Khao phôem pha-nák-ngaan mài sǎwng kon nai team kǒng khao pheûa khwaam mee prasit-tì-pâap",
        "en": "He added two new employees to his team for efficiency.",
        "grammar_audio": "/audio/thai/grammar/s_เพิ่ม_phôem_-_To_increase_to_add_20231230_เขา_เพิ่ม_พนักงาน_ใหม่_สอง_คน_ใน_ทีม_ของ_เขา_เพื่อ_ความ_มี_ประสิทธิภาพ.mp3"
      },
      {
        "th": "คุณ ควร เพิ่ม เวลา ออกกำลังกาย เป็น อาทิตย์ ละ สาม ครั้ง เพื่อ สุขภาพ ที่ ดี",
        "romaji": "Khun khruan phôem we-laa òk-kam-lang-gaai pen a-thít lá săam krúang pheûa sùk-kà-pâap thîi dîi",
        "en": "You should increase your exercise time to three times a week for good health.",
        "grammar_audio": "/audio/thai/grammar/s_เพิ่ม_phôem_-_To_increase_to_add_20231230_คุณ_ควร_เพิ่ม_เวลา_ออกกำลังกาย_เป็น_อาทิตย์_ละ_สาม_ครั้ง_เพื่อ_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "ผู้บริหาร ตัดสินใจ เพิ่ม เงิน เดือน ให้ พนักงาน ทั้ง หมด เป็น ทุน สั้นๆ",
        "romaji": "Phûu-borì-haan dtàt-sǐn-jai phôem ngern deuan hái pha-nák-ngaan tháng mòt pen thun sân-sân",
        "en": "The executives decided to increase the salaries of all employees in a short time.",
        "grammar_audio": "/audio/thai/grammar/s_เพิ่ม_phôem_-_To_increase_to_add_20231230_ผู้บริหาร_ตัดสินใจ_เพิ่ม_เงิน_เดือน_ให้_พนักงาน_ทั้ง_หมด_เป็น_ทุน_สั้นๆ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ลด (lót) - To decrease, to reduce",
    "short_explanation": "Indicates decreasing or reducing something.",
    "long_explanation": "The term 'ลด (lót)' is commonly used in Thai to indicate decreasing or reducing something. In a sentence, it's usually followed by the object that is being reduced or decreased. It is often used to describe diminishing quantities, volumes, or degrees.",
    "formation": "ลด + Object being decreased or reduced",
    "examples": [
      {
        "th": "ร้านค้า นี้ ลด ราคา สินค้า อย่าง มาก ใน ช่วง โปรโมชั่น",
        "romaji": "Ran khaa nee lót ra ga sin khaa yang maak nai chuang promo-chan",
        "en": "This shop greatly reduces the price of goods during promotions.",
        "grammar_audio": "/audio/thai/grammar/s_ลด_lót_-_To_decrease_to_reduce_20231230_ร้านค้า_นี้_ลด_ราคา_สินค้า_อย่าง_มาก_ใน_ช่วง_โปรโมชั่น.mp3"
      },
      {
        "th": "ขอ ลด ราคา ผลไม้ หน่อย ได้ ไหม ?",
        "romaji": "Khor lót ra kha pholamai noi dai mai?",
        "en": "Could you please reduce the price of the fruit?",
        "grammar_audio": "/audio/thai/grammar/s_ลด_lót_-_To_decrease_to_reduce_20231230_ขอ_ลด_ราคา_ผลไม้_หน่อย_ได้_ไหม_.mp3"
      },
      {
        "th": "ฉัน ต้องการ ลด น้ำหนัก โดย การ ออกกำลังกาย เพิ่ม",
        "romaji": "Chan tong gaan lót nam nak dooy gaan auk kam lang gaai peum",
        "en": "I want to lose weight by exercising more.",
        "grammar_audio": "/audio/thai/grammar/s_ลด_lót_-_To_decrease_to_reduce_20231230_ฉัน_ต้องการ_ลด_น้ำหนัก_โดย_การ_ออกกำลังกาย_เพิ่ม.mp3"
      },
      {
        "th": "เขา กำลัง ลด การ ใช้ พลังงาน แสง อาทิตย์ เพื่อ ลด การ ปล่อย ก๊าซ เรือนกระจก",
        "romaji": "Khao kam lang lót gaan chai phalang ngaan saeng aa-thit pheu lót gaan bploy gas ruean krachok",
        "en": "He is reducing the use of solar energy in order to decrease greenhouse gas emissions.",
        "grammar_audio": "/audio/thai/grammar/s_ลด_lót_-_To_decrease_to_reduce_20231230_เขา_กำลัง_ลด_การ_ใช้_พลังงาน_แสง_อาทิตย์_เพื่อ_ลด_การ_ปล่อย_ก๊าซ_เรือนกระจก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ข้างหน้า (khâang nâa) - In front of, ahead",
    "short_explanation": "Refers to the physical or temporal position of something that is in front or ahead.",
    "long_explanation": "The term 'ข้างหน้า (khâang nâa)' is used in Thai to describe the physical or temporal position of something that is 'in front' or 'ahead'. It is comparable to the English prepositions 'in front of' or 'ahead'. It's typically used to specify the location of an object or place relative to another, or to indicate future time in a sentence.",
    "formation": "Noun1 + ข้างหน้า + Noun2 ",
    "examples": [
      {
        "th": "สถานี รถไฟ อยู่ ข้างหน้า อาคาร สูง",
        "romaji": "Sathani rot fai yu khâang nâa a-karn suung",
        "en": "The train station is in front of the tall building.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหน้า_khâang_nâa_-_In_front_of_ahead_20231230_สถานี_รถไฟ_อยู่_ข้างหน้า_อาคาร_สูง.mp3"
      },
      {
        "th": "เขา อยู่ ข้างหน้า ฉัน ใน คิว การ ซื้อ ตั๋ว",
        "romaji": "Khao yu khâang nâa chan nai kiu kan sue tua",
        "en": "He is ahead of me in the ticket purchasing queue.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหน้า_khâang_nâa_-_In_front_of_ahead_20231230_เขา_อยู่_ข้างหน้า_ฉัน_ใน_คิว_การ_ซื้อ_ตั๋ว.mp3"
      },
      {
        "th": "มี งาน ที่ ต้อง ทำ อยู่ ข้างหน้า อีก เยอะ",
        "romaji": "Mee ngan thi tong tham yu khâang nâa eek yer",
        "en": "There is a lot of work to do ahead.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหน้า_khâang_nâa_-_In_front_of_ahead_20231230_มี_งาน_ที่_ต้อง_ทำ_อยู่_ข้างหน้า_อีก_เยอะ.mp3"
      },
      {
        "th": "ข้างหน้า เมือง ฝั่ง ตรงข้าม คือ ทะเล",
        "romaji": "Khâang nâa mueang fang trong kham keu tha-lay",
        "en": "Ahead of the city on the opposite shore is the sea.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหน้า_khâang_nâa_-_In_front_of_ahead_20231230_ข้างหน้า_เมือง_ฝั่ง_ตรงข้าม_คือ_ทะเล.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ข้างหลัง (khâang lǎng) - Behind, at the back",
    "short_explanation": "Indicates the position of something or someone that is at the back or behind of something or someone else.",
    "long_explanation": "The term 'ข้างหลัง (khâang lǎng)' is used in Thai to indicate the position of an object or person which is 'behind' or 'at the back' of something or someone else. It's often used in the context of giving directions, describing the relative position or locations of objects or people. It is typically placed after the noun it refers to, similar to the structure of 'behind' in English, i.e. [Noun] + ข้างหลัง.",
    "formation": "[Noun] + ข้างหลัง",
    "examples": [
      {
        "th": "รถ ที่ ฉัน ขับ อยู่ ข้างหลัง รถ กลับ",
        "romaji": "Rot thi chan khap yu khâang lǎng rot glap",
        "en": "The car that I am driving is behind the returning car.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหลัง_khâang_lǎng_-_Behind_at_the_back_20231230_รถ_ที่_ฉัน_ขับ_อยู่_ข้างหลัง_รถ_กลับ.mp3"
      },
      {
        "th": "คุณ สามารถ หา ห้องน้ำ ได้ ที่ ข้างหลัง อาคาร ร้าน กาแฟ",
        "romaji": "Khun sa maat ha hong nam dai thi khâang lǎng aa-karn raan gaa-fae",
        "en": "You can find the bathroom behind the coffee shop building.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหลัง_khâang_lǎng_-_Behind_at_the_back_20231230_คุณ_สามารถ_หา_ห้องน้ำ_ได้_ที่_ข้างหลัง_อาคาร_ร้าน_กาแฟ.mp3"
      },
      {
        "th": "เขา พัก อยู่ ใน ห้อง ที่ ตั้ง อยู่ ข้างหลัง อพาร์ตเมนต์",
        "romaji": "Khao pak yu nai hong thi tang yu khâang lǎng apaat men",
        "en": "He is staying in a room located at the back of the apartment.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหลัง_khâang_lǎng_-_Behind_at_the_back_20231230_เขา_พัก_อยู่_ใน_ห้อง_ที่_ตั้ง_อยู่_ข้างหลัง_อพาร์ตเมนต์.mp3"
      },
      {
        "th": "แมว ของ ฉัน ชอบ ซ่อน เล่น อยู่ ข้างหลัง โซฟา",
        "romaji": "Maew kong chan chop son len yu khâang lǎng sofa",
        "en": "My cat likes to play hide and seek behind the sofa.",
        "grammar_audio": "/audio/thai/grammar/s_ข้างหลัง_khâang_lǎng_-_Behind_at_the_back_20231230_แมว_ของ_ฉัน_ชอบ_ซ่อน_เล่น_อยู่_ข้างหลัง_โซฟา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เสมือน (sà-mʉan) - As if, resembling",
    "short_explanation": "Indicates similarity or resemblance; 'as if' or 'resembling'.",
    "long_explanation": "The term 'เสมือน (sà-mʉan)' is frequently employed in Thai language to illustrate similarity or likeness, corresponding to the English phrases 'as if' or 'resembling'. It is generally utilized at the introduction of sentences to draw comparisons or to make suppositions about a particular situation, action or object. Furthermore, it can be used together with differing types of verbs, adjectives, and phrases to portray comparison.",
    "formation": "เสมือน + Statement",
    "examples": [
      {
        "th": "เขา ยิ้ม เสมือน แสง อาทิตย์ ที่ อุ่น ๆ อยู่ ใน วัน หนาว ๆ",
        "romaji": "Khao yim sà-mʉan saeng a-thit thi un un yu nai wan nao nao",
        "en": "He smiled as if he was the warm sunlight in a cold day.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_เขา_ยิ้ม_เสมือน_แสง_อาทิตย์_ที่_อุ่น_ๆ_อยู่_ใน_วัน_หนาว_ๆ.mp3"
      },
      {
        "th": "ฉัน รู้สึก เสมือน อยู่ บน ฟ้า ทุก ครั้ง ที่ คุณ จับ มือ ฉัน",
        "romaji": "Chan ru suke sà-mʉan yu bon fa thook khrang thi khun jab mue chan",
        "en": "I feel as if I'm on cloud nine every time you hold my hand.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_ฉัน_รู้สึก_เสมือน_อยู่_บน_ฟ้า_ทุก_ครั้ง_ที่_คุณ_จับ_มือ_ฉัน.mp3"
      },
      {
        "th": "ภาพ นี้ สวย เหมือน ภาพ วาด เสมือน มี ชีวิต",
        "romaji": "Pap nee suay meuang pap wad sà-mʉan mee chee-wit",
        "en": "This picture is so beautiful, it's as if it's a drawing that's alive.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_ภาพ_นี้_สวย_เหมือน_ภาพ_วาด_เสมือน_มี_ชีวิต.mp3"
      },
      {
        "th": "เวลา ที่ เรา อยู่ ด้วยกัน ฉัน รู้สึก เสมือน ทั้ง โลก หยุด เวลา",
        "romaji": "We-la thi rao yu duay gan, chan ru suke sà-mʉan thang lok yut we-la",
        "en": "Every time we're together, it feels as if the whole world has stopped in time.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_เวลา_ที่_เรา_อยู่_ด้วยกัน_ฉัน_รู้สึก_เสมือน_ทั้ง_โลก_หยุด_เวลา.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "พร้อมกับ (phróam gàp) - Along with, ready with",
    "short_explanation": "Used to indicate simultaneity or parallelism; 'along with' or 'ready with'.",
    "long_explanation": "The term 'พร้อมกับ (phróam gàp)' is used in Thai as a conjunction to portray simultaneity or the occurrence of two actions or states at the same time. It can be translated to English as 'along with' or 'ready with'. It is also used to express readiness or preparedness in conjunction with another event or condition.",
    "formation": "Statement + พร้อมกับ + Statement",
    "examples": [
      {
        "th": "เวลา ไป ทริป ฉัน พร้อมกับ กล้อง ถ่ายรูป ทุก ครั้ง",
        "romaji": "Wela pai trip, chan phróam gàp klong tai ruup thuk krang",
        "en": "Every time I go on a trip, I always bring along my camera.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phróam_gàp_-_Along_with_ready_with_20231230_เวลา_ไป_ทริป_ฉัน_พร้อมกับ_กล้อง_ถ่ายรูป_ทุก_ครั้ง.mp3"
      },
      {
        "th": "เขา ส่ง รายงาน พร้อมกับ แผนการ ทุก อาทิตย์",
        "romaji": "Khao song raay ngan phróam gàp phaen gaan thuk a thiht",
        "en": "He submits the report along with the plan every week.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phróam_gàp_-_Along_with_ready_with_20231230_เขา_ส่ง_รายงาน_พร้อมกับ_แผนการ_ทุก_อาทิตย์.mp3"
      },
      {
        "th": "ใน การเดินทาง ครั้ง นี้ ฉัน พร้อมกับ สุดยอด อุปกรณ์ ท่องเที่ยว",
        "romaji": "Nai gaan dern tang krang ni, chan phróam gàp sut yot upa gaan thong thiao",
        "en": "For this trip, I am ready with the latest travel gear.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phróam_gàp_-_Along_with_ready_with_20231230_ใน_การเดินทาง_ครั้ง_นี้_ฉัน_พร้อมกับ_สุดยอด_อุปกรณ์_ท่องเที่ยว.mp3"
      },
      {
        "th": "เมื่อ มา ถึง สถานที่ นั้น ฉัน รู้สึก ตื่นเต้น พร้อมกับ เศร้า",
        "romaji": "Muea ma teung sathan thi nan, chan ru suuk theun ten phróam gàp sao",
        "en": "When I arrived at that place, I felt excited along with sadness.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phróam_gàp_-_Along_with_ready_with_20231230_เมื่อ_มา_ถึง_สถานที่_นั้น_ฉัน_รู้สึก_ตื่นเต้น_พร้อมกับ_เศร้า.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "แทนที่ (thɛɛn thîi) - Instead of",
    "short_explanation": "Used to express 'instead of' or 'in place of' in Thai.",
    "long_explanation": "The term 'แทนที่ (thɛɛn thîi)' is commonly used in Thai to show replacement or substitution of one action, object or person with another. It's akin to the English term 'instead of'. In Thai sentences, 'แทนที่' usually comes before the action, object or person that is being replaced.",
    "formation": "แทนที่ + [action/object/person being replaced]",
    "examples": [
      {
        "th": "แทนที่ จะ ต้อง ไป ทำงาน ใน สำนักงาน พวกเรา ได้ ทำงาน จาก บ้าน",
        "romaji": "Thɛɛn thîi ja tong pai tham-ngan nai samnak-ngan phuak-rao dai tham-ngan jak baan",
        "en": "Instead of having to go work in the office, we got to work from home.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่_thɛɛn_thîi_-_Instead_of_20231230_แทนที่_จะ_ต้อง_ไป_ทำงาน_ใน_สำนักงาน_พวกเรา_ได้_ทำงาน_จาก_บ้าน.mp3"
      },
      {
        "th": "แทนที่ จะ กิน ขนม ทำ ไม ไม่ กิน ผัก ดี ๆ หน่อย",
        "romaji": "Thɛɛn thîi ja gin khanom tham mai mai gin phak di di noi",
        "en": "Instead of eating sweets, why not eat some good vegetables.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่_thɛɛn_thîi_-_Instead_of_20231230_แทนที่_จะ_กิน_ขนม_ทำ_ไม_ไม่_กิน_ผัก_ดี_ๆ_หน่อย.mp3"
      },
      {
        "th": "แทนที่ จะ สั่ง ซื้อ ทาง ออนไลน์ ได้ รับ สินค้า ตรง จาก ผู้ ผลิต แทน",
        "romaji": "Thɛɛn thîi ja sang su thang on-lai dai rap sin-kha trong jak phu phlit thɛɛn",
        "en": "Instead of ordering online, received goods directly from the manufacturer instead.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่_thɛɛn_thîi_-_Instead_of_20231230_แทนที่_จะ_สั่ง_ซื้อ_ทาง_ออนไลน์_ได้_รับ_สินค้า_ตรง_จาก_ผู้_ผลิต_แทน.mp3"
      },
      {
        "th": "แทนที่ จะ รีบ ไป ที่ ถัด ไป เรา ควร พัก พัก หน่อย",
        "romaji": "Thɛɛn thîi ja reep pai thi that pai rao khuan phak phak noi",
        "en": "Instead of rushing to the next place, we should take a break.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่_thɛɛn_thîi_-_Instead_of_20231230_แทนที่_จะ_รีบ_ไป_ที่_ถัด_ไป_เรา_ควร_พัก_พัก_หน่อย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ดังกับ (dang gàp) - As if, like, as though",
    "short_explanation": "Used in comparisons to express likeness or similarity to another thing or situation.",
    "long_explanation": "The term 'ดังกับ (dang gàp)' functions similarly to the English phrases 'as if', 'like', or 'as though'. It is used in sentences to draw comparisons, indicating that something is occurring in the same way as another situation, or to describe something as having qualities similar to another thing. It is often followed by a noun, adjective or a verb phrase.",
    "formation": "Statement + ดังกับ + Statement",
    "examples": [
      {
        "th": "เธอ ยิ้ม ดังกับ ไม่มี อะไร เกิด ขึ้น ทั้งๆที่ เธอ กรีดร้อง ไป ทั้ง คืน",
        "romaji": "Thoe yim dang gàp mai mee a rai koet khuen thang thîi thoe greet raawng pai thang kheun",
        "en": "She smiled as if nothing had happened, even though she had been crying all night.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เธอ_ยิ้ม_ดังกับ_ไม่มี_อะไร_เกิด_ขึ้น_ทั้งๆที่_เธอ_กรีดร้อง_ไป_ทั้ง_คืน.mp3"
      },
      {
        "th": "เขา ดู ดังกับ คน ที่ ไม่มี ที่ พึ่ง แต่ อาสา มา ช่วย เตรียมอาหาร",
        "romaji": "Khao duu dang gàp khon thi mai mee thi peung tae a-sa ma chuai dtriam ahaan",
        "en": "He looked as though he had nowhere to turn, but volunteers came to help cooking food.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เขา_ดู_ดังกับ_คน_ที่_ไม่มี_ที่_พึ่ง_แต่_อาสา_มา_ช่วย_เตรียมอาหาร.mp3"
      },
      {
        "th": "ปรากฎ ขึ้น ดังกับ ลม ตก ใน สระ อากาศ นั้น ยังคง อยู่ แล้ว ก็ หายไป",
        "romaji": "Pra-kod khuen dang gàp lom tok nai sa a-gat nan yang kong yuu laeo gor hai pai",
        "en": "It appeared as if the air fell into the pond, the same air was still there and then it disappeared.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_ปรากฎ_ขึ้น_ดังกับ_ลม_ตก_ใน_สระ_อากาศ_นั้น_ยังคง_อยู่_แล้ว_ก็_หายไป.mp3"
      },
      {
        "th": "เธอ กิน ข้าว ดังกับ ไม่ ได้ รับ ประทานอาหาร นานๆ หนึ่ง",
        "romaji": "Thoe gin khao dang gàp mai dai rap brathan ahaan naan naan neung",
        "en": "She eats as if she hasn't eaten for a long time.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เธอ_กิน_ข้าว_ดังกับ_ไม่_ได้_รับ_ประทานอาหาร_นานๆ_หนึ่ง.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "แบบนี้ (bàeb níi) - Like this, this way",
    "short_explanation": "Used to indicate 'this way' or 'like this'. It points to a method, style, or manner that has been mentioned or is observable.",
    "long_explanation": "'แบบนี้ (bàeb níi)' refers to 'this kind of' or 'like this' in Thai. It is used to point towards a method, style or manner, either previously mentioned or observable within the context. It is typically placed at the end or in the middle of sentences, depending on what the speaker is referring to. This word is versatile and is used commonly in daily Thai conversation.",
    "formation": "Statement + แบบนี้",
    "examples": [
      {
        "th": "ถ้า อยาก ได้ ผล ดี คุณ ต้อง ทำ แบบนี้",
        "romaji": "Tha yaak dai pon dee, khun tong tham bàeb níi",
        "en": "If you want good results, you must do it this way.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนี้_bàeb_níi_-_Like_this_this_way_20231230_ถ้า_อยาก_ได้_ผล_ดี_คุณ_ต้อง_ทำ_แบบนี้.mp3"
      },
      {
        "th": "ฉัน ชอบ ที่นี่ แบบนี้ มัน สงบ และ สะอาด",
        "romaji": "Chan chob thi nii bàeb níi, man sa-ngob lae sa-at",
        "en": "I like it here like this, it's calm and clean.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนี้_bàeb_níi_-_Like_this_this_way_20231230_ฉัน_ชอบ_ที่นี่_แบบนี้_มัน_สงบ_และ_สะอาด.mp3"
      },
      {
        "th": "เขา วาด รูป ออก มา แบบนี้ ดู น่ารัก จริง ๆ",
        "romaji": "Khao wat ruup ok ma bàeb níi, du na-rak jing jing",
        "en": "He drew the picture out like this, it's really cute.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนี้_bàeb_níi_-_Like_this_this_way_20231230_เขา_วาด_รูป_ออก_มา_แบบนี้_ดู_น่ารัก_จริง_ๆ.mp3"
      },
      {
        "th": "ฉัน กิน อาหาร แบบนี้ มัน มี รสชาติ ดี",
        "romaji": "Chan gin a-han bàeb níi, man mee rot chaat di",
        "en": "I eat food like this, it tastes good.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนี้_bàeb_níi_-_Like_this_this_way_20231230_ฉัน_กิน_อาหาร_แบบนี้_มัน_มี_รสชาติ_ดี.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "แบบนั้น (bàeb nán) - Like that, that way",
    "short_explanation": "Used to reference the state or condition of something/someone previously mentioned; 'like that' or 'that way'.",
    "long_explanation": "The term 'แบบนั้น (bàeb nán)' is used in Thai to reference the state, condition, or action of something or someone that was previously mentioned in the conversation. It translates to English as 'like that' or 'that way'. It is used to refer back to a specific condition or state that has already been established in the context of the dialogue.",
    "formation": "Statement + แบบนั้น",
    "examples": [
      {
        "th": "ถ้า ต้องการ สมัครงาน นี่ ต้อง มี ประสบการณ์ ใน ด้าน ต่าง ๆ นะ ถ้า แบบนั้น ผม ต้อง ลอง ค้นหา งาน อื่น แทน ดีกว่า",
        "romaji": "Tha tung-karn som-kan-ngan ni tung mee pra-sop-garn nai dan tang tang na, tha bàeb nán, phom tung long kon-ha ngan eun taen dee-gwa",
        "en": "If you want to apply for this job, you must have experience in various fields, if that's the case, I'll try finding another job instead.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนั้น_bàeb_nán_-_Like_that_that_way_20231230_ถ้า_ต้องการ_สมัครงาน_นี่_ต้อง_มี_ประสบการณ์_ใน_ด้าน_ต่าง_ๆ_นะ_ถ้า_แบบนั้น_ผม_ต้อง_ลอง_ค้นหา_งาน_อื่น_แทน_ดีกว่า.mp3"
      },
      {
        "th": "เขา บอก ว่า เขา ไม่ สามารถ มา เจอ ผม แบบนั้น ผม ก็ ยอมรับ ว่า ผม คง ต้อง รอ อีก นาน",
        "romaji": "Khao bok wa khao mai sa-mart ma jer phom bàeb nán, phom kor yom-rap wa phom kong tung ror eek nan",
        "en": "He said he could not come and see me, if that's the case, I accept that I probably have to wait longer.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนั้น_bàeb_nán_-_Like_that_that_way_20231230_เขา_บอก_ว่า_เขา_ไม่_สามารถ_มา_เจอ_ผม_แบบนั้น_ผม_ก็_ยอมรับ_ว่า_ผม_คง_ต้อง_รอ_อีก_นาน.mp3"
      },
      {
        "th": "ขอ ก้อน น้ำแข็ง เพิ่ม หน่อย แต่ ถ้า มัน ทำให้ เครื่องดื่ม หมด รสชาติ แบบนั้น ขอ ไม่ ต้อง ค่ะ",
        "romaji": "Kor kon nam-kaeng perm noi tae tha man tam-hai khreung-deum mod rot-cha-ti bàeb nán, kor mai tung kha",
        "en": "Can I have some more ice, but if it's going to make the drink lose its taste like that, never mind.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนั้น_bàeb_nán_-_Like_that_that_way_20231230_ขอ_ก้อน_น้ำแข็ง_เพิ่ม_หน่อย_แต่_ถ้า_มัน_ทำให้_เครื่องดื่ม_หมด_รสชาติ_แบบนั้น_ขอ_ไม่_ต้อง_ค่ะ.mp3"
      },
      {
        "th": "ถ้า มัน ยาก แบบนั้น ฉัน คิด ว่า ฉัน คง ไม่ เป็นไปได้ ที่ จะ สำเร็จ",
        "romaji": "Tha man yark bàeb nán, chan kit wa chan kong mai pen-pai-dai thi ja sam-ret",
        "en": "If it's this hard, I think I may not be able to succeed.",
        "grammar_audio": "/audio/thai/grammar/s_แบบนั้น_bàeb_nán_-_Like_that_that_way_20231230_ถ้า_มัน_ยาก_แบบนั้น_ฉัน_คิด_ว่า_ฉัน_คง_ไม่_เป็นไปได้_ที่_จะ_สำเร็จ.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ใกล้ (glâi) - Near, close",
    "short_explanation": "Used to mean 'near' or 'close to' something.",
    "long_explanation": "The term 'ใกล้ (glâi)' is used in Thai to mean 'near' or 'close to' something. It antecedes the noun or pronouns to denote proximity or closeness. Not only is it used to express physical closeness, but it can also be used in a figurative way to demonstrate closeness in relationships or a nearness in time.",
    "formation": "ใกล้ + Noun/Pronoun",
    "examples": [
      {
        "th": "ร้าน กาแฟ ที่ ฉัน ชอบ อยู่ ใกล้ บ้าน ฉัน",
        "romaji": "Raan gaa-fae thi chan chob yoo glâi baan chan",
        "en": "The coffee shop that I like is near my house.",
        "grammar_audio": "/audio/thai/grammar/s_ใกล้_glâi_-_Near_close_20231230_ร้าน_กาแฟ_ที่_ฉัน_ชอบ_อยู่_ใกล้_บ้าน_ฉัน.mp3"
      },
      {
        "th": "กรุงเทพฯ ใกล้ สิ้นเดือน นี้ จะ มี งาน วันเด็ก มากมาย",
        "romaji": "Krung Thep glâi sin duan ni ja mee ngan wan-dek maak maay",
        "en": "Many children's day events will be held in Bangkok near the end of this month.",
        "grammar_audio": "/audio/thai/grammar/s_ใกล้_glâi_-_Near_close_20231230_กรุงเทพฯ_ใกล้_สิ้นเดือน_นี้_จะ_มี_งาน_วันเด็ก_มากมาย.mp3"
      },
      {
        "th": "เรา ควร ถึง หาด ภูเก็ต ใกล้ เที่ยง คืน นี้",
        "romaji": "Rao khuan theung haad Phuket glâi thieng kheun ni",
        "en": "We should reach Phuket beach near midnight.",
        "grammar_audio": "/audio/thai/grammar/s_ใกล้_glâi_-_Near_close_20231230_เรา_ควร_ถึง_หาด_ภูเก็ต_ใกล้_เที่ยง_คืน_นี้.mp3"
      },
      {
        "th": "สงคราม นี้ อยู่ ใกล้ รุ่นพี่ ฉัน มาก",
        "romaji": "Songkhram ni yoo glâi runphi chan maak",
        "en": "This war is very close to my older generation.",
        "grammar_audio": "/audio/thai/grammar/s_ใกล้_glâi_-_Near_close_20231230_สงคราม_นี้_อยู่_ใกล้_รุ่นพี่_ฉัน_มาก.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "แตกต่าง (dtàek dtàang) - Different, to differ",
    "short_explanation": "Used to express the contrast or difference between two or more items or people.",
    "long_explanation": "The term 'แตกต่าง (dtàek dtàang)' is used in Thai language to express the idea of difference or contrast. It can be used to show difference between two or more items, people, or situations. Typically, it is used in the structure 'A แตกต่าง จาก B', meaning 'A is different from B'. It is versatile and can be used with a wide range of nouns and adjectives to express differences or contrasts.",
    "formation": "A + แตกต่าง + จาก + B",
    "examples": [
      {
        "th": "วัฒนธรรม ของ ประเทศ ไทย แตกต่าง จาก วัฒนธรรม ของ ประเทศ ญี่ปุ่น",
        "romaji": "Watthanathom kong prathet thai dtàek dtàang jak watthanathom kong prathet nippon",
        "en": "The culture of Thailand is different from the culture of Japan.",
        "grammar_audio": "/audio/thai/grammar/s_แตกต่าง_dtàek_dtàang_-_Different_to_differ_20231230_วัฒนธรรม_ของ_ประเทศ_ไทย_แตกต่าง_จาก_วัฒนธรรม_ของ_ประเทศ_ญี่ปุ่น.mp3"
      },
      {
        "th": "ภาษา อังกฤษ แตกต่าง จาก ภาษา ไทย ทั้ง ใน การ เขียน และ การ พูด",
        "romaji": "Phasa ang-git dtàek dtàang jak phasa thai tang nai kan khiian lae kan poot",
        "en": "English language is different from Thai language both in writing and speaking.",
        "grammar_audio": "/audio/thai/grammar/s_แตกต่าง_dtàek_dtàang_-_Different_to_differ_20231230_ภาษา_อังกฤษ_แตกต่าง_จาก_ภาษา_ไทย_ทั้ง_ใน_การ_เขียน_และ_การ_พูด.mp3"
      },
      {
        "th": "สภาพอากาศ ใน บางกอก แตกต่าง จาก สภาพอากาศ ใน ชิคาโก้",
        "romaji": "Saphap a-gat nai Bangkok dtàek dtàang jak saphap a-gat nai Chi-ka-go",
        "en": "The weather in Bangkok is different from the weather in Chicago.",
        "grammar_audio": "/audio/thai/grammar/s_แตกต่าง_dtàek_dtàang_-_Different_to_differ_20231230_สภาพอากาศ_ใน_บางกอก_แตกต่าง_จาก_สภาพอากาศ_ใน_ชิคาโก้.mp3"
      },
      {
        "th": "รสชาติ ของ อาหาร ฝรั่งเศส แตกต่าง จาก รสชาติ ของ อาหาร อิตาลี",
        "romaji": "Rod-cha-dti kong ahaan farangset dtàek dtàang jak rod-cha-dti kong ahaan Italy",
        "en": "The taste of French food is different from the taste of Italian food.",
        "grammar_audio": "/audio/thai/grammar/s_แตกต่าง_dtàek_dtàang_-_Different_to_differ_20231230_รสชาติ_ของ_อาหาร_ฝรั่งเศส_แตกต่าง_จาก_รสชาติ_ของ_อาหาร_อิตาลี.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "หาย (hǎai) - To disappear, to be missing",
    "short_explanation": "Used to indicate disappearance or missing of something or someone.",
    "long_explanation": "The word 'หาย (hǎai)' is a common verb in Thai that can mean 'to disappear', 'to go missing' , 'to get lost', or 'to be absent'. It is often used to describe situations where a person or object cannot be found or is not present. In this formation, it is placed after the noun that it is describing.",
    "formation": "Noun + หาย (hǎai)",
    "examples": [
      {
        "th": "กระเป๋า ของ เขา หาย ไป จาก ห้อง",
        "romaji": "Gra-peaw kong khao hǎai pai jak hǒng",
        "en": "His bag is missing from the room.",
        "grammar_audio": "/audio/thai/grammar/s_หาย_hǎai_-_To_disappear_to_be_missing_20231230_กระเป๋า_ของ_เขา_หาย_ไป_จาก_ห้อง.mp3"
      },
      {
        "th": "ฉัน ไม่ สามารถ หา แว่นตา ของ ฉัน หาย ไป ได้",
        "romaji": "Chan mai sa-mart ha waen-ta kong chan hǎai pai dai",
        "en": "I can't find my glasses, they're missing.",
        "grammar_audio": "/audio/thai/grammar/s_หาย_hǎai_-_To_disappear_to_be_missing_20231230_ฉัน_ไม่_สามารถ_หา_แว่นตา_ของ_ฉัน_หาย_ไป_ได้.mp3"
      },
      {
        "th": "หมา ของ เรา หาย ไป มา สอง วัน แล้ว ",
        "romaji": "Ma kong rao hǎai pai ma song wan laeo",
        "en": "Our dog has been missing for two days.",
        "grammar_audio": "/audio/thai/grammar/s_หาย_hǎai_-_To_disappear_to_be_missing_20231230_หมา_ของ_เรา_หาย_ไป_มา_สอง_วัน_แล้ว_.mp3"
      },
      {
        "th": "กรุณา ช่วย ฉัน หา โทรศัพท์ มือ ถือ ของ ฉัน หาย ไป",
        "romaji": "Gru-na chuay chan ha to-rasap meua thue kong chan hǎai pai",
        "en": "Please help me, my mobile phone is missing.",
        "grammar_audio": "/audio/thai/grammar/s_หาย_hǎai_-_To_disappear_to_be_missing_20231230_กรุณา_ช่วย_ฉัน_หา_โทรศัพท์_มือ_ถือ_ของ_ฉัน_หาย_ไป.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เห็น (hěn) - To see, to perceive",
    "short_explanation": "Used to represent the action of seeing or perceiving; similar to the English verb 'to see'.",
    "long_explanation": "The term 'เห็น (hěn)' is a common Thai verb meaning 'to see' or 'to perceive'. This word can be paired with various nouns and adjectives to express that the speaker has seen something or someone, or has a certain perception or opinion about a situation or object. It is also used to ask if someone else sees, understands, or agrees with something.",
    "formation": "Subject + เห็น + Object",
    "examples": [
      {
        "th": "ฉัน เห็น แมว น้อย นอน ใน กระ เป๋า ของ ฉัน",
        "romaji": "Chan hěn maeo noi non nai gra pao kong chan",
        "en": "I see a small cat sleeping in my bag.",
        "grammar_audio": "/audio/thai/grammar/s_เห็น_hěn_-_To_see_to_perceive_20231230_ฉัน_เห็น_แมว_น้อย_นอน_ใน_กระ_เป๋า_ของ_ฉัน.mp3"
      },
      {
        "th": "ทุกวัน นี้ เป็น ยังไง บ้าง คุณ เห็น ด้วย หรือ ไม่",
        "romaji": "Thuk wan ni pen yang ngai bang, khun hěn duay rue mai",
        "en": "How about these days, do you see or agree with it?",
        "grammar_audio": "/audio/thai/grammar/s_เห็น_hěn_-_To_see_to_perceive_20231230_ทุกวัน_นี้_เป็น_ยังไง_บ้าง_คุณ_เห็น_ด้วย_หรือ_ไม่.mp3"
      },
      {
        "th": "เธอ เห็น ดาว จาก หน้าต่าง ห้อง นอน ไหม",
        "romaji": "Thoe hěn dao jak na tang hong non mai",
        "en": "Can you see the stars from the bedroom window?",
        "grammar_audio": "/audio/thai/grammar/s_เห็น_hěn_-_To_see_to_perceive_20231230_เธอ_เห็น_ดาว_จาก_หน้าต่าง_ห้อง_นอน_ไหม.mp3"
      },
      {
        "th": "ผม เห็น พี่สาว ของ ฉัน กิน อาหาร ใน ห้อง ครัว",
        "romaji": "Phom hěn phi sao kong chan gin aharn nai hong khrua",
        "en": "I see my older sister eating food in the kitchen.",
        "grammar_audio": "/audio/thai/grammar/s_เห็น_hěn_-_To_see_to_perceive_20231230_ผม_เห็น_พี่สาว_ของ_ฉัน_กิน_อาหาร_ใน_ห้อง_ครัว.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "รู้ (rúu) - To know, to be aware of",
    "short_explanation": "Used to express knowledge, awareness, or familiarity about something or someone.",
    "long_explanation": "The verb 'รู้ (rúu)' in Thai is used to denote knowing something or being aware of something. It can be used both in the sense of knowing someone (being acquainted with) and knowing about something (having knowledge or being aware of). It is very common as it is used frequently in daily life, both in social and formal situations. It can be used in both past and present tense, and often directly follows the subject of the sentence.",
    "formation": "Subject + รู้ + Object",
    "examples": [
      {
        "th": "ฉัน รู้ ว่า เธอ ไม่ ชอบ กิน ผัก",
        "romaji": "Chan rúu wa thoe mai chop kin pak",
        "en": "I know that you don't like to eat vegetables.",
        "grammar_audio": "/audio/thai/grammar/s_รู้_rúu_-_To_know_to_be_aware_of_20231230_ฉัน_รู้_ว่า_เธอ_ไม่_ชอบ_กิน_ผัก.mp3"
      },
      {
        "th": "เธอ รู้ มั้ย ว่า วัน นี้ คือ วัน เกิด ของ ฉัน",
        "romaji": "Thoe rúu may wa wan ni khue wan gert kong chan",
        "en": "Do you know that today is my birthday?",
        "grammar_audio": "/audio/thai/grammar/s_รู้_rúu_-_To_know_to_be_aware_of_20231230_เธอ_รู้_มั้ย_ว่า_วัน_นี้_คือ_วัน_เกิด_ของ_ฉัน.mp3"
      },
      {
        "th": "พวก เขา ไม่ รู้ ว่า ฉัน มี ทุกข์",
        "romaji": "Phuak khao mai rúu wa chan mee thuk",
        "en": "They don't know that I'm suffering.",
        "grammar_audio": "/audio/thai/grammar/s_รู้_rúu_-_To_know_to_be_aware_of_20231230_พวก_เขา_ไม่_รู้_ว่า_ฉัน_มี_ทุกข์.mp3"
      },
      {
        "th": "คุณ รู้ ความลับ ที่ ฉัน ซ่อนไว้ มั้ย",
        "romaji": "Khun rúu khwam lup thi chan sorn wai may",
        "en": "Do you know the secret that I'm hiding?",
        "grammar_audio": "/audio/thai/grammar/s_รู้_rúu_-_To_know_to_be_aware_of_20231230_คุณ_รู้_ความลับ_ที่_ฉัน_ซ่อนไว้_มั้ย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เรียน (riian) - To study, learn",
    "short_explanation": "State an action of learning or studying in present or future.",
    "long_explanation": "The verb 'เรียน (riian)' directly translates to 'study' or 'learn' in English. In Thai sentence structure, 'เรียน (riian)' is typically positioned after the subject. It can be used to express the action of learning or studying in either the present or the future tense. Also, in some instances, this verb can be followed by the object of the study such as a subject or a language.",
    "formation": "Subject + เรียน + (Object)",
    "examples": [
      {
        "th": "ฉัน กำลัง เรียน ภาษา ไทย",
        "romaji": "Chan kamlang riian phasa Thai",
        "en": "I am studying Thai language.",
        "grammar_audio": "/audio/thai/grammar/s_เรียน_riian_-_To_study_learn_20231230_ฉัน_กำลัง_เรียน_ภาษา_ไทย.mp3"
      },
      {
        "th": "เขา จะ เรียน ทาง วิทยาศาสตร์ เมื่อ เขา ไป มหาวิทยาลัย",
        "romaji": "Khao ja riian thang witthayaa-saat muae khao pai maha-witthaya-lai",
        "en": "He will study science when he goes to university.",
        "grammar_audio": "/audio/thai/grammar/s_เรียน_riian_-_To_study_learn_20231230_เขา_จะ_เรียน_ทาง_วิทยาศาสตร์_เมื่อ_เขา_ไป_มหาวิทยาลัย.mp3"
      },
      {
        "th": "นางสาว นี ใช้ เวลา ว่าง เพื่อ เรียน รู้ การ ทำ อาหาร",
        "romaji": "Nang-sao ni chai wela waang phuea riian ruu kaan tham aa-haan",
        "en": "Miss Nee uses her free time to learn cooking.",
        "grammar_audio": "/audio/thai/grammar/s_เรียน_riian_-_To_study_learn_20231230_นางสาว_นี_ใช้_เวลา_ว่าง_เพื่อ_เรียน_รู้_การ_ทำ_อาหาร.mp3"
      },
      {
        "th": "ผม ต้อง เรียน การ ติดต่อ ให้ ดี กว่า นี้",
        "romaji": "Phom tong riian kaan tit-tao hai di gwaa ni",
        "en": "I need to study communication better than this.",
        "grammar_audio": "/audio/thai/grammar/s_เรียน_riian_-_To_study_learn_20231230_ผม_ต้อง_เรียน_การ_ติดต่อ_ให้_ดี_กว่า_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "ฝึก (fùek) - To practice, to train",
    "short_explanation": " 'ฝึก (fùek)' in Thai is used to express the action of practicing or training.",
    "long_explanation": " 'ฝึก (fùek)' is a verb in Thai language which means to practice or to train. The term is used when you engage in a repetitive task with the aim of acquiring proficiency or skill. This word can be used in the context of practicing a sport, instrument, language or any other skill. It is usually followed by the object you are practicing or training on.",
    "formation": "ฝึก + Object",
    "examples": [
      {
        "th": "เขา ฝึก พูด ภาษา ญี่ปุ่น ทุกวัน เพื่อ จะ เป็น ทั่วถึง ใน การสื่อสาร ",
        "romaji": "Khao fùek phuut phaasaa yippun thuk wan phuea cha pen thuathueng nai kan sùe sàr",
        "en": "He practices speaking Japanese every day to become fluent in communication.",
        "grammar_audio": "/audio/thai/grammar/s_ฝึก_fùek_-_To_practice_to_train_20231230_เขา_ฝึก_พูด_ภาษา_ญี่ปุ่น_ทุกวัน_เพื่อ_จะ_เป็น_ทั่วถึง_ใน_การสื่อสาร_.mp3"
      },
      {
        "th": "ฉัน ฝึก เต้น วิทยา ประจำ วัน เพื่อ ปรับปรุง สุขภาพ ของ ฉัน",
        "romaji": "Chan fùek ten wit-thayaa prajam wan phuea prab prung suk kha phaap kong chan",
        "en": "I practice dance regularly to improve my health.",
        "grammar_audio": "/audio/thai/grammar/s_ฝึก_fùek_-_To_practice_to_train_20231230_ฉัน_ฝึก_เต้น_วิทยา_ประจำ_วัน_เพื่อ_ปรับปรุง_สุขภาพ_ของ_ฉัน.mp3"
      },
      {
        "th": "มาริโอ ฝึก เตะ รั่ว ลูก ฟุตบอล ทุก วัน หลัง จาก โรงเรียน",
        "romaji": "Mario fùek tec rua look foot bon thuk wan lang jak rong rien",
        "en": "Mario practices shooting soccer balls every day after school.",
        "grammar_audio": "/audio/thai/grammar/s_ฝึก_fùek_-_To_practice_to_train_20231230_มาริโอ_ฝึก_เตะ_รั่ว_ลูก_ฟุตบอล_ทุก_วัน_หลัง_จาก_โรงเรียน.mp3"
      },
      {
        "th": "คุณ ควร ฝึก พิมพ์ ด้วย สิบ นิ้ว ทั้งหมด เพื่อ การ เคลื่อนไหว ที่ เร็ว ขึ้น",
        "romaji": "Khun khuan fùek phim duay sib niu thang mot phuea kan kheuan wai thi reo khuen",
        "en": "You should practice typing with all ten fingers for faster movement.",
        "grammar_audio": "/audio/thai/grammar/s_ฝึก_fùek_-_To_practice_to_train_20231230_คุณ_ควร_ฝึก_พิมพ์_ด้วย_สิบ_นิ้ว_ทั้งหมด_เพื่อ_การ_เคลื่อนไหว_ที่_เร็ว_ขึ้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "เปลี่ยน (bplìian) - To change, to alter",
    "short_explanation": "Verb that means 'to change' or 'to alter'.",
    "long_explanation": "The verb 'เปลี่ยน (bplìian)' is used in Thai language to convey the concept of change or alteration. It can be used to reflect a transformation in an object, a situation, or even in personal behaviour or character. This verb is versatile, and can be implemented within various types of sentence structures. To create a sentence with the term 'เปลี่ยน', the subject is often followed by 'เปลี่ยน' and then the object or situation that is being changed.",
    "formation": "Subject + เปลี่ยน + Object",
    "examples": [
      {
        "th": "ฉัน ต้อง เปลี่ยน แผน การ ท่องเที่ยว เพราะ พยากรณ์อากาศ ไม่ดี",
        "romaji": "Chan tong bplìian phaen gan thong-thiao pror pha-ya-gon-agat mai dee",
        "en": "I have to change my travel plan because the weather forecast is not good.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_bplìian_-_To_change_to_alter_20231230_ฉัน_ต้อง_เปลี่ยน_แผน_การ_ท่องเที่ยว_เพราะ_พยากรณ์อากาศ_ไม่ดี.mp3"
      },
      {
        "th": "เขา เปลี่ยน ที่ อยู่ เพราะ ต้อง ย้าย ไป ทำงาน ที่ เมือง อื่น",
        "romaji": "Khao bplìian thi yu pror tong yaai pai tham ngan thi mueang eun",
        "en": "He changed his residence because he had to move to work in another city.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_bplìian_-_To_change_to_alter_20231230_เขา_เปลี่ยน_ที่_อยู่_เพราะ_ต้อง_ย้าย_ไป_ทำงาน_ที่_เมือง_อื่น.mp3"
      },
      {
        "th": "ทำไม ดู เหมือน คุณ เปลี่ยน ใจ บ่อย จัง",
        "romaji": "Thamai du meuuan khun bplìian jai boi jang",
        "en": "Why does it seem like you change your mind so often?",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_bplìian_-_To_change_to_alter_20231230_ทำไม_ดู_เหมือน_คุณ_เปลี่ยน_ใจ_บ่อย_จัง.mp3"
      },
      {
        "th": "เรา ควร เปลี่ยน วิธี การ สอน ให้ เหมาะ กับ สมัย ใหม่",
        "romaji": "Rao khuan bplìian wi-thi gan son hai maw gut sa-mai mai",
        "en": "We should change the teaching method to suit the modern age.",
        "grammar_audio": "/audio/thai/grammar/s_เปลี่ยน_bplìian_-_To_change_to_alter_20231230_เรา_ควร_เปลี่ยน_วิธี_การ_สอน_ให้_เหมาะ_กับ_สมัย_ใหม่.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  },
  {
    "title": "แนะนำ (náe-nam) - To recommend, to suggest",
    "short_explanation": "Used when giving advice, suggestions, or recommending something.",
    "long_explanation": "The word 'แนะนำ (náe-nam)' is used in Thai language when providing a suggestion, recommendation, or advice. It can be used in a variety of contexts - from recommending a good restaurant to your friends, to suggesting a new approach at a business meeting. Depending on the sentence structure, 'แนะนำ' can also be conjugated or placed differently, but in general, it often precedes the item or action that is being suggested.",
    "formation": "แนะนำ + (noun or idea)",
    "examples": [
      {
        "th": "ฉัน แนะนำ ว่า เรา ควร จอง ตั๋ว หนัง ล่วงหน้า",
        "romaji": "Chan náe-nam wa rao khuan jong tua nang luang na",
        "en": "I suggest that we should book the movie tickets in advance.",
        "grammar_audio": "/audio/thai/grammar/s_แนะนำ_náe-nam_-_To_recommend_to_suggest_20231230_ฉัน_แนะนำ_ว่า_เรา_ควร_จอง_ตั๋ว_หนัง_ล่วงหน้า.mp3"
      },
      {
        "th": "โรงแรม นี้ มี ห้องพัก ที่ สะอาด และ สะดวกสบาย ฉัน แนะนำ ให้ คุณ พัก ที่นี่",
        "romaji": "Rong raem ni mee hong pak thi sa-at lae sa-duak sa-bai, chan náe-nam hai khun pak thi ni",
        "en": "This hotel has clean and comfortable rooms, I recommend you to stay here.",
        "grammar_audio": "/audio/thai/grammar/s_แนะนำ_náe-nam_-_To_recommend_to_suggest_20231230_โรงแรม_นี้_มี_ห้องพัก_ที่_สะอาด_และ_สะดวกสบาย_ฉัน_แนะนำ_ให้_คุณ_พัก_ที่นี่.mp3"
      },
      {
        "th": "ถ้า คุณ ชอบ อาหาร ทะเล ฉัน แนะนำ ร้าน อาหาร นี้",
        "romaji": "Tha khun chop a-han tha-le, chan náe-nam raan a-han ni",
        "en": "If you like seafood, I recommend this restaurant.",
        "grammar_audio": "/audio/thai/grammar/s_แนะนำ_náe-nam_-_To_recommend_to_suggest_20231230_ถ้า_คุณ_ชอบ_อาหาร_ทะเล_ฉัน_แนะนำ_ร้าน_อาหาร_นี้.mp3"
      },
      {
        "th": "ผม จะ แนะนำ ว่า ลอง ใช้ สมุด จด ราย วัน ดู สัก พัก ดู อาจ จะ ช่วย ให้ คุณ รู้สึก มี ความ จำ เมื่อต้อง จำ ข้อมูล หลากหลาย",
        "romaji": "Phom ja náe-nam wa long chai samut jot rai wan duu sak pak duu, aat ja chuay hai khun rue-seuk mee khwam jam meu dtaung jam kawm-mlun laak laai",
        "en": "I would suggest trying to use a journal for a while, it might help you feel more memorizable when having to remember a variety of information.",
        "grammar_audio": "/audio/thai/grammar/s_แนะนำ_náe-nam_-_To_recommend_to_suggest_20231230_ผม_จะ_แนะนำ_ว่า_ลอง_ใช้_สมุด_จด_ราย_วัน_ดู_สัก_พัก_ดู_อาจ_จะ_ช่วย_ให้_คุณ_รู้สึก_มี_ความ_จำ_เมื่อต้อง_จำ_ข้อมูล_หลากหลาย.mp3"
      }
    ],
    "p_tag": "CU-TFL_2",
    "s_tag": "100"
  }
]