[
  {
    "title": "~게다가 [gedaga] (Moreover, besides)",
    "short_explanation": "This grammar point is used to introduce an additional point or detail that strengthens the previous statement.",
    "long_explanation": "`~게다가 [gedaga]` is a conjunctive adverb in Korean. It is used to add further information or details to a previously mentioned point, similar to 'moreover' or 'besides' in English. It implies that the subsequent information is an additional detail rather than a completely separate point.",
    "formation": "Clause1 + 게다가 + Clause2",
    "examples": [
      {
        "kr": "그 카페는 커피 맛이 아주 좋고, 게다가 분위기도 좋아서 자주 가요.",
        "romaji": "Geu kape-neun keopi masi aju jo-go, gedaga bunwigi-do jo-a-seo ja-ju ga-yo.",
        "en": "I often go to that cafe because not only is the coffee really good, but the atmosphere is also nice.",
        "grammar_audio": "/audio/korean/grammar/s_게다가_gedaga_Moreover_besides_20250209_그_카페는_커피_맛이_아주_좋고_게다가_분위기도_좋아서_자주_가요.mp3"
      },
      {
        "kr": "오늘은 비가 오고, 게다가 추워서 나가기 싫어요.",
        "romaji": "Oneul-eun bi-ga o-go, gedaga chu-wo-seo na-ga-gi si-reo-yo.",
        "en": "Today, it's raining and, besides, it's cold so I don't want to go out.",
        "grammar_audio": "/audio/korean/grammar/s_게다가_gedaga_Moreover_besides_20250209_오늘은_비가_오고_게다가_추워서_나가기_싫어요.mp3"
      },
      {
        "kr": "그는 성격이 참 좋고, 게다가 똑똑해서 사람들이 많이 좋아해요.",
        "romaji": "Geu-neun seonggyeogi cham jo-go, gedaga ttokttok-hae-seo saram-deul-i ma-ni jo-a-hae-yo.",
        "en": "He has a very good personality and, moreover, he is smart, so many people like him.",
        "grammar_audio": "/audio/korean/grammar/s_게다가_gedaga_Moreover_besides_20250209_그는_성격이_참_좋고_게다가_똑똑해서_사람들이_많이_좋아해요.mp3"
      },
      {
        "kr": "이 식당은 음식이 맛있고, 게다가 가격도 저렴해서 자주 찾아가요.",
        "romaji": "I sikdang-eun eumsik-i masit-go, gedaga gyeog-do jeo-ryeom-hae-seo ja-ju cha-ja-ga-yo.",
        "en": "The food at this restaurant is delicious and, in addition, the prices are cheap, so I visit often.",
        "grammar_audio": "/audio/korean/grammar/s_게다가_gedaga_Moreover_besides_20250209_이_식당은_음식이_맛있고_게다가_가격도_저렴해서_자주_찾아가요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~거니와 [geoniwa] (And, besides)",
    "short_explanation": "Used to add an additional reason or explanation, equivalent to 'and' or 'besides' in English, though it is more literary.",
    "long_explanation": "`~거니와 [geoniwa]` is a conjunctive particle used in Korean to connect two clauses, providing an extra reason or detail. It is similar in function to 'and' or 'besides' in English. This construction is more formal or literary and is less common in everyday speech.",
    "formation": "Clause1 (adjective/verb stem) + 거니와 + Clause2",
    "examples": [
      {
        "kr": "이것은 비싸거니와 내가 원하는 모양도 아니에요.",
        "romaji": "Igeoseun bissageoniwa naega wonhaneun moyang-do anieyo.",
        "en": "This is not only expensive but also not the style I want.",
        "grammar_audio": "/audio/korean/grammar/s_거니와_geoniwa_And_besides_20250209_이것은_비싸거니와_내가_원하는_모양도_아니에요.mp3"
      },
      {
        "kr": "나는 책 읽거니와 영화도 좋아해서 주말마다 항상 바빠요.",
        "romaji": "Naneun chaek ilkkeoniwa yeonghwado joahaseo jumalmada hangsang bappayo.",
        "en": "I not only enjoy reading books but also like movies, so I'm always busy on weekends.",
        "grammar_audio": "/audio/korean/grammar/s_거니와_geoniwa_And_besides_20250209_나는_책_읽거니와_영화도_좋아해서_주말마다_항상_바빠요.mp3"
      },
      {
        "kr": "이 상품은 품질이 낮거니와 서비스도 엉망이에요.",
        "romaji": "I sangpumeun pumjili najgeoniwa seobiseudo eongmang-ieyo.",
        "en": "This product is of poor quality and, besides, the service is also a mess.",
        "grammar_audio": "/audio/korean/grammar/s_거니와_geoniwa_And_besides_20250209_이_상품은_품질이_낮거니와_서비스도_엉망이에요.mp3"
      },
      {
        "kr": "그 영화는 재미있거니와 감동적이에요.",
        "romaji": "Geu yeonghwaneun jaemiitgeoniwa gamdongjieyo.",
        "en": "That movie is not only entertaining but also moving.",
        "grammar_audio": "/audio/korean/grammar/s_거니와_geoniwa_And_besides_20250209_그_영화는_재미있거니와_감동적이에요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~것만은 [geot man-eun] (But / At least)",
    "short_explanation": "This construction is used to emphasize that one particular aspect is an exception, often contrasting with expectations.",
    "long_explanation": "The `~것만은` construction in Korean is used to highlight that despite other circumstances, one specific aspect does not follow the expected result. It is often used in a contrasting or contradictory context to stress that, if nothing else, this one thing is different.",
    "formation": "Verb/Adjective (in past form) + -(ㄴ/은) + 것만은",
    "examples": [
      {
        "kr": "그녀는 공부를 열심히 했는데, 학교에서 점수가 좋지 않은 것만은 이해할 수 없어요.",
        "romaji": "Geunyeoneun gongbureul yeolsimhi haetneunde, hakgyoeseo jeomsuga jotji anheun geotman-eun ihaehal su eopsseoyo.",
        "en": "She studied hard, but I can't understand why her scores at school aren't good.",
        "grammar_audio": "/audio/korean/grammar/s_것만은_geot_man-eun_But__At_least_20250209_그녀는_공부를_열심히_했는데_학교에서_점수가_좋지_않은_것만은_이해할_수_없어요.mp3"
      },
      {
        "kr": "어젯밤에 잠을 많이 잤는데, 아직도 피곤한 것만은 이해하기 어려워요.",
        "romaji": "Eojjeotbame jameul manhi jassneunde, ajikdo pigonhan geotman-eun ihaehagi eoryeowoyo.",
        "en": "I slept a lot last night, but I still can't understand why I'm tired.",
        "grammar_audio": "/audio/korean/grammar/s_것만은_geot_man-eun_But__At_least_20250209_어젯밤에_잠을_많이_잤는데_아직도_피곤한_것만은_이해하기_어려워요.mp3"
      },
      {
        "kr": "우리 팀이 열심히 노력했는데, 게임에서 지는 것만은 너무 아쉬워요.",
        "romaji": "Uri timi yeolsimhi noryeokhaetneunde, geimeseo jineun geotman-eun neomu ashuwoyo.",
        "en": "Our team worked hard, but it's such a shame that we lost the game.",
        "grammar_audio": "/audio/korean/grammar/s_것만은_geot_man-eun_But__At_least_20250209_우리_팀이_열심히_노력했는데_게임에서_지는_것만은_너무_아쉬워요.mp3"
      },
      {
        "kr": "나는 매일 운동을 했는데, 체중이 늘어난 것만은 실망스러워요.",
        "romaji": "Naneun maeil undongeul haetneunde, chejungi neureonan geotman-eun silmangseureowoyo.",
        "en": "I exercised every day, but I'm disappointed that my weight increased.",
        "grammar_audio": "/audio/korean/grammar/s_것만은_geot_man-eun_But__At_least_20250209_나는_매일_운동을_했는데_체중이_늘어난_것만은_실망스러워요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~과/와 같이 [gwa/wa gachi] (Like, as if)",
    "short_explanation": "Used to express a comparison, similarity, or analogy, equivalent to 'like' or 'as if' in English.",
    "long_explanation": "`~과/와 같이 [gwa/wa gachi]` is an expression used in Korean to draw a comparison or analogy, showing that one thing is similar to another. It is equivalent to saying 'like' or 'as if' in English and helps in visualizing or emphasizing the resemblance between two things.",
    "formation": "Noun + 과/와 같이",
    "examples": [
      {
        "kr": "지난 주말은 봄과 같이 따뜻했어요. 하지만 이번 주말은 겨울과 같이 너무 추웠어요.",
        "romaji": "Jinan jumal-eun bomgwa gachi ttatteushaess-eoyo. Hajiman ibeon jumal-eun gyeoulgwa gachi neomu chuweoss-eoyo.",
        "en": "Last weekend was warm like spring, but this weekend was as cold as winter.",
        "grammar_audio": "/audio/korean/grammar/s_과와_같이_gwawa_gachi_Like_as_if_20250209_지난_주말은_봄과_같이_따뜻했어요_하지만_이번_주말은_겨울과_같이_너무_추웠어요.mp3"
      },
      {
        "kr": "그 그림은 사진과 같이 생생해 보여요, 그래서 그가 대단한 화가라는 것을 알 수 있어요.",
        "romaji": "Geu geurim-eun sajingwa gachi saengsaenghae boyeoyo, geuraeseo geuga daedanhan hwaga-raneun geos-eul al su iss-eoyo.",
        "en": "That painting is vivid like a photograph, so you can tell that he is a great artist.",
        "grammar_audio": "/audio/korean/grammar/s_과와_같이_gwawa_gachi_Like_as_if_20250209_그_그림은_사진과_같이_생생해_보여요_그래서_그가_대단한_화가라는_것을_알_수_있어요.mp3"
      },
      {
        "kr": "오늘은 여름과 같이 더웠어요, 그래서 아이스크림을 먹었어요.",
        "romaji": "Oneul-eun yeoleumgwa gachi deowoss-eoyo, geulaeseo aiseukeulim-eul meogeoss-eoyo.",
        "en": "Today was hot like summer, so I ate ice cream.",
        "grammar_audio": "/audio/korean/grammar/s_과와_같이_gwawa_gachi_Like_as_if_20250209_오늘은_여름과_같이_더웠어요_그래서_아이스크림을_먹었어요.mp3"
      },
      {
        "kr": "독서는 운동과 같이, 마음을 건강하게 해주는 활동이에요.",
        "romaji": "Dogseo-neun undonggwa gachi, ma-eum-eul geonganghage haejuneun hwaldong-ieyo.",
        "en": "Reading is like exercise; it's an activity that keeps the mind healthy.",
        "grammar_audio": "/audio/korean/grammar/s_과와_같이_gwawa_gachi_Like_as_if_20250209_독서는_운동과_같이_마음을_건강하게_해주는_활동이에요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~나마저 [namajeo] (Even)",
    "short_explanation": "Used to express surprise or emphasis, indicating that even the unexpected subject or object is included.",
    "long_explanation": "`~나마저 [namajeo]` is a postpositional particle in Korean that emphasizes an unexpected inclusion, similar to 'even' in English. It highlights that the subject or object in question surpasses normal expectations.",
    "formation": "Noun + 나마저",
    "examples": [
      {
        "kr": "그녀는 학교에서 가장 어려운 수업도 쉽게 이해하는데, 이 수업 나마저 이해하는 걸 보니 그녀는 정말 대단해요.",
        "romaji": "Geunyeoneun hakgyoeseo gajang eoryeoun sueobdo swipge ihaehaneunde, i sueob namajeo ihaehaneun geol boni geunyeoneun jeongmal daedanhaeyo.",
        "en": "She easily understands even the hardest classes at school, so seeing her grasp this subject, she's truly amazing.",
        "grammar_audio": "/audio/korean/grammar/s_나마저_namajeo_Even_20250209_그녀는_학교에서_가장_어려운_수업도_쉽게_이해하는데_이_수업_나마저_이해하는_걸_보니_그녀는_정말_대단해요.mp3"
      },
      {
        "kr": "나는 보통 친구들과 잘 지내는데, 그 친구 나마저 저를 싫어하는 것 같아서 상처받았어요.",
        "romaji": "Naneun botong chingudeulgwa jal jinaende, geu chingu namajeo jeoreul silheohaneun geot gataseo sangcheobadasseoyo.",
        "en": "I usually get along well with my friends, but I was hurt because even that friend seems to dislike me.",
        "grammar_audio": "/audio/korean/grammar/s_나마저_namajeo_Even_20250209_나는_보통_친구들과_잘_지내는데_그_친구_나마저_저를_싫어하는_것_같아서_상처받았어요.mp3"
      },
      {
        "kr": "다른 사람들은 다 반대했지만, 그는 한 사람이라도 지지하는 중요성을 알았어요. 그런데 그 사람 나마저 반대하자 기분이 나빴어요.",
        "romaji": "Dareun saramdeureun da bandaehaetjiman, geuneun han saramirado jijihaneun jungyoseongeul arasseoyo. Geureonde geu saram namajeo bandaehaja gibuni nappasseoyo.",
        "en": "Everyone else opposed it, but he recognized the importance of having even one supporter. However, when even that person opposed, he felt bad.",
        "grammar_audio": "/audio/korean/grammar/s_나마저_namajeo_Even_20250209_다른_사람들은_다_반대했지만_그는_한_사람이라도_지지하는_중요성을_알았어요_그런데_그_사람_나마저_반대하자_기분이_나빴어요.mp3"
      },
      {
        "kr": "책상 위에 있는 모든 물건들을 봤는데, 그 물건 나마저 찾지 못했어요.",
        "romaji": "Chaeksang wie inneun modeun mulgeondeureul bwatneunde, geu mulgeon namajeo chatji mothaesseoyo.",
        "en": "I looked at every single item on the desk, but I couldn't even find that item.",
        "grammar_audio": "/audio/korean/grammar/s_나마저_namajeo_Even_20250209_책상_위에_있는_모든_물건들을_봤는데_그_물건_나마저_찾지_못했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~뿐만 아니라 [ppunman anira] (Not only... but also)",
    "short_explanation": "Used to express 'not only... but also' by adding additional, related information.",
    "long_explanation": "`~뿐만 아니라 [ppunman anira]` is used in Korean to add extra information, indicating that something applies not only in one aspect but also in another. It serves to emphasize that a subject or event encompasses multiple qualities or characteristics.",
    "formation": "Noun/Adjective/Verb + 뿐만 아니라 + Clause",
    "examples": [
      {
        "kr": "그녀는 중국어뿐만 아니라 일본어도 유창하게 할 수 있습니다.",
        "romaji": "Geunyeoneun junggugppunman anira ilboneodo yuchanghage hal su itsseumnida.",
        "en": "She can not only speak Chinese but also speak Japanese fluently.",
        "grammar_audio": "/audio/korean/grammar/s_뿐만_아니라_ppunman_anira_Not_only_but_also_20250209_그녀는_중국어뿐만_아니라_일본어도_유창하게_할_수_있습니다.mp3"
      },
      {
        "kr": "나는 공부뿐만 아니라 운동도 좋아해요.",
        "romaji": "Naneun gongbuppunman anira undongdo joahaeyo.",
        "en": "I not only like studying but also enjoy exercising.",
        "grammar_audio": "/audio/korean/grammar/s_뿐만_아니라_ppunman_anira_Not_only_but_also_20250209_나는_공부뿐만_아니라_운동도_좋아해요.mp3"
      },
      {
        "kr": "이 상품은 가격이 저렴할 뿐만 아니라 품질도 뛰어나요.",
        "romaji": "I sangpumeun gakyeogi jeoryeomhal ppunman anira pumjildo ttwieonayo.",
        "en": "This product is not only affordable but also of high quality.",
        "grammar_audio": "/audio/korean/grammar/s_뿐만_아니라_ppunman_anira_Not_only_but_also_20250209_이_상품은_가격이_저렴할_뿐만_아니라_품질도_뛰어나요.mp3"
      },
      {
        "kr": "그는 한국어뿐만 아니라 영어도 유창하게 구사해서 통역으로 일하고 있어요.",
        "romaji": "Geuneun hangugeoppunman anira yeong-eodo yuchanghage gusahaeseo tongyeogeuro ilhago isseoyo.",
        "en": "He can not only speak Korean fluently but also speaks fluent English, so he works as an interpreter.",
        "grammar_audio": "/audio/korean/grammar/s_뿐만_아니라_ppunman_anira_Not_only_but_also_20250209_그는_한국어뿐만_아니라_영어도_유창하게_구사해서_통역으로_일하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~더니 [deoni] (After, and then)",
    "short_explanation": "Used to connect two clauses, indicating that the second clause follows after the first.",
    "long_explanation": "`~더니` is a conjunction used in Korean to connect two clauses or actions, showing that the second event or state was realized after experiencing the first. It is often used in narratives or personal experiences to indicate a change or consequence.",
    "formation": "Verb (in past tense) + 더니",
    "examples": [
      {
        "kr": "저는 이것을 먹었더니 맛이 진짜 변했어요. 그래서 다른 음식을 찾아 마시기로 했어요.",
        "romaji": "Jeoneun igeoseul meogeosseodeoni, masi jinjja byeonhaesseoyo. Geuraeseo dareun eumsigeul chaja masigi sijakhaesseoyo.",
        "en": "After I ate this, the taste really changed. So, I decided to look for another food.",
        "grammar_audio": "/audio/korean/grammar/s_더니_deoni_After_and_then_20250209_저는_이것을_먹었더니_맛이_진짜_변했어요_그래서_다른_음식을_찾아_마시기로_했어요.mp3"
      },
      {
        "kr": "나는 그녀에게 전화했더니 그녀는 휴가 중이라 전화를 못 받았어요.",
        "romaji": "Naneun geunyeoege jeonhwahaesseodeoni, geunyeoneun hyuga jungira jeonhwareul mot badasseoyo.",
        "en": "After I called her, it turned out she was on vacation and couldn't answer the phone.",
        "grammar_audio": "/audio/korean/grammar/s_더니_deoni_After_and_then_20250209_나는_그녀에게_전화했더니_그녀는_휴가_중이라_전화를_못_받았어요.mp3"
      },
      {
        "kr": "서점에 갔더니 내가 원하는 책은 이미 다 팔렸어요. 그래서 다른 서점에서 찾아야 했어요.",
        "romaji": "Seojeome gassdeoni, naega wonhaneun chaegeneun imi da pallyeosseoyo. Geuraeseo dareun seojeomeseo chajaya haesseoyo.",
        "en": "After I went to the bookstore, the book I wanted was already sold out. So, I had to look in another bookstore.",
        "grammar_audio": "/audio/korean/grammar/s_더니_deoni_After_and_then_20250209_서점에_갔더니_내가_원하는_책은_이미_다_팔렸어요_그래서_다른_서점에서_찾아야_했어요.mp3"
      },
      {
        "kr": "피자집에 갔더니 주문하려던 피자는 이미 전부 소진되었어요. 이런 경우는 처음이에요.",
        "romaji": "Pijajibe gassdeoni, jumunharyeodeon pijaneun imi jeonbu sojindoeeosseoyo. Ireon gyeonguneun cheoeumieyo.",
        "en": "After I went to the pizza place, the pizza I intended to order was already completely sold out. This was a first for me.",
        "grammar_audio": "/audio/korean/grammar/s_더니_deoni_After_and_then_20250209_피자집에_갔더니_주문하려던_피자는_이미_전부_소진되었어요_이런_경우는_처음이에요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~이든지 ~든지 [ideunji deunji] (Whether… or)",
    "short_explanation": "Used to present multiple alternatives, similar to 'whether... or' in English.",
    "long_explanation": "`~이든지 ~든지 [ideunji deunji]` is used in Korean to list alternative options or possibilities, conveying indifference about which one is chosen. It is often used in both interrogative sentences and statements to present choices.",
    "formation": "Clause1 + 이든지 + Clause2 + 든지",
    "examples": [
      {
        "kr": "당신이 커피를 좋아하든지, 차를 좋아하든지, 이 카페에서는 모두를 만족시킬 수 있어요.",
        "romaji": "Dangsin-i keopi-reul joh-ahadeunji, cha-reul joh-ahadeunji, i kape-eseoneun modu-reul manjogshil su iss-eoyo.",
        "en": "Whether you like coffee or tea, this cafe can satisfy everyone.",
        "grammar_audio": "/audio/korean/grammar/s_이든지_든지_ideunji_deunji_Whether_or_20250209_당신이_커피를_좋아하든지_차를_좋아하든지_이_카페에서는_모두를_만족시킬_수_있어요.mp3"
      },
      {
        "kr": "아침에 일찍 나가든지, 저녁에 늦게 돌아오든지, 매일 한 시간 동안 만나기로 약속해요.",
        "romaji": "Achim-e iljjik nagadeunji, jeonyeoge neutge dol-aodeunji, maeil han shigan dong-an mannagiro yaksokhaeyo.",
        "en": "Whether you leave early in the morning or come back late in the evening, we promise to meet for an hour every day.",
        "grammar_audio": "/audio/korean/grammar/s_이든지_든지_ideunji_deunji_Whether_or_20250209_아침에_일찍_나가든지_저녁에_늦게_돌아오든지_매일_한_시간_동안_만나기로_약속해요.mp3"
      },
      {
        "kr": "햄버거를 좋아하든지, 피자를 좋아하든지, 이 식당은 모든 음식을 제공할 수 있어요.",
        "romaji": "Hambaegoreul joh-ahadeunji, pijareul joh-ahadeunji, i sikdang-eun modeun eumsigeul jegonghal su iss-eoyo.",
        "en": "Whether you like hamburgers or pizza, this restaurant can serve all kinds of food.",
        "grammar_audio": "/audio/korean/grammar/s_이든지_든지_ideunji_deunji_Whether_or_20250209_햄버거를_좋아하든지_피자를_좋아하든지_이_식당은_모든_음식을_제공할_수_있어요.mp3"
      },
      {
        "kr": "당신이 평일에 여행 가든지, 주말에 가든지, 무관하게 편하게 여행을 즐기세요.",
        "romaji": "Dangsin-i pyeongil-e yeohaeng gadeunji, jumal-e gadeunji, mugwanhage pyeonhage yeohaeng-eul jeulgiseyo.",
        "en": "Whether you travel on weekdays or on weekends, enjoy your trip comfortably without any worries.",
        "grammar_audio": "/audio/korean/grammar/s_이든지_든지_ideunji_deunji_Whether_or_20250209_당신이_평일에_여행_가든지_주말에_가든지_무관하게_편하게_여행을_즐기세요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~임에 틀림없다 [ime tteollimeopda] (Without a doubt)",
    "short_explanation": "Used to express certainty, meaning 'without a doubt' or 'it's certain that...'.",
    "long_explanation": "`~임에 틀림없다 [ime tteollimeopda]` is used in Korean to express a high degree of certainty about a situation or outcome. It emphasizes that there is no doubt about the assertion and is often used in formal or written contexts.",
    "formation": "Verb/Adjective (nominalized) + 임에 틀림없다",
    "examples": [
      {
        "kr": "그의 출연이 성공적이었음에 틀림없지만, 그의 재능은 더욱 뛰어남에 틀림없어요.",
        "romaji": "Geuui chulyeoni seonggongjeogieosseum-e tteullim-eobsjiman, geuui jaeneung-eun ttwieonam-e tteullim-eobseoyo.",
        "en": "While it's too early to say that his performance was successful, there is no doubt that his talent is outstanding.",
        "grammar_audio": "/audio/korean/grammar/s_임에_틀림없다_ime_tteollimeopda_Without_a_doubt_20250209_그의_출연이_성공적이었음에_틀림없지만_그의_재능은_더욱_뛰어남에_틀림없어요.mp3"
      },
      {
        "kr": "우리 팀이 이길 확률이 높으니, 우리가 이겨낼 것임에 틀림없어요.",
        "romaji": "Uri timi igil hwagru-i nop-euni, uriga igyeonael geosim-e tteullim-eobseoyo.",
        "en": "Since our team's chance of winning is high, there's no doubt that we will win.",
        "grammar_audio": "/audio/korean/grammar/s_임에_틀림없다_ime_tteollimeopda_Without_a_doubt_20250209_우리_팀이_이길_확률이_높으니_우리가_이겨낼_것임에_틀림없어요.mp3"
      },
      {
        "kr": "그는 비록 다른 사람들에게 비판받더라도, 그의 선택이 옳았음에 틀림없어요.",
        "romaji": "Geuneun birok dareun saramdeulege bipanbadeudorado, geuui seontaegi olhassum-e tteullim-eobseoyo.",
        "en": "Even if he is criticized by others, there's no doubt that his decision was correct.",
        "grammar_audio": "/audio/korean/grammar/s_임에_틀림없다_ime_tteollimeopda_Without_a_doubt_20250209_그는_비록_다른_사람들에게_비판받더라도_그의_선택이_옳았음에_틀림없어요.mp3"
      },
      {
        "kr": "관측소의 예보에 따르면, 내일 비가 올 것임에 틀림없어요.",
        "romaji": "Gwanchukso-ui yebo-e ttareumyeon, naeil biga ol geosim-e tteullim-eobseoyo.",
        "en": "According to the weather station's forecast, it will without a doubt rain tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_임에_틀림없다_ime_tteollimeopda_Without_a_doubt_20250209_관측소의_예보에_따르면_내일_비가_올_것임에_틀림없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~쩌면 [jjeomyeon] (Maybe, perhaps)",
    "short_explanation": "Used to express possibility or probability; 'maybe', 'perhaps'.",
    "long_explanation": "'~쩌면 [jjeomyeon]' is an adverb that expresses the speaker's uncertainty about a situation. It is usually placed at the beginning of a sentence to suggest that something might be the case. It can be translated as 'maybe' or 'perhaps' in English.",
    "formation": "쩌면 + Sentence",
    "examples": [
      {
        "kr": "쩌면 그는 진심으로 당신을 사랑했을지도 몰라요.",
        "romaji": "Jjeomyeon geuneun jinsimeuro dangsineul saranghaess-euljido mollayo.",
        "en": "Perhaps he really loved you.",
        "grammar_audio": "/audio/korean/grammar/s_쩌면_jjeomyeon_Maybe_perhaps_20250209_쩌면_그는_진심으로_당신을_사랑했을지도_몰라요.mp3"
      },
      {
        "kr": "쩌면 이 갈등은 해결될 수도 있을 것 같아요.",
        "romaji": "Jjeomyeon i galdungeun haegyeoldoel sudo isseul geot gatayo.",
        "en": "Maybe this conflict could be resolved.",
        "grammar_audio": "/audio/korean/grammar/s_쩌면_jjeomyeon_Maybe_perhaps_20250209_쩌면_이_갈등은_해결될_수도_있을_것_같아요.mp3"
      },
      {
        "kr": "쩌면 그 계획이 성공할 수 있을지도 모르겠어요.",
        "romaji": "Jjeomyeon geu gyehoegi seonggonghal su isseuljido mollayo.",
        "en": "Perhaps that plan could succeed.",
        "grammar_audio": "/audio/korean/grammar/s_쩌면_jjeomyeon_Maybe_perhaps_20250209_쩌면_그_계획이_성공할_수_있을지도_모르겠어요.mp3"
      },
      {
        "kr": "쩌면 이번 시험은 제일 어려울 수도 있어요.",
        "romaji": "Jjeomyeon ibeon siheomeun jeil eoryeoul sudo isseoyo.",
        "en": "This exam might be the most difficult.",
        "grammar_audio": "/audio/korean/grammar/s_쩌면_jjeomyeon_Maybe_perhaps_20250209_쩌면_이번_시험은_제일_어려울_수도_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~치고는 [chigoneun] (For, considering)",
    "short_explanation": "Expresses the meaning of 'for' or 'considering' when reality is better or worse than expected.",
    "long_explanation": "'~치고는 [chigoneun]' is a postpositional expression used to compare a situation with expectations. It conveys that, considering the condition or status of something, the outcome is surprising or different from what one might expect.",
    "formation": "Noun/Verb(-는/ᆫ) + 치고는",
    "examples": [
      {
        "kr": "그가 어린애 치고는 너무 많은 책을 읽어서 놀랐어요.",
        "romaji": "Geuga eorin ae chigoneun neomu manheun chaegeul ilgeoseo nollasseoyo.",
        "en": "I was surprised that he, for a young child, reads so many books.",
        "grammar_audio": "/audio/korean/grammar/s_치고는_chigoneun_For_considering_20250209_그가_어린애_치고는_너무_많은_책을_읽어서_놀랐어요.mp3"
      },
      {
        "kr": "팀장 치고는 너무 책임감이 없어서 모두가 기분이 나빴어요.",
        "romaji": "Timjang chigoneun neomu chaegimgami eopseoseo moduga gibuni nappeosseoyo.",
        "en": "Everyone was upset because he, for a team leader, lacked responsibility.",
        "grammar_audio": "/audio/korean/grammar/s_치고는_chigoneun_For_considering_20250209_팀장_치고는_너무_책임감이_없어서_모두가_기분이_나빴어요.mp3"
      },
      {
        "kr": "첫날 치고는 너무 많은 고객들이 왔고, 우리는 정말로 바빴어요.",
        "romaji": "Cheotnal chigoneun neomu manheun gogaekdeuli wassgo, urineun jeongmallo babbeosseoyo.",
        "en": "On the first day, too many customers came and we were really busy.",
        "grammar_audio": "/audio/korean/grammar/s_치고는_chigoneun_For_considering_20250209_첫날_치고는_너무_많은_고객들이_왔고_우리는_정말로_바빴어요.mp3"
      },
      {
        "kr": "그녀는 몸이 작은 편인데, 작은 체격 치고는 꽤 힘세다.",
        "romaji": "Geunyeoneun momi jakgeun pyeoninde, jageun chegyeok chigoneun kkwae himseda.",
        "en": "She may be small, but for her small stature, she is quite strong.",
        "grammar_audio": "/audio/korean/grammar/s_치고는_chigoneun_For_considering_20250209_그녀는_몸이_작은_편인데_작은_체격_치고는_꽤_힘세다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~커녕 [keonyeong] (Far from, let alone)",
    "short_explanation": "Used to show that the actual reality is far from the expected outcome.",
    "long_explanation": "'~커녕 [keonyeong]' is used to emphasize that not only did the expected result not occur, but something even less occurred instead. It is similar to saying 'far from' or 'let alone' in English.",
    "formation": "Noun/Verb stem + 커녕",
    "examples": [
      {
        "kr": "계획은 잘 하겠다고 했는데, 시작하기도 커녕 준비조차 못 했어요.",
        "romaji": "Gyehoegeun jal hagetdago haessneunde, sijakhagido keonyeong, junbijochado mot haesseoyo.",
        "en": "He said he would plan well, but far from even starting, he couldn’t prepare at all.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Far_from_let_alone_20250209_계획은_잘_하겠다고_했는데_시작하기도_커녕_준비조차_못_했어요.mp3"
      },
      {
        "kr": "약속 시간에 늦지 않을 거라고 생각했는데, 일찍 오기도 커녕 늦게 와버렸어요.",
        "romaji": "Yaksok sigane neujji anheul georago saenggakhaessneunde, iljjik ogido keonyeong, neutge waboryeosseoyo.",
        "en": "I thought he wouldn’t be late, but far from coming early, he arrived late.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Far_from_let_alone_20250209_약속_시간에_늦지_않을_거라고_생각했는데_일찍_오기도_커녕_늦게_와버렸어요.mp3"
      },
      {
        "kr": "공부하러 도서관에 갔는데, 독서는 커녕 졸다가 하루가 다 갔어요.",
        "romaji": "Gongbuhareo doseogwan-e gassneunde, dokseoneun keonyeong joldaga haruga da gasseoyo.",
        "en": "I came to the library to study, but far from reading, I ended up dozing off and the whole day passed.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Far_from_let_alone_20250209_공부하러_도서관에_갔는데_독서는_커녕_졸다가_하루가_다_갔어요.mp3"
      },
      {
        "kr": "세일에 간다고 기대했지만, 싸게 살 생각은 커녕 더 비싸게 살게 됐어요.",
        "romaji": "Seire gandago gidaehaetjiman, ssage sal saenggageun keonyeong, deo bissage salge dwaesseoyo.",
        "en": "I was expecting a sale, but far from buying cheap, I ended up spending more.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Far_from_let_alone_20250209_세일에_간다고_기대했지만_싸게_살_생각은_커녕_더_비싸게_살게_됐어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~판에 [pane] (In the midst of)",
    "short_explanation": "~판에 [pane] is used to express that something happens in the midst of a particular situation or event.",
    "long_explanation": "'판에 [pane]' is a grammatical pattern used to indicate that an action occurs during or in the midst of another event. Although its literal translation might seem odd, it is best understood as 'in the midst of' or 'during' and is often found in formal or written Korean.",
    "formation": "Verb-는/Noun + 판에",
    "examples": [
      {
        "kr": "학교가 시작된 판에 새로운 학생이 입학하였습니다.",
        "romaji": "Hakgyoga sijakdoen pane saeroun haksaengi ibhakhaessseubnida.",
        "en": "A new student was admitted in the midst of the school term beginning.",
        "grammar_audio": "/audio/korean/grammar/s_판에_pane_In_the_midst_of_20250209_학교가_시작된_판에_새로운_학생이_입학하였습니다.mp3"
      },
      {
        "kr": "회사가 오늘부터 폐업하게 되는 판에 저는 새로운 직장을 찾고 있습니다.",
        "romaji": "Hoesaga oneulbuteo pyeop-eophage doeneun pane jeoneun saeroun jikjangeul chatgo issseubnida.",
        "en": "I am looking for a new job in the midst of the company closing down starting today.",
        "grammar_audio": "/audio/korean/grammar/s_판에_pane_In_the_midst_of_20250209_회사가_오늘부터_폐업하게_되는_판에_저는_새로운_직장을_찾고_있습니다.mp3"
      },
      {
        "kr": "주요 사업을 준비하고 있는 판에 회사의 주식이 급등하였습니다.",
        "romaji": "Juyo saeobeul junbihago issneun pane hoesaui jusigi geupdeunghaessseubnida.",
        "en": "In the midst of preparing for a major project, the company's stock skyrocketed.",
        "grammar_audio": "/audio/korean/grammar/s_판에_pane_In_the_midst_of_20250209_주요_사업을_준비하고_있는_판에_회사의_주식이_급등하였습니다.mp3"
      },
      {
        "kr": "시험공부를 하는 판에 친구들이 놀러왔습니다.",
        "romaji": "Siheomgongbureul haneun pane chingudeuli nolleowassseubnida.",
        "en": "My friends came to hang out while I was studying for an exam.",
        "grammar_audio": "/audio/korean/grammar/s_판에_pane_In_the_midst_of_20250209_시험공부를_하는_판에_친구들이_놀러왔습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하건마는 [hageonmaneun] (But, however)",
    "short_explanation": "Used to express contrast or opposition; 'but', 'however'.",
    "long_explanation": "'~하건마는 [hageonmaneun]' is a conjunction used to contrast two clauses. It shows that even though one thing is true, another conflicting fact or situation follows.",
    "formation": "Verb (present tense form) + 건마는",
    "examples": [
      {
        "kr": "난 그래픽 디자인을 공부하건마는 컴퓨터를 잘 못 다뤄서 디자인 프로그램 사용이 어려운 것 같아.",
        "romaji": "Nan geuraepik dijaineul gongbuhageonmaneun keompyuteoreul jal mot darwoseo dijain peurogeuraem sayongi eoryeoun geot gata.",
        "en": "I study graphic design, but I'm not good at handling computers, so I find design programs difficult to use.",
        "grammar_audio": "/audio/korean/grammar/s_하건마는_hageonmaneun_But_however_20250209_난_그래픽_디자인을_공부하건마는_컴퓨터를_잘_못_다뤄서_디자인_프로그램_사용이_어려운_것_같아.mp3"
      },
      {
        "kr": "오늘 날씨가 좋아서 산책하려고 했건마는 갑자기 비가 와서 산책할 수 없었어.",
        "romaji": "Oneul nalssiga johaseo sancaekharyeogo haetgeonmaneun gabjagi biga waseo sancaekhal su eopseosseo.",
        "en": "The weather was nice today so I planned to take a walk, but suddenly it rained and I couldn’t go.",
        "grammar_audio": "/audio/korean/grammar/s_하건마는_hageonmaneun_But_however_20250209_오늘_날씨가_좋아서_산책하려고_했건마는_갑자기_비가_와서_산책할_수_없었어.mp3"
      },
      {
        "kr": "저는 한국어를 잘하고 싶건마는 단어 외우기가 너무 어려워서 매일 공부해도 잘 생각나지 않아요.",
        "romaji": "Jeoneun hangugeoreul jalhago sipgeonmaneun daneo oewoogiga neomu eoryeowoseo maeil gongbuhadaedo jal saenggaknaji anhayo.",
        "en": "I want to be good at Korean, but memorizing words is so difficult that even with daily study, I can’t remember them well.",
        "grammar_audio": "/audio/korean/grammar/s_하건마는_hageonmaneun_But_however_20250209_저는_한국어를_잘하고_싶건마는_단어_외우기가_너무_어려워서_매일_공부해도_잘_생각나지_않아요.mp3"
      },
      {
        "kr": "친구가 나에게 생일 선물을 주기로 했건마는, 그는 선물을 잊어버려서 아무것도 주지 않았어.",
        "romaji": "Chinguga naege saengil seonmureul jugiro haetgeonmaneun, geuneun seonmureul ijeobeoryeoseo amugeotdo juji anhasseoyo.",
        "en": "My friend promised to give me a birthday present, but he forgot and ended up giving me nothing.",
        "grammar_audio": "/audio/korean/grammar/s_하건마는_hageonmaneun_But_however_20250209_친구가_나에게_생일_선물을_주기로_했건마는_그는_선물을_잊어버려서_아무것도_주지_않았어.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하더라도 [hadeorado] (Even if)",
    "short_explanation": "Used to express 'even if', 'even though', or 'despite'.",
    "long_explanation": "'~하더라도 [hadeorado]' is a grammatical construction used to express a hypothetical or contrastive situation—essentially meaning 'even if' or 'even though'. It is used with all types of verbs to emphasize that the outcome remains unchanged despite the condition.",
    "formation": "Verb + 더라도",
    "examples": [
      {
        "kr": "비가 오더라도 우산을 가져가지 않을 거예요, 제가 우산을 싫어해서요.",
        "romaji": "Biga odeorado usaneul gajyeogaji anheul geoyeyo, jaega usaneul silheohaseyo.",
        "en": "Even if it rains, I won’t take an umbrella because I don’t like them.",
        "grammar_audio": "/audio/korean/grammar/s_하더라도_hadeorado_Even_if_20250209_비가_오더라도_우산을_가져가지_않을_거예요_제가_우산을_싫어해서요.mp3"
      },
      {
        "kr": "피곤하더라도 공부를 계속해야 해요, 시험이 곧 있어서요.",
        "romaji": "Pigonhadeorado, gongbureul gyesokhaeya haeyo, siheomi got itsseoseoyo.",
        "en": "Even if I'm tired, I have to keep studying because the exam is soon.",
        "grammar_audio": "/audio/korean/grammar/s_하더라도_hadeorado_Even_if_20250209_피곤하더라도_공부를_계속해야_해요_시험이_곧_있어서요.mp3"
      },
      {
        "kr": "일찍 일어나야 하더라도 항상 운동을 해야 돼요, 건강을 위해서요.",
        "romaji": "Ichik ireonaya hadeorado hangsang undongeul hae dwaeyo, geongang-eul wihaseyo.",
        "en": "Even if I have to get up early, I always exercise for my health.",
        "grammar_audio": "/audio/korean/grammar/s_하더라도_hadeorado_Even_if_20250209_일찍_일어나야_하더라도_항상_운동을_해야_돼요_건강을_위해서요.mp3"
      },
      {
        "kr": "시간이 없더라도 저는 부지런히 한국어를 계속 공부해야 합니다, 한국어에 관심이 많아서요.",
        "romaji": "Sigani eopseorado jeoneun buzireonhi hangugeoreul gyesok gongbuhaeya hamnida, hangugeo-e gwansimi manh-aseo.",
        "en": "Even if I don’t have time, I must continue studying Korean diligently because I’m very interested in it.",
        "grammar_audio": "/audio/korean/grammar/s_하더라도_hadeorado_Even_if_20250209_시간이_없더라도_저는_부지런히_한국어를_계속_공부해야_합니다_한국어에_관심이_많아서요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하든지 말든지 [hadeunji maldeunji] (Whether... or not)",
    "short_explanation": "Used to convey 'whether... or not'.",
    "long_explanation": "'~하든지 말든지 [hadeunji maldeunji]' is a compound ending that expresses indifference toward the outcome regardless of which choice is made. It implies that the result remains unchanged.",
    "formation": "Verb stem + 하든지 말든지",
    "examples": [
      {
        "kr": "그 사람이 좋아하든지 말든지 우리는 계획대로 진행하겠어요.",
        "romaji": "Geu sarami joahadeunji maldeunji urineun gyehoekdaero jinhaenghagesseoyo.",
        "en": "Whether that person likes it or not, we will proceed according to plan.",
        "grammar_audio": "/audio/korean/grammar/s_하든지_말든지_hadeunji_maldeunji_Whether_or_not_20250209_그_사람이_좋아하든지_말든지_우리는_계획대로_진행하겠어요.mp3"
      },
      {
        "kr": "오늘 비가 오든지 말든지 우리는 계속해서 산책할 계획이에요.",
        "romaji": "Oneul biga odeunji maldeunji urineun gyesokhaeseo sancaekhal gyeongiraeyo.",
        "en": "Whether or not it rains today, we plan to keep taking walks.",
        "grammar_audio": "/audio/korean/grammar/s_하든지_말든지_hadeunji_maldeunji_Whether_or_not_20250209_오늘_비가_오든지_말든지_우리는_계속해서_산책할_계획이에요.mp3"
      },
      {
        "kr": "네가 참여하든지 말든지 이 파티는 계속될 거예요.",
        "romaji": "Nega chamyeohadeunji maldeunji i patineun gyesokdoel geosida.",
        "en": "Whether you participate or not, this party will continue.",
        "grammar_audio": "/audio/korean/grammar/s_하든지_말든지_hadeunji_maldeunji_Whether_or_not_20250209_네가_참여하든지_말든지_이_파티는_계속될_거예요.mp3"
      },
      {
        "kr": "그녀가 나를 사랑하든지 말든지 나는 계속해서 그녀를 사랑할 거야.",
        "romaji": "Geunyeoga naleul salanghadeunji maldeunji naneun gyesoghaeseo geunyeoreul salanghalgeoya.",
        "en": "Whether she loves me or not, I will continue to love her.",
        "grammar_audio": "/audio/korean/grammar/s_하든지_말든지_hadeunji_maldeunji_Whether_or_not_20250209_그녀가_나를_사랑하든지_말든지_나는_계속해서_그녀를_사랑할_거야.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하려니와 [haryeoniwa] (Trying to, but)",
    "short_explanation": "Used to express a situation where one tries to do something but encounters an obstacle.",
    "long_explanation": "'~하려니와 [haryeoniwa]' is used to show that while one is attempting to do something, an unexpected difficulty or issue prevents it from happening. It can be translated as 'trying to, but' or 'want to, but' in English.",
    "formation": "Verb stem + 려니와",
    "examples": [
      {
        "kr": "오늘은 친구들과 함께 영화를 보러 가려니와, 갑자기 날씨가 너무 안 좋아져서 계획이 실패했어요.",
        "romaji": "Oneuleun chingudeulgwa hamkke yeonghwareul boreo garyeoniwa, gapjagi nalssiga neomu an johajyeoseo gyehoegi silpaehaesseoyo.",
        "en": "I was trying to go watch a movie with my friends today, but the weather suddenly got so bad that our plan failed.",
        "grammar_audio": "/audio/korean/grammar/s_하려니와_haryeoniwa_Trying_to_but_20250209_오늘은_친구들과_함께_영화를_보러_가려니와_갑자기_날씨가_너무_안_좋아져서_계획이_실패했어요.mp3"
      },
      {
        "kr": "좀 더 다양한 맛의 음식을 만들어 보려니와, 요리 실력이 부족해서 잘 되지 않아요.",
        "romaji": "Jom deo dayanghan matsui eumsigeul mandeureo boryeoniwa, yori silryeogi bujokhaeseo jal doeji anhayo.",
        "en": "I tried to make food with a variety of flavors, but it didn’t turn out well because my cooking skills are lacking.",
        "grammar_audio": "/audio/korean/grammar/s_하려니와_haryeoniwa_Trying_to_but_20250209_좀_더_다양한_맛의_음식을_만들어_보려니와_요리_실력이_부족해서_잘_되지_않아요.mp3"
      },
      {
        "kr": "빨리 잠자려니와, 많은 생각들이 머리를 스쳐 지나가서 잠에 들지 못했어요.",
        "romaji": "Ppalli jamjaryeoniwa, manheun saenggakdeuli meorireul seuchyeo jinagaseo jame deulji moshaesseoyo.",
        "en": "I tried to fall asleep quickly, but I couldn’t because many thoughts kept running through my mind.",
        "grammar_audio": "/audio/korean/grammar/s_하려니와_haryeoniwa_Trying_to_but_20250209_빨리_잠자려니와_많은_생각들이_머리를_스쳐_지나가서_잠에_들지_못했어요.mp3"
      },
      {
        "kr": "운동을 시작하려니와, 집에 있느라 시간을 못 내어서 아직 시작하지 못했어요.",
        "romaji": "Undongeul sijakharyeoniwa, jibe issneura siganeul mot naeoseo ajik sijakhaji moshaesseoyo.",
        "en": "I tried to start exercising, but I couldn’t find the time because I was stuck at home, so I haven’t started yet.",
        "grammar_audio": "/audio/korean/grammar/s_하려니와_haryeoniwa_Trying_to_but_20250209_운동을_시작하려니와_집에_있느라_시간을_못_내어서_아직_시작하지_못했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하여간 [hayaegane] (Anyway, anyhow)",
    "short_explanation": "Used to express that one will proceed regardless of difficulties or obstacles.",
    "long_explanation": "'~하여간 [hayaegane]' is used in Korean to show a determined resolve or to express that, regardless of any obstacles or factors, one will do something. It is similar in meaning to 'anyway' or 'anyhow' in English.",
    "formation": "Predicate (Verb/Adjective) + 아/어/여 + 하여간",
    "examples": [
      {
        "kr": "시험을 준비하지 않았지만, 노력하여간 시험을 통과하려고 합니다.",
        "romaji": "Siheomeul junbihaji anhjiman, noryeoghayaegane siheomeul tonggwaharyeogo hamnida.",
        "en": "Although I didn't prepare for the exam, I will try to pass it anyhow.",
        "grammar_audio": "/audio/korean/grammar/s_하여간_hayaegane_Anyway_anyhow_20250209_시험을_준비하지_않았지만_노력하여간_시험을_통과하려고_합니다.mp3"
      },
      {
        "kr": "비록 경제적으로 어려운 상황이지만, 아끼려하여간 학비를 모아야 합니다.",
        "romaji": "Birok gyeongjejeogeuro eoryeoun sanghwangijiman, akkyeo sayonghayaegane hakbireul moaya hamnida.",
        "en": "Even though the financial situation is difficult, I must save for my tuition fees anyway.",
        "grammar_audio": "/audio/korean/grammar/s_하여간_hayaegane_Anyway_anyhow_20250209_비록_경제적으로_어려운_상황이지만_아끼려하여간_학비를_모아야_합니다.mp3"
      },
      {
        "kr": "힘들어도, 꾸준히 하여간 그 목표를 달성할 수 있을 것입니다.",
        "romaji": "Himdeureodo, kkuduni hayaegane geu mokpyoreul dalssengal su isseul geosimnida.",
        "en": "Even if it’s hard, if you persist anyhow, you will be able to achieve that goal.",
        "grammar_audio": "/audio/korean/grammar/s_하여간_hayaegane_Anyway_anyhow_20250209_힘들어도_꾸준히_하여간_그_목표를_달성할_수_있을_것입니다.mp3"
      },
      {
        "kr": "많은 자금이 필요하지만, 아껴 사용하여간 꿈을 이뤄낼 수 있을 것입니다.",
        "romaji": "Manheun jagumi pil-yohajiman, akkyeo sayonghayaegane kkumeul irwonaelsu isseul geosimnida.",
        "en": "Though a lot of money is required, by spending frugally anyway, you will be able to fulfill your dream.",
        "grammar_audio": "/audio/korean/grammar/s_하여간_hayaegane_Anyway_anyhow_20250209_많은_자금이_필요하지만_아껴_사용하여간_꿈을_이뤄낼_수_있을_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~하여야만 [hayeoyaman] (Only when)",
    "short_explanation": "Indicates that a certain condition must be satisfied for something else to happen.",
    "long_explanation": "'~하여야만 [hayeoyaman]' is used when a specific condition or criteria must be met for an outcome to occur. It is equivalent to 'only when' in English and stresses that without this condition, the result is unattainable.",
    "formation": "Verb stem + ~하여야만 + Positive verb",
    "examples": [
      {
        "kr": "일찍 기상하여야만 출근시간에 도착할 수 있어요.",
        "romaji": "Iljjik gisanghayeoyaman chulgooksigane dochakhal su isseoyo.",
        "en": "I can only arrive at work on time if I get up early.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_when_20250209_일찍_기상하여야만_출근시간에_도착할_수_있어요.mp3"
      },
      {
        "kr": "당신의 사정을 받아들여주신 의사와 상의하여야만 수술 계획을 변경할 수 있습니다.",
        "romaji": "Dangsineui sajeangeul badadeulyeojusin uisawa sangyihayeoyaman susul gyehoekul byeongyeokhal su isseubnida.",
        "en": "Only when you consult with the doctor who understood your circumstances can you change the surgery plan.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_when_20250209_당신의_사정을_받아들여주신_의사와_상의하여야만_수술_계획을_변경할_수_있습니다.mp3"
      },
      {
        "kr": "고정적인 수입이 있어야만 주택대출을 받을 수 있습니다.",
        "romaji": "Gojeongjeogin suipi isseoyaman jutakdaechurul badul su isseubnida.",
        "en": "Only when you have a regular income can you get a housing loan.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_when_20250209_고정적인_수입이_있어야만_주택대출을_받을_수_있습니다.mp3"
      },
      {
        "kr": "훈련을 잘 따라하여야만 시험에 합격할 수 있어요.",
        "romaji": "Hunryeone jal ttarahayeoyaman siheome hapgyeokhal su isseoyo.",
        "en": "Only when you follow the training well can you pass the exam.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_when_20250209_훈련을_잘_따라하여야만_시험에_합격할_수_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~해야겠다 [haeyagetda] (Should, ought to)",
    "short_explanation": "Expresses the speaker's intention or determination to do something in the future.",
    "long_explanation": "'~해야겠다 [haeyagetda]' is a pattern used to express necessity or determination for a future action. It indicates that the speaker has decided that something should be done.",
    "formation": "Verb stem + 야겠다",
    "examples": [
      {
        "kr": "이제 늦었으니까 집에 가야겠다.",
        "romaji": "Ije neujeosseunikka jibe gayagetda.",
        "en": "Now that it's late, I should go home.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetda_Should_ought_to_20250209_이제_늦었으니까_집에_가야겠다.mp3"
      },
      {
        "kr": "내일 시험이 있으니까 오늘 밤에 공부해야겠다.",
        "romaji": "Naeil siheomi isseunikka oneul bame gongbuhaeyagetda.",
        "en": "I have an exam tomorrow, so I should study tonight.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetda_Should_ought_to_20250209_내일_시험이_있으니까_오늘_밤에_공부해야겠다.mp3"
      },
      {
        "kr": "체중이 계속 증가하고 있어서 운동을 시작해야겠다.",
        "romaji": "Chejungi gyesok jeunggahago isseoseo undongeul sijakhaeyagetda.",
        "en": "My weight continues to increase, so I should start exercising.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetda_Should_ought_to_20250209_체중이_계속_증가하고_있어서_운동을_시작해야겠다.mp3"
      },
      {
        "kr": "오래동안 연락하지 않아서 친구에게 전화해야겠다.",
        "romaji": "Oraedongan yeollakaji anhaseo chinguege jeonhwahaeyagetda.",
        "en": "I haven't been in touch for a long time, so I should call my friend.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetda_Should_ought_to_20250209_오래동안_연락하지_않아서_친구에게_전화해야겠다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~에 근거하여 [e geungeohayeo] (Based on)",
    "short_explanation": "Expresses the notion 'based on', 'according to', or 'in accordance with'.",
    "long_explanation": "~에 근거하여 [e geungeohayeo] is used to indicate that a statement, action, or conclusion is derived from a particular source such as data, rules, or authoritative information.",
    "formation": "Noun + 에 근거하여",
    "examples": [
      {
        "kr": "데이터에 근거하여, 이 제품이 가장 잘 팔렸습니다.",
        "romaji": "Deiteo-e geungeohayeo, i jepumeun gajang jal pallyeotsseumnida.",
        "en": "Based on the data, this product sold the best.",
        "grammar_audio": "/audio/korean/grammar/s_에_근거하여_e_geungeohayeo_Based_on_20250209_데이터에_근거하여_이_제품이_가장_잘_팔렸습니다.mp3"
      },
      {
        "kr": "법에 근거하여, 그는 잘못되었다는 것이 증명되었습니다.",
        "romaji": "Beop-e geungeohayeo, geuneun jalmosdwaessdaneun geosi jeungmyeongdwaetseumnida.",
        "en": "Based on the law, it was proven that he was wrong.",
        "grammar_audio": "/audio/korean/grammar/s_에_근거하여_e_geungeohayeo_Based_on_20250209_법에_근거하여_그는_잘못되었다는_것이_증명되었습니다.mp3"
      },
      {
        "kr": "과학적 연구에 근거하여, 지구 온난화는 심각한 문제입니다.",
        "romaji": "Gwahakjeok yeongu-e geungeohayeo, jigu onnanhwaneun simgakhan munje-ibnida.",
        "en": "Based on scientific research, global warming is a serious problem.",
        "grammar_audio": "/audio/korean/grammar/s_에_근거하여_e_geungeohayeo_Based_on_20250209_과학적_연구에_근거하여_지구_온난화는_심각한_문제입니다.mp3"
      },
      {
        "kr": "그녀의 후기에 근거하여, 이 식당은 맛이 좋지 않다고 합니다.",
        "romaji": "Geunyeoui hugi-e geungeohayeo, i sikdangeun mas-i joji anhdago hamnida.",
        "en": "Based on her review, this restaurant doesn't taste good.",
        "grammar_audio": "/audio/korean/grammar/s_에_근거하여_e_geungeohayeo_Based_on_20250209_그녀의_후기에_근거하여_이_식당은_맛이_좋지_않다고_합니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~에 비추어 볼 때 [e bichueo bol ttae] (In comparison to)",
    "short_explanation": "Used to express comparison; 'in comparison to' or 'compared to'.",
    "long_explanation": "'~에 비추어 볼 때 [e bichueo bol ttae]' is used to compare one subject or factor with another, often to assert a judgment or highlight a contrast.",
    "formation": "Noun + 에 비추어 볼 때",
    "examples": [
      {
        "kr": "우리나라에 비추어 볼 때 미국의 문화는 매우 다릅니다.",
        "romaji": "Urinarae bichueo bol ttae miguk-ui munhwa-neun ma-eu dareumnida.",
        "en": "Compared to our country, American culture is very different.",
        "grammar_audio": "/audio/korean/grammar/s_에_비추어_볼_때_e_bichueo_bol_ttae_In_comparison_to_20250209_우리나라에_비추어_볼_때_미국의_문화는_매우_다릅니다.mp3"
      },
      {
        "kr": "나의 과거에 비추어 볼 때 나는 많이 변했어요.",
        "romaji": "Na-ui gwageoe bichueo bol ttae, naneun mani byeonhaesseoyo.",
        "en": "Compared to my past, I have changed a lot.",
        "grammar_audio": "/audio/korean/grammar/s_에_비추어_볼_때_e_bichueo_bol_ttae_In_comparison_to_20250209_나의_과거에_비추어_볼_때_나는_많이_변했어요.mp3"
      },
      {
        "kr": "서울에 비추어 볼 때 부산은 훨씬 조용하다.",
        "romaji": "Seoure bichueo bol ttae, busaneun hwolssin joyonghada.",
        "en": "Compared to Seoul, Busan is much quieter.",
        "grammar_audio": "/audio/korean/grammar/s_에_비추어_볼_때_e_bichueo_bol_ttae_In_comparison_to_20250209_서울에_비추어_볼_때_부산은_훨씬_조용하다.mp3"
      },
      {
        "kr": "다른 사람들에 비추어 볼 때 그는 특히 뛰어납니다.",
        "romaji": "Dareun saramdeure bichueo bol ttae, geuneun teughi ttwieonamnida.",
        "en": "Compared to other people, he is particularly outstanding.",
        "grammar_audio": "/audio/korean/grammar/s_에_비추어_볼_때_e_bichueo_bol_ttae_In_comparison_to_20250209_다른_사람들에_비추어_볼_때_그는_특히_뛰어납니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~이다 보니 [ida boni] (Since, as)",
    "short_explanation": "Used to state a reason or cause that leads to a certain result, similar to 'since' or 'as' in English.",
    "long_explanation": "'~이다 보니 [ida boni]' expresses a cause-and-effect relationship. It is used when a state or habitual action gradually leads to a particular consequence, implying that the result became apparent over time.",
    "formation": "Verb stem + -다 + 보니",
    "examples": [
      {
        "kr": "매일 같은 길을 걸어다니니 보니 이 동네에 대해 잘 알게 되었어요.",
        "romaji": "Maeil gateun gileul georeodanini boni i dongne-e daehae jal alge doeeoss-eoyo.",
        "en": "Since I walk the same route every day, I have come to know this neighborhood well.",
        "grammar_audio": "/audio/korean/grammar/s_이다_보니_ida_boni_Since_as_20250209_매일_같은_길을_걸어다니니_보니_이_동네에_대해_잘_알게_되었어요.mp3"
      },
      {
        "kr": "한국에서 한 달 살다 보니 한국어가 조금 더 편해졌어요.",
        "romaji": "Hangug-eseo han dal salda boni hanguk-eoga jogeum deo pyeonhaejyeoss-eoyo.",
        "en": "Since living in Korea for a month, Korean has become a bit easier for me.",
        "grammar_audio": "/audio/korean/grammar/s_이다_보니_ida_boni_Since_as_20250209_한국에서_한_달_살다_보니_한국어가_조금_더_편해졌어요.mp3"
      },
      {
        "kr": "우리는 같은 회사에서 일하다 보니 친해졌어요.",
        "romaji": "Ulineun gateun hoesa-eseo ilhada boni chinhaejyeoss-eoyo.",
        "en": "Since we worked together at the same company, we became close.",
        "grammar_audio": "/audio/korean/grammar/s_이다_보니_ida_boni_Since_as_20250209_우리는_같은_회사에서_일하다_보니_친해졌어요.mp3"
      },
      {
        "kr": "매일 아침에 운동을 하다 보니 몸이 건강해진 것 같아요.",
        "romaji": "Maeil achim-e undong-eul hada boni mom-i geonganghaejin geos gat-ayo.",
        "en": "Since I exercise every morning, it seems my body has become healthier.",
        "grammar_audio": "/audio/korean/grammar/s_이다_보니_ida_boni_Since_as_20250209_매일_아침에_운동을_하다_보니_몸이_건강해진_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~이라면 그것은 [iramyeon geugeoseun] (If it’s called)",
    "short_explanation": "Used when describing or explaining something in detail if it is defined in a certain way.",
    "long_explanation": "'~이라면 그것은 [iramyeon geugeoseun]' is used to introduce a definition or explanation. It is roughly equivalent to saying 'if it's called...' in English and is followed by a more detailed description of the subject.",
    "formation": "Subject + 이라면 그것은 + Detailed Description",
    "examples": [
      {
        "kr": "사랑이라면 그것은 상대방을 배려하고 이해해 주는 것을 말한다.",
        "romaji": "Sarangiramyeon geugeoseun sangdaebangeul baeryeohago ihaehaejuneun geoseul maldanda.",
        "en": "If it's called love, it means showing care and understanding toward the other person.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_그것은_iramyeon_geugeoseun_If_its_called_20250209_사랑이라면_그것은_상대방을_배려하고_이해해_주는_것을_말한다.mp3"
      },
      {
        "kr": "자유라면 그것은 자신의 생각과 말을 제한받지 않는 것이다.",
        "romaji": "Jayuramyeon geugeoseun jasinui saenggakwa malul jehanbadji antneun geosida.",
        "en": "If it's called freedom, it means not having your thoughts and words restricted.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_그것은_iramyeon_geugeoseun_If_its_called_20250209_자유라면_그것은_자신의_생각과_말을_제한받지_않는_것이다.mp3"
      },
      {
        "kr": "친구라면 그것은 서로를 이해하고 도와주는 사이를 말한다.",
        "romaji": "Chinguramyeon geugeoseun seororeul ihaehago dowajuneun saireul maldanda.",
        "en": "If it's called a friend, it refers to a relationship where you understand and help each other.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_그것은_iramyeon_geugeoseun_If_its_called_20250209_친구라면_그것은_서로를_이해하고_도와주는_사이를_말한다.mp3"
      },
      {
        "kr": "성공이라면 그것은 목표를 달성하고 자신의 꿈을 이룬 것을 말한다.",
        "romaji": "Seonggongiramyeon geugeoseun mokpyoreul dalhagong jasinui kkumeul irun geoseul maldanda.",
        "en": "If it's called success, it means achieving your goals and fulfilling your dreams.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_그것은_iramyeon_geugeoseun_If_its_called_20250209_성공이라면_그것은_목표를_달성하고_자신의_꿈을_이룬_것을_말한다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~이래 [irae] (Since then, after)",
    "short_explanation": "Used to express that something has been the case since a certain past event.",
    "long_explanation": "'~이래 [irae]' denotes 'since then' or 'after' an event, emphasizing the lasting impact or continued change from that moment onward.",
    "formation": "Verbal noun + 이래",
    "examples": [
      {
        "kr": "그 사고 이래로 제가 차를 타지 못하게 되었어요, 그래서 버스와 지하철로 이동하게 되었어요.",
        "romaji": "Geu sago iraero jega cha-reul taji mothage doe-eotseoyo, geuraeseo beoseuwa jihacheollo idongeul hage doe-eotseoyo.",
        "en": "Since that accident, I have not been able to drive a car, so I have had to travel by bus and subway.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_then_after_20250209_그_사고_이래로_제가_차를_타지_못하게_되었어요_그래서_버스와_지하철로_이동하게_되었어요.mp3"
      },
      {
        "kr": "봄이래 제가 꽃 알레르기로 고생을 많이 했어요, 그래서 약을 계속 먹고 있어요.",
        "romaji": "Bom irae jega kkoche allerugiro gosaeng-eul mani haesseoyo, geuraeseo yag-eul gyesog meogeoyo.",
        "en": "Since spring, I have suffered a lot from flower allergies, so I am constantly taking medicine.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_then_after_20250209_봄이래_제가_꽃_알레르기로_고생을_많이_했어요_그래서_약을_계속_먹고_있어요.mp3"
      },
      {
        "kr": "지난 회의 이래로 사무실 분위기가 계속 나빠지고 있어요, 많은 사람들이 불만을 표시하고 있어요.",
        "romaji": "Jinan hoeui iraero samusil bunwigiga gyesok nappajigo iss-eoyo, manheun saramdeuri bulmane pyosi hago iss-eoyo.",
        "en": "Since the last meeting, the office atmosphere has been continuously deteriorating, and many people are expressing their dissatisfaction.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_then_after_20250209_지난_회의_이래로_사무실_분위기가_계속_나빠지고_있어요_많은_사람들이_불만을_표시하고_있어요.mp3"
      },
      {
        "kr": "오랜만에 만난 친구가 결혼했다는 소식을 듣고 이래로는 못 마주쳤어요, 그래서 연락을 해야 할 것 같아요.",
        "romaji": "Oraenman-e mannahn chinguga gyeolhonhaessdaneun sosigeul deudgo iraero-neun mot majuchyeosseoyo, geuraeseo yeollageul haeya hal geos gatayo.",
        "en": "Since I heard that my long-lost friend got married, I haven’t run into her, so I think I should contact her.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Since_then_after_20250209_오랜만에_만난_친구가_결혼했다는_소식을_듣고_이래로는_못_마주쳤어요_그래서_연락을_해야_할_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "25"
  },
  {
    "title": "~이야말로 [iyamallo] (Truly, really)",
    "short_explanation": "Used to emphasize that something or someone is the true or real example of a quality.",
    "long_explanation": "'~이야말로 [iyamallo]' is used to assert that the attached noun is the very or best example of a given quality. It can be translated as 'truly' or 'really' in English and is used for emphasis when stating a fact or situation.",
    "formation": "Noun + 이야말로",
    "examples": [
      {
        "kr": "그 학생이야말로 모범적인 학생이에요, 그는 항상 열심히 공부하고 책임감이 강해요.",
        "romaji": "Geu haksengiyamallo mobeomjeokin haksengieyo, geuneun hangsang yeolsimhi gongbuhago chaegimgami ganghaeyo.",
        "en": "That student is truly an exemplary student; he always studies hard and is very responsible.",
        "grammar_audio": "/audio/korean/grammar/s_이야말로_iyamallo_Truly_really_20250209_그_학생이야말로_모범적인_학생이에요_그는_항상_열심히_공부하고_책임감이_강해요.mp3"
      },
      {
        "kr": "지금 이 순간이야말로 우리가 기다렸던 기회입니다, 이번 기회를 놓치면 더 이상의 기회는 없을 거예요.",
        "romaji": "Jigeum i sunganiyamallo uriga gidaryeotdeon gihoeyibnida, ibeon gihoereul nohchimyeon deo isangui gihoeuneun eobseul geoyeyo.",
        "en": "This moment is truly the opportunity we have been waiting for; if we miss it, there will be no more chances.",
        "grammar_audio": "/audio/korean/grammar/s_이야말로_iyamallo_Truly_really_20250209_지금_이_순간이야말로_우리가_기다렸던_기회입니다_이번_기회를_놓치면_더_이상의_기회는_없을_거예요.mp3"
      },
      {
        "kr": "이 보컬이야말로 이 밴드의 핵심입니다, 그녀의 목소리 없이는 이 밴드가 상상조차 되지 않아요.",
        "romaji": "I bokoriyamallo i baendeu-ui haeksingibnida, geunyeoui moksori eobsineun i baendeuga sangsangjocha doeji anhayo.",
        "en": "This vocalist is truly the core of the band; without her voice, the band is unimaginable.",
        "grammar_audio": "/audio/korean/grammar/s_이야말로_iyamallo_Truly_really_20250209_이_보컬이야말로_이_밴드의_핵심입니다_그녀의_목소리_없이는_이_밴드가_상상조차_되지_않아요.mp3"
      },
      {
        "kr": "그 일이야말로 제 인생의 중요한 전환점이었습니다, 그 일로 인해 제 인생이 완전히 바뀌었어요.",
        "romaji": "Geu iriyamallo je insaengui jungyohan jeonhwanjeomieossseubnida, geu ilro inhae je insaeng-i wanjeonhi bakkwieosseo.",
        "en": "That incident was truly an important turning point in my life; my life changed completely because of it.",
        "grammar_audio": "/audio/korean/grammar/s_이야말로_iyamallo_Truly_really_20250209_그_일이야말로_제_인생의_중요한_전환점이었습니다_그_일로_인해_제_인생이_완전히_바뀌었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~인 까닭에 [in kkadake] (Because, the reason why)",
    "short_explanation": "Indicates 'because' or 'the reason why' by giving the cause for the main clause.",
    "long_explanation": "'~인 까닭에 [in kkadake]' is a conjunction expression used in Korean to explain the reason or cause of an action, event, or situation. It is similar in meaning to 'because' or 'the reason why' in English and is generally used in formal or literary contexts (in contrast to colloquial forms like '때문에' or '해서').",
    "formation": "Verb‑기 / Adjective‑은 / Noun‑인 + 까닭에",
    "examples": [
      {
        "kr": "부모님이 건강하신 까닭에 저는 항상 행복해요.",
        "romaji": "Bumonim-i geonganghasin kkadake, jeoneun hangsang haengbokhaeyo.",
        "en": "I am always happy because my parents are healthy.",
        "grammar_audio": "/audio/korean/grammar/s_인_까닭에_in_kkadake_Because_the_reason_why_20250209_부모님이_건강하신_까닭에_저는_항상_행복해요.mp3"
      },
      {
        "kr": "날씨가 좋은 까닭에 저는 오늘 산책하러 갔어요.",
        "romaji": "Nalssiga jo-eun kkadake, jeoneun oneul sancaekhaleo gasseoyo.",
        "en": "I went for a walk today because the weather was nice.",
        "grammar_audio": "/audio/korean/grammar/s_인_까닭에_in_kkadake_Because_the_reason_why_20250209_날씨가_좋은_까닭에_저는_오늘_산책하러_갔어요.mp3"
      },
      {
        "kr": "여행 준비를 철저히 한 까닭에 저는 여행 중에 불편함을 느끼지 않았어요.",
        "romaji": "Yeohaeng junbireul cheoljeohi han kkadake, jeoneun yeohaeng jung-e bulpyeonham-eul neukkiji anhass-eoyo.",
        "en": "I didn’t feel uncomfortable during the trip because I thoroughly prepared for it.",
        "grammar_audio": "/audio/korean/grammar/s_인_까닭에_in_kkadake_Because_the_reason_why_20250209_여행_준비를_철저히_한_까닭에_저는_여행_중에_불편함을_느끼지_않았어요.mp3"
      },
      {
        "kr": "문제를 꼼꼼히 살펴본 까닭에 방학 중에 공부할 때 하나도 다루지 않는 문제는 없어요.",
        "romaji": "Munje-reul kkomkkomhi salpyeobon kkadake, banghak jung-e gongbuhal ttae hanado daruji anneun munjeneun eopseoyo.",
        "en": "Because I carefully examined the problem, there isn’t a single issue I avoid while studying during vacation.",
        "grammar_audio": "/audio/korean/grammar/s_인_까닭에_in_kkadake_Because_the_reason_why_20250209_문제를_꼼꼼히_살펴본_까닭에_방학_중에_공부할_때_하나도_다루지_않는_문제는_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~인 즉 [in jeuk] (In other words)",
    "short_explanation": "Used to restate or clarify something; 'in other words', 'that is to say'.",
    "long_explanation": "'~인 즉 [in jeuk]' is a phrase used in Korean to restate or clarify a previous statement in different words. It is similar to the English expressions 'in other words', 'that is to say', or 'namely' and offers additional clarification or perspective.",
    "formation": "Noun/Verb + ~인 즉 + Restatement",
    "examples": [
      {
        "kr": "그는 특이한 사람입니다, 즉 그가 평범한 사람과는 다르게 행동하는 것을 의미합니다.",
        "romaji": "Geuneun teukiin saramimnida, injeok geuga pyeongbeonhan saramgwaneun dareuge haengdonghaneun geoseul uimihabnida.",
        "en": "He is an unusual person; in other words, he behaves differently from ordinary people.",
        "grammar_audio": "/audio/korean/grammar/s_인_즉_in_jeuk_In_other_words_20250209_그는_특이한_사람입니다_즉_그가_평범한_사람과는_다르게_행동하는_것을_의미합니다.mp3"
      },
      {
        "kr": "이번 시험은 어려웠습니다. 즉, 많은 학생들이 낮은 점수를 받았다는 것입니다.",
        "romaji": "Ibeon siheomeun eoryeowosseumnida. Injeok, maneun haksaengdeuri najeun jeomsureul badatneun geosimnida.",
        "en": "This exam was difficult; that is to say, many students received low scores.",
        "grammar_audio": "/audio/korean/grammar/s_인_즉_in_jeuk_In_other_words_20250209_이번_시험은_어려웠습니다_즉_많은_학생들이_낮은_점수를_받았다는_것입니다.mp3"
      },
      {
        "kr": "당신은 제 최고의 친구입니다, 즉 제가 가장 신뢰하는 사람입니다.",
        "romaji": "Dangsineun je choegoui chinguimnida, injeok jegaga gajang sinroehaneun saramimnida.",
        "en": "You are my best friend; in other words, you are the person I trust the most.",
        "grammar_audio": "/audio/korean/grammar/s_인_즉_in_jeuk_In_other_words_20250209_당신은_제_최고의_친구입니다_즉_제가_가장_신뢰하는_사람입니다.mp3"
      },
      {
        "kr": "지구가 따뜻해지고 있습니다, 즉 지구 온난화 현상이 일어나고 있는 것입니다.",
        "romaji": "Jiguga ttatteutaejigo issseumnida, injeok jigu onnanhwa hyeonsangi ileonago issneun geosimnida.",
        "en": "The Earth is getting warmer; in other words, global warming is happening.",
        "grammar_audio": "/audio/korean/grammar/s_인_즉_in_jeuk_In_other_words_20250209_지구가_따뜻해지고_있습니다_즉_지구_온난화_현상이_일어나고_있는_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~처럼 하다 [cheoreom hada] (To act as if, pretend to)",
    "short_explanation": "Expresses that someone behaves as if they are in a certain state; 'pretend to' or 'act as if'.",
    "long_explanation": "'~처럼 하다 [cheoreom hada]' is used to describe when someone imitates or mimics a particular state or behavior. In everyday Korean, speakers often use the expression with the auxiliary ‘척 하다’ to mean 'pretend to.'",
    "formation": "Noun/Adjective (or state) + 척 하다",
    "examples": [
      {
        "kr": "그는 사람들에게 행복한 척 하며 웃었어요.",
        "romaji": "Geuneun saramdeurege haengboghan cheok hameo useosseoyo.",
        "en": "He pretended to be happy and laughed to make people feel good.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_하다_cheoreom_hada_To_act_as_if_pretend_to_20250209_그는_사람들에게_행복한_척_하며_웃었어요.mp3"
      },
      {
        "kr": "제가 이해한 척 행동하려고 노력했지만, 사실 많은 것을 이해하지 못했어요.",
        "romaji": "Jega ihaehan cheok haengdongharyeogo noryeokhaessjiman, sasil manheun geoseul ihaehaji motaesseoyo.",
        "en": "I tried to act as if I understood, but in fact, I didn’t understand many things.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_하다_cheoreom_hada_To_act_as_if_pretend_to_20250209_제가_이해한_척_행동하려고_노력했지만_사실_많은_것을_이해하지_못했어요.mp3"
      },
      {
        "kr": "그녀는 자신의 문제를 모른 척 행동했어요.",
        "romaji": "Geunyeoneun jasineui munjeleul moreun cheok haengdonghaesseoyo.",
        "en": "She acted as if she didn’t know about her own problem.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_하다_cheoreom_hada_To_act_as_if_pretend_to_20250209_그녀는_자신의_문제를_모른_척_행동했어요.mp3"
      },
      {
        "kr": "그는 상황을 제어할 수 있는 척 행동하려고 했지만, 사실은 그렇지 않아요.",
        "romaji": "Geuneun sanghwangeul jeeohal su itneun cheok haengdongharyeogo haessjiman, sasileun geureohji anhayo.",
        "en": "He tried to act as if he could control the situation, but in reality, he couldn’t.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_하다_cheoreom_hada_To_act_as_if_pretend_to_20250209_그는_상황을_제어할_수_있는_척_행동하려고_했지만_사실은_그렇지_않아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~커지다 [keojida] (Become bigger, more important)",
    "short_explanation": "Expresses that something grows in size, significance, or importance.",
    "long_explanation": "The verb '커지다 [keojida]' indicates that something becomes bigger, more significant, or more important. It can be used for physical size as well as abstract or emotional growth, making it versatile in various contexts.",
    "formation": "Noun + 이/가 + 커지다",
    "examples": [
      {
        "kr": "나는 자라면서 내 꿈이 더 커지고 중요해져서 내 삶이 바뀌었어요.",
        "romaji": "Naneun jarimyeonseo nae kkumi deo keojigo jungyohajaeseo nae salmi bakkwieosseo.",
        "en": "As I grew up, my dreams became bigger and more important, and my life changed.",
        "grammar_audio": "/audio/korean/grammar/s_커지다_keojida_Become_bigger_more_important_20250209_나는_자라면서_내_꿈이_더_커지고_중요해져서_내_삶이_바뀌었어요.mp3"
      },
      {
        "kr": "그 회사는 확장하면서 그의 역할이 점점 중요하게 커졌어요.",
        "romaji": "Geu hwesa-neun hwakjanghamyeonseo geuui yeoghal-i jeomjeom jungyohage keojyeosseoyo.",
        "en": "As the company expanded, his role became increasingly important.",
        "grammar_audio": "/audio/korean/grammar/s_커지다_keojida_Become_bigger_more_important_20250209_그_회사는_확장하면서_그의_역할이_점점_중요하게_커졌어요.mp3"
      },
      {
        "kr": "저희 집 가족의 사랑은 저희가 함께 시간을 보내며 점점 커져요.",
        "romaji": "Jeohui jib gajog-ui sarangeun, jeohui-ga hamkke siganeul bonaemyeo jeomjeom keojyeoyo.",
        "en": "Our family's love grows bigger as we spend time together.",
        "grammar_audio": "/audio/korean/grammar/s_커지다_keojida_Become_bigger_more_important_20250209_저희_집_가족의_사랑은_저희가_함께_시간을_보내며_점점_커져요.mp3"
      },
      {
        "kr": "이슈가 계속되면서 그 문제의 중요성은 커져만 갔어요.",
        "romaji": "Isugagi gyesokdoemyeonseo geu munjeui jungyoseong-eun keojyeoman gasseoyo.",
        "en": "As the issue continued, the importance of that problem only grew.",
        "grammar_audio": "/audio/korean/grammar/s_커지다_keojida_Become_bigger_more_important_20250209_이슈가_계속되면서_그_문제의_중요성은_커져만_갔어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~키로 하다 [kiro hada] (Intend to, plan to)",
    "short_explanation": "Denotes the speaker's intention or resolution to do something.",
    "long_explanation": "The form '~키로 하다 [kiro hada]' is used in Korean to express a decision, plan, or intention for a future action. It conveys a sense of resolution and deliberate commitment, and is generally translated as 'intend to' or 'plan to' in English.",
    "formation": "Verb (dictionary form) + 키로 하다",
    "examples": [
      {
        "kr": "저는 한국어를 완벽하게 배울 키로 했습니다 그래서 매일 많은 연습을 하고 있습니다.",
        "romaji": "Jeoneun hangugeoreul wanbyeokhage baeul kiro haetsseumnida, geuraeseo maeil maneun yeonseubeul hago issseumnida.",
        "en": "I have decided to learn Korean perfectly, so I am practicing a lot every day.",
        "grammar_audio": "/audio/korean/grammar/s_키로_하다_kiro_hada_Intend_to_plan_to_20250209_저는_한국어를_완벽하게_배울_키로_했습니다_그래서_매일_많은_연습을_하고_있습니다.mp3"
      },
      {
        "kr": "우리는 내년에 결혼할 키로 했습니다.",
        "romaji": "Urineun naenyeone gyeolhonhal kiro haetsseumnida.",
        "en": "We have decided to get married next year.",
        "grammar_audio": "/audio/korean/grammar/s_키로_하다_kiro_hada_Intend_to_plan_to_20250209_우리는_내년에_결혼할_키로_했습니다.mp3"
      },
      {
        "kr": "다이어트를 시작할 키로 했어요 그래서 매일 운동하고 있어요.",
        "romaji": "Daieteureul sijakhal kiro haetsseumnida, geuraeseo maeil undonghago isseoyo.",
        "en": "I have decided to start dieting, so I am exercising every day.",
        "grammar_audio": "/audio/korean/grammar/s_키로_하다_kiro_hada_Intend_to_plan_to_20250209_다이어트를_시작할_키로_했어요_그래서_매일_운동하고_있어요.mp3"
      },
      {
        "kr": "사장님은 회사를 확장할 키로 했습니다.",
        "romaji": "Sajangnimeun hoesareul hwakjanghal kiro haetsseumnida.",
        "en": "The boss has decided to expand the company.",
        "grammar_audio": "/audio/korean/grammar/s_키로_하다_kiro_hada_Intend_to_plan_to_20250209_사장님은_회사를_확장할_키로_했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하기에는 [hagineun] (Considering)",
    "short_explanation": "Used to express 'considering' or 'given that'.",
    "long_explanation": "'~하기에는 [hagineun]' is used when taking into account a certain condition or fact before making a judgment or decision. It is attached to a verb stem (as in '하기에는') to indicate that, given that condition, the following statement holds true.",
    "formation": "Verb stem + 기에는",
    "examples": [
      {
        "kr": "오늘은 비가 와서 축구를 하기에는 좀 어렵겠어요.",
        "romaji": "Oneureun biga wasseo chukgureul hagineun jom eoryeobgesseoyo.",
        "en": "Considering that it's raining today, it might be a bit difficult to play soccer.",
        "grammar_audio": "/audio/korean/grammar/s_하기에는_hagineun_Considering_20250209_오늘은_비가_와서_축구를_하기에는_좀_어렵겠어요.mp3"
      },
      {
        "kr": "저는 돈이 너무 없어서 여행을 가기에는 불가능해요.",
        "romaji": "Jeoneun doni neomu eopsseo yeohaengeul gagineun bulganeunghaeyo.",
        "en": "Considering that I don't have much money, it's impossible for me to travel.",
        "grammar_audio": "/audio/korean/grammar/s_하기에는_hagineun_Considering_20250209_저는_돈이_너무_없어서_여행을_가기에는_불가능해요.mp3"
      },
      {
        "kr": "이 프로젝트를 완성하기에는 시간이 부족해요.",
        "romaji": "I peurojekteureul wanseonghagineun sigani bujokhaeyo.",
        "en": "Considering the time, it's not enough to complete this project.",
        "grammar_audio": "/audio/korean/grammar/s_하기에는_hagineun_Considering_20250209_이_프로젝트를_완성하기에는_시간이_부족해요.mp3"
      },
      {
        "kr": "이 영화를 보기에는 너무 무서워서 안될 거 같아요.",
        "romaji": "I yeonghwaleul bogineun neomu museowoseo andoel geo gatayo.",
        "en": "Considering it's too scary, I don't think I can watch this movie.",
        "grammar_audio": "/audio/korean/grammar/s_하기에는_hagineun_Considering_20250209_이_영화를_보기에는_너무_무서워서_안될_거_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하기는 하다 [hagineun hada] (Do it somehow)",
    "short_explanation": "Conveys that someone does something, though not very well or adequately.",
    "long_explanation": "The expression '~하기는 하다 [hagineun hada]' is used to imply that while an action is indeed performed, it may not be done proficiently or to the expected standard.",
    "formation": "Verb stem + 기는 하다",
    "examples": [
      {
        "kr": "제가 요리를 하기는 하는데, 그렇게 맛있게는 안 나와요.",
        "romaji": "Jega yorireul hagineun haneunde, geureoke masitge-neun an nawayo.",
        "en": "I do cook, but it doesn't turn out that delicious.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hagineun_hada_Do_it_somehow_20250209_제가_요리를_하기는_하는데_그렇게_맛있게는_안_나와요.mp3"
      },
      {
        "kr": "우리 회사에는 일을 하기는 하는데, 잘 하는 사람이 별로 없어요.",
        "romaji": "Uri hwesaeneun ireul hagineun haneunde, jal haneun sarami byeollo eopseoyo.",
        "en": "In our company, people do work, but there aren’t many who do it well.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hagineun_hada_Do_it_somehow_20250209_우리_회사에는_일을_하기는_하는데_잘_하는_사람이_별로_없어요.mp3"
      },
      {
        "kr": "그는 학교를 다니기는 하는데, 실제로는 못 하는 과목이 많아요.",
        "romaji": "Geuneun hakgyoreul danigineun haneunde, siljero-neun mot haneun gwamogi manh-ayo.",
        "en": "He does attend school, but in reality, there are many subjects he struggles with.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hagineun_hada_Do_it_somehow_20250209_그는_학교를_다니기는_하는데_실제로는_못_하는_과목이_많아요.mp3"
      },
      {
        "kr": "나는 영어를 말하기는 하는데, 자연스럽게 말하진 못해요.",
        "romaji": "Naneun yeong-eoreul malhagineun haneunde, jayeon-seureopge malhajin moth-ayo.",
        "en": "I do speak English, but I can't speak it fluently.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hagineun_hada_Do_it_somehow_20250209_나는_영어를_말하기는_하는데_자연스럽게_말하진_못해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하기야 [hagiya] (Indeed, truly)",
    "short_explanation": "Used to emphasize or affirm a statement; 'indeed', 'truly', 'to be sure'.",
    "long_explanation": "'~하기야 [hagiya]' is a form used to strongly affirm the truth of a statement or to emphasize one’s viewpoint. It is akin to saying 'indeed' or 'truly' in English.",
    "formation": "Verb stem + 하기야",
    "examples": [
      {
        "kr": "요즘 친구들이 공부하기야 쉽지 않아요, 그러니까 매일 night study가 필요해요.",
        "romaji": "Yojeum chingudeuri gongbuhagiya swipji anayo, geureonikka maeil night studyga piryohaeyo.",
        "en": "Indeed, studying isn’t easy for my friends these days, so night study is necessary every day.",
        "grammar_audio": "/audio/korean/grammar/s_하기야_hagiya_Indeed_truly_20250209_요즘_친구들이_공부하기야_쉽지_않아요_그러니까_매일_night_study가_필요해요.mp3"
      },
      {
        "kr": "이제 코로나19 바이러스가 퍼져서 여행하기야 어려워요, 그래서 집에서만 시간을 보내고 있어요.",
        "romaji": "Ije korona19 baireoseuga peojyeoseo yeohaenghagiya eoryeowoyo, geuraeseo jibeseoman siganeul bonaego isseoyo.",
        "en": "Indeed, traveling is difficult now that Covid‑19 is spreading, so I’m spending time only at home.",
        "grammar_audio": "/audio/korean/grammar/s_하기야_hagiya_Indeed_truly_20250209_이제_코로나19_바이러스가_퍼져서_여행하기야_어려워요_그래서_집에서만_시간을_보내고_있어요.mp3"
      },
      {
        "kr": "학교에 관한 것이 아니라면, 그것을 하다 하기야 꼭 원합니다.",
        "romaji": "Hakgyoe gwanhan geosi aniramyeon, geugeoseul hada hagiya kkok wonhamnida.",
        "en": "Indeed, if it isn’t about school, I definitely want to do it.",
        "grammar_audio": "/audio/korean/grammar/s_하기야_hagiya_Indeed_truly_20250209_학교에_관한_것이_아니라면_그것을_하다_하기야_꼭_원합니다.mp3"
      },
      {
        "kr": "맛있는 음식을 만드는 것은 어렵다고 하기야 그렇습니다, 그러나 매일 노력하면 점차 능력이 향상될 것입니다.",
        "romaji": "Masinneun eumsigeul mandeuneun geoseun eoryeodago hagiya geuraeyo, geureona maeil noryeokhamyeon jeomcha neungryeogi hyangsangdoel geosibnida.",
        "en": "Indeed, making delicious food is difficult, but if you try every day, your ability will gradually improve.",
        "grammar_audio": "/audio/korean/grammar/s_하기야_hagiya_Indeed_truly_20250209_맛있는_음식을_만드는_것은_어렵다고_하기야_그렇습니다_그러나_매일_노력하면_점차_능력이_향상될_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하기만 하면 [hakiman hamyeon] (As soon as)",
    "short_explanation": "Expresses 'as soon as' or 'whenever' an action occurs, another immediately follows.",
    "long_explanation": "'~하기만 하면 [hakiman hamyeon]' is used to indicate that as soon as a certain action (expressed by the verb stem + 하다) happens, another action follows immediately or consequently.",
    "formation": "Verb stem + 하기만 하면",
    "examples": [
      {
        "kr": "나는 매일 아침 일어나기만 하면 운동을 합니다.",
        "romaji": "Naneun maeil achim ileonagiman hamyeon undongeul habnida.",
        "en": "I exercise as soon as I wake up every morning.",
        "grammar_audio": "/audio/korean/grammar/s_하기만_하면_hakiman_hamyeon_As_soon_as_20250209_나는_매일_아침_일어나기만_하면_운동을_합니다.mp3"
      },
      {
        "kr": "그녀가 집에 도착하기만 하면 바로 저녁을 만들어요.",
        "romaji": "Geunyeoga jibe dochakhagiman hamyeon baro jeonyeogeul mandeureoyo.",
        "en": "As soon as she arrives home, she starts to make dinner.",
        "grammar_audio": "/audio/korean/grammar/s_하기만_하면_hakiman_hamyeon_As_soon_as_20250209_그녀가_집에_도착하기만_하면_바로_저녁을_만들어요.mp3"
      },
      {
        "kr": "수업이 끝나기만 하면 학생들이 즉시 학교를 떠납니다.",
        "romaji": "Sueobi ggeutnagiman hamyeon haksaengdeuli jeugshi hakgyoreul tteonabnida.",
        "en": "The students leave school immediately as soon as the class ends.",
        "grammar_audio": "/audio/korean/grammar/s_하기만_하면_hakiman_hamyeon_As_soon_as_20250209_수업이_끝나기만_하면_학생들이_즉시_학교를_떠납니다.mp3"
      },
      {
        "kr": "그가 긴장하기만 하면 어깨가 떨립니다.",
        "romaji": "Geuga ginjanghagiman hamyeon eokkaega tteollibnida.",
        "en": "His shoulders shake whenever he gets nervous.",
        "grammar_audio": "/audio/korean/grammar/s_하기만_하면_hakiman_hamyeon_As_soon_as_20250209_그가_긴장하기만_하면_어깨가_떨립니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하면서도 [hamyeonseodo] (While, although)",
    "short_explanation": "Used to express a contradictory situation or event occurring at the same time; 'while', 'although'.",
    "long_explanation": "'~하면서도 [hamyeonseodo]' is a conjunction used in Korean to indicate two actions or states happening simultaneously, with an aspect of contradiction or conflicting elements. It's like saying 'although' or 'even when' in English, and it implies that despite the first action, the second one still occurs. It can be used to show an inconsistency between what is expected and what really happens.",
    "formation": "Verb-stem + ~하면서도",
    "examples": [
      {
        "kr": "그녀는 회사에서 바쁘게 일하면서도 항상 일찍 집에 가서 아이들과 식사를 함께해요.",
        "romaji": "Geunyeoneun hoesaeseo bappeuge ilhamyeonseodo hangsang iljjik jibe gaseo aideulgwa siksa-reul hamkkehaeyo.",
        "en": "Even as she works hard at the company, she always goes home early to have meals with her children.",
        "grammar_audio": "/audio/korean/grammar/s_하면서도_hamyeonseodo_While_although_20250209_그녀는_회사에서_바쁘게_일하면서도_항상_일찍_집에_가서_아이들과_식사를_함께해요.mp3"
      },
      {
        "kr": "저는 공부에 집중하면서도 친구들과 소통하는 데에는 어려움이 있어요.",
        "romaji": "Jeoneun gongbue jipjunghamyeonseodo chingudeulgwa sotonghaneun deeneun eoryeoumi isseoyo.",
        "en": "While focusing on my studies, I find it difficult to communicate with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_하면서도_hamyeonseodo_While_although_20250209_저는_공부에_집중하면서도_친구들과_소통하는_데에는_어려움이_있어요.mp3"
      },
      {
        "kr": "그는 연인과 행복하게 지내면서도, 그녀가 항상 곁에 없을 때를 두려워해요.",
        "romaji": "Geuneun yeoningwa haengbokhage jinaemyeonseodo, geunyeoga hangsang gyeote eopseul ttaereul duryeowohaeyo.",
        "en": "Even as he spends happy moments with his lover, he fears the times when she is not by his side.",
        "grammar_audio": "/audio/korean/grammar/s_하면서도_hamyeonseodo_While_although_20250209_그는_연인과_행복하게_지내면서도_그녀가_항상_곁에_없을_때를_두려워해요.mp3"
      },
      {
        "kr": "어머니는 항상 건강에 신경을 쓰면서도, 자신의 건강은 항상 무시하곤 해요.",
        "romaji": "Eomeonineun hangsang geongange singyeongeul sseumyeonseodo, jasinui geongangeun hangsang musihagon haeyo.",
        "en": "While mom always takes care of others’ health, she tends to ignore her own health.",
        "grammar_audio": "/audio/korean/grammar/s_하면서도_hamyeonseodo_While_although_20250209_어머니는_항상_건강에_신경을_쓰면서도_자신의_건강은_항상_무시하곤_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하면 할수록 [hamyeon halsurok] (The more... the more)",
    "short_explanation": "Used to express a correlation between two actions or situations; 'the more... the more'.",
    "long_explanation": "The '~하면 할수록 [hamyeon halsurok]' grammar point is used to express a correlation between two things. The first clause shows what is increasing or decreasing, while the second clause shows the result. This pattern emphasizes that as one event or situation increases or decreases, a related event or situation also increases or decreases—much like the English expression 'the more... the more'.",
    "formation": "Verb + 면, Verb + 수록",
    "examples": [
      {
        "kr": "이것을 연습하면 연습할수록 더 잘해져서, 계속 연습하면 제가 마스터할 수 있을 거예요.",
        "romaji": "Igeoseul yeonseubhamyeon yeonseubhalsurok deo jalhaejeoseo, gyesok yeonseubhamyeon jega maseuteo hal su isseul geoyeyo.",
        "en": "The more I practice this, the better I get; so if I keep practicing, I could master it.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_이것을_연습하면_연습할수록_더_잘해져서_계속_연습하면_제가_마스터할_수_있을_거예요.mp3"
      },
      {
        "kr": "날씨가 추워지면 추워질수록 더 많은 사람들이 옷가게에 들렀어요.",
        "romaji": "Nalssiga chuwojimyeon chuwojilsurok deo manheun saramdeuri otgage deulleosseoyo.",
        "en": "The colder the weather gets, the more people stop by the clothing store.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_날씨가_추워지면_추워질수록_더_많은_사람들이_옷가게에_들렀어요.mp3"
      },
      {
        "kr": "나는 한국어를 공부하면 공부할수록 그 언어에 대해 더 알고 싶어져요.",
        "romaji": "Naneun hangugeoreul gongbuhamyeon gongbuhalsurok geu eoneoe daehae deo algo sipheojyeoyo.",
        "en": "The more I study Korean, the more I want to know about the language.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_나는_한국어를_공부하면_공부할수록_그_언어에_대해_더_알고_싶어져요.mp3"
      },
      {
        "kr": "이 도시에 살면 살수록 더 많은 볼거리와 할 것들이 있는 걸 알게 됐어요.",
        "romaji": "I dosiye salsumyeon salsurok deo manheun bolgeoriwa hal geosdeuli issneun geol alge dwaesseoyo.",
        "en": "The longer I live in this city, the more I find there is to see and do.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_이_도시에_살면_살수록_더_많은_볼거리와_할_것들이_있는_걸_알게_됐어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하자마자 [hajamaja] (As soon as)",
    "short_explanation": "Used to express 'as soon as' or 'right after' something has happened.",
    "long_explanation": "'~하자마자 [hajamaja]' is a conjugation used in Korean to indicate an action that is immediately followed by another action with no gap in between. Essentially, it means 'as soon as' or 'right after.'",
    "formation": "Verb stem + 하자마자",
    "examples": [
      {
        "kr": "학교에 도착하자마자 그는 수업에 바로 들어갔습니다.",
        "romaji": "Hakgyoe dochakhajamaja geuneun sueobe baro deuleogassseubnida.",
        "en": "As soon as he arrived at school, he went straight to class.",
        "grammar_audio": "/audio/korean/grammar/s_하자마자_hajamaja_As_soon_as_20250209_학교에_도착하자마자_그는_수업에_바로_들어갔습니다.mp3"
      },
      {
        "kr": "저는 공항에 도착하자마자 택시를 불렀어요.",
        "romaji": "Jeoneun gonghang-e dochakhajamaja taeksileul bulleosseoyo.",
        "en": "As soon as I arrived at the airport, I called a taxi.",
        "grammar_audio": "/audio/korean/grammar/s_하자마자_hajamaja_As_soon_as_20250209_저는_공항에_도착하자마자_택시를_불렀어요.mp3"
      },
      {
        "kr": "그녀는 일어나자마자 커피를 만들었습니다.",
        "romaji": "Geunyeoneun ileonajamaja keopireul mandeuleosseubnida.",
        "en": "As soon as she woke up, she made coffee.",
        "grammar_audio": "/audio/korean/grammar/s_하자마자_hajamaja_As_soon_as_20250209_그녀는_일어나자마자_커피를_만들었습니다.mp3"
      },
      {
        "kr": "회사에서 퇴근하자마자 집에 바로 가서 쉬었어요.",
        "romaji": "Hoesaeseo toeguenhajamaja jibe baro gaseo swieosseoyo.",
        "en": "As soon as I got off work, I went straight home and rested.",
        "grammar_audio": "/audio/korean/grammar/s_하자마자_hajamaja_As_soon_as_20250209_회사에서_퇴근하자마자_집에_바로_가서_쉬었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~해서 그런지 [haeseo geureonji] (Perhaps because)",
    "short_explanation": "Used to express a supposition, assumption, or speculation; 'perhaps because', 'maybe due to'.",
    "long_explanation": "'~해서 그런지 [haeseo geureonji]' is commonly used in Korean to indicate a speculative cause-and-effect relationship or supposition. It is generally translated as 'perhaps because' or 'maybe due to' and is used when the speaker is not completely certain about the cause but speculates based on observable evidence.",
    "formation": "Verb/Adjective + 해서 그런지",
    "examples": [
      {
        "kr": "오늘은 날씨가 좋아서 그런지 사람들이 많이 활동하는 것을 볼 수 있었습니다.",
        "romaji": "Oneureun nalssiga johaseo geureonji saramdeuri mani hwaldonghaneun geoseul bol su isseosseubnida.",
        "en": "Perhaps because the weather is nice today, I could see a lot of people being active.",
        "grammar_audio": "/audio/korean/grammar/s_해서_그런지_haeseo_geureonji_Perhaps_because_20250209_오늘은_날씨가_좋아서_그런지_사람들이_많이_활동하는_것을_볼_수_있었습니다.mp3"
      },
      {
        "kr": "그녀는 어제 다치고 나서 그런지 오늘은 엄청 조심스럽게 걸어갔습니다.",
        "romaji": "Geunyeoneun eoje dachigo naseo geureonji oneureun eomcheong josimseureopge georeogassseubnida.",
        "en": "Maybe because she got hurt yesterday, she walked very carefully today.",
        "grammar_audio": "/audio/korean/grammar/s_해서_그런지_haeseo_geureonji_Perhaps_because_20250209_그녀는_어제_다치고_나서_그런지_오늘은_엄청_조심스럽게_걸어갔습니다.mp3"
      },
      {
        "kr": "어제 짜장면을 너무 많이 먹었나 봐요. 오늘은 배가 아파서 그런지 컨디션이 좋지 않아요.",
        "romaji": "Eoje jjajangmyeoneul neomu mani meogeossnabwayo. Oneureun baegi apaseo geureonji keondisyeoni joji anhayo.",
        "en": "Perhaps because I ate too much black bean noodles yesterday, I don't feel well today.",
        "grammar_audio": "/audio/korean/grammar/s_해서_그런지_haeseo_geureonji_Perhaps_because_20250209_어제_짜장면을_너무_많이_먹었나_봐요_오늘은_배가_아파서_그런지_컨디션이_좋지_않아요.mp3"
      },
      {
        "kr": "나는 꿈에서 그녀를 만났어서 그런지 오늘은 그녀가 계속 생각나요.",
        "romaji": "Naneun kkumeseo geunyeoreul mannasseo geureonji oneureun geunyeoga gyesok saenggaknayo.",
        "en": "Maybe because I met her in my dream, I keep thinking about her today.",
        "grammar_audio": "/audio/korean/grammar/s_해서_그런지_haeseo_geureonji_Perhaps_because_20250209_나는_꿈에서_그녀를_만났어서_그런지_오늘은_그녀가_계속_생각나요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~하여서는 안 되다 [hayeoseoneun an dweda] (Must not)",
    "short_explanation": "Used to express prohibition or strong advice against doing something, which can be translated as 'must not' or 'should not'.",
    "long_explanation": "'~하여서는 안 되다 [hayeoseoneun an dweda]' is a grammar form used to indicate that something should not or must not occur. It is often used when giving strong advice or setting prohibitions, highlighting the negative consequences of the action.",
    "formation": "Verb stem + 아/어/여 + 하여서는 안 되다",
    "examples": [
      {
        "kr": "학생들이라고 해서 수업에 늦게 오는 것은 절대로 하여서는 안 되다.",
        "romaji": "Haksaengdeulirago haeseo sueobe neuje oneun geoseun jeoldaero hayeoseoneun an dweda.",
        "en": "Just because they are students, they absolutely must not come to class late.",
        "grammar_audio": "/audio/korean/grammar/s_하여서는_안_되다_hayeoseoneun_an_dweda_Must_not_20250209_학생들이라고_해서_수업에_늦게_오는_것은_절대로_하여서는_안_되다.mp3"
      },
      {
        "kr": "의사로서 환자에 대한 사항을 외부에 누설하는 것을 하여서는 안 되다.",
        "romaji": "Uisaroseo hwanjae daehan sahangeul oebue nuseolhaneun geoseul hayeoseoneun an dweda.",
        "en": "As a doctor, you must not leak patient information to the outside.",
        "grammar_audio": "/audio/korean/grammar/s_하여서는_안_되다_hayeoseoneun_an_dweda_Must_not_20250209_의사로서_환자에_대한_사항을_외부에_누설하는_것을_하여서는_안_되다.mp3"
      },
      {
        "kr": "내일 시험 때문에 밤을 새운다고 해서는 안 돼요. 건강이 먼저예요.",
        "romaji": "Naeil siheom ttaemune bameul saeundago haeseoneun an dwaeyo. Geongangi meonjeoyeyo.",
        "en": "You must not stay up all night because of tomorrow's exam. Health comes first.",
        "grammar_audio": "/audio/korean/grammar/s_하여서는_안_되다_hayeoseoneun_an_dweda_Must_not_20250209_내일_시험_때문에_밤을_새운다고_해서는_안_돼요_건강이_먼저예요.mp3"
      },
      {
        "kr": "다른 사람에게 피해를 주는 행동을 하여서는 안 되다.",
        "romaji": "Dareun saramege pihaereul juneun haengdong-eul hayeoseoneun an dweda.",
        "en": "You must not engage in actions that harm others.",
        "grammar_audio": "/audio/korean/grammar/s_하여서는_안_되다_hayeoseoneun_an_dweda_Must_not_20250209_다른_사람에게_피해를_주는_행동을_하여서는_안_되다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~한테는 [hanteneun] (To, for someone)",
    "short_explanation": "Used to indicate the target or recipient of an action, similar to 'to' or 'for' in English.",
    "long_explanation": "'~한테는 [hanteneun]' is a construction in Korean used when the speaker wants to specify the recipient or target of an action. It is similar to 'to' or 'for' in English and is often used to single out someone in contrast to others.",
    "formation": "Noun + 한테는",
    "examples": [
      {
        "kr": "제 언니한테는 선물을 사려고 왔어요. 제 친구한테는 이메일로 메시지를 보낼 예정입니다.",
        "romaji": "Je eonni-hanteneun seonmureul saryeogo wasseoyo. Je chingu-hanteneun imeiro mesijireul bonael yejeongimnida.",
        "en": "I came here to shop for a gift for my older sister. I plan to send a message to my friend by email.",
        "grammar_audio": "/audio/korean/grammar/s_한테는_hanteneun_To_for_someone_20250209_제_언니한테는_선물을_사려고_왔어요_제_친구한테는_이메일로_메시지를_보낼_예정입니다.mp3"
      },
      {
        "kr": "아버지한테는 이 사실을 아직 알리지 않았어요. 언니에게만 이야기했어요.",
        "romaji": "Abeoji-hanteneun i sasileul ajik alliji anasseoyo. Eonni-egeman iyagihasseoyo.",
        "en": "I have not yet told my father about this; I only told my older sister.",
        "grammar_audio": "/audio/korean/grammar/s_한테는_hanteneun_To_for_someone_20250209_아버지한테는_이_사실을_아직_알리지_않았어요_언니에게만_이야기했어요.mp3"
      },
      {
        "kr": "아이들한테는 단순한 언어로 설명해야 해요. 너무 복잡하면 이해할 수 없어요.",
        "romaji": "Aideul-hanteneun dansunhan eoneoro seolmyeonghaeya haeyo. Neomu bokjabhamyeon ihaehal su eopseoyo.",
        "en": "You need to explain in simple language to children; if it’s too complex, they won’t understand.",
        "grammar_audio": "/audio/korean/grammar/s_한테는_hanteneun_To_for_someone_20250209_아이들한테는_단순한_언어로_설명해야_해요_너무_복잡하면_이해할_수_없어요.mp3"
      },
      {
        "kr": "그는 엄마한테는 항상 친절하지만, 아빠한테는 무례해요.",
        "romaji": "Geuneun eomma-hanteneun hangsang chinjeolhajiman, abba-hanteneun muryehaeyo.",
        "en": "He is always kind to his mom, but he is rude to his dad.",
        "grammar_audio": "/audio/korean/grammar/s_한테는_hanteneun_To_for_someone_20250209_그는_엄마한테는_항상_친절하지만_아빠한테는_무례해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~할 만하다 [hal manhada] (Worth doing)",
    "short_explanation": "Used to express the worthiness of doing something.",
    "long_explanation": "'~할 만하다 [hal manhada]' is used to indicate that something is worth the effort, time, or cost invested in it. It can be translated as 'worth doing' or 'worth it' in English, expressing a subjective assessment of value.",
    "formation": "Verb stem + 할 만하다",
    "examples": [
      {
        "kr": "요리 공부를 계속하는 게 어렵지만, 맛있는 음식을 자주 먹을 수 있게 되니까 할 만해요.",
        "romaji": "Yori gongbureul gyesokhaneun ge eoryeopjiman, masitneun eumsigeul jaju meogeul su itge doenikka hal manhaeyo.",
        "en": "Continuing to study cooking is difficult, but it’s worth it because I get to eat delicious food often.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20250209_요리_공부를_계속하는_게_어렵지만_맛있는_음식을_자주_먹을_수_있게_되니까_할_만해요.mp3"
      },
      {
        "kr": "이 작품은 비싸기는 하지만, 아름다운 디자인과 고품질로 볼 때 사는 것이 할 만해요.",
        "romaji": "I jakpumeun bissagineun hajiman, areumdaun dijain-gwa gopumjillo bol ttae saneun geosi hal manhaeyo.",
        "en": "This item is expensive, but considering its beautiful design and high quality, it’s worth buying.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20250209_이_작품은_비싸기는_하지만_아름다운_디자인과_고품질로_볼_때_사는_것이_할_만해요.mp3"
      },
      {
        "kr": "긴 시간을 기다리는 것은 힘들지만, 그 결과가 좋으면 할 만합니다.",
        "romaji": "Gin siganeul gidarineun geoseun himdeuljiman, geu gyeolgwaga joheumyeon hal manhamnida.",
        "en": "Waiting for a long time is tough, but if the result is good, it’s worth it.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20250209_긴_시간을_기다리는_것은_힘들지만_그_결과가_좋으면_할_만합니다.mp3"
      },
      {
        "kr": "이 영화는 별로 재미있지 않기 때문에 보는 것이 할 만하지 않아요.",
        "romaji": "I yeonghwaneun byeollo jaemiitji anhgi ttaemune boneun geosi hal manhaji anhayo.",
        "en": "This movie isn’t very interesting, so it’s not worth watching.",
        "grammar_audio": "/audio/korean/grammar/s_할_만하다_hal_manhada_Worth_doing_20250209_이_영화는_별로_재미있지_않기_때문에_보는_것이_할_만하지_않아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~할 수밖에 없다 [hal subakke eopda] (Have no choice but to)",
    "short_explanation": "Used to express that there is no other option but to do what is mentioned.",
    "long_explanation": "'~할 수밖에 없다 [hal subakke eopda]' is used when there is no alternative but to perform the action mentioned. It implies that circumstances force one to act in a certain way.",
    "formation": "Verb (in dictionary form) + 수밖에 없다",
    "examples": [
      {
        "kr": "비가 오니까 우산을 가지고 갈 수밖에 없어요.",
        "romaji": "Biga onikka usaneul gajigo gal subakke eopseoyo.",
        "en": "Since it’s raining, I have no choice but to bring an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_할_수밖에_없다_hal_subakke_eopda_Have_no_choice_but_to_20250209_비가_오니까_우산을_가지고_갈_수밖에_없어요.mp3"
      },
      {
        "kr": "시험이 있기 때문에 공부를 계속할 수밖에 없어요.",
        "romaji": "Siheomi itgi ttaemune gongbureul gyesokhal subakke eopseoyo.",
        "en": "Because there is an exam, I have no choice but to keep studying.",
        "grammar_audio": "/audio/korean/grammar/s_할_수밖에_없다_hal_subakke_eopda_Have_no_choice_but_to_20250209_시험이_있기_때문에_공부를_계속할_수밖에_없어요.mp3"
      },
      {
        "kr": "그녀가 그렇게 말했으니까, 나는 그녀를 신뢰할 수밖에 없었어요.",
        "romaji": "Geunyeoga geureoke malhaessnika, naneun geunyeoreul sinroehal subakke eopseosseoyo.",
        "en": "Since she said so, I had no choice but to trust her.",
        "grammar_audio": "/audio/korean/grammar/s_할_수밖에_없다_hal_subakke_eopda_Have_no_choice_but_to_20250209_그녀가_그렇게_말했으니까_나는_그녀를_신뢰할_수밖에_없었어요.mp3"
      },
      {
        "kr": "지금 돈이 없어서 이렇게 저렴한 물건밖에 살 수 없어요.",
        "romaji": "Jigeum doni eopseoseo ireoke jeoryeomhan mulgeonbakke sal su eopseoyo.",
        "en": "I don’t have money now, so I have no choice but to buy such cheap items.",
        "grammar_audio": "/audio/korean/grammar/s_할_수밖에_없다_hal_subakke_eopda_Have_no_choice_but_to_20250209_지금_돈이_없어서_이렇게_저렴한_물건밖에_살_수_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~해 갈수록 [hae galsurok] (Increasingly, as time goes on)",
    "short_explanation": "Used to describe a situation where a condition progressively intensifies or becomes more serious.",
    "long_explanation": "The '~해 갈수록 [hae galsurok]' expression indicates that as time passes, a particular state or condition gradually becomes more intense or worsens. It can be used with both verbs and adjectives, similar to saying 'increasingly' or 'the more... the more' in English.",
    "formation": "Verb/Adjective stem + -을수록 / -ㄹ수록",
    "examples": [
      {
        "kr": "날씨가 추워질수록 감기에 걸리는 사람이 많아지는 것 같아요.",
        "romaji": "Nalssiga chuwojilsurok gamgie geollineun sarami manhajineun geot gatayo.",
        "en": "The colder the weather gets, the more people seem to catch a cold.",
        "grammar_audio": "/audio/korean/grammar/s_해_갈수록_hae_galsurok_Increasingly_as_time_goes_on_20250209_날씨가_추워질수록_감기에_걸리는_사람이_많아지는_것_같아요.mp3"
      },
      {
        "kr": "그녀는 알수록 더 매력적인 사람이에요.",
        "romaji": "Geunyeoneun alsurok deo maeryeokjeogin saram-ieyo.",
        "en": "The more I get to know her, the more attractive she becomes.",
        "grammar_audio": "/audio/korean/grammar/s_해_갈수록_hae_galsurok_Increasingly_as_time_goes_on_20250209_그녀는_알수록_더_매력적인_사람이에요.mp3"
      },
      {
        "kr": "책을 읽을수록 나의 사고력이 향상되는 것 같아요.",
        "romaji": "Chaegeul ilgeulsurok naui sagoryeogi hyangsangdoeneun geot gatayo.",
        "en": "The more I read, the more I feel my thinking ability improves.",
        "grammar_audio": "/audio/korean/grammar/s_해_갈수록_hae_galsurok_Increasingly_as_time_goes_on_20250209_책을_읽을수록_나의_사고력이_향상되는_것_같아요.mp3"
      },
      {
        "kr": "저는 집에 있을수록 외로워져서, 밖에 나가고 싶어요.",
        "romaji": "Jeoneun jibe isseulsurok werowojyeoseo, bakk-e nagago sipeoyo.",
        "en": "The longer I stay at home, the lonelier I become; so I feel like going out.",
        "grammar_audio": "/audio/korean/grammar/s_해_갈수록_hae_galsurok_Increasingly_as_time_goes_on_20250209_저는_집에_있을수록_외로워져서_밖에_나가고_싶어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~해 보아야 [hae boaya] (Should try and see)",
    "short_explanation": "Used to suggest that somebody should try something out in order to know or understand it.",
    "long_explanation": "'~해 보아야 [hae boaya]' is used when suggesting that one should try something to truly understand or experience it. In English, it is similar to saying 'you should try and see.'",
    "formation": "Verb stem + 해 보아야",
    "examples": [
      {
        "kr": "음식이 신선한지 아는 방법은 먹어 보아야 해요.",
        "romaji": "Eumsigi sinseonhanji aneun bangbeobeun meogeoboaya haeyo.",
        "en": "The way to know if the food is fresh is to try eating it.",
        "grammar_audio": "/audio/korean/grammar/s_해_보아야_hae_boaya_Should_try_and_see_20250209_음식이_신선한지_아는_방법은_먹어_보아야_해요.mp3"
      },
      {
        "kr": "이 옷이 어떤지 아는 방법은 입어 보아야 해요.",
        "romaji": "I ot-i eotteonji aneun bangbeobeun ibeoboaya haeyo.",
        "en": "The way to know how these clothes fit is to try them on.",
        "grammar_audio": "/audio/korean/grammar/s_해_보아야_hae_boaya_Should_try_and_see_20250209_이_옷이_어떤지_아는_방법은_입어_보아야_해요.mp3"
      },
      {
        "kr": "이 책이 재미있는지 아는 방법은 읽어 보아야 해요.",
        "romaji": "I chaegi jaemiitji aneun bangbeobeun ilgeo boaya haeyo.",
        "en": "The way to know if this book is interesting is to try reading it.",
        "grammar_audio": "/audio/korean/grammar/s_해_보아야_hae_boaya_Should_try_and_see_20250209_이_책이_재미있는지_아는_방법은_읽어_보아야_해요.mp3"
      },
      {
        "kr": "이 스포츠가 얼마나 재미있는지 아는 방법은 직접 해 보아야 해요.",
        "romaji": "I seupocheuga eolmana jaemiinneunji aneun bangbeobeun jikjeop haeboaya haeyo.",
        "en": "The way to know how fun this sport is is by trying it out yourself.",
        "grammar_audio": "/audio/korean/grammar/s_해_보아야_hae_boaya_Should_try_and_see_20250209_이_스포츠가_얼마나_재미있는지_아는_방법은_직접_해_보아야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~해오다 [haeoda] (Continue doing something until now)",
    "short_explanation": "Used to express an ongoing action from the past up to the present moment.",
    "long_explanation": "'해오다 [haeoda]' is used to denote an action that started in the past and continues until now. It literally means 'have been doing' and is often used to express a continuous habit, an ongoing action, or a series of actions over an extended period.",
    "formation": "Verb + 아/어/해 + 오다",
    "examples": [
      {
        "kr": "나는 어렸을 때부터 피아노를 쳐오고 있어요.",
        "romaji": "Naneun eoryeot taebuteo pianoreul chyeo-ogo isseoyo.",
        "en": "I have been playing the piano since I was young.",
        "grammar_audio": "/audio/korean/grammar/s_해오다_haeoda_Continue_doing_something_until_now_20250209_나는_어렸을_때부터_피아노를_쳐오고_있어요.mp3"
      },
      {
        "kr": "우리는 그 사업을 시작한 지 5년 동안 일해오고 있습니다.",
        "romaji": "Urineun geu saeobeul sijakhan ji 5nyeon dongan ilhaeoogo issseumnida.",
        "en": "We have been working on that business for five years since we started.",
        "grammar_audio": "/audio/korean/grammar/s_해오다_haeoda_Continue_doing_something_until_now_20250209_우리는_그_사업을_시작한_지_5년_동안_일해오고_있습니다.mp3"
      },
      {
        "kr": "세계 여행을 꿈꾸며 돈을 아껴오고 있어요.",
        "romaji": "Segye yeohaengeul kkumkkumyeo doneul akkyeo-ogo isseoyo.",
        "en": "I have been saving money while dreaming of a world tour.",
        "grammar_audio": "/audio/korean/grammar/s_해오다_haeoda_Continue_doing_something_until_now_20250209_세계_여행을_꿈꾸며_돈을_아껴오고_있어요.mp3"
      },
      {
        "kr": "우리는 친구가 왔을 때부터 함께 이야기해오고 있어요.",
        "romaji": "Urineun chinguga wasseul ttaebuteo hamkke iyagihae-ogo isseoyo.",
        "en": "We have been telling stories together since our friend arrived.",
        "grammar_audio": "/audio/korean/grammar/s_해오다_haeoda_Continue_doing_something_until_now_20250209_우리는_친구가_왔을_때부터_함께_이야기해오고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~했건만 [haetgeonman] (But, however)",
    "short_explanation": "Used to express contrast or contradiction; 'but', 'however'.",
    "long_explanation": "The '~했건만 [haetgeonman]' form is used to express a contrasting situation or contradiction. It can be translated as 'but', 'nevertheless', or 'however' and is used when the speaker wants to present a fact or circumstance that conflicts with what was previously stated.",
    "formation": "Verb + 았/었/했건만",
    "examples": [
      {
        "kr": "저는 많이 노력했건만, 시험에 떨어졌습니다.",
        "romaji": "Jeoneun mani noryeokhaetgeonman, siheome ddeoleojyeossseubnida.",
        "en": "I put in a lot of effort, but I failed the exam.",
        "grammar_audio": "/audio/korean/grammar/s_했건만_haetgeonman_But_however_20250209_저는_많이_노력했건만_시험에_떨어졌습니다.mp3"
      },
      {
        "kr": "친구는 어제 왔건만, 오늘은 못 왔습니다.",
        "romaji": "Chinguneun eoje watgeonman, oneureun mot watseubnida.",
        "en": "My friend came yesterday, but he couldn’t make it today.",
        "grammar_audio": "/audio/korean/grammar/s_했건만_haetgeonman_But_however_20250209_친구는_어제_왔건만_오늘은_못_왔습니다.mp3"
      },
      {
        "kr": "음식은 맛있었건만, 가격이 너무 비쌌습니다.",
        "romaji": "Eumsikeun masisseotgeonman, gagyeogi neomu bissassseubnida.",
        "en": "The food was delicious, but it was too expensive.",
        "grammar_audio": "/audio/korean/grammar/s_했건만_haetgeonman_But_however_20250209_음식은_맛있었건만_가격이_너무_비쌌습니다.mp3"
      },
      {
        "kr": "그녀는 예쁘다고 했건만, 저는 그렇게 생각하지 않았습니다.",
        "romaji": "Geunyeoneun yeppeudago haetgeonman, jeoneun geureohge saenggakaji anhaetseubnida.",
        "en": "She said she was pretty, but I didn't think so.",
        "grammar_audio": "/audio/korean/grammar/s_했건만_haetgeonman_But_however_20250209_그녀는_예쁘다고_했건만_저는_그렇게_생각하지_않았습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~했기 때문에 [haetgi ttaemune] (Because)",
    "short_explanation": "Used to express reason or cause, equivalent to 'Because' in English.",
    "long_explanation": "'~했기 때문에 [haetgi ttaemune]' is used to give a reason or cause. It refers retrospectively to an action or situation in the past that explains a present condition or outcome.",
    "formation": "Action Verb in Past Tense + 했기 때문에",
    "examples": [
      {
        "kr": "어제 늦게 잤기 때문에 오늘 아침에 일어나기 힘들었어요.",
        "romaji": "Eoje neutge jatgi ttaemune oneul achime ileonagi himdeureosseoyo.",
        "en": "Because I went to bed late last night, it was hard for me to wake up this morning.",
        "grammar_audio": "/audio/korean/grammar/s_했기_때문에_haetgi_ttaemune_Because_20250209_어제_늦게_잤기_때문에_오늘_아침에_일어나기_힘들었어요.mp3"
      },
      {
        "kr": "미세먼지 농도가 높아서 창문을 열지 않았기 때문에 방이 더워졌어요.",
        "romaji": "Mise meonjiga nongdoga nopaseo changmuneul yeolji anhatgi ttaemune bangi deowojyeosseoyo.",
        "en": "Because the fine dust concentration was high, I didn't open the window and the room got hot.",
        "grammar_audio": "/audio/korean/grammar/s_했기_때문에_haetgi_ttaemune_Because_20250209_미세먼지_농도가_높아서_창문을_열지_않았기_때문에_방이_더워졌어요.mp3"
      },
      {
        "kr": "많은 공부를 했기 때문에 시험에서 좋은 점수를 받았어요.",
        "romaji": "Manneun gongbureul haetgi ttaemune siheomeseo joheun jeomsureul badasseoyo.",
        "en": "Because I studied a lot, I got a good score on the exam.",
        "grammar_audio": "/audio/korean/grammar/s_했기_때문에_haetgi_ttaemune_Because_20250209_많은_공부를_했기_때문에_시험에서_좋은_점수를_받았어요.mp3"
      },
      {
        "kr": "비가 왔기 때문에 운동화가 젖었어요.",
        "romaji": "Biga watgi ttaemune undonghwaga jeojeosseoyo.",
        "en": "Because it rained, my sneakers got wet.",
        "grammar_audio": "/audio/korean/grammar/s_했기_때문에_haetgi_ttaemune_Because_20250209_비가_왔기_때문에_운동화가_젖었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~했기에 [haetgie] (Because)",
    "short_explanation": "Used to indicate the reason or cause; 'because' or 'since'.",
    "long_explanation": "`~했기에 [haetgie]` is a conjunction that connects two sentences by showing that the first is the cause or reason for the second. It emphasizes that one situation exists because of another, equivalent to 'because' or 'since' in English.",
    "formation": "Verb + 했기에",
    "examples": [
      {
        "kr": "그녀는 학문을 아주 좋아했기에, 대학에서 교수가 되었어요.",
        "romaji": "Geunyeoneun hakmuneul aju joahaetgie, daehageseo gyosuga doeeosseoyo.",
        "en": "She became a professor at the university because she really loved academics.",
        "grammar_audio": "/audio/korean/grammar/s_했기에_haetgie_Because_20250209_그녀는_학문을_아주_좋아했기에_대학에서_교수가_되었어요.mp3"
      },
      {
        "kr": "저는 갈비를 많이 먹었기에, 지금 배가 너무 불러요.",
        "romaji": "Jeoneun galbireul manhi meogeotgie, jigeum baega neomu bulleoyo.",
        "en": "I ate a lot of ribs, so now I am very full.",
        "grammar_audio": "/audio/korean/grammar/s_했기에_haetgie_Because_20250209_저는_갈비를_많이_먹었기에_지금_배가_너무_불러요.mp3"
      },
      {
        "kr": "오늘 일찍 일어났기에, 출근할 시간에 늦지 않았어요.",
        "romaji": "Oneul iljjik ileonatgie, chulgeunhal sigane neujji anhasseoyo.",
        "en": "I woke up early today, so I was not late for work.",
        "grammar_audio": "/audio/korean/grammar/s_했기에_haetgie_Because_20250209_오늘_일찍_일어났기에_출근할_시간에_늦지_않았어요.mp3"
      },
      {
        "kr": "그는 개인적인 문제 때문에 스트레스를 받았기에, 단체 활동에 참여하지 않았어요.",
        "romaji": "Geuneun gaeinjeogin munje ttaemune seuteureseureul badatgie, danche hwaldonge chamyeohaji anhasseoyo.",
        "en": "He did not participate in the group activity because he was stressed due to personal issues.",
        "grammar_audio": "/audio/korean/grammar/s_했기에_haetgie_Because_20250209_그는_개인적인_문제_때문에_스트레스를_받았기에_단체_활동에_참여하지_않았어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~했더니 [haetdeoni] (And then)",
    "short_explanation": "Used to express the progression of actions or events, indicating a consequential relationship.",
    "long_explanation": "The '~했더니 [haetdeoni]' expression is used in Korean to show that after an action or event, an unexpected or revealing result followed. It can be translated as 'and then' or 'so' in English.",
    "formation": "Verb + 았/었더니",
    "examples": [
      {
        "kr": "그녀에게 전화했더니 그녀는 바빠서 전화를 받을 수 없다고 했어요.",
        "romaji": "Geunyeoege jeonhwahaetdeoni geunyeoneun bappaseo jeonhwareul badeul su eopsdago haesseoyo.",
        "en": "I called her and then she said she was too busy to answer the call.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_And_then_20250209_그녀에게_전화했더니_그녀는_바빠서_전화를_받을_수_없다고_했어요.mp3"
      },
      {
        "kr": "저는 버스에서 내렸더니 지갑을 잃어버렸다는 것을 깨달았어요.",
        "romaji": "Jeoneun beoseueseo naeryeotdeoni jigabeul ilheobeoryeotdaneun geoseul kkaedalatseoyo.",
        "en": "I got off the bus and then realized that I had lost my wallet.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_And_then_20250209_저는_버스에서_내렸더니_지갑을_잃어버렸다는_것을_깨달았어요.mp3"
      },
      {
        "kr": "나는 책을 읽었더니 창문 밖에 비가 오고 있는 것을 봤어요.",
        "romaji": "Naneun chaeg-eul ilgeotdeoni changmun bakke biga ogo issneun geoseul bwasseoyo.",
        "en": "I was reading a book and then I saw that it was raining outside the window.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_And_then_20250209_나는_책을_읽었더니_창문_밖에_비가_오고_있는_것을_봤어요.mp3"
      },
      {
        "kr": "약을 먹었더니 기분이 좋아졌어요.",
        "romaji": "Yageul meogeotdeoni gibuni johajyeosseoyo.",
        "en": "I took a pill and then I felt better.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_And_then_20250209_약을_먹었더니_기분이_좋아졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "50"
  },
  {
    "title": "~했어야 했다 [haesseoya haetda] (Had to)",
    "short_explanation": "Indicates that something 'had to' be done in the past, often expressing regret or missed opportunities.",
    "long_explanation": "'~했어야 했다 [haesseoya haetda]' is used to express that something should have been done or occurred in the past, even if it wasn’t. It often carries a sense of regret or a feeling that an opportunity was missed.",
    "formation": "Verb stem + 았/었어야 했다",
    "examples": [
      {
        "kr": "어제 그 일을 끝냈어야 했는데, 시간이 부족해서 끝내지 못했어요.",
        "romaji": "Eoje geu ileul kkeutnesseoya haetneunde, sigani bujokhaeseo kkeutnaeji motaesseoyo.",
        "en": "I should have finished that work yesterday, but I couldn’t because I didn’t have enough time.",
        "grammar_audio": "/audio/korean/grammar/s_했어야_했다_haesseoya_haetda_Had_to_20250209_어제_그_일을_끝냈어야_했는데_시간이_부족해서_끝내지_못했어요.mp3"
      },
      {
        "kr": "학원에 가서 공부했어야 했는데, 게임을 하느라고 갈 수 없었어요.",
        "romaji": "Hagwone gaseo gongbuhaesseoya haetneunde, geimeul haneurago gal su eopseosseoyo.",
        "en": "I should have gone to the academy and studied, but I couldn’t because I was playing games.",
        "grammar_audio": "/audio/korean/grammar/s_했어야_했다_haesseoya_haetda_Had_to_20250209_학원에_가서_공부했어야_했는데_게임을_하느라고_갈_수_없었어요.mp3"
      },
      {
        "kr": "커피 대신 물을 마셨어야 했는데, 카페인이 많아서 잠이 안 왔어요.",
        "romaji": "Keopi daesin mureul masyeosseoya haetneunde, kapeini manhaseo jami an wasseoyo.",
        "en": "I should have drunk water instead of coffee, but I couldn’t sleep because there was too much caffeine.",
        "grammar_audio": "/audio/korean/grammar/s_했어야_했다_haesseoya_haetda_Had_to_20250209_커피_대신_물을_마셨어야_했는데_카페인이_많아서_잠이_안_왔어요.mp3"
      },
      {
        "kr": "전화를 받았어야 했는데, 전화기를 못 봐서 받지 못했어요.",
        "romaji": "Jeonhwaleul badesseoya haetneunde, jeonhwagireul mot bwaseo badji motaesseoyo.",
        "en": "I should have answered the phone, but I didn’t because I couldn’t see it.",
        "grammar_audio": "/audio/korean/grammar/s_했어야_했다_haesseoya_haetda_Had_to_20250209_전화를_받았어야_했는데_전화기를_못_봐서_받지_못했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~혹은 [hogeun] (Or)",
    "short_explanation": "Used to express options or alternatives; 'or'.",
    "long_explanation": "'~혹은 [hogeun]' is a conjunction used to present two or more alternatives or choices without prioritizing one over another, similar to 'or' in English.",
    "formation": "Noun1 + 혹은 + Noun2",
    "examples": [
      {
        "kr": "당신은 커피 혹은 차를 원하세요?",
        "romaji": "Dangsin-eun keopi hogeun chaleul wonhaseyo?",
        "en": "Would you like coffee or tea?",
        "grammar_audio": "/audio/korean/grammar/s_혹은_hogeun_Or_20250209_당신은_커피_혹은_차를_원하세요.mp3"
      },
      {
        "kr": "이 문제를 해결하기 위해서는 시간 혹은 노력이 필요하겠어요.",
        "romaji": "I munjeleul haegyeolhagi wihaeseoneun sigan hogeun noryeogi pilyohagesseoyo.",
        "en": "Time or effort is needed to solve this problem.",
        "grammar_audio": "/audio/korean/grammar/s_혹은_hogeun_Or_20250209_이_문제를_해결하기_위해서는_시간_혹은_노력이_필요하겠어요.mp3"
      },
      {
        "kr": "그는 강아지 혹은 고양이를 키우고 싶어 했어요.",
        "romaji": "Geuneun gangaji hogeun goyangireul kiugo sip-eo haesseoyo.",
        "en": "He wanted to raise a puppy or a kitten.",
        "grammar_audio": "/audio/korean/grammar/s_혹은_hogeun_Or_20250209_그는_강아지_혹은_고양이를_키우고_싶어_했어요.mp3"
      },
      {
        "kr": "여름 휴가를 보내기 위해 바닷가 혹은 산에서 휴가를 보낼 수 있어요.",
        "romaji": "Yeoleum hyugaleul bonaegi wihae badasga hogeun san-eseo hyugaleul bonael su iss-eoyo.",
        "en": "You can spend your summer vacation at the beach or in the mountains.",
        "grammar_audio": "/audio/korean/grammar/s_혹은_hogeun_Or_20250209_여름_휴가를_보내기_위해_바닷가_혹은_산에서_휴가를_보낼_수_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "후에야 [hueya] (Only after)",
    "short_explanation": "Used to indicate that something happened or was realized only after a certain event or time.",
    "long_explanation": "'후에야 [hueya]' is a compound word formed from '후에' (after) and '야' (only). It emphasizes that an action or realization occurs only after a specified event or period has passed – the precondition for what follows.",
    "formation": "Noun/Verb(Stem) + (으)ㄴ/는/ㄹ + 후에야 + Verb",
    "examples": [
      {
        "kr": "그녀가 날 떠나고 후에야 난 그녀를 얼마나 사랑하는지 알았어요.",
        "romaji": "Geunyeoga nal tteonago hueya nan geunyeoreul eolmana saranghaneunji alatseoyo.",
        "en": "Only after she left me did I realize how much I loved her.",
        "grammar_audio": "/audio/korean/grammar/s_후에야_hueya_Only_after_20250209_그녀가_날_떠나고_후에야_난_그녀를_얼마나_사랑하는지_알았어요.mp3"
      },
      {
        "kr": "시험을 보고 후에야 이 문제의 정답이 무엇인지 기억이 났어요.",
        "romaji": "Siheomeul bogo hueya i munjeui jeongdabi mueosinji gieogi nasseoyo.",
        "en": "Only after taking the test did I remember what the correct answer was.",
        "grammar_audio": "/audio/korean/grammar/s_후에야_hueya_Only_after_20250209_시험을_보고_후에야_이_문제의_정답이_무엇인지_기억이_났어요.mp3"
      },
      {
        "kr": "나는 대학을 졸업한 후에야 진짜로 배워야 할 것이 무엇인지 이해했어요.",
        "romaji": "Naneun daehageul joreophan hueya jinjjaro baewoya hal geosi mueosinji ihaehaetseoyo.",
        "en": "Only after I graduated from university did I understand what I really needed to learn.",
        "grammar_audio": "/audio/korean/grammar/s_후에야_hueya_Only_after_20250209_나는_대학을_졸업한_후에야_진짜로_배워야_할_것이_무엇인지_이해했어요.mp3"
      },
      {
        "kr": "일을 시작한 후에야 할 일이 얼마나 많은지 알게 되었어요.",
        "romaji": "Ileul sijakhan hueya hal ili eolmana manheunji alge doeeosseoyo.",
        "en": "Only after starting work did I realize how much there was to do.",
        "grammar_audio": "/audio/korean/grammar/s_후에야_hueya_Only_after_20250209_일을_시작한_후에야_할_일이_얼마나_많은지_알게_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~흔히 [heunhi] (Commonly, often)",
    "short_explanation": "Used to indicate that an event or situation happens frequently or is commonly known.",
    "long_explanation": "'~흔히 [heunhi]' is an adverb used in Korean to demonstrate that something happens frequently, is a common occurrence, or is typically known. It is very similar to English expressions like 'often', 'commonly', 'usually' or 'typically'. It is used in both objective descriptions of facts and in subjective observations.",
    "formation": "흔히 + Verb",
    "examples": [
      {
        "kr": "흔히 사람들은 건강한 음식은 맛이 없다고 생각합니다.",
        "romaji": "Heunhi saramdeureun geonganghan eumsigeun masi eopdago saenggakhabnida.",
        "en": "People often think that healthy food is tasteless.",
        "grammar_audio": "/audio/korean/grammar/s_흔히_heunhi_Commonly_often_20250209_흔히_사람들은_건강한_음식은_맛이_없다고_생각합니다.mp3"
      },
      {
        "kr": "한국에서는 혼자 살아가는 사람들을 흔히 '싱글'이라고 부릅니다.",
        "romaji": "Hangugeoseoneun honja saraganeun saramdeureul heunhi 'single'irago bureubnida.",
        "en": "In Korea, people living alone are commonly referred to as 'singles'.",
        "grammar_audio": "/audio/korean/grammar/s_흔히_heunhi_Commonly_often_20250209_한국에서는_혼자_살아가는_사람들을_흔히_싱글이라고_부릅니다.mp3"
      },
      {
        "kr": "우리는 흔히 우리나라 음식보다 외국 음식을 더 많이 먹습니다.",
        "romaji": "Urineun heunhi urinara eumsikboda oeguk eumsigeul deo manhi meokseumnida.",
        "en": "We often eat more foreign food than our country's food.",
        "grammar_audio": "/audio/korean/grammar/s_흔히_heunhi_Commonly_often_20250209_우리는_흔히_우리나라_음식보다_외국_음식을_더_많이_먹습니다.mp3"
      },
      {
        "kr": "봄이 오면 흔히 피는 꽃인 벚꽃은 많은 사람들에게 잘 알려져 있습니다.",
        "romaji": "Bomi omyeon heunhi pineun kkotin beotkkotseun manheun saramdeurege jal allyeojyeo issseubnida.",
        "en": "Cherry blossoms, one of the flowers that commonly bloom in spring, are well known to many people.",
        "grammar_audio": "/audio/korean/grammar/s_흔히_heunhi_Commonly_often_20250209_봄이_오면_흔히_피는_꽃인_벚꽃은_많은_사람들에게_잘_알려져_있습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~되다 [doeda] (To become)",
    "short_explanation": "Used to express a change into a different state or condition; 'to become'.",
    "long_explanation": "'~되다 [doeda]' is used to indicate that someone or something has changed into a new state or condition. It expresses a transformation or transition from one state to another.",
    "formation": "Noun/Adjective/Verb stem + 되다",
    "examples": [
      {
        "kr": "날씨가 덥다가 갑자기 춥게 되었어요. 그래서 모두 감기에 걸렸어요.",
        "romaji": "Nalssiga deopdaga gapjagi chupge doeeosseoyo. Geuraeseo modu gamgie geollyeosseoyo.",
        "en": "The weather suddenly became cold after being hot, so everyone caught a cold.",
        "grammar_audio": "/audio/korean/grammar/s_되다_doeda_To_become_20250209_날씨가_덥다가_갑자기_춥게_되었어요_그래서_모두_감기에_걸렸어요.mp3"
      },
      {
        "kr": "그녀는 열심히 공부해서 세계에서 가장 젊은 교수가 되었어요.",
        "romaji": "Geunyeoneun yeolsimhi gongbuhaseo segyeeseo gajang jeolmeun gyosuga doeeosseoyo.",
        "en": "She studied hard to become the youngest professor in the world.",
        "grammar_audio": "/audio/korean/grammar/s_되다_doeda_To_become_20250209_그녀는_열심히_공부해서_세계에서_가장_젊은_교수가_되었어요.mp3"
      },
      {
        "kr": "나의 친구는 한국어를 배워서 번역가가 되었어요.",
        "romaji": "Na-ui chinguneun hangugeoreul baewoseo beonyeokgaga doeeosseoyo.",
        "en": "My friend studied Korean and became a translator.",
        "grammar_audio": "/audio/korean/grammar/s_되다_doeda_To_become_20250209_나의_친구는_한국어를_배워서_번역가가_되었어요.mp3"
      },
      {
        "kr": "자그마했던 새끼 고양이가 큰 고양이가 되었어요.",
        "romaji": "Jageumahaessdeon saekki goyangiga keun goyangiga doeeosseoyo.",
        "en": "The tiny kitten became a big cat.",
        "grammar_audio": "/audio/korean/grammar/s_되다_doeda_To_become_20250209_자그마했던_새끼_고양이가_큰_고양이가_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~잖다 [janda] (You know, isn't it)",
    "short_explanation": "Used to state information the speaker assumes the listener already knows.",
    "long_explanation": "'~잖다 [janda]' is a sentence-ending phrase used to indicate the speaker's assumption that the listener is already aware of the information being shared. It's akin to saying 'you know' or 'isn’t it' in English. This grammar point can be used to confirm facts or imply shared knowledge.",
    "formation": "Verb stem + 잖다",
    "examples": [
      {
        "kr": "너 오늘 학교 가야 하잖아, 왜 아직도 놀고 있어?",
        "romaji": "Neo oneul hakgyo gaya hajanha, wae ajikdo nolgo isseo?",
        "en": "You have to go to school today, you know, so why are you still playing?",
        "grammar_audio": "/audio/korean/grammar/s_잖다_janda_You_know_isnt_it_20250209_너_오늘_학교_가야_하잖아_왜_아직도_놀고_있어.mp3"
      },
      {
        "kr": "우리 내일 시험이 있잖아. 그래서 오늘 공부하려고.",
        "romaji": "Uri naeil siheomi issjanha. Geuraeseo oneul gongbuharyeogo.",
        "en": "We have a test tomorrow, you know. So, I plan to study today.",
        "grammar_audio": "/audio/korean/grammar/s_잖다_janda_You_know_isnt_it_20250209_우리_내일_시험이_있잖아_그래서_오늘_공부하려고.mp3"
      },
      {
        "kr": "너 그 사람을 알잖아, 그런데 요즘 어떻게 지내?",
        "romaji": "Neo geu saram-eul al janha, geureonde yojeum eotteoke jinae?",
        "en": "You know that person, don't you? So, how's he doing these days?",
        "grammar_audio": "/audio/korean/grammar/s_잖다_janda_You_know_isnt_it_20250209_너_그_사람을_알잖아_그런데_요즘_어떻게_지내.mp3"
      },
      {
        "kr": "지금 시간이 늦었잖아, 우린 이제 공부해야 해.",
        "romaji": "Jigeum sigani neu-eossjanha, urin ije gongbuhayeya hae.",
        "en": "It's late now, you know, so we should study.",
        "grammar_audio": "/audio/korean/grammar/s_잖다_janda_You_know_isnt_it_20250209_지금_시간이_늦었잖아_우린_이제_공부해야_해.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~져/지다 [jyeo/jida] (Become)",
    "short_explanation": "Used to depict changes in state, emotion, condition, or situation, similar to 'become' or 'get' in English.",
    "long_explanation": "'~져/지다 [jyeo/jida]' is a conjugation that indicates transformation or change. It can mean 'become' or 'get' and is used to describe shifts in state, feelings, or conditions.",
    "formation": "Adjective/Verbal Noun + ~져/지다",
    "examples": [
      {
        "kr": "날씨가 너무 더워져서 밖에 나가기가 힘들어졌어요.",
        "romaji": "Nalssiga neomu deowojyeoseo bakke nagagiga himdeureojyeosseoyo.",
        "en": "The weather has become so hot that it's hard to go outside.",
        "grammar_audio": "/audio/korean/grammar/s_져지다_jyeojida_Become_20250209_날씨가_너무_더워져서_밖에_나가기가_힘들어졌어요.mp3"
      },
      {
        "kr": "그녀는 학교에서 인기가 많아져서 많은 사람들이 그녀를 알게 되었어요.",
        "romaji": "Geunyeoneun hakgyoeseo ingiga manhajyeoseo manheun saramdeuli geunyeoreul alge doeeosseoyo.",
        "en": "She has become popular in school, so many people got to know her.",
        "grammar_audio": "/audio/korean/grammar/s_져지다_jyeojida_Become_20250209_그녀는_학교에서_인기가_많아져서_많은_사람들이_그녀를_알게_되었어요.mp3"
      },
      {
        "kr": "그는 그림을 많이 그리니까, 그림 그리는 실력이 정말 좋아졌어요.",
        "romaji": "Geuneun geurimeul manhi geurinikka, geurim geurineun sillyeogi jeongmal joahjyeosseoyo.",
        "en": "He has become really good at drawing because he draws a lot.",
        "grammar_audio": "/audio/korean/grammar/s_져지다_jyeojida_Become_20250209_그는_그림을_많이_그리니까_그림_그리는_실력이_정말_좋아졌어요.mp3"
      },
      {
        "kr": "일하는데 집중하니까 시간이 너무 빨리 가버렸어요.",
        "romaji": "Ilhaneunde jipjunghanikka, sigani neomu ppalli gabeollyeosseoyo.",
        "en": "Time has gone by so fast because I was focused on work.",
        "grammar_audio": "/audio/korean/grammar/s_져지다_jyeojida_Become_20250209_일하는데_집중하니까_시간이_너무_빨리_가버렸어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~졌다가 [jyeotdaga] (Was once, but)",
    "short_explanation": "Used to express that something was once in a certain state or condition, but then changed again.",
    "long_explanation": "'~졌다가 [jyeotdaga]' is used to indicate a sequence where the subject was once in one state and then changed to another—often reverting or fluctuating. It is typically attached to verbs in the past tense.",
    "formation": "Verb + -졌다가",
    "examples": [
      {
        "kr": "나는 문을 열졌다가 다시 닫았어요. 그런데 친구가 오길 기다릴 수 없어서요.",
        "romaji": "Naneun muneul yeoljyeotdaga dasi dadasseoyo. Geureonde chinguga ogil gidaril su eopseoseoyo.",
        "en": "I opened the door, but then closed it again. However, I couldn't wait for my friend to come.",
        "grammar_audio": "/audio/korean/grammar/s_졌다가_jyeotdaga_Was_once_but_20250209_나는_문을_열졌다가_다시_닫았어요_그런데_친구가_오길_기다릴_수_없어서요.mp3"
      },
      {
        "kr": "그 레스토랑은 며칠 전에 문을 연졌다가 오늘 바로 닫았어요.",
        "romaji": "Geu reseutorangeun myeochil jeone muneul yeonjyeotdaga oneul baro dadasseoyo.",
        "en": "That restaurant had opened just a few days ago, but it closed again today.",
        "grammar_audio": "/audio/korean/grammar/s_졌다가_jyeotdaga_Was_once_but_20250209_그_레스토랑은_며칠_전에_문을_연졌다가_오늘_바로_닫았어요.mp3"
      },
      {
        "kr": "아이들은 컴퓨터 게임을 하다가 숙제를 그만두어야 했어요.",
        "romaji": "Aideuleun keompyuteo geimeul hadaga sukjereul geumandueoya haesseoyo.",
        "en": "The kids had to stop playing computer games and do their homework.",
        "grammar_audio": "/audio/korean/grammar/s_졌다가_jyeotdaga_Was_once_but_20250209_아이들은_컴퓨터_게임을_하다가_숙제를_그만두어야_했어요.mp3"
      },
      {
        "kr": "나의 친구는 직장을 받았다가 한 달 후에 해고되었습니다.",
        "romaji": "Naui chinguneun jikjangeul badatdaga han dal hue haegodoeeotseumnida.",
        "en": "My friend got a job, but then got fired after a month.",
        "grammar_audio": "/audio/korean/grammar/s_졌다가_jyeotdaga_Was_once_but_20250209_나의_친구는_직장을_받았다가_한_달_후에_해고되었습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~즉 [jeuk] (That is to say, namely)",
    "short_explanation": "Used to restate or clarify a point with more detail; 'namely', 'that is to say'.",
    "long_explanation": "'~즉 [jeuk]' is a conjunction used in Korean to re-explain or add further details to a statement. It is equivalent to 'namely' or 'that is to say' in English and helps clarify or specify information.",
    "formation": "Sentence + 즉 + Sentence",
    "examples": [
      {
        "kr": "이 연구의 결과를 바탕으로 즉, 우리가 본 바로는 지구 온난화는 인간의 활동 때문임이 분명하다.",
        "romaji": "I yeonguui gyeolgwareul batangeuro jeuk, uriga bon baroneun jigu onnanhwaneun inganui hwaldong ttaemunimi bunmyeonghada.",
        "en": "Based on the results of this research, that is to say, from what we have seen, it is clear that global warming is due to human activities.",
        "grammar_audio": "/audio/korean/grammar/s_즉_jeuk_That_is_to_say_namely_20250209_이_연구의_결과를_바탕으로_즉_우리가_본_바로는_지구_온난화는_인간의_활동_때문임이_분명하다.mp3"
      },
      {
        "kr": "그는 국제관계 전문가이다. 즉, 그는 세계의 다양한 나라들 간의 문제를 연구한다.",
        "romaji": "Geuneun gukje gwangye jeonmungaida. Jeuk, geuneun segyeui dayanghan naradeul gan-ui munjeleul yeonguhanda.",
        "en": "He is an expert in international relations. That is to say, he studies issues between various countries around the world.",
        "grammar_audio": "/audio/korean/grammar/s_즉_jeuk_That_is_to_say_namely_20250209_그는_국제관계_전문가이다_즉_그는_세계의_다양한_나라들_간의_문제를_연구한다.mp3"
      },
      {
        "kr": "이 메일은 너에게만 보낼 것이다. 즉, 너는 이 메시지의 유일한 수신자다.",
        "romaji": "I meireun neoegeman bonael geosida. Jeuk, neoneun i mesijui yuilhan susinjada.",
        "en": "I will send this email to you only. Namely, you are the only recipient of this message.",
        "grammar_audio": "/audio/korean/grammar/s_즉_jeuk_That_is_to_say_namely_20250209_이_메일은_너에게만_보낼_것이다_즉_너는_이_메시지의_유일한_수신자다.mp3"
      },
      {
        "kr": "그는 내 좋은 친구이다. 즉, 나는 그를 아주 잘 알고 있다.",
        "romaji": "Geuneun nae joheun chinguida. Jeuk, naneun geureul aju jal algo itda.",
        "en": "He is a good friend of mine. That is to say, I know him very well.",
        "grammar_audio": "/audio/korean/grammar/s_즉_jeuk_That_is_to_say_namely_20250209_그는_내_좋은_친구이다_즉_나는_그를_아주_잘_알고_있다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~지 않을까 싶다 [ji anheulkka sipda] (I think perhaps)",
    "short_explanation": "Expresses an assumption or supposition that something might be; it suggests that the speaker thinks something is likely.",
    "long_explanation": "The structure '~지 않을까 싶다' is used to express a guess or speculation about a situation. It conveys uncertainty as well as a hopeful anticipation about what might happen or be true.",
    "formation": "Verb-지 않을까 싶다",
    "examples": [
      {
        "kr": "그가 이번 시험에 잘 볼 수 있을지 않을까 싶어요, 왜냐하면 그는 항상 열심히 공부하고 있거든요.",
        "romaji": "Geuga ibeon siheome jal bol su isseulji anheulkka sipeoyo, waenyahamyeon geuneun hangsang yeolsimhi gongbuhago issgeodeunyo.",
        "en": "I think perhaps he might do well on this test, because he is always studying hard.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_싶다_ji_anheulkka_sipda_I_think_perhaps_20250209_그가_이번_시험에_잘_볼_수_있을지_않을까_싶어요_왜냐하면_그는_항상_열심히_공부하고_있거든요.mp3"
      },
      {
        "kr": "날씨가 나빠지지 않을까 싶어요, 구름이 많아지고 있어요.",
        "romaji": "Nalssiga nappajiji anheulkka sipeoyo, gureumi manhajigo isseoyo.",
        "en": "I think the weather might get worse; the clouds are increasing.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_싶다_ji_anheulkka_sipda_I_think_perhaps_20250209_날씨가_나빠지지_않을까_싶어요_구름이_많아지고_있어요.mp3"
      },
      {
        "kr": "오늘 밤에 집에 도착할 수 있을지 않을까 싶어요, 비행기가 시간에 맞춰 출발했어요.",
        "romaji": "Oneul bame jibe dochakhal su isseulji anheulkka sipeoyo, bihaengiga sigane matchwo chulbalhaesseoyo.",
        "en": "I think perhaps I could reach home tonight since the airplane has departed on time.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_싶다_ji_anheulkka_sipda_I_think_perhaps_20250209_오늘_밤에_집에_도착할_수_있을지_않을까_싶어요_비행기가_시간에_맞춰_출발했어요.mp3"
      },
      {
        "kr": "이번 주말에 영화 보러 갈 수 있을지 않을까 싶은데, 어떻게 생각하세요?",
        "romaji": "Ibeon jumal-e yeonghwa boreo gal su isseulji anheulkka sipeunde, eotteohge saenggakhaseyo?",
        "en": "I think perhaps we might go see a movie this weekend; what do you think?",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_싶다_ji_anheulkka_sipda_I_think_perhaps_20250209_이번_주말에_영화_보러_갈_수_있을지_않을까_싶은데_어떻게_생각하세요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~지 않을까 하다 [ji anheulkka hada] (I guess, I suspect)",
    "short_explanation": "Used to express one's conjecture or prediction; 'I think', 'I guess', 'I suspect'.",
    "long_explanation": "'~지 않을까 하다' is used to express a guess or suspicion about a situation when the speaker is not completely sure. It conveys the speaker's uncertainty and expectation about what might be true.",
    "formation": "Verb + 지 않을까 하다",
    "examples": [
      {
        "kr": "내일 비가 올지 않을까 해서 우산을 가져왔어요.",
        "romaji": "Naeil biga olji anheulkka haeseo usaneul gajyeowasseoyo.",
        "en": "I brought an umbrella because I thought it might rain tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_하다_ji_anheulkka_hada_I_guess_I_suspect_20250209_내일_비가_올지_않을까_해서_우산을_가져왔어요.mp3"
      },
      {
        "kr": "그녀가 좋아하는 사람을 만나지 않을까 해서 신경 쓰고 있어요.",
        "romaji": "Geunyeoga joahaneun sarameul mannaji anheulkka haeseo singyeong sseugo isseoyo.",
        "en": "I'm nervous because I suspect she might meet the person she likes.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_하다_ji_anheulkka_hada_I_guess_I_suspect_20250209_그녀가_좋아하는_사람을_만나지_않을까_해서_신경_쓰고_있어요.mp3"
      },
      {
        "kr": "지금 새벽이니까 아마 모든 사람들이 잠들지 않을까 해요.",
        "romaji": "Jigeum saebyeoginikka ama modeun saramdeuri jamdeulji anheulkka haeyo.",
        "en": "Since it's dawn now, I guess everyone might be asleep.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_하다_ji_anheulkka_hada_I_guess_I_suspect_20250209_지금_새벽이니까_아마_모든_사람들이_잠들지_않을까_해요.mp3"
      },
      {
        "kr": "내 친구가 이번 시험에 합격하지 않을까 해서 축하 메시지를 준비하고 있어요.",
        "romaji": "Nae chinguga ibeon siheome hapgyeokhaji anheulkka haeseo chukha mesijireul junbihago isseoyo.",
        "en": "I'm preparing a congratulatory message because I think my friend might pass this exam.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_하다_ji_anheulkka_hada_I_guess_I_suspect_20250209_내_친구가_이번_시험에_합격하지_않을까_해서_축하_메시지를_준비하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~지 않을래 [ji anheullae] (I don't want to)",
    "short_explanation": "Expresses the speaker's intention not to do something.",
    "long_explanation": "'~지 않을래' is a verb ending used in Korean to indicate that the speaker does not want to perform a certain action. It shows a strong personal decision and is typically used in informal contexts.",
    "formation": "Verb stem + 지 않을래",
    "examples": [
      {
        "kr": "저는 오늘 운동하러 가지 않을래요, 몸이 좀 피곤해서 쉬고 싶어요.",
        "romaji": "Jeoneun oneul undonghareo gaji anheullaeyo, momi jom pigonhaeseo swigo sip-eoyo.",
        "en": "I don't want to go exercise today because I feel a bit tired and want to rest.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을래_ji_anheullae_I_dont_want_to_20250209_저는_오늘_운동하러_가지_않을래요_몸이_좀_피곤해서_쉬고_싶어요.mp3"
      },
      {
        "kr": "저는 너무 많이 먹었기 때문에 디저트는 먹지 않을래요.",
        "romaji": "Jeoneun neomu mani meogeoss-gi ttaemune dijeoteuneun meokji anheullaeyo.",
        "en": "I don't want to eat dessert because I ate too much.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을래_ji_anheullae_I_dont_want_to_20250209_저는_너무_많이_먹었기_때문에_디저트는_먹지_않을래요.mp3"
      },
      {
        "kr": "너무 걱정하지 말고, 그 사람은 제가 대신 말하지 않을래요.",
        "romaji": "Neomu geogjeonghaji malgo, geu saram-eun jega doae daesin malhaji anheullaeyo.",
        "en": "Don't worry too much; I don't want to speak on your behalf to that person.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을래_ji_anheullae_I_dont_want_to_20250209_너무_걱정하지_말고_그_사람은_제가_대신_말하지_않을래요.mp3"
      },
      {
        "kr": "이 옷이 마음에 들지 않아서 사지 않을래요.",
        "romaji": "I os-i ma-eum-e deulji anhasseo saji anheullaeyo.",
        "en": "I don't like this outfit, so I don't want to buy it.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을래_ji_anheullae_I_dont_want_to_20250209_이_옷이_마음에_들지_않아서_사지_않을래요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~지요 [jyo] (~지, right?)",
    "short_explanation": "A casual way to seek agreement or confirmation from the listener, similar to 'right?' or 'isn't it?' in English.",
    "long_explanation": "~지요 [jyo] is a commonly used ending in conversational Korean that seeks agreement or confirmation. It softens statements and is often used in friendly dialogues. In English, it can be roughly translated as 'right?' or 'isn't it?'.",
    "formation": "Verb + 지요",
    "examples": [
      {
        "kr": "날씨가 매우 좋지요?",
        "romaji": "Nalssiga maeu johjiyo?",
        "en": "The weather is very nice, isn't it?",
        "grammar_audio": "/audio/korean/grammar/s_지요_jyo_지_right_20250209_날씨가_매우_좋지요.mp3"
      },
      {
        "kr": "우리는 내일 학교에 가야 하지요?",
        "romaji": "Urineun naeil hakgyoe gaya hajiyo?",
        "en": "We have to go to school tomorrow, right?",
        "grammar_audio": "/audio/korean/grammar/s_지요_jyo_지_right_20250209_우리는_내일_학교에_가야_하지요.mp3"
      },
      {
        "kr": "이 영화가 재미있었지요?",
        "romaji": "I yeonghwaga jaemiisseotjiyo?",
        "en": "This movie was interesting, wasn't it?",
        "grammar_audio": "/audio/korean/grammar/s_지요_jyo_지_right_20250209_이_영화가_재미있었지요.mp3"
      },
      {
        "kr": "그녀는 아직도 학생인 것 같지요?",
        "romaji": "Geunyeoneun ajikdo haksaengin geot gatjiyo?",
        "en": "She's still a student, right?",
        "grammar_audio": "/audio/korean/grammar/s_지요_jyo_지_right_20250209_그녀는_아직도_학생인_것_같지요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~진행하다 [jinhaenghada] (To proceed)",
    "short_explanation": "Used to express the progression or continuation of an action or event.",
    "long_explanation": "'~진행하다 [jinhaenghada]' indicates that an action or event is being carried out or continued. It is equivalent to 'to proceed with' or 'to continue' in English and can be used in contexts such as work, study, or any ongoing process.",
    "formation": "Noun + 을/를 + 진행하다",
    "examples": [
      {
        "kr": "연구팀은 이 이슈에 대해 조사를 진행하고 있습니다. 그들은 다양한 데이터를 수집하면서 정보를 분석하고 있어요.",
        "romaji": "Yeongutimeun i isue daehae josareul jinhaenghago itsseumnida. Geudeureun dayanghan dateoreul sujibhamyeo jeongboreul bunseokhago itsseoyo.",
        "en": "The research team is conducting an investigation on this issue; they are analyzing information as they collect various data.",
        "grammar_audio": "/audio/korean/grammar/s_진행하다_jinhaenghada_To_proceed_20250209_연구팀은_이_이슈에_대해_조사를_진행하고_있습니다_그들은_다양한_데이터를_수집하면서_정보를_분석하고_있어요.mp3"
      },
      {
        "kr": "오늘 회의를 얼마나 빨리 진행하느냐에 따라서 제 시간에 퇴근할 수 있을지 결정됩니다.",
        "romaji": "Oneul hoeuireul eolmana ppalli jinhaenghaneunyae ddalaseo je sigane tuikeunhal su iss-eulji gyeoljeongdoebnida.",
        "en": "Whether I can leave work on time today is decided by how quickly the meeting proceeds.",
        "grammar_audio": "/audio/korean/grammar/s_진행하다_jinhaenghada_To_proceed_20250209_오늘_회의를_얼마나_빨리_진행하느냐에_따라서_제_시간에_퇴근할_수_있을지_결정됩니다.mp3"
      },
      {
        "kr": "학생들은 공부를 계속 진행하다 보니 시간이 어떻게 지나갔는지도 모르겠습니다.",
        "romaji": "Haksaengdeureun gongbureul gyesok jinhaenghada boni sigani eotteoke jinagatneunjido moreugesseumnida.",
        "en": "The students were so engrossed in their studies that they didn’t realize how fast time passed.",
        "grammar_audio": "/audio/korean/grammar/s_진행하다_jinhaenghada_To_proceed_20250209_학생들은_공부를_계속_진행하다_보니_시간이_어떻게_지나갔는지도_모르겠습니다.mp3"
      },
      {
        "kr": "프로젝트 계획 중, 우리 팀은 문제 해결을 위한 논의를 진행하고 있습니다.",
        "romaji": "Peurojekteu gyehoeg jung, uri timeun munje haegyeoreul wihan noniureul jinhaenghago itsseumnida.",
        "en": "During the project planning, our team is proceeding with discussions to resolve the issue.",
        "grammar_audio": "/audio/korean/grammar/s_진행하다_jinhaenghada_To_proceed_20250209_프로젝트_계획_중_우리_팀은_문제_해결을_위한_논의를_진행하고_있습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~차라리 [charari] (Rather, instead)",
    "short_explanation": "Used to express a preference for one option over another; 'rather', 'instead'.",
    "long_explanation": "'~차라리 [charari]' is used to indicate that one option is preferable to another, often implying that the chosen option is the lesser of two evils or simply more favorable. It is typically used in the pattern: '[A] 보다는 차라리 [B]'.",
    "formation": "[A] 보다는 차라리 [B]",
    "examples": [
      {
        "kr": "나는 그냥 집에서 혼자 있기보다는 차라리 밖에서 친구들과 놀러 나갔어요.",
        "romaji": "Naneun geunyang jibeseo honja itgibodaneun charari bakeseo chingudeulgwa nolreo nagasseoyo.",
        "en": "I would rather go out and play with friends than just stay home alone.",
        "grammar_audio": "/audio/korean/grammar/s_차라리_charari_Rather_instead_20250209_나는_그냥_집에서_혼자_있기보다는_차라리_밖에서_친구들과_놀러_나갔어요.mp3"
      },
      {
        "kr": "당신이 직접 거짓말하기보다는 차라리 솔직하게 말하면 좋겠어요.",
        "romaji": "Dangsini jigjeob geojitmalhagi bodaneun charari soljikhage malhamyeon johgesseoyo.",
        "en": "I'd rather you speak honestly than tell a lie yourself.",
        "grammar_audio": "/audio/korean/grammar/s_차라리_charari_Rather_instead_20250209_당신이_직접_거짓말하기보다는_차라리_솔직하게_말하면_좋겠어요.mp3"
      },
      {
        "kr": "그 물건을 사지 않기보다는 차라리 돈을 저금하는 것이 낫습니다.",
        "romaji": "Geu mulgeoneul saji anhgibodaneun charari doneul jeogeumhaneun geosi natseupnida.",
        "en": "It’s better to save money than to buy that item.",
        "grammar_audio": "/audio/korean/grammar/s_차라리_charari_Rather_instead_20250209_그_물건을_사지_않기보다는_차라리_돈을_저금하는_것이_낫습니다.mp3"
      },
      {
        "kr": "그럴 거면 차라리 아무 말도 하지 않는 것이 나아요.",
        "romaji": "Geureol geomyeon charari amu maldo haji anneun geosi naayeo.",
        "en": "If that’s the case, I’d rather you said nothing at all.",
        "grammar_audio": "/audio/korean/grammar/s_차라리_charari_Rather_instead_20250209_그럴_거면_차라리_아무_말도_하지_않는_것이_나아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~처럼만 [cheoreomman] (Just like, as if)",
    "short_explanation": "Used to express similarity or comparison; 'just like', 'as if'.",
    "long_explanation": "'~처럼만 [cheoreomman]' is used to compare one thing to another, emphasizing an exclusive similarity. It can be translated as 'just like' or 'as if' in English.",
    "formation": "Noun/Clause + 처럼만",
    "examples": [
      {
        "kr": "그녀는 다른 사람들과 달리, 마치 꿈을 꾸는 것처럼만 행동했어.",
        "romaji": "Geunyeoneun dareun saramdeulgwa dalli, machi kkumeul kkuneun geotcheoreomman haengdonghaesseo.",
        "en": "Unlike others, she acted as if she were dreaming.",
        "grammar_audio": "/audio/korean/grammar/s_처럼만_cheoreomman_Just_like_as_if_20250209_그녀는_다른_사람들과_달리_마치_꿈을_꾸는_것처럼만_행동했어.mp3"
      },
      {
        "kr": "이 음식은 마치 엄마가 만든 것처럼만 맛있어요.",
        "romaji": "I eumsikeun machi eommaga mandeun geotcheoreomman masisseoyo.",
        "en": "This food tastes just like the one my mother makes.",
        "grammar_audio": "/audio/korean/grammar/s_처럼만_cheoreomman_Just_like_as_if_20250209_이_음식은_마치_엄마가_만든_것처럼만_맛있어요.mp3"
      },
      {
        "kr": "오늘은 날씨가 봄처럼만 따뜻해요.",
        "romaji": "Oneuleun nalssiga bomcheoreomman ttatteushaeyo.",
        "en": "The weather today is warm just like spring.",
        "grammar_audio": "/audio/korean/grammar/s_처럼만_cheoreomman_Just_like_as_if_20250209_오늘은_날씨가_봄처럼만_따뜻해요.mp3"
      },
      {
        "kr": "그는 마치 나를 알아보는 것처럼만 쳐다보았어.",
        "romaji": "Geuneun machi nareul araboneun geotcheoreomman chyeodaboasseo.",
        "en": "He looked at me as if he recognized me.",
        "grammar_audio": "/audio/korean/grammar/s_처럼만_cheoreomman_Just_like_as_if_20250209_그는_마치_나를_알아보는_것처럼만_쳐다보았어.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~게 하다 [ge hada] (To make)",
    "short_explanation": "Used to express causing someone or something to be in a certain state.",
    "long_explanation": "'~게 하다 [ge hada]' is a verb ending used in Korean to indicate that someone causes or makes another person or thing perform an action or be in a certain state. The verb or adjective before it is used in its descriptive stem form. It is equivalent to 'make' or 'let' in English.",
    "formation": "Descriptive verb stem + 게 하다",
    "examples": [
      {
        "kr": "어머니는 저를 일찍 자게 했습니다.",
        "romaji": "Eomeonineun jeoreul iljjik jage haetsseumnida.",
        "en": "My mother made me go to bed early.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_20250209_어머니는_저를_일찍_자게_했습니다.mp3"
      },
      {
        "kr": "선생님은 우리를 많이 공부하게 했습니다.",
        "romaji": "Seonsaengnimeun urireul mani gongbu hage haetsseumnida.",
        "en": "The teacher made us study a lot.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_20250209_선생님은_우리를_많이_공부하게_했습니다.mp3"
      },
      {
        "kr": "재수없는 사고로 그는 그녀를 울게 했습니다.",
        "romaji": "Jaesueopsneun sago-ro geuneun geunyeoreul ulge haesseoyo.",
        "en": "Due to an unfortunate accident, he made her cry.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_20250209_재수없는_사고로_그는_그녀를_울게_했습니다.mp3"
      },
      {
        "kr": "그녀는 남편을 행복하게 했습니다.",
        "romaji": "Geunyeoneun nampyeoneul haengbokhage haetsseumnida.",
        "en": "She made her husband happy.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_20250209_그녀는_남편을_행복하게_했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~타다 [tada] (To take, ride)",
    "short_explanation": "Denotes the action of riding or taking a vehicle.",
    "long_explanation": "'~타다 [tada]' is used with means of transportation to indicate that the subject is riding or taking that vehicle to a destination. It applies to buses, taxis, subways, cars, etc.",
    "formation": "Means of transportation + 을/를 + 타다",
    "examples": [
      {
        "kr": "나는 출근할 때 항상 버스를 타고 회사에 갑니다.",
        "romaji": "Naneun chulgeunhal ttae hangsang beoseureul tago hoesae gamnida.",
        "en": "When I go to work, I always take a bus to the office.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_나는_출근할_때_항상_버스를_타고_회사에_갑니다.mp3"
      },
      {
        "kr": "피곤해서 오늘은 택시를 타고 집에 돌아왔어요.",
        "romaji": "Pigontaeseo oneureun taeksireul tago jibe doraowassseoyo.",
        "en": "Because I was tired, I took a taxi and returned home today.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_피곤해서_오늘은_택시를_타고_집에_돌아왔어요.mp3"
      },
      {
        "kr": "여동생은 지하철을 타고 학교에 갑니다.",
        "romaji": "Yeodongsaengeun jihacheoreul tago hakgyoe gamnida.",
        "en": "My younger sister takes the subway to school.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_여동생은_지하철을_타고_학교에_갑니다.mp3"
      },
      {
        "kr": "우리 아버지는 자가용 차를 타고 출근합니다.",
        "romaji": "Uri abeojineun jagayong chareul tago chulgeunhamnida.",
        "en": "My father goes to work by taking his own car.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_우리_아버지는_자가용_차를_타고_출근합니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~하게 하다 [hage hada] (Make someone do)",
    "short_explanation": "Used when one causes or allows someone else to perform an action.",
    "long_explanation": "The '~하게 하다 [hage hada]' structure indicates that one person is causing or permitting another to do something. The action verb is conjugated with ~하게, and then 하다 is added to complete the construction. The subject causes the action, while the object is the person who performs it.",
    "formation": "Subject + (Object) + Verb (in ~하게 form) + 하다",
    "examples": [
      {
        "kr": "어머니는 저를 일찍 자게 했습니다.",
        "romaji": "Eomeonineun jeoreul iljjik jage haetsseumnida.",
        "en": "My mother made me go to bed early.",
        "grammar_audio": "/audio/korean/grammar/s_하게_하다_hage_hada_Make_someone_do_20250209_어머니는_저를_일찍_자게_했습니다.mp3"
      },
      {
        "kr": "선생님은 우리를 많이 공부하게 했습니다.",
        "romaji": "Seonsaengnimeun urireul mani gongbu hage haetsseumnida.",
        "en": "The teacher made us study a lot.",
        "grammar_audio": "/audio/korean/grammar/s_하게_하다_hage_hada_Make_someone_do_20250209_선생님은_우리를_많이_공부하게_했습니다.mp3"
      },
      {
        "kr": "재수없는 사고로 그는 그녀를 울게 했습니다.",
        "romaji": "Jaesueopsneun sago-ro geuneun geunyeoreul ulge haesseoyo.",
        "en": "Due to an unfortunate accident, he made her cry.",
        "grammar_audio": "/audio/korean/grammar/s_하게_하다_hage_hada_Make_someone_do_20250209_재수없는_사고로_그는_그녀를_울게_했습니다.mp3"
      },
      {
        "kr": "그녀는 남편을 행복하게 했습니다.",
        "romaji": "Geunyeoneun nampyeoneul haengbokhage haetsseumnida.",
        "en": "She made her husband happy.",
        "grammar_audio": "/audio/korean/grammar/s_하게_하다_hage_hada_Make_someone_do_20250209_그녀는_남편을_행복하게_했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~하여야만 [hayeoyaman] (Only by doing)",
    "short_explanation": "Used to express that an objective can be achieved only by doing a certain action.",
    "long_explanation": "'~하여야만 [hayeoyaman]' conveys the meaning 'only by doing...' It is used to emphasize that a specific goal or result can be attained only if a certain action is performed.",
    "formation": "Verb + 어/아 + 하여야만",
    "examples": [
      {
        "kr": "성공하려면 열심히 공부하여야만 해요, 그렇지 않으면 실패할 가능성이 있어요.",
        "romaji": "Seonggongharyeomyeon yeolsimhi gongbuhayeoyaman haeyo, geureohji anheumyeon silpaehal ganeungseongi isseoyo.",
        "en": "To succeed, you must study hard; otherwise, there is a chance of failure.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_by_doing_20250209_성공하려면_열심히_공부하여야만_해요_그렇지_않으면_실패할_가능성이_있어요.mp3"
      },
      {
        "kr": "병이 고쳐지려면 약을 복용하여야만 해요, 그렇지 않으면 건강을 회복할 수 없어요.",
        "romaji": "Byeongi gochyeojiryeomyeon yageul bogyonghayeoyaman haeyo, geureohji anheumyeon geongangeul hoebokhal su eopseoyo.",
        "en": "To recover from an illness, you must take medicine; otherwise, you cannot regain your health.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_by_doing_20250209_병이_고쳐지려면_약을_복용하여야만_해요_그렇지_않으면_건강을_회복할_수_없어요.mp3"
      },
      {
        "kr": "이루고 싶은 꿈이 있으면 계속 노력하여야만 해요, 그렇지 않으면 그 꿈은 단지 꿈일 뿐이에요.",
        "romaji": "Irugo shipeun kkumi issneumyeon gyesok noryeokhayeoyaman haeyo, geureohji anheumyeon geu kkumeun danji kkumil ppunieyo.",
        "en": "If you have a dream you want to achieve, you must keep trying; otherwise, that dream is just a dream.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_by_doing_20250209_이루고_싶은_꿈이_있으면_계속_노력하여야만_해요_그렇지_않으면_그_꿈은_단지_꿈일_뿐이에요.mp3"
      },
      {
        "kr": "목표를 달성하려면 계획을 세우고 그 계획을 따라야만 해요, 그렇지 않으면 목표를 이룰 수 없어요.",
        "romaji": "Mokpyoreul dalseongharyeomyeon gyehoegeul sewoogo geu gyehoegeul ttarayeoyaman haeyo, geureohji anheumyeon mokpyoreul irul su eopseoyo.",
        "en": "To achieve your goal, you must make a plan and follow it; otherwise, you won't be able to reach your goal.",
        "grammar_audio": "/audio/korean/grammar/s_하여야만_hayeoyaman_Only_by_doing_20250209_목표를_달성하려면_계획을_세우고_그_계획을_따라야만_해요_그렇지_않으면_목표를_이룰_수_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~해서는 안 되다 [haeseoneun an dwae] (Must not, shouldn't)",
    "short_explanation": "This grammar point is used to express prohibition or things that shouldn't be done.",
    "long_explanation": "'~해서는 안 되다' is a common ending in Korean that translates to 'must not' or 'shouldn't'. It indicates actions or behaviors that are prohibited, and it is used to express restrictions, warnings, or advice. It can be attached to both action and descriptive verbs.",
    "formation": "Verb stem + 아/어/여서 +는 안 되다",
    "examples": [
      {
        "kr": "너는 남의 물건을 가져서는 안 된다. 그것은 도둑질이다.",
        "romaji": "Neoneun namui mulgeoneul gajyeoseoneun an doenda. Geugeoseun dodukjilida.",
        "en": "You must not take other people's belongings. That's stealing.",
        "grammar_audio": "/audio/korean/grammar/s_해서는_안_되다_haeseoneun_an_dwae_Must_not_shouldnt_20250209_너는_남의_물건을_가져서는_안_된다_그것은_도둑질이다.mp3"
      },
      {
        "kr": "아이들은 먼저 놀아서는 안 된다. 먼저 숙제를 하고, 그 후에 놀아야 한다.",
        "romaji": "Aideureun meonjeo noraseoneun an doenda. Meonjeo sukjereul hago, geu hue noraya handa.",
        "en": "Children should not play first; they must do their homework first, then play.",
        "grammar_audio": "/audio/korean/grammar/s_해서는_안_되다_haeseoneun_an_dwae_Must_not_shouldnt_20250209_아이들은_먼저_놀아서는_안_된다_먼저_숙제를_하고_그_후에_놀아야_한다.mp3"
      },
      {
        "kr": "당신은 늦게 자서는 안 된다. 건강을 해칠 수 있습니다.",
        "romaji": "Dangsin-eun neutge jaseoneun an doenda. Geongangeul haechil su issseubnida.",
        "en": "You should not stay up late. It can harm your health.",
        "grammar_audio": "/audio/korean/grammar/s_해서는_안_되다_haeseoneun_an_dwae_Must_not_shouldnt_20250209_당신은_늦게_자서는_안_된다_건강을_해칠_수_있습니다.mp3"
      },
      {
        "kr": "우리는 문제를 무시해서는 안 된다. 대신, 우리는 그것을 해결해야 한다.",
        "romaji": "Ulineun munjeleul musihaseoneun an doenda. Daesin, ulineun geugeoseul haegyeolhaeya handa.",
        "en": "We must not ignore the problem. Instead, we have to solve it.",
        "grammar_audio": "/audio/korean/grammar/s_해서는_안_되다_haeseoneun_an_dwae_Must_not_shouldnt_20250209_우리는_문제를_무시해서는_안_된다_대신_우리는_그것을_해결해야_한다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~해서야 [haeseoya] (In order to)",
    "short_explanation": "Used to express the necessity or requirement to achieve a purpose or goal; 'in order to', 'so that'.",
    "long_explanation": "'~해서야' is a verb ending in Korean that expresses that a certain action is required to achieve a specific goal. It is similar to 'in order to' or 'so that' in English, implying that the desired outcome depends on performing the action.",
    "formation": "Verb stem + 아/어/여 + 서야",
    "examples": [
      {
        "kr": "학교에 더 잘 적응하기 위해서야, 일상적으로 학교 활동에 더 많이 참여해야 해요.",
        "romaji": "Hakgyo-e deo jal jeogeungeul wihaeseoya, ilsangjeogeuro hakgyo hwaldonge deo manhi chamyeohaeya haeyo.",
        "en": "In order to better adapt to school, you need to participate more in daily school activities.",
        "grammar_audio": "/audio/korean/grammar/s_해서야_haeseoya_In_order_to_20250209_학교에_더_잘_적응하기_위해서야_일상적으로_학교_활동에_더_많이_참여해야_해요.mp3"
      },
      {
        "kr": "올리는 무게를 더 높이려면, 나는 더 열심히 운동해서야 해요.",
        "romaji": "Ollineun mugeleul deo nopihalymyeon, naneun deo yeolsimhi undonghaeseoya haeyo.",
        "en": "In order to lift more weight, I need to exercise harder.",
        "grammar_audio": "/audio/korean/grammar/s_해서야_haeseoya_In_order_to_20250209_올리는_무게를_더_높이려면_나는_더_열심히_운동해서야_해요.mp3"
      },
      {
        "kr": "회사 직원들에게 좋은 이미지를 보여주기 위해서야, 더 많이 야근해서야 해요.",
        "romaji": "Hoesa jigweondeul-ege joheun imijileul boyeojugi wihaeseoya, deo manhi yageunhaeseoya haeyo.",
        "en": "In order to show a good image to the employees, I have to work late more.",
        "grammar_audio": "/audio/korean/grammar/s_해서야_haeseoya_In_order_to_20250209_회사_직원들에게_좋은_이미지를_보여주기_위해서야_더_많이_야근해서야_해요.mp3"
      },
      {
        "kr": "요리를 잘 배우기 위해서야, 재료에 대해 더 많이 이해하려면 노력해서야 해요.",
        "romaji": "Yolileul jal baeugi wihaeseoya, jaeli-e daehae deo manhi ihaehalyeomyeon noryeokhaeseoya haeyo.",
        "en": "In order to learn to cook well, you have to make an effort to understand more about the ingredients.",
        "grammar_audio": "/audio/korean/grammar/s_해서야_haeseoya_In_order_to_20250209_요리를_잘_배우기_위해서야_재료에_대해_더_많이_이해하려면_노력해서야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~해야겠다 [haeyagetta] (Should, must, have to)",
    "short_explanation": "Used to indicate a strong need or determination to perform an action; 'should', 'must', 'have to'.",
    "long_explanation": "'~해야겠다' is used in Korean to express a firm decision or determination to carry out an action. It conveys the sense that something must be done and is often used in self-directed statements or diary entries.",
    "formation": "Verb stem + 아/어/여야겠다",
    "examples": [
      {
        "kr": "밖이 너무 더워요, 다음부터는 자외선 차단제를 발라야겠어요.",
        "romaji": "Baggi neomu deowoyo, daeumbuteoneun jayeonseon chadanjereul ballyagesseoyo.",
        "en": "It's too hot outside; I should apply sunscreen next time.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetta_Should_must_have_to_20250209_밖이_너무_더워요_다음부터는_자외선_차단제를_발라야겠어요.mp3"
      },
      {
        "kr": "마지막 시험도 끝났으니, 이제 책을 치워야겠습니다.",
        "romaji": "Majimak siheomdo ggeutnasseuni, ije chaeg-eul chiwoyagessseubnida.",
        "en": "Since the last exam is over, I must put my books away now.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetta_Should_must_have_to_20250209_마지막_시험도_끝났으니_이제_책을_치워야겠습니다.mp3"
      },
      {
        "kr": "열심히 공부했으니, 이제 잠을 자야겠어요.",
        "romaji": "Yeolsimhi gongbuhaeseuni, ije jameul jayagesseoyo.",
        "en": "I studied hard, so I should sleep now.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetta_Should_must_have_to_20250209_열심히_공부했으니_이제_잠을_자야겠어요.mp3"
      },
      {
        "kr": "다음 주에 중요한 회의가 있어서, 제 시간 관리를 해야겠어요.",
        "romaji": "Daeum jue jungyohan hoeuiga isseoseo, je sigan gwonlireul haeyagesseoyo.",
        "en": "I have an important meeting next week, so I must manage my time.",
        "grammar_audio": "/audio/korean/grammar/s_해야겠다_haeyagetta_Should_must_have_to_20250209_다음_주에_중요한_회의가_있어서_제_시간_관리를_해야겠어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~해야지 [haeyaji] (I should)",
    "short_explanation": "Used to express a determination or resolution; 'I should'.",
    "long_explanation": "'~해야지' is used in casual, informal speech to express a self-suggestion or resolution regarding something you plan to do. It conveys the speaker's determination to carry out an action in the future.",
    "formation": "Verb stem + 야지",
    "examples": [
      {
        "kr": "시험이 코 앞이니까, 이제 공부를 시작해야지.",
        "romaji": "Siheomi ko apinikka, ije gongbureul sijakhaeyaji.",
        "en": "Since the exam is right around the corner, I should start studying now.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_I_should_20250209_시험이_코_앞이니까_이제_공부를_시작해야지.mp3"
      },
      {
        "kr": "오늘 밤에 친구들과 영화를 보기로 했으니, 티켓을 사야지.",
        "romaji": "Oneul bame chingudeulgwa yeongwareul bogiro haesseuni, tikeseul saya ji.",
        "en": "I decided to watch a movie with my friends tonight, so I should buy tickets.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_I_should_20250209_오늘_밤에_친구들과_영화를_보기로_했으니_티켓을_사야지.mp3"
      },
      {
        "kr": "헬스장에서 오래 동안 운동하지 않았으니, 내일 일찍 가야지.",
        "romaji": "Helseujangeseo orae dongan undonghaji anhasseuni, naeil iljjik gaya ji.",
        "en": "I haven’t exercised in a long time at the gym, so I should go early tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_I_should_20250209_헬스장에서_오래_동안_운동하지_않았으니_내일_일찍_가야지.mp3"
      },
      {
        "kr": "오늘 늦게 잠들었으니, 아침에 빵을 사 먹어야지.",
        "romaji": "Oneul neutge jamdeureosseuni, achime bbangeul sa meogeoya ji.",
        "en": "I went to bed late today, so I should buy bread for breakfast in the morning.",
        "grammar_audio": "/audio/korean/grammar/s_해야지_haeyaji_I_should_20250209_오늘_늦게_잠들었으니_아침에_빵을_사_먹어야지.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~했더니 [haetdeoni] (After doing something, result)",
    "short_explanation": "Used to show that an action is followed by an unexpected outcome or change.",
    "long_explanation": "'~했더니' is used in Korean to indicate that after an action is performed, a particular (often surprising) result occurs. It expresses a cause-and-effect relationship where the outcome is notable.",
    "formation": "Verb (in past tense) + 더니",
    "examples": [
      {
        "kr": "저는 오랜만에 친구를 만났더니 친구가 많이 변했어요.",
        "romaji": "Jeoneun oraenmane chingureul mannatdeoni, chinguga manhi byeonhaess-eoyo.",
        "en": "I met my friend after a long time, and he had changed a lot.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_After_doing_something_result_20250209_저는_오랜만에_친구를_만났더니_친구가_많이_변했어요.mp3"
      },
      {
        "kr": "집에 왔더니 청소를 다 해놨어요.",
        "romaji": "Jib-e watdeoni cheongsoleul da haenwasseoyo.",
        "en": "When I got home, the house was already cleaned.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_After_doing_something_result_20250209_집에_왔더니_청소를_다_해놨어요.mp3"
      },
      {
        "kr": "실시간 업데이트 확인을 했더니 큰 변화가 있었어요.",
        "romaji": "Silsigan eobdeiteu hwagin-eul haetdeoni keun byeonhwaga iss-eoss-eoyo.",
        "en": "After checking the real-time updates, there was a big change.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_After_doing_something_result_20250209_실시간_업데이트_확인을_했더니_큰_변화가_있었어요.mp3"
      },
      {
        "kr": "전화를 끊었더니 실수로 잘못 연결된 거예요.",
        "romaji": "Jeonhwaleul kkeunh-eossdeoni silsuro jalmot yeongyeoldoengeoyeyo.",
        "en": "After I hung up the phone, it turned out that I had mistakenly connected.",
        "grammar_audio": "/audio/korean/grammar/s_했더니_haetdeoni_After_doing_something_result_20250209_전화를_끊었더니_실수로_잘못_연결된_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "75"
  },
  {
    "title": "~했었는데 [haesseotneunde] (Had done but)",
    "short_explanation": "Used to indicate an action that was completed in the past but is still connected to the present or resulted in an unexpected contrast.",
    "long_explanation": "'~했었는데' is a verb ending that expresses an action completed in the past which, in context, leads to a contrast or an unexpected situation in the present.",
    "formation": "Verb + 했었는데",
    "examples": [
      {
        "kr": "책을 샀었는데 도서관에서 같은 책을 발견했어요, 그래서 결국 두 권이 있는 상황이 되었어요.",
        "romaji": "Chaeg-eul sasseossneunde, doseogwan-eseo gateun chaeg-eul balgyeonhaesseoyo, geuraeseo gyeolguk du gwon-i issneun sanghwang-i dwaesseoyo.",
        "en": "I had bought a book but then found the same book at the library, so I ended up having two copies.",
        "grammar_audio": "/audio/korean/grammar/s_했었는데_haesseotneunde_Had_done_but_20250209_책을_샀었는데_도서관에서_같은_책을_발견했어요_그래서_결국_두_권이_있는_상황이_되었어요.mp3"
      },
      {
        "kr": "저녁을 먹었었는데 친구가 갑자기 나를 불러서 또 저녁을 먹었어요.",
        "romaji": "Jeonyeogeul meogeosseotneunde, chinguga gabjagi nareul bulleoseo tto jeonyeogeul meogeosseoyo.",
        "en": "I had already eaten dinner but then my friend suddenly called me and I had dinner again.",
        "grammar_audio": "/audio/korean/grammar/s_했었는데_haesseotneunde_Had_done_but_20250209_저녁을_먹었었는데_친구가_갑자기_나를_불러서_또_저녁을_먹었어요.mp3"
      },
      {
        "kr": "학교에 일찍 도착했었는데 갑자기 수업이 취소되었어요, 그래서 결국 집에 일찍 돌아갔어요.",
        "romaji": "Hakgyo-e iljjik dochakhaesseotneunde, gabjagi sueop-i chwisodoeeosseoyo, geuraeseo gyeolguk jib-e iljjik dol-agasseoyo.",
        "en": "I had arrived at school early, but then the class was suddenly cancelled, so I ended up going home early.",
        "grammar_audio": "/audio/korean/grammar/s_했었는데_haesseotneunde_Had_done_but_20250209_학교에_일찍_도착했었는데_갑자기_수업이_취소되었어요_그래서_결국_집에_일찍_돌아갔어요.mp3"
      },
      {
        "kr": "몇 시간동안 공부했었는데 시험 문제를 모두 틀려버렸어요, 공부한 내용과 다르게 나왔거든요.",
        "romaji": "Myeot sigandongan gongbuhaesseotneunde, siheom munjeleul modu tullyeobeoryeosseoyo, gongbuhan naeyong-gwa dareuge nawassgeodeunyo.",
        "en": "I had studied for several hours but then got all the test questions wrong—the questions were different from what I had studied.",
        "grammar_audio": "/audio/korean/grammar/s_했었는데_haesseotneunde_Had_done_but_20250209_몇_시간동안_공부했었는데_시험_문제를_모두_틀려버렸어요_공부한_내용과_다르게_나왔거든요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~했을 텐데 [haesseultende] (Would have done but)",
    "short_explanation": "Used to express that something 'would have' happened but for some reason did not.",
    "long_explanation": "'~했을 텐데' is used in Korean to describe an action or state that was expected to occur but did not due to certain circumstances. It expresses a contrast between expectation and reality.",
    "formation": "Verb stem + 았/었을 텐데",
    "examples": [
      {
        "kr": "저는 원래 오늘 공항에 갔을 텐데, 비행기표가 매진되서 못 갔어요.",
        "romaji": "Jeoneun wonrae oneul gonghang-e gasseultende, bihanggipyo-ga maejindweseo mot gat-eoyo.",
        "en": "I would have gone to the airport today, but I couldn't because the airplane tickets were sold out.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseultende_Would_have_done_but_20250209_저는_원래_오늘_공항에_갔을_텐데_비행기표가_매진되서_못_갔어요.mp3"
      },
      {
        "kr": "그녀는 숙제를 다 했을 텐데, 갑자기 컴퓨터가 고장나서 못 했어요.",
        "romaji": "Geunyeoneun sujereul da haesseultende, gabjagi keompyuteoga gojangnaseo mot haesseoyo.",
        "en": "She would have done all her homework, but she couldn't because her computer suddenly broke down.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseultende_Would_have_done_but_20250209_그녀는_숙제를_다_했을_텐데_갑자기_컴퓨터가_고장나서_못_했어요.mp3"
      },
      {
        "kr": "우리는 지난 주말에 영화를 봤을 텐데, 그날 너무 바빠서 못 봤어요.",
        "romaji": "Urineun jinan jumale yeonghwareul bwasseultende, geunal neomu bappaseo mot bwasseoyo.",
        "en": "We would have watched a movie last weekend, but we couldn't because we were too busy that day.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseultende_Would_have_done_but_20250209_우리는_지난_주말에_영화를_봤을_텐데_그날_너무_바빠서_못_봤어요.mp3"
      },
      {
        "kr": "내가 너에게 전화했을 텐데, 핸드폰 배터리가 다 떨어져서 못 했어요.",
        "romaji": "Naega neoege jeonhwahasseultende, haendeupon baeteoriga da tteol-eojyeoseo mot haesseoyo.",
        "en": "I would have called you, but I couldn't because my phone battery died.",
        "grammar_audio": "/audio/korean/grammar/s_했을_텐데_haesseultende_Would_have_done_but_20250209_내가_너에게_전화했을_텐데_핸드폰_배터리가_다_떨어져서_못_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~혹시 [hoksi] (By any chance)",
    "short_explanation": "Used to express uncertainty or to make polite inquiries.",
    "long_explanation": "The expression '혹시' is used at the beginning of sentences to indicate a level of uncertainty or to politely propose a possibility. It softens questions or suggestions and is useful when inquiring about something hypothetically.",
    "formation": "혹시 + Verb/Adjective",
    "examples": [
      {
        "kr": "혹시 나중에 틈나시면, 우리 같이 커피나 마시러 갈래요?",
        "romaji": "Hoksi najunge teumnasimyeon, uri gachi keopina masireo gallaeyo?",
        "en": "By any chance, if you have time later, would you like to go for a coffee with me?",
        "grammar_audio": "/audio/korean/grammar/s_혹시_hoksi_By_any_chance_20250209_혹시_나중에_틈나시면_우리_같이_커피나_마시러_갈래요.mp3"
      },
      {
        "kr": "혹시 내일 비가 올까요?",
        "romaji": "Hoksi naeil biga olkkayo?",
        "en": "Do you think it will rain by any chance tomorrow?",
        "grammar_audio": "/audio/korean/grammar/s_혹시_hoksi_By_any_chance_20250209_혹시_내일_비가_올까요.mp3"
      },
      {
        "kr": "혹시 그분을 아세요?",
        "romaji": "Hoksi geubuneul aseyo?",
        "en": "Do you know that person by any chance?",
        "grammar_audio": "/audio/korean/grammar/s_혹시_hoksi_By_any_chance_20250209_혹시_그분을_아세요.mp3"
      },
      {
        "kr": "혹시 시간 좀 있으세요?",
        "romaji": "Hoksi sigan jom isseuseyo?",
        "en": "Do you have some time by any chance?",
        "grammar_audio": "/audio/korean/grammar/s_혹시_hoksi_By_any_chance_20250209_혹시_시간_좀_있으세요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~힘들다 [himdeulda] (It's hard to)",
    "short_explanation": "Used to express that something is difficult or hard to do.",
    "long_explanation": "'힘들다' is a common expression in Korean used to describe difficulty or hardship in performing an action. It can be translated as 'it's hard to' in English and often conveys a sense of struggle or challenge.",
    "formation": "Verb stem + 기 + 힘들다",
    "examples": [
      {
        "kr": "일어나기 힘들었어요, 왜냐하면 어제 밤에 너무 늦게 잤어요.",
        "romaji": "Ireonagi himdeureosseoyo, waenyahamyeon eoje bame neomu neutge jasseyo.",
        "en": "It was hard to get up because I went to bed so late last night.",
        "grammar_audio": "/audio/korean/grammar/s_힘들다_himdeulda_Its_hard_to_20250209_일어나기_힘들었어요_왜냐하면_어제_밤에_너무_늦게_잤어요.mp3"
      },
      {
        "kr": "영어를 배우기 힘들다고 생각했지만, 매일 공부하니까 점점 익숙해졌어요.",
        "romaji": "Yeongeoreul baeugi himdeuldago saenggakhaetjiman, maeil gongbuhannikkaji jeomjeom iksukhaejeosseoyo.",
        "en": "I thought learning English was hard, but as I studied every day, I gradually got used to it.",
        "grammar_audio": "/audio/korean/grammar/s_힘들다_himdeulda_Its_hard_to_20250209_영어를_배우기_힘들다고_생각했지만_매일_공부하니까_점점_익숙해졌어요.mp3"
      },
      {
        "kr": "건강을 유지하기 힘들지만, 운동을 꾸준히 하고, 잘 먹으면 가능해요.",
        "romaji": "Geongangeul yujihagi himdeuljiman, undongeul ggujunhi hago, jal meogeumyeon ganeunghaeyo.",
        "en": "Keeping healthy is hard, but it's possible if you exercise regularly and eat well.",
        "grammar_audio": "/audio/korean/grammar/s_힘들다_himdeulda_Its_hard_to_20250209_건강을_유지하기_힘들지만_운동을_꾸준히_하고_잘_먹으면_가능해요.mp3"
      },
      {
        "kr": "저는 한국어를 처음 배울 때, 글자를 외우기 힘들었어요. 하지만 계속 연습하다 보니 점점 쉬워졌어요.",
        "romaji": "Jeoneun hangugeoreul cheoeum baeul ttae, geuljareul oeuwgi himdeureosseoyo. Hajiman gyesok yeonseuphada boni jeomjeom swiwojyeosseoyo.",
        "en": "When I first started learning Korean, memorizing the characters was hard. But as I kept practicing, it gradually got easier.",
        "grammar_audio": "/audio/korean/grammar/s_힘들다_himdeulda_Its_hard_to_20250209_저는_한국어를_처음_배울_때_글자를_외우기_힘들었어요_하지만_계속_연습하다_보니_점점_쉬워졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~는 김에 [neun gimae] (Used to express that someone does something while doing another action)",
    "short_explanation": "Used to depict that someone performs a certain action while already engaged in another.",
    "long_explanation": "The ending '~는 김에' is used when one is already doing something and takes advantage of that situation to do something else. It conveys the idea of 'while you are at it' or 'since you are doing one thing, you might as well do another.'",
    "formation": "Verb stem + ~는 김에",
    "examples": [
      {
        "kr": "제가 책을 읽는 김에, 아들이 저를 부르는 소리를 들었어요.",
        "romaji": "Jega chaegeul ilkneun gimae, adeuri jeoreul bureuneun sorireul deureosseoyo.",
        "en": "While I was reading a book, I heard my son calling me.",
        "grammar_audio": "/audio/korean/grammar/s_는_김에_neun_gimae_Used_to_express_that_someone_does_something_while_doing_another_action_20250209_제가_책을_읽는_김에_아들이_저를_부르는_소리를_들었어요.mp3"
      },
      {
        "kr": "먹는 김에 티비를 봐도 돼요?",
        "romaji": "Meogneun gimae tibireul bwado dwaeyo?",
        "en": "Can I watch TV while eating?",
        "grammar_audio": "/audio/korean/grammar/s_는_김에_neun_gimae_Used_to_express_that_someone_does_something_while_doing_another_action_20250209_먹는_김에_티비를_봐도_돼요.mp3"
      },
      {
        "kr": "그는 달리는 김에 손톱을 물어 뜯었어요.",
        "romaji": "Geuneun dallineun gimae sontobeul mureo tteocheosseoyo.",
        "en": "He bit his nails while running.",
        "grammar_audio": "/audio/korean/grammar/s_는_김에_neun_gimae_Used_to_express_that_someone_does_something_while_doing_another_action_20250209_그는_달리는_김에_손톱을_물어_뜯었어요.mp3"
      },
      {
        "kr": "저는 샤워하는 김에 노래를 불렀어요.",
        "romaji": "Jeoneun syawohaneun gimae noraereul bulleosseoyo.",
        "en": "I sang a song while taking a shower.",
        "grammar_audio": "/audio/korean/grammar/s_는_김에_neun_gimae_Used_to_express_that_someone_does_something_while_doing_another_action_20250209_저는_샤워하는_김에_노래를_불렀어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~기 시작하다 [sijakada] (To begin to, start to)",
    "short_explanation": "Used to express that something begins to occur or a state starts to develop.",
    "long_explanation": "The form '~기 시작하다' is used to indicate the initiation of an action or change in state. It marks the moment when something starts to happen.",
    "formation": "Verb stem + 기 시작하다",
    "examples": [
      {
        "kr": "회사에서 문제가 생기기 시작해서 많은 사람들이 짜증이 나기 시작했어요.",
        "romaji": "Hoesaeseo munjega saenggigi sijakhaeseo maneun saramdeul-i jjajeungi sijakhaesseoyo.",
        "en": "Problems began to occur at the company, and many people started to feel annoyed.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_sijakada_To_begin_to_start_to_20250209_회사에서_문제가_생기기_시작해서_많은_사람들이_짜증이_나기_시작했어요.mp3"
      },
      {
        "kr": "진짜 봄이 시작했을 때, 꽃들이 피기 시작했어요.",
        "romaji": "Jinjja bom-i sijakhaess-eul ttae, kkotdeul-i pigi sijakhaesseoyo.",
        "en": "When real spring began, the flowers started to bloom.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_sijakada_To_begin_to_start_to_20250209_진짜_봄이_시작했을_때_꽃들이_피기_시작했어요.mp3"
      },
      {
        "kr": "나는 평소보다 많이 배가 고프기 시작했어요.",
        "romaji": "Naneun pyeongsoboda manhi baega gopeugi sijakhaesseoyo.",
        "en": "I started to feel hungrier than usual.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_sijakada_To_begin_to_start_to_20250209_나는_평소보다_많이_배가_고프기_시작했어요.mp3"
      },
      {
        "kr": "우리는 오류가 발생하기 시작했다는 것을 알게 되었어요.",
        "romaji": "Urineun oryuga balseenghagi sijakhaessdaneun geoseul alge doeeosseoyo.",
        "en": "We began to realize that errors were starting to occur.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_sijakada_To_begin_to_start_to_20250209_우리는_오류가_발생하기_시작했다는_것을_알게_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~남다 [namda] (To remain, be left over)",
    "short_explanation": "Used to express that something remains or is left over.",
    "long_explanation": "The term '~남다' is used to indicate that something remains – whether a physical quantity or an abstract element – after other parts have been used up or removed.",
    "formation": "Noun + 남다",
    "examples": [
      {
        "kr": "저도 공부하고 싶었지만, 시험 준비를 위해 시간이 거의 남지 않았어요.",
        "romaji": "Jeodo gongbuhago sipeotjiman, siheom junbireul wihae sigani geoui namji anhasseoyo.",
        "en": "I also wanted to study, but I hardly had any time left to prepare for the exam.",
        "grammar_audio": "/audio/korean/grammar/s_남다_namda_To_remain_be_left_over_20250209_저도_공부하고_싶었지만_시험_준비를_위해_시간이_거의_남지_않았어요.mp3"
      },
      {
        "kr": "결혼식에 초대된 모든 사람들이 도착한 후에는 음식이 많이 남았어요.",
        "romaji": "Gyeolhonsig-e chodaedoen modeun saramdeul-i dochakhan hue, eumsigi mani namasseoyo.",
        "en": "After everyone invited to the wedding arrived, there was a lot of food left over.",
        "grammar_audio": "/audio/korean/grammar/s_남다_namda_To_remain_be_left_over_20250209_결혼식에_초대된_모든_사람들이_도착한_후에는_음식이_많이_남았어요.mp3"
      },
      {
        "kr": "우리는 호숫가를 다 걸은 후, 더 이상 볼거리가 남지 않았어요.",
        "romaji": "Urineun hosutgareul da georeun hu, deo isang bolgeoriga namji anhasseoyo.",
        "en": "After we walked along the lakeside, there was nothing more to see.",
        "grammar_audio": "/audio/korean/grammar/s_남다_namda_To_remain_be_left_over_20250209_우리는_호숫가를_다_걸은_후_더_이상_볼거리가_남지_않았어요.mp3"
      },
      {
        "kr": "그녀가 나간 후, 이별의 첫날 밤에 그리움만 남았어요.",
        "romaji": "Geunyeoga nagan hu, ibyeol-ui cheosnal bame geuriumman namasseoyo.",
        "en": "After she left, on the first night of parting, only longing remained.",
        "grammar_audio": "/audio/korean/grammar/s_남다_namda_To_remain_be_left_over_20250209_그녀가_나간_후_이별의_첫날_밤에_그리움만_남았어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~네요 [neyo] (Express surprise)",
    "short_explanation": "Used when the speaker discovers something new or unexpected.",
    "long_explanation": "The ending '~네요' is used to express surprise, realization, or a newly noticed fact. It can convey sentiments such as 'I see,' 'Oh,' or 'Wow,' indicating that the speaker has become aware of something.",
    "formation": "Adjective/Verb stem + 네요",
    "examples": [
      {
        "kr": "오늘 날씨가 정말 따뜻하네요, 아침에는 춥다고 생각했는데요.",
        "romaji": "Oneul nalssiga jeongmal ttatteuthneyo, achimeun chubdago saenggakhaetneundeyo.",
        "en": "The weather is really warm today, although I thought it was cold this morning.",
        "grammar_audio": "/audio/korean/grammar/s_네요_neyo_Express_surprise_20250209_오늘_날씨가_정말_따뜻하네요_아침에는_춥다고_생각했는데요.mp3"
      },
      {
        "kr": "그녀가 노래를 정말 잘 부르네요, 이전에 들어본 적이 없어서 모르겠어요.",
        "romaji": "Geunyeoga noraereul jeongmal jal bureuneyo, ijeon-e deureobon jeogi eopseoseo moreugesseoyo.",
        "en": "She sings really well; I haven’t heard her sing before.",
        "grammar_audio": "/audio/korean/grammar/s_네요_neyo_Express_surprise_20250209_그녀가_노래를_정말_잘_부르네요_이전에_들어본_적이_없어서_모르겠어요.mp3"
      },
      {
        "kr": "와, 이 케이크가 정말 맛있네요, 처음 먹어보는 맛이에요.",
        "romaji": "Wa, i keikeuga jeongmal masitneyo, cheoeum meogeoboneun masieyo.",
        "en": "Wow, this cake is really delicious—it’s a taste I’m experiencing for the first time.",
        "grammar_audio": "/audio/korean/grammar/s_네요_neyo_Express_surprise_20250209_와_이_케이크가_정말_맛있네요_처음_먹어보는_맛이에요.mp3"
      },
      {
        "kr": "어, 비가 오네요, 우산을 가져왔어야 했어요.",
        "romaji": "Eo, biga oneyo, usaneul gajyeowasseoya haesseoyo.",
        "en": "Oh, it’s raining. I should have brought an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_네요_neyo_Express_surprise_20250209_어_비가_오네요_우산을_가져왔어야_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~다고 [dago] (Saying that)",
    "short_explanation": "Used to indirectly report what someone said, thought, or felt.",
    "long_explanation": "The ending '~다고' is used to quote or report someone’s speech, thoughts, or feelings indirectly. It functions similarly to saying 'saying that' in English.",
    "formation": "Verb + 다고 + (다/요)",
    "examples": [
      {
        "kr": "그는 내가 밥을 먹었다고 생각했어요, 하지만 저는 아직 밥을 먹지 않았어요.",
        "romaji": "Geuneun naega babeul meogeossdago saenggakhaesseoyo, hajiman jeoneun ajik babeul meokji anhasseoyo.",
        "en": "He thought that I had eaten, but I haven’t eaten yet.",
        "grammar_audio": "/audio/korean/grammar/s_다고_dago_Saying_that_20250209_그는_내가_밥을_먹었다고_생각했어요_하지만_저는_아직_밥을_먹지_않았어요.mp3"
      },
      {
        "kr": "친구가 오늘은 비가 온다고 말했어요, 그래서 나는 우산을 가져왔어요.",
        "romaji": "Chinguga oneureun biga ondago malhaesseoyo, geuraeseo naneun usaneul gajyeowasseoyo.",
        "en": "My friend said that it would rain today, so I brought an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_다고_dago_Saying_that_20250209_친구가_오늘은_비가_온다고_말했어요_그래서_나는_우산을_가져왔어요.mp3"
      },
      {
        "kr": "선생님이 시험이 어렵다고 말했어요, 그래서 부지런히 공부했어요.",
        "romaji": "Seonsaengnimi siheomi eoryeopdago malhaesseoyo, geuraeseo bujireonhi gongbuhaesseoyo.",
        "en": "The teacher said that the test would be difficult, so I studied diligently.",
        "grammar_audio": "/audio/korean/grammar/s_다고_dago_Saying_that_20250209_선생님이_시험이_어렵다고_말했어요_그래서_부지런히_공부했어요.mp3"
      },
      {
        "kr": "엄마가 오늘 밤 늦게 들어오지 마라고 말했어요.",
        "romaji": "Eommaga oneul bam neutge deureooji marago malhaesseoyo.",
        "en": "My mom said not to come home late tonight.",
        "grammar_audio": "/audio/korean/grammar/s_다고_dago_Saying_that_20250209_엄마가_오늘_밤_늦게_들어오지_마라고_말했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~다는 [daneun] (The fact that)",
    "short_explanation": "Used to denote the fact or idea that something has been stated or quoted.",
    "long_explanation": "'~다는' is used to emphasize the content of a statement or the fact that something is said or known. It is often used when reporting or conveying information that was heard from another source.",
    "formation": "Verb/Adjective + 다는",
    "examples": [
      {
        "kr": "그는 자신의 실수를 인정한다는 사실이 얼마나 어려운지 모릅니다.",
        "romaji": "Geuneun jasinui silsureul injeonghandaneun sasil-i eolmana eoryeounji moreumnida.",
        "en": "He doesn’t know how hard it is to admit his mistakes.",
        "grammar_audio": "/audio/korean/grammar/s_다는_daneun_The_fact_that_20250209_그는_자신의_실수를_인정한다는_사실이_얼마나_어려운지_모릅니다.mp3"
      },
      {
        "kr": "나는 내가 그녀를 사랑한다는 것을 처음으로 깨달았다.",
        "romaji": "Naneun naega geunyeoreul saranghandaneun geoseul cheoeumeuro kkaedaraessda.",
        "en": "I realized for the first time that I love her.",
        "grammar_audio": "/audio/korean/grammar/s_다는_daneun_The_fact_that_20250209_나는_내가_그녀를_사랑한다는_것을_처음으로_깨달았다.mp3"
      },
      {
        "kr": "퍼피 님의 회사가 본격적으로 확장한다는 소식을 들었어요.",
        "romaji": "Peopi nimui hoesaga bongyeokjeogeuro hwakjanghandaneun sosigeul deureosseoyo.",
        "en": "I heard that Puppy’s company is expanding in earnest.",
        "grammar_audio": "/audio/korean/grammar/s_다는_daneun_The_fact_that_20250209_퍼피_님의_회사가_본격적으로_확장한다는_소식을_들었어요.mp3"
      },
      {
        "kr": "오늘 아침에 네가 결혼한다는 사실을 들었어.",
        "romaji": "Oneul achime neoga gyeolhonhandaneun sasil-eul deureosseo.",
        "en": "This morning, I heard that you are getting married.",
        "grammar_audio": "/audio/korean/grammar/s_다는_daneun_The_fact_that_20250209_오늘_아침에_네가_결혼한다는_사실을_들었어.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~다면서요 [damyeonseyo] (Said that)",
    "short_explanation": "Used when quoting someone's words or conveying information heard from someone else.",
    "long_explanation": "The expression '~다면서요' is used to relay information that was reported or said by someone else. It combines the declarative form with a quoting marker to indicate that the speaker is passing along what was heard.",
    "formation": "Verb + 다면서요",
    "examples": [
      {
        "kr": "영희가 서울에 살고 있다면서요, 정말 그런 건지 알 수가 없어요.",
        "romaji": "Yeonghiga Seoure salgo itdamyeonseyo, jeongmal geureon geonji al suga eopseoyo.",
        "en": "You said that Young Hee lives in Seoul, but I can’t really tell if that’s true.",
        "grammar_audio": "/audio/korean/grammar/s_다면서요_damyeonseyo_Said_that_20250209_영희가_서울에_살고_있다면서요_정말_그런_건지_알_수가_없어요.mp3"
      },
      {
        "kr": "집에 일찍 돌아오라고 했다면서요, 그런데 왜 아직도 안 와요?",
        "romaji": "Jibe iljjik doraorago haetdamyeonseyo, geureonde wae ajikdo an wayo?",
        "en": "You said to come home early, but why haven’t you come yet?",
        "grammar_audio": "/audio/korean/grammar/s_다면서요_damyeonseyo_Said_that_20250209_집에_일찍_돌아오라고_했다면서요_그런데_왜_아직도_안_와요.mp3"
      },
      {
        "kr": "친구가 낼 학교에 안 온다고 했다면서요, 아마 아프지 않았나요?",
        "romaji": "Chinguga nael hakgyoe an ondago haetdamyeonseyo, ama apeuji anhatnayo?",
        "en": "My friend said he won’t come to school tomorrow; maybe he’s not feeling well?",
        "grammar_audio": "/audio/korean/grammar/s_다면서요_damyeonseyo_Said_that_20250209_친구가_낼_학교에_안_온다고_했다면서요_아마_아프지_않았나요.mp3"
      },
      {
        "kr": "나중에 커피 한 잔 같이 할 것을 약속했다면서요, 그런데 왜 연락이 없나요?",
        "romaji": "Najunge keopi hanjan gachi hal geoseul yaksokhaetdamyeonseyo, geureonde wae yeonragi eomnayo?",
        "en": "You promised to have a cup of coffee later, but why haven’t you contacted me?",
        "grammar_audio": "/audio/korean/grammar/s_다면서요_damyeonseyo_Said_that_20250209_나중에_커피_한_잔_같이_할_것을_약속했다면서요_그런데_왜_연락이_없나요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~던데 [deonde] (Used to)",
    "short_explanation": "Used to express reminiscence or describe how something used to be.",
    "long_explanation": "The ending '~던데' is a past tense form used to recall how things were in the past. It is often used in a reminiscing context or to highlight a contrast between past and present.",
    "formation": "Verb in past tense + 던데",
    "examples": [
      {
        "kr": "그는 항상 머리를 길게 기르던데, 언제부터 짧게 자르기 시작했어요?",
        "romaji": "Geuneun hangsang meorireul gilge gireudeonde, eonjebuteo jjalbge jareugi sijakhaesseoyo?",
        "en": "He used to always grow his hair long—when did he start cutting it short?",
        "grammar_audio": "/audio/korean/grammar/s_던데_deonde_Used_to_20250209_그는_항상_머리를_길게_기르던데_언제부터_짧게_자르기_시작했어요.mp3"
      },
      {
        "kr": "내 친구는 예전에는 채소를 안 좋아했던데, 이제는 건강을 위해 열심히 먹는다고 하네요.",
        "romaji": "Nae chinguneun yejeoneneun chaesoreul an joahaetdeonde, ijeneun geongangeul wihae yeolsimhi meokneundago haneyo.",
        "en": "My friend used to dislike vegetables, but now he says he eats them diligently for his health.",
        "grammar_audio": "/audio/korean/grammar/s_던데_deonde_Used_to_20250209_내_친구는_예전에는_채소를_안_좋아했던데_이제는_건강을_위해_열심히_먹는다고_하네요.mp3"
      },
      {
        "kr": "나는 어릴 때 청소를 정말 싫어했던데, 이제는 좋아해서 매일 하는 편이에요.",
        "romaji": "Naneun eoril ttae cheongso-reul jeongmal sirheohaetdeonde, ijeneun joahaeseo maeil haneun pyeonieyo.",
        "en": "I used to really hate cleaning when I was young, but now I like it and do it every day.",
        "grammar_audio": "/audio/korean/grammar/s_던데_deonde_Used_to_20250209_나는_어릴_때_청소를_정말_싫어했던데_이제는_좋아해서_매일_하는_편이에요.mp3"
      },
      {
        "kr": "우리는 어렸을 때부터 함께 공부하던데, 지금은 각자 다른 대학교에 다녀요.",
        "romaji": "Urineun eoryeosseuttobuteo hamkke gongbuhadeonde, jigeumeun gakja dareun daehakgyoe danyeoyo.",
        "en": "We used to study together when we were young, but now we attend different universities.",
        "grammar_audio": "/audio/korean/grammar/s_던데_deonde_Used_to_20250209_우리는_어렸을_때부터_함께_공부하던데_지금은_각자_다른_대학교에_다녀요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~도록 하다 [dorok hada] (To try to, to make sure to)",
    "short_explanation": "Used to express the intention of making something happen or ensuring an action occurs.",
    "long_explanation": "The structure '~도록 하다' is used when someone takes measures or makes an effort to ensure that a certain action or state is achieved. It implies intention or control over making something happen.",
    "formation": "Verb stem + 기 / Noun + 도록 하다",
    "examples": [
      {
        "kr": "우리는 우리의 직원들이 충분한 휴식을 취하도록 해야 합니다. 그렇게 하지 않으면 그들의 효율성이 줄어들 수 있습니다.",
        "romaji": "Urineun uriui jikwon-deul-i chungbunhan hyusigeul chwihadorok haeya hamnida. Geureoke haji anheumyeon geudeurui hyoyulseongi jureodeul su issseubnida.",
        "en": "We should ensure our employees get enough rest. If not, their efficiency might decrease.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_To_try_to_to_make_sure_to_20250209_우리는_우리의_직원들이_충분한_휴식을_취하도록_해야_합니다_그렇게_하지_않으면_그들의_효율성이_줄어들_수_있습니다.mp3"
      },
      {
        "kr": "생일 파티를 계획하면서 모든 것이 완벽하게 되도록 해야 해요. 아무래도 그것은 아버지의 특별한 날이니까요.",
        "romaji": "Saeng-il patireul gyehoekhamyeonseo modeun geosi wanbyeokhage doedorok haeya haeyo. Amuraedo geugeoseun abeojiui teugbyeolhan narinikkayo.",
        "en": "While planning the birthday party, everything must be perfect—after all, it’s Dad’s special day.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_To_try_to_to_make_sure_to_20250209_생일_파티를_계획하면서_모든_것이_완벽하게_되도록_해야_해요_아무래도_그것은_아버지의_특별한_날이니까요.mp3"
      },
      {
        "kr": "반장으로서, 나는 모든 학생들이 숙제를 완료하도록 해야 합니다. 그럼 선생님은 우리에게 불만을 가질 이유가 없을 거예요.",
        "romaji": "Banjang-euroseo, naneun modeun haksaengdeul-i sukje-reul wanryohadorok haeya hamnida. Geureom seonsaengnimeun uriege bulmaneul gajil iyuga eobseul geoyeyo.",
        "en": "As class president, I must ensure that all students complete their homework—then the teacher won’t have any reason to complain.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_To_try_to_to_make_sure_to_20250209_반장으로서_나는_모든_학생들이_숙제를_완료하도록_해야_합니다_그럼_선생님은_우리에게_불만을_가질_이유가_없을_거예요.mp3"
      },
      {
        "kr": "고객이 우리의 제품에 만족하도록 최선을 다해야 합니다. 그렇게 하면 우리의 비즈니스가 성장할 수 있을 것입니다.",
        "romaji": "Gogaegi uriui jepum-e manjokhadorok choeseoneul dahaeya hamnida. Geureoke hamyeon uriui bijeuniseuga seongjanghal su isseul geosibnida.",
        "en": "We must do our best to ensure that customers are satisfied with our product. By doing so, our business can grow.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_To_try_to_to_make_sure_to_20250209_고객이_우리의_제품에_만족하도록_최선을_다해야_합니다_그렇게_하면_우리의_비즈니스가_성장할_수_있을_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~든지 [deunji] (Whether or)",
    "short_explanation": "Used to express indecision between two or more options; 'whether or'.",
    "long_explanation": "The conjunction '~든지' is used to indicate that any of the given alternatives is acceptable or that the speaker is indifferent about the choice. It is often used to show that no matter which option is chosen, the outcome will be similar.",
    "formation": "Noun/V-아/어/여 + 든지 + Noun/V-아/어/여 + 든지",
    "examples": [
      {
        "kr": "당신이 들어오든지 나가든지 저는 상관하지 않아요, 중요한 것은 작업이 계속되어야 한다는 것입니다.",
        "romaji": "Dangsini deureodeunji nagadeunji jeoneun sanggwanhaji anhayo, jungyohan geos-eun jageobi gyesogdoeya handaneun geosibnida.",
        "en": "Whether you come in or go out, I don’t care; what’s important is that the work must continue.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether_or_20250209_당신이_들어오든지_나가든지_저는_상관하지_않아요_중요한_것은_작업이_계속되어야_한다는_것입니다.mp3"
      },
      {
        "kr": "비가 오든지 맑은 날이든지 저는 항상 산책하러 나갑니다.",
        "romaji": "Biga odeunji malgeun narideunji jeoneun hangsang sanchaekhareo nagamnida.",
        "en": "Whether it’s raining or a clear day, I always go out for a walk.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether_or_20250209_비가_오든지_맑은_날이든지_저는_항상_산책하러_나갑니다.mp3"
      },
      {
        "kr": "당신이 이해하든지 못하든지 저는 계속 설명하겠습니다.",
        "romaji": "Dangsini ihaehadeonji mothadeonji, jeoneun gyesok seolmyeonghagessseubnida.",
        "en": "Whether you understand or not, I will keep explaining.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether_or_20250209_당신이_이해하든지_못하든지_저는_계속_설명하겠습니다.mp3"
      },
      {
        "kr": "강아지가 짖든지 안 짖든지, 마치 대화를 나누는 것처럼 인사하는 것이 좋습니다.",
        "romaji": "Gang-ajiga jijdeunji an jijdeunji, machi daehwareul nanuneun geoscheoreom insahaneun geosi johseubnida.",
        "en": "Whether the dog barks or not, it’s nice to greet it as if you were having a conversation.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether_or_20250209_강아지가_짖든지_안_짖든지_마치_대화를_나누는_것처럼_인사하는_것이_좋습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~라는 것이다 [raneun geosida] (It means that)",
    "short_explanation": "Used to indicate or define the meaning of a statement; 'it means that'.",
    "long_explanation": "'~라는 것이다' is a grammatical structure that turns a clause into a noun phrase to explain or define its implication. It is commonly used after a verb or descriptive verb to emphasize that something signifies a particular fact or idea.",
    "formation": "Verb + 라는 것이다 OR Descriptive Verb + 라는 것이다",
    "examples": [
      {
        "kr": "그녀가 사진을 찍는다는 것은, 그녀가 사진을 좋아한다는 뜻이다.",
        "romaji": "Geunyeoga sajineul jjikneundaneun geoseun, geunyeoga sajineul joahandaneun tteusida.",
        "en": "The fact that she takes photographs means she likes photography.",
        "grammar_audio": "/audio/korean/grammar/s_라는_것이다_raneun_geosida_It_means_that_20250209_그녀가_사진을_찍는다는_것은_그녀가_사진을_좋아한다는_뜻이다.mp3"
      },
      {
        "kr": "그가 항상 일찍 일어난다는 것은, 그는 아침형 인간이라는 것이다.",
        "romaji": "Geuga hangsang iljjik ireonandaneun geoseun, geuneun achimhyeong inganiraneun geosida.",
        "en": "The fact that he always gets up early means that he is a morning person.",
        "grammar_audio": "/audio/korean/grammar/s_라는_것이다_raneun_geosida_It_means_that_20250209_그가_항상_일찍_일어난다는_것은_그는_아침형_인간이라는_것이다.mp3"
      },
      {
        "kr": "가을이 오면 나무 잎이 노란색으로 변한다는 것은, 가을의 특성이라는 것이다.",
        "romaji": "Ga-euli omyeon namu ip-i nolan saeg-eulo byeondandaneun geoseun, gaeul-ui teugseong-iraneun geosida.",
        "en": "The fact that the leaves turn yellow when autumn comes means it is a characteristic of autumn.",
        "grammar_audio": "/audio/korean/grammar/s_라는_것이다_raneun_geosida_It_means_that_20250209_가을이_오면_나무_잎이_노란색으로_변한다는_것은_가을의_특성이라는_것이다.mp3"
      },
      {
        "kr": "우리가 어떤 문제를 가지고 있다는 것은, 우리가 그 문제를 해결해야 한다는 것이다.",
        "romaji": "Uriga eotteon munje-reul gajigo issdaneun geoseun, uriga geu munje-reul haegyeolhaeya handaneun geosida.",
        "en": "The fact that we have a problem means we need to solve it.",
        "grammar_audio": "/audio/korean/grammar/s_라는_것이다_raneun_geosida_It_means_that_20250209_우리가_어떤_문제를_가지고_있다는_것은_우리가_그_문제를_해결해야_한다는_것이다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~라도 [rado] (At least, even if)",
    "short_explanation": "Used to express 'at least' or 'even if'.",
    "long_explanation": "'~라도' is used to indicate a minimum or acceptable alternative. It can be attached to a noun or verb stem to mean 'at least' or 'even if' under a given condition, often softening a statement or presenting a fallback option.",
    "formation": "Noun/Verb Stem + -라도",
    "examples": [
      {
        "kr": "달까지 걸어가기는 어렵지만, 사진이라도 찍자.",
        "romaji": "Dalkkaji georeogagineun eoryeopjiman, sajin-irado jjikja.",
        "en": "Although it's hard to walk to the moon, let's at least take a picture.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_달까지_걸어가기는_어렵지만_사진이라도_찍자.mp3"
      },
      {
        "kr": "그는 일하기 힘들다고 했지만, 일이라도 시켜야 하는 게 아니에요?",
        "romaji": "Geuneun ilhagi himdeuldago haejiman, il-irado sikyeoya haneun ge anieyo?",
        "en": "He said working is hard, but don't we have to make him work at least?",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_그는_일하기_힘들다고_했지만_일이라도_시켜야_하는_게_아니에요.mp3"
      },
      {
        "kr": "최소한 사과라도 했어야 하지 않았을까요? 그러면 상황이 좀 더 나아질 수 있었을 텐데.",
        "romaji": "Choesohan sagwarado haesseoya haji anhaesseulkka-yo? Geureomyeon sanghwang-i jom deo naajil su isseosseul tende.",
        "en": "Shouldn't she have at least apologized? Then the situation could have been better.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_최소한_사과라도_했어야_하지_않았을까요_그러면_상황이_좀_더_나아질_수_있었을_텐데.mp3"
      },
      {
        "kr": "집에 가지 않을 거라면, 연락이라도 해주었어야 하는 게 아니겠어요?",
        "romaji": "Jibe gaji anheul georamyeon, yeonragirado haejueosseoya haneun ge anigesseoyo?",
        "en": "If you weren't going home, shouldn’t you have at least made a call?",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_집에_가지_않을_거라면_연락이라도_해주었어야_하는_게_아니겠어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~러 [reo] (In order to)",
    "short_explanation": "Used to indicate the purpose or intention of an action; 'in order to'.",
    "long_explanation": "'~러' is a grammar pattern attached to a verb stem to express the purpose or intent of an action. It is equivalent to 'in order to' or 'for the purpose of' in English and is commonly used when going somewhere or doing something with a specific goal in mind.",
    "formation": "Verb Stem + ~러",
    "examples": [
      {
        "kr": "저는 한국어를 배우러 한국에 왔어요.",
        "romaji": "Jeoneun hangugeoreul baeureo, hanguge wassseoyo.",
        "en": "I came to Korea in order to learn Korean.",
        "grammar_audio": "/audio/korean/grammar/s_러_reo_In_order_to_20250209_저는_한국어를_배우러_한국에_왔어요.mp3"
      },
      {
        "kr": "그는 책을 사러 서점에 갔어요.",
        "romaji": "Geuneun chaegeul sareo, seojome gasseoyo.",
        "en": "He went to the bookstore to buy a book.",
        "grammar_audio": "/audio/korean/grammar/s_러_reo_In_order_to_20250209_그는_책을_사러_서점에_갔어요.mp3"
      },
      {
        "kr": "어머니는 저녁 식사를 준비하러 부엌에 가셨어요.",
        "romaji": "Eomeonineun jeonyeok siksa-reul junbihareo, bueoge gasyeosseoyo.",
        "en": "Mother went to the kitchen to prepare dinner.",
        "grammar_audio": "/audio/korean/grammar/s_러_reo_In_order_to_20250209_어머니는_저녁_식사를_준비하러_부엌에_가셨어요.mp3"
      },
      {
        "kr": "친구들과 영화를 보러 영화관에 갔어요.",
        "romaji": "Chingudeulgwa yeonghwareul boreo, yeonghwagw-e gasseoyo.",
        "en": "I went to the movie theater to watch a movie with friends.",
        "grammar_audio": "/audio/korean/grammar/s_러_reo_In_order_to_20250209_친구들과_영화를_보러_영화관에_갔어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~려고 하다 [ryeogo hada] (Try to)",
    "short_explanation": "Used to express an intention or attempt to do something; 'try to'.",
    "long_explanation": "The construction '~려고 하다' is used to convey an intention, plan, or attempt to do something. It expresses a planned future action or an effort, without guaranteeing success.",
    "formation": "Verb Stem + 려고 하다",
    "examples": [
      {
        "kr": "저는 매일 새로운 단어를 10개 배우려고 해요, 그래서 한국어 향상을 위해 노력하고 있어요.",
        "romaji": "Jeoneun maeil saeroun daneoreul 10gae baeuryeogo haeyo, geuraeseo hangugeo hyangsangeul wihae noryeokhago isseoyo.",
        "en": "I try to learn 10 new words every day, so I am making an effort to improve my Korean.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_저는_매일_새로운_단어를_10개_배우려고_해요_그래서_한국어_향상을_위해_노력하고_있어요.mp3"
      },
      {
        "kr": "아플 때에도 항상 웃으려고 해요, 그것이 저의 방식입니다.",
        "romaji": "Apeul ttaeedo hangsang useuryeogo haeyo, geugeosi jeoui bangshigibnida.",
        "en": "Even when I'm sick, I always try to smile; that's my way.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_아플_때에도_항상_웃으려고_해요_그것이_저의_방식입니다.mp3"
      },
      {
        "kr": "그는 항상 일찍 자려고 하지만, 항상 실패하고 말아요.",
        "romaji": "Geuneun hangsang iljjik jaryeogo hajiman, hangsang silpaehago maraeyo.",
        "en": "He always tries to go to bed early, but always ends up failing.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_그는_항상_일찍_자려고_하지만_항상_실패하고_말아요.mp3"
      },
      {
        "kr": "우리는 연습하고 공부해서 공연을 성공적으로 마치려고 했어요.",
        "romaji": "Urineun yeonseuphago gongbuhaeseo gongyeoneul seonggongjeogeuro machiryeogo haesseoyo.",
        "en": "We tried to finish the performance successfully by practicing and studying.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_우리는_연습하고_공부해서_공연을_성공적으로_마치려고_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~려는 [ryeoneun] (Intending to)",
    "short_explanation": "Used to express a future intention, plan, or aim.",
    "long_explanation": "~려는 is used to indicate that someone intends or plans to do something in the future. It carries the nuance of will or purpose, even if the outcome is not yet decided.",
    "formation": "Verb Stem + ~려는",
    "examples": [
      {
        "kr": "내일 출장 가려는 사람은 저 혼자입니다. 다른 사람들은 모두 바쁩니다.",
        "romaji": "Naeil chuljang garyeoneun sarameun jeo honjaimnida. Dareun saramdeureun modu bappumnida.",
        "en": "I am the only one intending to go on a business trip tomorrow; everyone else is busy.",
        "grammar_audio": "/audio/korean/grammar/s_려는_ryeoneun_Intending_to_20250209_내일_출장_가려는_사람은_저_혼자입니다_다른_사람들은_모두_바쁩니다.mp3"
      },
      {
        "kr": "건강한 식생활을 위해 채식주의자가 되려는 사람이 많습니다.",
        "romaji": "Geonganghan siksaenghwaleul wihae chaesikjuuijaga doeryeoneun sarami manheumnida.",
        "en": "There are many people intending to become vegetarians for a healthier diet.",
        "grammar_audio": "/audio/korean/grammar/s_려는_ryeoneun_Intending_to_20250209_건강한_식생활을_위해_채식주의자가_되려는_사람이_많습니다.mp3"
      },
      {
        "kr": "토익 시험을 준비하려는 학생들은 많은 시간을 공부에 투자하고 있습니다.",
        "romaji": "Toik siheomeul junbiharyeoneun haksaengdeuleun manheun siganeul gongbue tujahago isseumnida.",
        "en": "Students intending to prepare for the TOEIC exam are investing a lot of time in studying.",
        "grammar_audio": "/audio/korean/grammar/s_려는_ryeoneun_Intending_to_20250209_토익_시험을_준비하려는_학생들은_많은_시간을_공부에_투자하고_있습니다.mp3"
      },
      {
        "kr": "제 주말 계획은 코딩을 배우려는 것입니다만, 평소보다 더 많은 시간과 노력이 필요합니다.",
        "romaji": "Je jumal gyehoek-eun kodingeul baeuryeoneun geosimnida man, pyeongsoboda deo manheun sigangwa noryeogi pil-yohabnida.",
        "en": "My weekend plan is to learn coding, but it requires more time and effort than usual.",
        "grammar_audio": "/audio/korean/grammar/s_려는_ryeoneun_Intending_to_20250209_제_주말_계획은_코딩을_배우려는_것입니다만_평소보다_더_많은_시간과_노력이_필요합니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~로써 [rossyeo] (By means of)",
    "short_explanation": "Used to indicate the role, means, or capacity in which something is done.",
    "long_explanation": "'~로써' is used after a noun to express the manner or capacity in which an action is performed – similar to saying 'by means of' or 'as' in English.",
    "formation": "Noun + 로써",
    "examples": [
      {
        "kr": "제가 학생으로써 선생님께서 알려주신 것을 모두 이해했습니다.",
        "romaji": "Jega haksaeng-eurosseo, seonsaengnimkkeseo allyeojusin geoseul modu ihaehaesseumnida.",
        "en": "As a student, I understood everything the teacher explained.",
        "grammar_audio": "/audio/korean/grammar/s_로써_rossyeo_By_means_of_20250209_제가_학생으로써_선생님께서_알려주신_것을_모두_이해했습니다.mp3"
      },
      {
        "kr": "바이올리니스트로써 그녀는 세계적으로 인정받았습니다.",
        "romaji": "Ba-iolliniseuteuro-sseo, geunyeoneun segyejeogeuro injeongbadassseumnida.",
        "en": "As a violinist, she has gained worldwide recognition.",
        "grammar_audio": "/audio/korean/grammar/s_로써_rossyeo_By_means_of_20250209_바이올리니스트로써_그녀는_세계적으로_인정받았습니다.mp3"
      },
      {
        "kr": "나는 엔지니어로써 이 문제를 해결할 수 있습니다.",
        "romaji": "Naneun enjinieo-ro-sseo, i munjeleul haegyeolhal su isseumnida.",
        "en": "As an engineer, I can solve this problem.",
        "grammar_audio": "/audio/korean/grammar/s_로써_rossyeo_By_means_of_20250209_나는_엔지니어로써_이_문제를_해결할_수_있습니다.mp3"
      },
      {
        "kr": "지도자로써 그는 팀을 잘 이끌고 있습니다.",
        "romaji": "Jidojaro-sseo, geuneun timeul jal ikkeulgo isseumnida.",
        "en": "As a leader, he is leading the team well.",
        "grammar_audio": "/audio/korean/grammar/s_로써_rossyeo_By_means_of_20250209_지도자로써_그는_팀을_잘_이끌고_있습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~를 바탕으로 [reul batageuro] (Based on)",
    "short_explanation": "Used to express the basis or foundation upon which something is derived.",
    "long_explanation": "The phrase '~를 바탕으로' is used to indicate that an action, decision, or creation is based on certain data, facts, or experience. It can be translated as 'on the basis of' or 'based on' in English.",
    "formation": "Noun + 를 바탕으로",
    "examples": [
      {
        "kr": "연구 결과를 바탕으로 새로운 약을 개발하고 있습니다.",
        "romaji": "Yeongu gyeolgwareul batageuro saeroun yageul gaebalhago issseumnida.",
        "en": "Based on the research results, we are developing a new medicine.",
        "grammar_audio": "/audio/korean/grammar/s_를_바탕으로_reul_batageuro_Based_on_20250209_연구_결과를_바탕으로_새로운_약을_개발하고_있습니다.mp3"
      },
      {
        "kr": "경험을 바탕으로 나의 미래를 계획하고 있습니다.",
        "romaji": "Gyeongheomeul batageuro naui miraereul gyehoekhago issseumnida.",
        "en": "Based on my experiences, I am planning my future.",
        "grammar_audio": "/audio/korean/grammar/s_를_바탕으로_reul_batageuro_Based_on_20250209_경험을_바탕으로_나의_미래를_계획하고_있습니다.mp3"
      },
      {
        "kr": "이 아이디어는 과학적인 사실을 바탕으로 생각했습니다.",
        "romaji": "I aideareun gwahakjeokin sasireul batageuro saenggakhaesseumnida.",
        "en": "This idea is based on scientific facts.",
        "grammar_audio": "/audio/korean/grammar/s_를_바탕으로_reul_batageuro_Based_on_20250209_이_아이디어는_과학적인_사실을_바탕으로_생각했습니다.mp3"
      },
      {
        "kr": "당신의 의견을 바탕으로 회의에서 얘기할 수 있을까요?",
        "romaji": "Dangsin-ui uigeoneul batageuro, hoeuieseo yaegi-hal su isseulkka-yo?",
        "en": "Can we discuss this in the meeting based on your opinion?",
        "grammar_audio": "/audio/korean/grammar/s_를_바탕으로_reul_batageuro_Based_on_20250209_당신의_의견을_바탕으로_회의에서_얘기할_수_있을까요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~를 통해 [reul tonghae] (Through, by means of)",
    "short_explanation": "Used to express the medium or method by which something is done or achieved.",
    "long_explanation": "'~를 통해' is a postposition used to indicate the means, method, or channel through which an action is performed. It is equivalent to 'through', 'by means of', or 'via' in English.",
    "formation": "Noun + 를 통해",
    "examples": [
      {
        "kr": "나는 음악을 통해 감정을 표현할 수 있어요.",
        "romaji": "Naneun eumageul tonghae gamjeongeul pyohyeonhal su isseoyo.",
        "en": "I can express my emotions through music.",
        "grammar_audio": "/audio/korean/grammar/s_를_통해_reul_tonghae_Through_by_means_of_20250209_나는_음악을_통해_감정을_표현할_수_있어요.mp3"
      },
      {
        "kr": "우리는 이메일을 통해 그에게 이 메시지를 보냈어요.",
        "romaji": "Urineun imeireul tonghae, geu-ege i mesijireul bonaesseoyo.",
        "en": "We sent him the message through email.",
        "grammar_audio": "/audio/korean/grammar/s_를_통해_reul_tonghae_Through_by_means_of_20250209_우리는_이메일을_통해_그에게_이_메시지를_보냈어요.mp3"
      },
      {
        "kr": "학생들은 실험을 통해 새로운 지식을 배웠어요.",
        "romaji": "Haksaengdeureun silheomeul tonghae saeroun jisigeul baewosseoyo.",
        "en": "The students learned new knowledge through experimentation.",
        "grammar_audio": "/audio/korean/grammar/s_를_통해_reul_tonghae_Through_by_means_of_20250209_학생들은_실험을_통해_새로운_지식을_배웠어요.mp3"
      },
      {
        "kr": "그녀는 연습을 통해 그림 그리는 기술을 향상시켰어요.",
        "romaji": "Geunyeoneun yeonseupeul tonghae, geurim geurineun gisuleul hyangsangshikyeosseoyo.",
        "en": "She improved her painting skills through practice.",
        "grammar_audio": "/audio/korean/grammar/s_를_통해_reul_tonghae_Through_by_means_of_20250209_그녀는_연습을_통해_그림_그리는_기술을_향상시켰어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~만큼 [mankeum] (As much as)",
    "short_explanation": "Used to express the amount, level, or extent equivalent to a certain standard; 'as much as', 'as...as'.",
    "long_explanation": "'~만큼 [mankeum]' is a postposition used in Korean to demonstrate equivalence in extent, amount, or level with a given reference. It is used to compare two things, implying that they have the same level or quantity. It can be interpreted as 'as much as' or 'as...as' in English.",
    "formation": "Noun/Verb + 만큼",
    "examples": [
      {
        "kr": "그는 그의 친구만큼 열심히 일하지 않아요, 그래서 그의 성과는 항상 작아요.",
        "romaji": "Geuneun geu chingumankeum yeolsimhi ilhaji anhayo, geuraeseo geu seonggwaneun hangsang jagayo.",
        "en": "He does not work as hard as his friend, so his performance is always weak.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_그는_그의_친구만큼_열심히_일하지_않아요_그래서_그의_성과는_항상_작아요.mp3"
      },
      {
        "kr": "나는 배운 만큼 가르칩니다, 그래서 제가 알고 있는 것은 모두 다른 사람들에게 가르쳐 줄 수 있어요.",
        "romaji": "Naneun baeun mankeum gareuchimnida, geuraeseo jega algo issneun geoseun modu dareun saramdeul-ege gareuchyeo jul su isseoyo.",
        "en": "I teach as much as I learn, so I can teach everything I know to others.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_나는_배운_만큼_가르칩니다_그래서_제가_알고_있는_것은_모두_다른_사람들에게_가르쳐_줄_수_있어요.mp3"
      },
      {
        "kr": "우리는 우리가 할 수 있는 만큼 최선을 다하고 있어요. 다른 사람들이 더 잘하더라도 우리는 걱정하지 않아요.",
        "romaji": "Urineun uriga hal su issneun mankeum choeseoneul dahago isseoyo. Dareun saramdeul-i deo jalhadeorado urineun geokjeonghaji anhayo.",
        "en": "We are doing our best as much as we can. Even if others do better, we don’t worry.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_우리는_우리가_할_수_있는_만큼_최선을_다하고_있어요_다른_사람들이_더_잘하더라도_우리는_걱정하지_않아요.mp3"
      },
      {
        "kr": "여행 가서 볼 수 있는 만큼 많은 것을 봤어요. 그래서 많은 추억을 만들었어요.",
        "romaji": "Yeohaeng gaseo bol su issneun mankeum maneun geoseul bwasseoyo. Geuraeseo maneun chueogeul mandeuleosseoyo.",
        "en": "I saw as much as I could on the trip. So I made a lot of memories.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_여행_가서_볼_수_있는_만큼_많은_것을_봤어요_그래서_많은_추억을_만들었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~마저 [majeo] (Even)",
    "short_explanation": "Used to express the unexpected inclusion; 'even'.",
    "long_explanation": "'~마저 [majeo]' is a postposition used in Korean to express the inclusion of someone or something that is not normally expected. It carries a sense of surprise or disbelief, similar to 'even' in English.",
    "formation": "Noun + 마저",
    "examples": [
      {
        "kr": "시험이 너무 어려워서 우리 반 학생들 중에 천재인 민수마저 틀렸어요.",
        "romaji": "Siheomi neomu eoryeowoseo uri ban haksaengdeul jung-e cheonjaein Minsumajeo teullyeosseoyo.",
        "en": "The exam was so difficult that even Minsu, a genius among the students in our class, got it wrong.",
        "grammar_audio": "/audio/korean/grammar/s_마저_majeo_Even_20250209_시험이_너무_어려워서_우리_반_학생들_중에_천재인_민수마저_틀렸어요.mp3"
      },
      {
        "kr": "집에 늦게 왔더니, 엄마마저 잠들어 있었어요.",
        "romaji": "Jibe neutge wassdeoni, eommamajeo jamdeureo isseosseoyo.",
        "en": "I came home late, and even my mom was asleep.",
        "grammar_audio": "/audio/korean/grammar/s_마저_majeo_Even_20250209_집에_늦게_왔더니_엄마마저_잠들어_있었어요.mp3"
      },
      {
        "kr": "오늘은 날씨가 너무 추워서 동물원의 사자마저 숨어버렸어요.",
        "romaji": "Oneuleun nalssiga neomu chuweoseo dongmulwon-ui sajamajeo sumeobeoryeosseoyo.",
        "en": "Today, the weather was so cold that even the lion at the zoo hid.",
        "grammar_audio": "/audio/korean/grammar/s_마저_majeo_Even_20250209_오늘은_날씨가_너무_추워서_동물원의_사자마저_숨어버렸어요.mp3"
      },
      {
        "kr": "그녀는 너무 유명해서 이 작은 마을 사람들마저 그녀를 알고 있어요.",
        "romaji": "Geunyeoneun neomu yumyeonghaeseo i jageun ma-eul saramdeul majeo geunyeoreul algo isseoyo.",
        "en": "She is so famous that even the people in this small village know her.",
        "grammar_audio": "/audio/korean/grammar/s_마저_majeo_Even_20250209_그녀는_너무_유명해서_이_작은_마을_사람들마저_그녀를_알고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~못하다 [mothada] (Cannot)",
    "short_explanation": "Used to express inability or impossibility; 'cannot'.",
    "long_explanation": "'~못하다 [mothada]' is used in Korean with action verbs to indicate that the action cannot be performed. It conveys the speaker’s inability or impossibility to carry out the action.",
    "formation": "Action Verb Stem + 못하다",
    "examples": [
      {
        "kr": "제가 솔직히 한국어를 못 하겠어요, 그래서 계속 연습하고 있습니다.",
        "romaji": "Jega soljikhi hangug-eoleul mothagesseoyo, geuraeseo gyesok yeonseukhago isseoyo.",
        "en": "Honestly, I can’t speak Korean well, so I keep practicing.",
        "grammar_audio": "/audio/korean/grammar/s_못하다_mothada_Cannot_20250209_제가_솔직히_한국어를_못_하겠어요_그래서_계속_연습하고_있습니다.mp3"
      },
      {
        "kr": "이 비 때문에 운동할 수가 없어요, 비가 너무 심하게 내려서 잔디밭이 미끄러워 움직일 수 없어요.",
        "romaji": "I biga ttaemune undonghal suga eopseoyo, biga neomu simhage naeraseo jandibat-i mikkureowo umjigil su eopseoyo.",
        "en": "I can’t exercise in this rain because it’s pouring so hard that the grass is slippery and I can’t move.",
        "grammar_audio": "/audio/korean/grammar/s_못하다_mothada_Cannot_20250209_이_비_때문에_운동할_수가_없어요_비가_너무_심하게_내려서_잔디밭이_미끄러워_움직일_수_없어요.mp3"
      },
      {
        "kr": "내가 웹 개발자로서 이 문제를 해결할 수가 없어요, 코딩 실력이 부족해서 이해를 못 하겠어요.",
        "romaji": "Naega web gaebolja-roseo i munjeleul haegyeolhal suga eopseoyo, coding sillyeogi bujokhaeseo ihaereul mothagesseoyo.",
        "en": "As a web developer, I can’t solve this problem because my coding skills are lacking.",
        "grammar_audio": "/audio/korean/grammar/s_못하다_mothada_Cannot_20250209_내가_웹_개발자로서_이_문제를_해결할_수가_없어요_코딩_실력이_부족해서_이해를_못_하겠어요.mp3"
      },
      {
        "kr": "그는 금연을 못하고 있어요, 담배를 너무 좋아해서 멈출 수가 없는 것 같아요.",
        "romaji": "Geuneun geumyeon-eul mothago isseoyo, dambaeleul neomu joahaseo meomchul suga eobsneun geos gatayo.",
        "en": "He can’t quit smoking because he likes cigarettes too much.",
        "grammar_audio": "/audio/korean/grammar/s_못하다_mothada_Cannot_20250209_그는_금연을_못하고_있어요_담배를_너무_좋아해서_멈출_수가_없는_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "100"
  },
  {
    "title": "~바라다 [barada] (Hope to)",
    "short_explanation": "Used to express the speaker's hope or wish for something.",
    "long_explanation": "'~바라다 [barada]' is used after a verb stem to express a personal hope or wish. It conveys that the speaker looks forward to or wishes for a particular outcome in the future.",
    "formation": "Verb Stem + 바라다",
    "examples": [
      {
        "kr": "저는 당신이 사업에서 성공하기를 바라요, 정말로 당신의 노력이 결실을 맺기를 바라요.",
        "romaji": "Jeoneun dangsin-i sa-eob-eseo seonggonghagil barayo, jeongmallo dangsin-ui noryeog-i gyeolsil-eul matgigil barayo.",
        "en": "I hope you succeed in your business; I really hope that your efforts bear fruit.",
        "grammar_audio": "/audio/korean/grammar/s_바라다_barada_Hope_to_20250209_저는_당신이_사업에서_성공하기를_바라요_정말로_당신의_노력이_결실을_맺기를_바라요.mp3"
      },
      {
        "kr": "우리 모두가 건강하게 살아가기를 바라는 부모님의 마음을 이해할 수 있어요.",
        "romaji": "Uri moduga geonganghage sal-agagil baraneun bumonim-ui ma-eum-eul ihaehal su isseoyo.",
        "en": "I understand the hearts of parents who wish for all of us to live healthily.",
        "grammar_audio": "/audio/korean/grammar/s_바라다_barada_Hope_to_20250209_우리_모두가_건강하게_살아가기를_바라는_부모님의_마음을_이해할_수_있어요.mp3"
      },
      {
        "kr": "교수님이 저에게 대학원에 진학하기를 바라셨어요, 그러나 저는 아직 준비가 안 돼 있어요.",
        "romaji": "Gyosunim-i jeoege daehagwon-e jin-hak-hagil barasyeosseoyo, geureona jeoneun ajik junbiga an dwae isseoyo.",
        "en": "The professor wished for me to go to grad school, but I'm not ready yet.",
        "grammar_audio": "/audio/korean/grammar/s_바라다_barada_Hope_to_20250209_교수님이_저에게_대학원에_진학하기를_바라셨어요_그러나_저는_아직_준비가_안_돼_있어요.mp3"
      },
      {
        "kr": "난 한국어를 유창하게 말하게 될 것이라고 바라지만, 아직 많이 배워야 돼요.",
        "romaji": "Nan hangug-eoreul yuchanghage malhage doel geos-irago barajiman, ajik manhi baewoya dwaeyo.",
        "en": "I hope to speak Korean fluently, but I still have a lot to learn.",
        "grammar_audio": "/audio/korean/grammar/s_바라다_barada_Hope_to_20250209_난_한국어를_유창하게_말하게_될_것이라고_바라지만_아직_많이_배워야_돼요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~밖에 [bakke] (Only, nothing but)",
    "short_explanation": "Used to express limitation; 'only', 'nothing but', or 'except'.",
    "long_explanation": "'~밖에 [bakke]' is used in Korean with negative sentences to indicate that nothing else exists beyond what is mentioned. It emphasizes the limited or exclusive nature of the subject or object.",
    "formation": "Noun + 밖에 + Negative Verb",
    "examples": [
      {
        "kr": "나는 커피밖에 마시지 않아요, 다른 음료는 전혀 마시지 않아요.",
        "romaji": "Naneun keopibakke masiji anhayo, dareun eumryoneun jeonhyeo masiji anhayo.",
        "en": "I only drink coffee; I do not drink any other beverages at all.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Only_nothing_but_20250209_나는_커피밖에_마시지_않아요_다른_음료는_전혀_마시지_않아요.mp3"
      },
      {
        "kr": "이 문제를 해결할 수 있는 사람은 저밖에 없어요, 다른 사람들은 전혀 모르겠어요.",
        "romaji": "I munjeleul haegyeolhal su inneun sarameun jeobakke eopseoyo, dareun saramdeul-eun jeonhyeo moreugesseoyo.",
        "en": "I am the only one who can solve this problem; others have no idea.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Only_nothing_but_20250209_이_문제를_해결할_수_있는_사람은_저밖에_없어요_다른_사람들은_전혀_모르겠어요.mp3"
      },
      {
        "kr": "그는 치킨밖에 안 먹어서 다른 음식을 먹을 수 없어요.",
        "romaji": "Geuneun chikinbakke an meogeoseo dareun eumsigeul meogeul su eopseoyo.",
        "en": "He eats nothing but chicken, so he can't eat other food.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Only_nothing_but_20250209_그는_치킨밖에_안_먹어서_다른_음식을_먹을_수_없어요.mp3"
      },
      {
        "kr": "이게 남은 마지막 기회밖에 없어서 공부를 더 열심히 해야 해요.",
        "romaji": "Ige nameun majimak gihoebakke eopseoseo gongbureul deo yeolsimhi haeya haeyo.",
        "en": "This is the only last chance left, so I have to study harder.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Only_nothing_but_20250209_이게_남은_마지막_기회밖에_없어서_공부를_더_열심히_해야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~본 [bon] (Having experienced)",
    "short_explanation": "Used to express that the speaker has experienced or done something.",
    "long_explanation": "'~본 [bon]' is attached to action verbs to indicate that the speaker has experienced or tried that action. It is typically used when sharing personal experiences or anecdotes.",
    "formation": "Action Verb + 본",
    "examples": [
      {
        "kr": "전 한국어 공부해본 사람으로서 한국어 문법을 가르치는 것이 저의 목표입니다.",
        "romaji": "Jeon hangug-eo gongbuhaebon saram-euroseo hangug-eo munbeobeul gareuchineun geosi jeoui mogpyoibnida.",
        "en": "As someone who has studied Korean, my goal is to teach Korean grammar.",
        "grammar_audio": "/audio/korean/grammar/s_본_bon_Having_experienced_20250209_전_한국어_공부해본_사람으로서_한국어_문법을_가르치는_것이_저의_목표입니다.mp3"
      },
      {
        "kr": "외국에서 살아본 친구가 생각보다 많아서 행복하다.",
        "romaji": "Oegugeseo sarabon chingu-ga saenggakboda manhaseo haengbokhada.",
        "en": "I’m happy because I have more friends who have lived abroad than I expected.",
        "grammar_audio": "/audio/korean/grammar/s_본_bon_Having_experienced_20250209_외국에서_살아본_친구가_생각보다_많아서_행복하다.mp3"
      },
      {
        "kr": "코트를 샀는데, 이런 코트는 처음 입어본다.",
        "romaji": "Koteureul satsneunde, ireon koteuneun cheoeum ibeobonda.",
        "en": "I bought a coat, and it’s the first time I’ve worn one like this.",
        "grammar_audio": "/audio/korean/grammar/s_본_bon_Having_experienced_20250209_코트를_샀는데_이런_코트는_처음_입어본다.mp3"
      },
      {
        "kr": "그리스에 가본 사람이라면, 아테네는 꼭 가봐야 할 도시라고 말할 것입니다.",
        "romaji": "Geuriseue gabon saram-iramyen, ateneuneun ggok gabwaya hal dosirago malhal geosibnida.",
        "en": "If you have been to Greece, you’d say that Athens is a city you must visit.",
        "grammar_audio": "/audio/korean/grammar/s_본_bon_Having_experienced_20250209_그리스에_가본_사람이라면_아테네는_꼭_가봐야_할_도시라고_말할_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~부터가 [buteoga] (Starting from)",
    "short_explanation": "Indicates that the occurrence of an action or state begins at a certain point, time, or place.",
    "long_explanation": "'~부터가 [buteoga]' combines '부터' (starting from) with the subject particle '가' to emphasize that things truly begin from that point. It is used to stress that from that moment or place onward, the state or action is in effect.",
    "formation": "Noun + 부터가",
    "examples": [
      {
        "kr": "나는 아침마다 강의를 듣는데, 오늘부터가 진짜 힘들음을 느꼈어요.",
        "romaji": "Naneun achimmada gangeureul deudneunde, oneulbuteoga jinjja himdeumeul neukkyeosseoyo.",
        "en": "I listen to lectures every morning, and starting from today, I really felt the hardship.",
        "grammar_audio": "/audio/korean/grammar/s_부터가_buteoga_Starting_from_20250209_나는_아침마다_강의를_듣는데_오늘부터가_진짜_힘들음을_느꼈어요.mp3"
      },
      {
        "kr": "사랑은 처음부터가 아니라, 서로를 이해하게 되는 순간부터 시작한다.",
        "romaji": "Sarangeun cheoeumbuteoga anira, seororeul ihaehage doeneun sunganbuteo sijakanda.",
        "en": "Love doesn’t start from the very beginning, but from the moment you begin to understand each other.",
        "grammar_audio": "/audio/korean/grammar/s_부터가_buteoga_Starting_from_20250209_사랑은_처음부터가_아니라_서로를_이해하게_되는_순간부터_시작한다.mp3"
      },
      {
        "kr": "그 일은 월요일부터가 진짜 시작이에요.",
        "romaji": "Geu ireun woryoilbuteoga jinjja sijakieyo.",
        "en": "That work really starts from Monday.",
        "grammar_audio": "/audio/korean/grammar/s_부터가_buteoga_Starting_from_20250209_그_일은_월요일부터가_진짜_시작이에요.mp3"
      },
      {
        "kr": "여름 휴가는 다음 주부터가 시작인데, 이미 준비가 돼 있어요.",
        "romaji": "Yeoreum hyuganeun daeum jubuteoga sijakinde, imi junbiga dwae isseoyo.",
        "en": "Summer vacation starts from next week, and I’m already prepared.",
        "grammar_audio": "/audio/korean/grammar/s_부터가_buteoga_Starting_from_20250209_여름_휴가는_다음_주부터가_시작인데_이미_준비가_돼_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~뿐이다 [ppunida] (Only, just)",
    "short_explanation": "Used to indicate 'only' or 'just'.",
    "long_explanation": "'~뿐이다 [ppunida]' expresses exclusivity by stating that nothing else exists beyond what is mentioned. It is used to emphasize limitation or singularity and is typically found with a negative verb.",
    "formation": "Noun + 뿐이다",
    "examples": [
      {
        "kr": "지금 가진 돈은 오천 원뿐이다. 그래서 먹을 것을 사기엔 부족하다.",
        "romaji": "Jigeum gajin doneun ocheon wonppunida. Geuraeseo meogeul geoseul sagien bujokhada.",
        "en": "All I have now is five thousand won, so it’s not enough to buy food.",
        "grammar_audio": "/audio/korean/grammar/s_뿐이다_ppunida_Only_just_20250209_지금_가진_돈은_오천_원뿐이다_그래서_먹을_것을_사기엔_부족하다.mp3"
      },
      {
        "kr": "내 친구는 너뿐이다. 그래서 네가 나를 도와주지 않으면 큰일 날 거예요.",
        "romaji": "Nae chinguneun neoppunida. Geuraeseo nega nareul dowajugi anheumyeon keunil nal geoyeyo.",
        "en": "My only friend is you. So if you don't help me, I'm in big trouble.",
        "grammar_audio": "/audio/korean/grammar/s_뿐이다_ppunida_Only_just_20250209_내_친구는_너뿐이다_그래서_네가_나를_도와주지_않으면_큰일_날_거예요.mp3"
      },
      {
        "kr": "방 안에는 텔레비전뿐이다. 다른 가구는 아무것도 없다.",
        "romaji": "Bang aneneun tellebijeonppunida. Dareun gaguneun amugeotdo eopda.",
        "en": "There is only a television in the room; there is no other furniture.",
        "grammar_audio": "/audio/korean/grammar/s_뿐이다_ppunida_Only_just_20250209_방_안에는_텔레비전뿐이다_다른_가구는_아무것도_없다.mp3"
      },
      {
        "kr": "제 친구들 중에서, 제 이야기를 들어줄 수 있는 사람은 누나뿐이다.",
        "romaji": "Je chingudeul jungeseo, je yaegireul deureojul su inneun sarameun nunappunida.",
        "en": "Among my friends, only my older sister is someone who can listen to my stories.",
        "grammar_audio": "/audio/korean/grammar/s_뿐이다_ppunida_Only_just_20250209_제_친구들_중에서_제_이야기를_들어줄_수_있는_사람은_누나뿐이다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~사이에서 [saieseo] (Between)",
    "short_explanation": "Used to indicate 'between' or 'among'.",
    "long_explanation": "'~사이에서 [saieseo]' is a postposition used in Korean to denote a position within a range or to specify a selection between multiple options. It is used with both tangible objects and abstract choices.",
    "formation": "Noun + 사이에서",
    "examples": [
      {
        "kr": "어느 색깔을 고를까요? 파란색과 빨간색 사이에서 너무 힘든 선택이에요.",
        "romaji": "Eoneu saekkareul goreulkka yo? Paran saekkwa bbalgan saek saieseo neomu himdeun seontaegieyo.",
        "en": "Which color should I choose? It’s a tough choice between blue and red.",
        "grammar_audio": "/audio/korean/grammar/s_사이에서_saieseo_Between_20250209_어느_색깔을_고를까요_파란색과_빨간색_사이에서_너무_힘든_선택이에요.mp3"
      },
      {
        "kr": "성수동과 건대 사이에서 카페를 찾고 있어요.",
        "romaji": "Seongsudonggwa Geondae saieseo kape-reul chatgo isseoyo.",
        "en": "I'm looking for a café between Seongsu-dong and Konkuk University.",
        "grammar_audio": "/audio/korean/grammar/s_사이에서_saieseo_Between_20250209_성수동과_건대_사이에서_카페를_찾고_있어요.mp3"
      },
      {
        "kr": "올해 여름동안, 둘 사이에서 결정을 내려야 합니다: 여행을 갈지 아니면 집에서 쉴지.",
        "romaji": "Olhae yeoreum dongan, dul saieseo gyeoljeongeul naeryeoya hamnida: yeohaengeul galji animyeon jibeseo swilji.",
        "en": "This summer, I have to decide between two options: whether to travel or to stay home and rest.",
        "grammar_audio": "/audio/korean/grammar/s_사이에서_saieseo_Between_20250209_올해_여름동안_둘_사이에서_결정을_내려야_합니다:_여행을_갈지_아니면_집에서_쉴지.mp3"
      },
      {
        "kr": "10살과 15살 사이에서 가장 좋아하는 영화를 선택해야 했어요.",
        "romaji": "Sip sal gwa sip-oship sal saieseo gajang johahaneun yeonghwaleul seontaekhaeya haesseoyo.",
        "en": "I had to choose my favorite movie between the ages of 10 and 15.",
        "grammar_audio": "/audio/korean/grammar/s_사이에서_saieseo_Between_20250209_10살과_15살_사이에서_가장_좋아하는_영화를_선택해야_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~서야 [seoya] (Only after)",
    "short_explanation": "Used to indicate that a result is possible only if a preceding action or condition is fulfilled.",
    "long_explanation": "'~서야 [seoya]' is formed by attaching the ending '-서야' to a verb stem. It expresses that only when the preceding action is done (or the condition is met) can the subsequent result occur.",
    "formation": "Verb stem + 서야",
    "examples": [
      {
        "kr": "공부를 열심히 해서야 시험에서 좋은 점수를 받을 수 있어요.",
        "romaji": "Gongbu-reul yeolsimhi haeseoya siheom-eseo joheun jeom-su badeul su isseoyo.",
        "en": "You can only get a good score on the test after studying hard.",
        "grammar_audio": "/audio/korean/grammar/s_서야_seoya_Only_after_20250209_공부를_열심히_해서야_시험에서_좋은_점수를_받을_수_있어요.mp3"
      },
      {
        "kr": "나는 집에 돌아와서 커피를 마셔야 일을 할 수 있어요.",
        "romaji": "Naneun jib-e dorawaseoya keopi-reul masheoya ireul hal su isseoyo.",
        "en": "I can only work after I come home and have coffee.",
        "grammar_audio": "/audio/korean/grammar/s_서야_seoya_Only_after_20250209_나는_집에_돌아와서_커피를_마셔야_일을_할_수_있어요.mp3"
      },
      {
        "kr": "그녀는 강당에 도착해서야 그녀가 출연할 것임을 깨달았어요.",
        "romaji": "Geunyeoneun gangdang-e dochakhaseoya geunyeoga chul-yeonhal geos-im-eul kkaedal-ass-eoyo.",
        "en": "It was only after she arrived at the lecture hall that she realized she was going to speak.",
        "grammar_audio": "/audio/korean/grammar/s_서야_seoya_Only_after_20250209_그녀는_강당에_도착해서야_그녀가_출연할_것임을_깨달았어요.mp3"
      },
      {
        "kr": "부모님에게 전화해서야 어제 일어난 사고에 대해 알게 되었어요.",
        "romaji": "Bumonim-ege jeonhwahaseoya eoje il-eonan sago-e daehae alge doeeoss-eoyo.",
        "en": "It was only after calling my parents that I learned about the accident that happened yesterday.",
        "grammar_audio": "/audio/korean/grammar/s_서야_seoya_Only_after_20250209_부모님에게_전화해서야_어제_일어난_사고에_대해_알게_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~소서 [soseo] (Polite way to apologize for an action)",
    "short_explanation": "Used to express apology or regret in a very polite and formal manner.",
    "long_explanation": "The verb ending '~소서 [soseo]' is an archaic and formal way to apologize or express deep regret. It is typically used in formal or public settings, especially when addressing someone of higher status, to show sincere remorse and respect.",
    "formation": "Verb stem + ~소서",
    "examples": [
      {
        "kr": "내가 네게 힘들게 하였소서, 이제 나 아닌 다른 사람을 찾아가시오.",
        "romaji": "Naega nege himdeulge hayeotssoseo, ije na anin dareun saram-eul chajagasyo.",
        "en": "I am sorry that I have caused you hardship; now please find someone other than me.",
        "grammar_audio": "/audio/korean/grammar/s_소서_soseo_Polite_way_to_apologize_for_an_action_20250209_내가_네게_힘들게_하였소서_이제_나_아닌_다른_사람을_찾아가시오.mp3"
      },
      {
        "kr": "일을 까먹었소서, 너무 바빠서 정말 기억나지 않았어요.",
        "romaji": "Ireul kkameogeotssoseo, neomu bappaseo jeongmal gieoknazji anhatssoyo.",
        "en": "I am sorry that I forgot the work; I really couldn’t remember because I was too busy.",
        "grammar_audio": "/audio/korean/grammar/s_소서_soseo_Polite_way_to_apologize_for_an_action_20250209_일을_까먹었소서_너무_바빠서_정말_기억나지_않았어요.mp3"
      },
      {
        "kr": "그때 과연 말을 잘못 보냈소서, 정말 죄송합니다.",
        "romaji": "Geuttae gwayeon maleul jalmot bonaetssoseo, jeongmal joesonghamnida.",
        "en": "I am sorry that I sent the wrong message at that time; I am truly sorry.",
        "grammar_audio": "/audio/korean/grammar/s_소서_soseo_Polite_way_to_apologize_for_an_action_20250209_그때_과연_말을_잘못_보냈소서_정말_죄송합니다.mp3"
      },
      {
        "kr": "너무 늦었소서, 지금부터 빨리 하겠습니다.",
        "romaji": "Neomu neujeotsseoseo, jigeumbuteo ppalli hagetsseumnida.",
        "en": "I am sorry that I am too late; I will do it quickly from now on.",
        "grammar_audio": "/audio/korean/grammar/s_소서_soseo_Polite_way_to_apologize_for_an_action_20250209_너무_늦었소서_지금부터_빨리_하겠습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~않게 [anhge] (So as not to)",
    "short_explanation": "Used to express doing something in such a way as to prevent a certain outcome.",
    "long_explanation": "'~않게 [anhge]' is a grammatical construction formed by attaching ‘않게’ to a verb stem. It expresses the speaker’s intention to avoid or prevent an action, situation, or condition from occurring – similar to saying 'so as not to' in English.",
    "formation": "Verb stem + 않게",
    "examples": [
      {
        "kr": "어떤 문제가 생기지 않게 미리 준비하세요.",
        "romaji": "Eotteon munjega saenggiji anhge miri junbihaseyo.",
        "en": "Prepare in advance so that no problems occur.",
        "grammar_audio": "/audio/korean/grammar/s_않게_anhge_So_as_not_to_20250209_어떤_문제가_생기지_않게_미리_준비하세요.mp3"
      },
      {
        "kr": "아무도 당황하지 않게 시간을 정확하게 준수해야 합니다.",
        "romaji": "Amudo danghwanghaji anhge siganeul jeonghwakhage junsuhaeya hamnida.",
        "en": "We need to keep time precisely so that no one is flustered.",
        "grammar_audio": "/audio/korean/grammar/s_않게_anhge_So_as_not_to_20250209_아무도_당황하지_않게_시간을_정확하게_준수해야_합니다.mp3"
      },
      {
        "kr": "늦지 않게 학교에 도착하려면 일찍 출발해야 합니다.",
        "romaji": "Neujji anhge hakgyoe dochakharyeomyeon iljjik chulbalhaeya hamnida.",
        "en": "To arrive at school on time, you should leave early.",
        "grammar_audio": "/audio/korean/grammar/s_않게_anhge_So_as_not_to_20250209_늦지_않게_학교에_도착하려면_일찍_출발해야_합니다.mp3"
      },
      {
        "kr": "자신을 다치게 하지 않게 조심하려면 안전 지침을 따라야 합니다.",
        "romaji": "Jasineul dachige haji anhge josimharyeomyeon anjeon gichimeul ddaraya hamnida.",
        "en": "To avoid hurting yourself, you should follow the safety guidelines.",
        "grammar_audio": "/audio/korean/grammar/s_않게_anhge_So_as_not_to_20250209_자신을_다치게_하지_않게_조심하려면_안전_지침을_따라야_합니다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 버리다 [a/eo beorida] (To completely)",
    "short_explanation": "Used to emphasize that an action is done completely or to its end.",
    "long_explanation": "The phrase '~아/어 버리다 [a/eo beorida]' attaches to a verb stem to indicate that an action is carried out completely or thoroughly, often adding a sense of finality. Depending on the context, it may express regret, surprise, or relief. This form is common in casual spoken Korean.",
    "formation": "Verb stem + ~아/어 버리다",
    "examples": [
      {
        "kr": "저는 갑자기 발렌타인 데이 카드를 빠르게 만들어 버렸어요, 그런데 매우 만족스럽습니다.",
        "romaji": "Jeoneun gapjagi balrentain dei kadeu-reul ppareuge mandeureo beoryeosseoyo, geureonde maeu manjokseureopseumnida.",
        "en": "I suddenly made a Valentine’s Day card quickly, and I am very satisfied.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_To_completely_20250209_저는_갑자기_발렌타인_데이_카드를_빠르게_만들어_버렸어요_그런데_매우_만족스럽습니다.mp3"
      },
      {
        "kr": "객실 청소를 기다리다가 결국 나는 그냥 전부 청소해 버렸어요.",
        "romaji": "Gaesil cheongso-reul gidaridaga gyeolguk naneun geunyang jeonbu cheongsohae beoryeosseoyo.",
        "en": "After waiting for the room to be cleaned, I ended up cleaning it all myself.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_To_completely_20250209_객실_청소를_기다리다가_결국_나는_그냥_전부_청소해_버렸어요.mp3"
      },
      {
        "kr": "나는 돼지고기를 너무 좋아해서 한 번에 다 먹어 버렸어요.",
        "romaji": "Naneun dwaejigogireul neomu joahaseo han beone da meogeobeoryeosseoyo.",
        "en": "I like pork so much that I ate it all at once.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_To_completely_20250209_나는_돼지고기를_너무_좋아해서_한_번에_다_먹어_버렸어요.mp3"
      },
      {
        "kr": "농담을 너무 심하게 해서 친구가 서운해할까봐 걱정한 나머지, 결국 죄송해 버렸어요.",
        "romaji": "Nongdameul neomu simhage haeseo chinguga seounhae halkkabwa geokjeonghan nameoji, gyeolguk joesonghae beoryeosseoyo.",
        "en": "I made such a harsh joke that, out of worry that my friend might be hurt, I ended up apologizing.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_To_completely_20250209_농담을_너무_심하게_해서_친구가_서운해할까봐_걱정한_나머지_결국_죄송해_버렸어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 놓다 [a/eo notda] (To have done something in advance)",
    "short_explanation": "Used to indicate that an action was performed ahead of time in preparation for something else.",
    "long_explanation": "'~아/어 놓다 [a/eo notda]' is used to express that an action has been done beforehand—either to prepare for a future event or to leave something in a completed state. This form is common in everyday conversation and adds nuance to your sentence structure.",
    "formation": "Verb stem + 아/어 놓다",
    "examples": [
      {
        "kr": "나는 내일 아침에 바쁠 것을 생각하고 오늘 저녁에 아침 식사를 만들어 놓았어요.",
        "romaji": "Naneun naeil achime bappeul geoseu saenggakago oneul jeonyeoge achim siksareul mandeureo noasseoyo.",
        "en": "I made breakfast tonight in anticipation of being busy tomorrow morning.",
        "grammar_audio": "/audio/korean/grammar/s_아어_놓다_aeo_notda_To_have_done_something_in_advance_20250209_나는_내일_아침에_바쁠_것을_생각하고_오늘_저녁에_아침_식사를_만들어_놓았어요.mp3"
      },
      {
        "kr": "시험 준비를 위해 이번 주 동안 모든 강의 노트를 미리 쓰고 놓았어요.",
        "romaji": "Siheom junbireul wihae ibeon ju dongan modeun gangui noteureul miri sseo noasseoyo.",
        "en": "I wrote all my lecture notes in advance this week to prepare for the exam.",
        "grammar_audio": "/audio/korean/grammar/s_아어_놓다_aeo_notda_To_have_done_something_in_advance_20250209_시험_준비를_위해_이번_주_동안_모든_강의_노트를_미리_쓰고_놓았어요.mp3"
      },
      {
        "kr": "우리는 피서 가기 전에 집안 청소를 하고 놓았어요.",
        "romaji": "Ulineun pisoga gagi jeone jipan cheongsoreul hago noasseoyo.",
        "en": "We cleaned the house in preparation for our vacation.",
        "grammar_audio": "/audio/korean/grammar/s_아어_놓다_aeo_notda_To_have_done_something_in_advance_20250209_우리는_피서_가기_전에_집안_청소를_하고_놓았어요.mp3"
      },
      {
        "kr": "오늘은 친구들이 와서 미리 음식을 만들어 놓을 거예요.",
        "romaji": "Oneuleun chingudeuli waseo miri eumsigeul mandeureo noheul geoyeyo.",
        "en": "My friends are coming over today, so I'm going to prepare the food in advance.",
        "grammar_audio": "/audio/korean/grammar/s_아어_놓다_aeo_notda_To_have_done_something_in_advance_20250209_오늘은_친구들이_와서_미리_음식을_만들어_놓을_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 달라다 [a/eo dallada] (To ask for)",
    "short_explanation": "Used to make a request or ask someone to do something.",
    "long_explanation": "'~아/어 달라다 [a/eo dallada]' is a form derived from the verb '달라하다' used when requesting or asking someone to do something. It is formed by conjugating the verb into its 아/어 form and then adding 달라다.",
    "formation": "Verb (아/어 form) + 달라다",
    "examples": [
      {
        "kr": "제 친구가 매우 배가 고파서, '빨리 밥을 줘 달라'고 말했어요.",
        "romaji": "Je chinguga maeu baega gopaseo, 'ppalli babeul jwo dalla'go malhaesseoyo.",
        "en": "My friend was very hungry, so he asked, 'Give me food quickly.'",
        "grammar_audio": "/audio/korean/grammar/s_아어_달라다_aeo_dallada_To_ask_for_20250209_제_친구가_매우_배가_고파서_빨리_밥을_줘_달라고_말했어요.mp3"
      },
      {
        "kr": "머리가 너무 아파서, '약 좀 주어 달라'고 요청했어요.",
        "romaji": "Meoriga neomu apaseo, 'yak jom jueo dalla'go yocheonghaesseoyo.",
        "en": "I had a severe headache, so I asked for some medicine.",
        "grammar_audio": "/audio/korean/grammar/s_아어_달라다_aeo_dallada_To_ask_for_20250209_머리가_너무_아파서_약_좀_주어_달라고_요청했어요.mp3"
      },
      {
        "kr": "집이 너무 더워서, '에어컨 좀 틀어 달라'고 부탁했어요.",
        "romaji": "Jibi neomu deoweoseo, 'eokon jom teureo dalla'go butakhaesseoyo.",
        "en": "It was so hot in the house, so I asked, 'Please turn on the air conditioner.'",
        "grammar_audio": "/audio/korean/grammar/s_아어_달라다_aeo_dallada_To_ask_for_20250209_집이_너무_더워서_에어컨_좀_틀어_달라고_부탁했어요.mp3"
      },
      {
        "kr": "커피가 너무 맛있어서, '한 잔만 더 줘 달라'고 말했어요.",
        "romaji": "Keopiga neomu masisseoseo, 'han janman deo jwo dalla'go malhaesseoyo.",
        "en": "The coffee was so delicious that I asked, 'Please give me one more cup.'",
        "grammar_audio": "/audio/korean/grammar/s_아어_달라다_aeo_dallada_To_ask_for_20250209_커피가_너무_맛있어서_한_잔만_더_줘_달라고_말했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 대다 [a/eo daeda] (To do aimlessly)",
    "short_explanation": "Used to indicate that an action is done without a clear purpose or merely out of idleness.",
    "long_explanation": "'~아/어 대다 [a/eo daeda]' attaches to a verb stem to express that the action is performed aimlessly, without proper thought, or in an idle, unproductive manner.",
    "formation": "Verb stem + 아/어 + 대다",
    "examples": [
      {
        "kr": "제가 그냥 막 쇼핑을 하다 대다 결국 비싼 옷을 샀어요.",
        "romaji": "Jega geunyang mak syoping-eul hada daeda gyeolguk bissan os-eul sass-eoyo.",
        "en": "I was shopping around aimlessly and ended up buying expensive clothes.",
        "grammar_audio": "/audio/korean/grammar/s_아어_대다_aeo_daeda_To_do_aimlessly_20250209_제가_그냥_막_쇼핑을_하다_대다_결국_비싼_옷을_샀어요.mp3"
      },
      {
        "kr": "시험기간이지만 그는 그냥 책을 들여다보다 대다 시간을 다 보냈어요.",
        "romaji": "Siheomgiganijiman geuneun geunyang chaeg-eul deulyeodaboda daeda sigan-eul da bonaess-eoyo.",
        "en": "Even though it was exam period, he just idly looked at his books and passed the time.",
        "grammar_audio": "/audio/korean/grammar/s_아어_대다_aeo_daeda_To_do_aimlessly_20250209_시험기간이지만_그는_그냥_책을_들여다보다_대다_시간을_다_보냈어요.mp3"
      },
      {
        "kr": "소리를 들으면서 그녀는 그냥 거리를 걷다 대다 음식점을 놓쳤어요.",
        "romaji": "Soli reul deureumyeonseo geunyeoneun geunyang georireul geotda daeda eumsikjeom-eul nohchyeoss-eoyo.",
        "en": "While listening to music, she was aimlessly walking down the street and missed the restaurant.",
        "grammar_audio": "/audio/korean/grammar/s_아어_대다_aeo_daeda_To_do_aimlessly_20250209_소리를_들으면서_그녀는_그냥_거리를_걷다_대다_음식점을_놓쳤어요.mp3"
      },
      {
        "kr": "나는 지루해서 그냥 인터넷을 서핑하다 대다 알게 된 사이트에서 책을 구입했다.",
        "romaji": "Naneun jiluhaeseo geunyang inteonet-eul seopinghada daeda alge doen saiteu-eseo chaeg-eul gu-ibhaetda.",
        "en": "Bored, I was aimlessly surfing the internet and ended up buying a book from a site I found.",
        "grammar_audio": "/audio/korean/grammar/s_아어_대다_aeo_daeda_To_do_aimlessly_20250209_나는_지루해서_그냥_인터넷을_서핑하다_대다_알게_된_사이트에서_책을_구입했다.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 보이다 [a/eo boida] (To seem, appear)",
    "short_explanation": "Used to express that something appears or seems to be a certain way.",
    "long_explanation": "The grammar point '~아/어 보이다 [a/eo boida]' is used to indicate that something looks or appears a certain way according to the speaker's perception or judgment. It is often used to describe appearances, conditions, or states based on external observation.",
    "formation": "Verb stem + 아/어 + 보이다",
    "examples": [
      {
        "kr": "그 여자는 매우 행복해 보이는데, 실제로는 아마 막대한 스트레스를 받고 있을 것 같아요.",
        "romaji": "Geu yeojaneun maeu haengbokhae boineunde, siljero-neun ama makdaehan seuteureseuleul badgo isseul geos gatayo.",
        "en": "That woman seems very happy, but in reality, she is probably under a lot of stress.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_To_seem_appear_20250209_그_여자는_매우_행복해_보이는데_실제로는_아마_막대한_스트레스를_받고_있을_것_같아요.mp3"
      },
      {
        "kr": "오늘은 날씨가 참 좋아 보이네요, 외출하기에 좋은 날인 것 같아요.",
        "romaji": "Oneuleun nalssiga cham joah boineyo, oechulhagi-e joheun narin geos gatayo.",
        "en": "The weather seems really nice today; it appears to be a good day to go out.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_To_seem_appear_20250209_오늘은_날씨가_참_좋아_보이네요_외출하기에_좋은_날인_것_같아요.mp3"
      },
      {
        "kr": "이 케이크는 달해 보이지만, 실제로는 그렇게 달지 않아요.",
        "romaji": "Ii keikeuneun dalhae boijiman, siljero-neun geureoke dalji anhayo.",
        "en": "This cake seems sweet, but it isn’t actually that sweet.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_To_seem_appear_20250209_이_케이크는_달해_보이지만_실제로는_그렇게_달지_않아요.mp3"
      },
      {
        "kr": "나는 피곤해 보인다고 친구가 말했어요, 하지만 저는 그렇게 느낀 적이 없어요.",
        "romaji": "Naneun pigonhae boindago chinguga malhaesseoyo, hajiman jeoneun geureoke neukkin jeogi eobseoyo.",
        "en": "My friend said I looked tired, but I’ve never felt that way.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_To_seem_appear_20250209_나는_피곤해_보인다고_친구가_말했어요_하지만_저는_그렇게_느낀_적이_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어 서는 [a/eo seoneun] (Although)",
    "short_explanation": "Used to express a contrast or contrary expectation; 'although' or 'but'.",
    "long_explanation": "'~아/어 서는 [a/eo seoneun]' is used to present a situation that contrasts with or contradicts an expectation. It can be translated as 'although' or 'but' and highlights an unexpected or contrary fact.",
    "formation": "Verb stem + 아/어 서는",
    "examples": [
      {
        "kr": "날씨가 춥다고 해서는 외출을 안 했는데, 실제로는 그리 춥지 않았어요.",
        "romaji": "Nalssiga chubdago haeseoneun oechuleul an haenneunde, siljero-neun geuri chubji anhasseoyo.",
        "en": "Although they said it was cold, I didn’t go out; in fact, it wasn’t that cold.",
        "grammar_audio": "/audio/korean/grammar/s_아어_서는_aeo_seoneun_Although_20250209_날씨가_춥다고_해서는_외출을_안_했는데_실제로는_그리_춥지_않았어요.mp3"
      },
      {
        "kr": "헬스장에 자주 가서는 운동을 열심히 했는데, 체중은 거의 줄지 않았어요.",
        "romaji": "Helthjange jaju gaseoneun undongeul yeolsimhi haenneunde, chejungeun geojeul julji anhasseoyo.",
        "en": "Although I went to the gym frequently and worked out hard, my weight barely decreased.",
        "grammar_audio": "/audio/korean/grammar/s_아어_서는_aeo_seoneun_Although_20250209_헬스장에_자주_가서는_운동을_열심히_했는데_체중은_거의_줄지_않았어요.mp3"
      },
      {
        "kr": "열심히 공부해서는 시험을 잘 보려고 했는데, 결과는 좋지 않았어요.",
        "romaji": "Yeolsimhi gongbuhaseoneun siheomeul jal boryeogo haenneunde, gyulegwaneun joaji anhasseoyo.",
        "en": "Although I studied hard to do well on the exam, the result wasn’t good.",
        "grammar_audio": "/audio/korean/grammar/s_아어_서는_aeo_seoneun_Although_20250209_열심히_공부해서는_시험을_잘_보려고_했는데_결과는_좋지_않았어요.mp3"
      },
      {
        "kr": "저는 열심히 외워서는 공연 때 잘 했다고 생각했는데, 실수를 많이 했어요.",
        "romaji": "Jeoneun yeolsimhi weowoseoneun gongyeon ttae jal haetdago saenggakhaenneunde, silsureul mani haesseoyo.",
        "en": "Although I memorized it thoroughly and thought I did well during the performance, I ended up making many mistakes.",
        "grammar_audio": "/audio/korean/grammar/s_아어_서는_aeo_seoneun_Although_20250209_저는_열심히_외워서는_공연_때_잘_했다고_생각했는데_실수를_많이_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어야만 [a/eoyaman] (Only if/when)",
    "short_explanation": "Used to express a condition that only if/when something happens, something else will or can occur.",
    "long_explanation": "The phrase '~아/어야만' is a conditional form in Korean that expresses the idea that only if/when a certain condition is satisfied can an expected result occur. This grammar point indicates that an action or state is contingent on a condition being fulfilled; without that condition, the action or state is impossible. It is often used with potential or hypothetical situations.",
    "formation": "Verb + 아/어야만 (Depending on the final vowel of the verb stem)",
    "examples": [
      {
        "kr": "고등학교를 졸업해야만 대학교에 들어갈 수 있어요.",
        "romaji": "Godeunghakgyoreul joreobhaeyaman daehakgyoe deuleogal su isseoyo.",
        "en": "You can only go to university if you graduate from high school.",
        "grammar_audio": "/audio/korean/grammar/s_아어야만_aeoyaman_Only_ifwhen_20250209_고등학교를_졸업해야만_대학교에_들어갈_수_있어요.mp3"
      },
      {
        "kr": "그 영화를 위해 꼭 티켓을 예약해야만 볼 수 있어요.",
        "romaji": "Geu yeonghwareul wihae ggok tikeseul yeyakhaeyaman bol su isseoyo.",
        "en": "You can only watch that movie if you book the tickets in advance.",
        "grammar_audio": "/audio/korean/grammar/s_아어야만_aeoyaman_Only_ifwhen_20250209_그_영화를_위해_꼭_티켓을_예약해야만_볼_수_있어요.mp3"
      },
      {
        "kr": "목표를 이루려면 하루하루 열심히 일해야만 해요.",
        "romaji": "Mokpyoreul iruryeomyeon haruharu yeolsimhi ilhaeyaman haeyo.",
        "en": "In order to achieve your goal, you have to work hard every day.",
        "grammar_audio": "/audio/korean/grammar/s_아어야만_aeoyaman_Only_ifwhen_20250209_목표를_이루려면_하루하루_열심히_일해야만_해요.mp3"
      },
      {
        "kr": "거기에 가려면 버스를 타야만 해요, 지하철로는 갈 수 없어요.",
        "romaji": "Geogie garyeomyeon beoseureul taya haeyaman haeyo, jihacheoroneun gal su eopsseoyo.",
        "en": "To get there, you have to take a bus; it's not possible to go by subway.",
        "grammar_audio": "/audio/korean/grammar/s_아어야만_aeoyaman_Only_ifwhen_20250209_거기에_가려면_버스를_타야만_해요_지하철로는_갈_수_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~아/어지다 [a/eojida] (To become)",
    "short_explanation": "Used to express a change of state, meaning 'to become'.",
    "long_explanation": "'~아/어지다' is a verb ending used in Korean to indicate a change in state, condition, or emotion—essentially, 'to become'. The ending is chosen based on the vowel in the preceding syllable (use '아지다' after ㅏ or ㅗ, and '어지다' for all other vowels). It is often used to show a transition from one state to another.",
    "formation": "Action verb stem + (~아/어지다)",
    "examples": [
      {
        "kr": "날씨가 갑자기 추워져서 난로를 켜야 했어요.",
        "romaji": "Nalssiga gapjagi chuweojyeoseo nanroleul kyeoya haesseoyo.",
        "en": "The weather suddenly became cold, so I had to turn on the heater.",
        "grammar_audio": "/audio/korean/grammar/s_아어지다_aeojida_To_become_20250209_날씨가_갑자기_추워져서_난로를_켜야_했어요.mp3"
      },
      {
        "kr": "작년에는 일을 너무 많이 해서 피곤해서 쉴 시간이 없어져서 힘들었어요.",
        "romaji": "Jaknyeoneun ireul neomu manihaseo pigonhaeseo swil sigan-i eobseojyeoseo himdeureoss-eoyo.",
        "en": "Last year, I worked so much that I became tired and had no time to rest, so it was tough.",
        "grammar_audio": "/audio/korean/grammar/s_아어지다_aeojida_To_become_20250209_작년에는_일을_너무_많이_해서_피곤해서_쉴_시간이_없어져서_힘들었어요.mp3"
      },
      {
        "kr": "친구가 바빠지니까 자주 만날 수 없게 됐어요.",
        "romaji": "Chinguga bappajinikkaji jaju mannal su eobge dwaesseoyo.",
        "en": "Since my friend became busy, we couldn't meet as often.",
        "grammar_audio": "/audio/korean/grammar/s_아어지다_aeojida_To_become_20250209_친구가_바빠지니까_자주_만날_수_없게_됐어요.mp3"
      },
      {
        "kr": "음식이 너무 많아져서 한 번에 다 먹을 수 없었어요.",
        "romaji": "Eumsigi neomu manhajyeoseo han beone da meogeul su eopseosseoyo.",
        "en": "The food became so abundant that I couldn't eat it all at once.",
        "grammar_audio": "/audio/korean/grammar/s_아어지다_aeojida_To_become_20250209_음식이_너무_많아져서_한_번에_다_먹을_수_없었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~았/었 던 [at/eot deon] (Past descriptive)",
    "short_explanation": "Used to describe past events or situations from the speaker's memory.",
    "long_explanation": "'~았/었 던' is a past descriptive form in Korean used to recall an event, person, or situation that occurred in the past. It is commonly attached to a verb (forming '보던') when modifying a noun and expresses a past state or memory from the speaker’s perspective.",
    "formation": "Verb in past tense (~았/었) + 던 (attached before a noun)",
    "examples": [
      {
        "kr": "제가 어릴 때 즐겨 보던 애니메이션 쇼를 어제 다시 보았어요, 많은 추억이 떠올랐어요.",
        "romaji": "Jega eoril ttae jeulgyeo bodon aenimeisyeon syoreul eoje dasi boasseoyo, manheun chueogi tteooreosseoyo.",
        "en": "I watched the animation show I used to enjoy as a kid again yesterday, and many memories came flooding back.",
        "grammar_audio": "/audio/korean/grammar/s_았었_던_ateot_deon_Past_descriptive_20250209_제가_어릴_때_즐겨_보던_애니메이션_쇼를_어제_다시_보았어요_많은_추억이_떠올랐어요.mp3"
      },
      {
        "kr": "그는 5년 전에 만났던 친구와 오랜만에 다시 만났어요.",
        "romaji": "Geuneun 5nyeon jeone mannatdeon chinguwa oraenman-e dasi mannatseoyo.",
        "en": "He met a friend he had met 5 years ago after a long time.",
        "grammar_audio": "/audio/korean/grammar/s_았었_던_ateot_deon_Past_descriptive_20250209_그는_5년_전에_만났던_친구와_오랜만에_다시_만났어요.mp3"
      },
      {
        "kr": "여름에 가봤던 해변에 다시 가고 싶어요.",
        "romaji": "Yeoreum-e gabwatdeon haebyeone dasi gago sipeoyo.",
        "en": "I want to go back to the beach I visited in the summer.",
        "grammar_audio": "/audio/korean/grammar/s_았었_던_ateot_deon_Past_descriptive_20250209_여름에_가봤던_해변에_다시_가고_싶어요.mp3"
      },
      {
        "kr": "저는 학교에서 만났던 친구들과 지금도 친하게 지내요.",
        "romaji": "Jeoneun hakgyoeso mannatdeon chingudeulgwa jigeumdo chinhage jinaeyo.",
        "en": "I am still close with the friends I met at school.",
        "grammar_audio": "/audio/korean/grammar/s_았었_던_ateot_deon_Past_descriptive_20250209_저는_학교에서_만났던_친구들과_지금도_친하게_지내요.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  },
  {
    "title": "~았/었으면 좋겠다 [at/eosseumyeon jokgetda] (Wish something had happened)",
    "short_explanation": "Used to express a wish or hope that something had occurred in the past.",
    "long_explanation": "'~았/었으면 좋겠다' is a grammar construction in Korean that expresses a speaker's wish or regret about a past event that did not occur. By combining a verb in the past tense with '으면 좋겠다', it conveys a longing for a different past outcome.",
    "formation": "Verb (past tense) + 았/었으면 좋겠다",
    "examples": [
      {
        "kr": "회사에 보고하러 갔었으면 좋겠다, 그러면 지금 이렇지 않았을 텐데.",
        "romaji": "Hoesae bogoharerogasseosseumyeon jokgetda, geureomyeon jigeum ireotji anhasseultende.",
        "en": "I wish I had gone to report to the company; then I wouldn't be like this now.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_좋겠다_ateosseumyeon_jokgetda_Wish_something_had_happened_20250209_회사에_보고하러_갔었으면_좋겠다_그러면_지금_이렇지_않았을_텐데.mp3"
      },
      {
        "kr": "당신을 더 일찍 알았었으면 좋겠다, 그렇게 되면 많은 문제를 피할 수 있었을 텐데.",
        "romaji": "Dangsineul deo iljjik arasseosseumyeon jokgetda, geureohge doemyeon manheun munjeleul pihal su isseosseultende.",
        "en": "I wish I had known you sooner; then I could have avoided many problems.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_좋겠다_ateosseumyeon_jokgetda_Wish_something_had_happened_20250209_당신을_더_일찍_알았었으면_좋겠다_그렇게_되면_많은_문제를_피할_수_있었을_텐데.mp3"
      },
      {
        "kr": "난 그날 그를 따랐었으면 좋겠다, 그러면 어떤 경험을 할 수 있었을까?",
        "romaji": "Nan geunal geuleul ttaratseosseumyeon jokgetda, geureomyeon eoddeon gyeongheomeul hal su isseosseulkka?",
        "en": "I wish I had followed him that day—what kind of experience would I have had?",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_좋겠다_ateosseumyeon_jokgetda_Wish_something_had_happened_20250209_난_그날_그를_따랐었으면_좋겠다_그러면_어떤_경험을_할_수_있었을까.mp3"
      },
      {
        "kr": "더 많은 연습을 했었으면 좋겠다, 그래야 내 성과가 더욱 개선될 수 있었을 텐데.",
        "romaji": "Deo manheun yeonseubeul haesseosseumyeon jokgetda, geuraeya nae seonggwaga deouk gaeseondwaesseultende.",
        "en": "I wish I had practiced more, then my performance could have improved even further.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_좋겠다_ateosseumyeon_jokgetda_Wish_something_had_happened_20250209_더_많은_연습을_했었으면_좋겠다_그래야_내_성과가_더욱_개선될_수_있었을_텐데.mp3"
      }
    ],
    "p_tag": "KOREAN_6",
    "s_tag": "125"
  }
]