[
  {
    "title": "不得不 (bùdébù) - Have no choice but, cannot but",
    "short_explanation": "Used to suggest that something is absolutely necessary or unavoidable.",
    "long_explanation": "The Chinese grammar point '不得不 (bùdébù)' is used to show that you have no choice but to do something, it is absolutely necessary or unavoidable, or you're forced to do it. It's kinda like explaining 'I have to...' or 'I must...' in English. When adding this phrase in your sentences, you're expressing the urgency and necessity of the action that follows.",
    "formation": "Subject + 不得不 + Verb + Object",
    "examples": [
      {
        "cn": "因为我迟到了，我不得不赶紧跑去上课。",
        "pinyin": "Yīnwèi wǒ chídàole, wǒ bùdébù gǎnjǐn pǎo qù shàngkè.",
        "en": "Because I was late, I had no choice but to rush to class.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_no_choice_but_cannot_but_20231230_因为我迟到了我不得不赶紧跑去上课.mp3"
      },
      {
        "cn": "天气太热，我们不得不取消了户外活动。",
        "pinyin": "Tiānqì tài rè, wǒmen bùdébù qǔxiāole hùwài huódòng.",
        "en": "The weather is too hot, we had no choice but to cancel the outdoor activities.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_no_choice_but_cannot_but_20231230_天气太热我们不得不取消了户外活动.mp3"
      },
      {
        "cn": "由于飞机延误，他不得不改变他的旅行计划。",
        "pinyin": "Yóuyú fēijī yánwù, tā bùdébù gǎibiàn tā de lǚxíng jìhuà.",
        "en": "Due to the flight delay, he had no choice but to change his travel plans.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_no_choice_but_cannot_but_20231230_由于飞机延误他不得不改变他的旅行计划.mp3"
      },
      {
        "cn": "她不得不接受，这个工作是她的唯一选择。",
        "pinyin": "Tā bùdébù jiēshòu, zhège gōngzuò shì tā de wéiyī xuǎnzé.",
        "en": "She had no choice but to accept, this job was her only choice.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_no_choice_but_cannot_but_20231230_她不得不接受这个工作是她的唯一选择.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "只要...就... (zhǐyào... jiù...) - As long as... then...",
    "short_explanation": "A Chinese construction used to express 'as long as... then...' or 'whenever... then'.",
    "long_explanation": "'只要...就...' (zhǐyào... jiù...) is a common grammar structure in Mandarin Chinese used to elaborate a conditional situation. It depicts the situation where the occurrence of one action is dependent on the fulfilment of another condition. The '只要' (zhǐyào) part represents the condition, while '就' (jiù) introduces the result that follows once the condition is met. This structure is equivalent to the English 'as long as... then...' or 'whenever... then...'.",
    "formation": "只要 (Condition) + 就 (Result)",
    "examples": [
      {
        "cn": "只要你努力，就能成功。",
        "pinyin": "Zhǐyào nǐ nǔlì, jiù néng chénggōng.",
        "en": "As long as you work hard, you can succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你努力就能成功.mp3"
      },
      {
        "cn": "只要有钱，就能买到你想要的东西。",
        "pinyin": "Zhǐyào yǒu qián, jiù néng mǎi dào nǐ xiǎng yào de dōngxī.",
        "en": "As long as you have money, you can buy what you want.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要有钱就能买到你想要的东西.mp3"
      },
      {
        "cn": "只要明天不下雨，我们就去爬山。",
        "pinyin": "Zhǐyào míngtiān bù xià yǔ, wǒmen jiù qù páshān.",
        "en": "As long as it doesn't rain tomorrow, we will go mountain climbing.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要明天不下雨我们就去爬山.mp3"
      },
      {
        "cn": "只要你开心，我就开心。",
        "pinyin": "Zhǐyào nǐ kāixīn, wǒ jiù kāixīn.",
        "en": "As long as you're happy, I'm happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你开心我就开心.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "只有...才... (zhǐyǒu... cái...) - Only if/when... then...",
    "short_explanation": "Used to express the condition 'only if' or 'only when' and the result that follows.",
    "long_explanation": "The Mandarin Chinese construction '只有...才...' roughly translates to 'only if... then...' in English. It sets a necessary and exclusive condition (stated after '只有') for something (expressed after '才') to occur. It is used to emphasize that the result can only happen under the specific condition given, and no other.",
    "formation": "只有 + Condition + 才 + Result",
    "examples": [
      {
        "cn": "只有努力工作，才能成功。",
        "pinyin": "Zhǐyǒu nǔlì gōngzuò, cáinéng chénggōng.",
        "en": "Only if you work hard, then you can succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有努力工作才能成功.mp3"
      },
      {
        "cn": "只有通过HSK考试，才能证明你的汉语水平。",
        "pinyin": "Zhǐyǒu tōngguò HSK kǎoshì, cáinéng zhèngmíng nǐ de Hànyǔ shuǐpíng.",
        "en": "Only if you pass the HSK test, then you can prove your Chinese proficiency.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有通过HSK考试才能证明你的汉语水平.mp3"
      },
      {
        "cn": "只有保持健康，才能享受生活。",
        "pinyin": "Zhǐyǒu bǎochí jiànkāng, cáinéng xiǎngshòu shēnghuó.",
        "en": "Only if you stay healthy, can you enjoy life.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有保持健康才能享受生活.mp3"
      },
      {
        "cn": "只有积累足够的经验，才能成为专家。",
        "pinyin": "Zhǐyǒu jīlěi zúgòu de jīngyàn, cáinéng chéngwéi zhuānjiā.",
        "en": "Only if you accumulate enough experience, can you become an expert.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有积累足够的经验才能成为专家.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "随着 (suízhe) - Along with, in the wake of",
    "short_explanation": "It is used to express that one event or action follows as another event or action progresses.",
    "long_explanation": "The Mandarin Chinese phrase '随着 (suízhe)' is used to indicate that one action or event progresses or changes as another one does. It basically sets up a cause-and-effect relationship between two actions or events, signifying that as one takes place, the other follows. In English, it can be translated to 'along with' or 'in the wake of'.",
    "formation": "随着 + Event 1, Event 2",
    "examples": [
      {
        "cn": "随着科技的发展，人们的生活越来越方便。",
        "pinyin": "Suízhe kējì de fāzhǎn, rénmen de shēnghuó yuè lái yuè fāngbiàn.",
        "en": "As technology develops, people's lives are becoming more and more convenient.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_the_wake_of_20231230_随着科技的发展人们的生活越来越方便.mp3"
      },
      {
        "cn": "随着年龄的增长，他的健康状况日益下降。",
        "pinyin": "Suízhe niánlíng de zēngzhǎng, tā de jiànkāng zhuàngkuàng rìyì xiàjiàng.",
        "en": "With the increase in age, his health is declining day by day.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_the_wake_of_20231230_随着年龄的增长他的健康状况日益下降.mp3"
      },
      {
        "cn": "随着时间的推移，我对这个问题的了解越来越深。",
        "pinyin": "Suízhe shíjiān de tuīyí, wǒ duì zhège wèntí de liǎojiě yuè lái yuè shēn.",
        "en": "With the passage of time, my understanding of this problem is getting deeper and deeper.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_the_wake_of_20231230_随着时间的推移我对这个问题的了解越来越深.mp3"
      },
      {
        "cn": "随着人口的增加，城市的压力也在增大。",
        "pinyin": "Suízhe rénkǒu de zēngjiā, chéngshì de yālì yě zài zēngdà.",
        "en": "Along with the increase in population, the pressure on cities is also increasing.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_the_wake_of_20231230_随着人口的增加城市的压力也在增大.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "不过 (búguò) - But, however",
    "short_explanation": "Used as a conjunction to introduce a contrasting idea or exception.",
    "long_explanation": "不过 is an adverb in Chinese that's equivalent to 'but' or 'however' in English. It is used to introduce a contrasting point or idea. It essentially makes the sentence that follows it serve as an exception or contrast to the sentence that precedes it.",
    "formation": "Sentence 1 + 不过 + Sentence 2",
    "examples": [
      {
        "cn": "我想去中国旅行，不过我没有足够的钱。",
        "pinyin": "Wǒ xiǎng qù Zhōngguó lǚxíng, búguò wǒ méiyǒu zúgòu de qián.",
        "en": "I would like to travel to China, but I don't have enough money.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_But_however_20231230_我想去中国旅行不过我没有足够的钱.mp3"
      },
      {
        "cn": "他很健康，不过他应该吃得更健康一些。",
        "pinyin": "Tā hěn jiànkāng, búguò tā yīnggāi chī dé gèng jiànkāng yīxiē.",
        "en": "He is very healthy, however, he should eat healthier.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_But_however_20231230_他很健康不过他应该吃得更健康一些.mp3"
      },
      {
        "cn": "我喜欢这款手机，不过它的价格有点高。",
        "pinyin": "Wǒ xǐhuan zhè kuǎn shǒujī, búguò tā de jiàgé yǒudiǎn gāo.",
        "en": "I like this mobile phone, but its price is a bit high.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_But_however_20231230_我喜欢这款手机不过它的价格有点高.mp3"
      },
      {
        "cn": "今天的天气很好，不过我必须在家里工作。",
        "pinyin": "Jīntiān de tiānqì hěn hǎo, búguò wǒ bìxū zài jiālǐ gōngzuò.",
        "en": "The weather is good today, however, I have to work at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_But_however_20231230_今天的天气很好不过我必须在家里工作.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "除非 (chúfēi) - Unless",
    "short_explanation": "Used to indicate a condition that must be fulfilled in order for a specific result to occur.",
    "long_explanation": "‘除非 (chúfēi)’ is a conditional conjunction in Mandarin Chinese, equivalent to 'unless' in English. It is used to establish a necessary condition for a particular outcome, implying that without the fulfillment of this condition, the stated result will not occur. It is commonly used in conversational and written Chinese to express contingencies or prerequisites.",
    "formation": "除非 + Condition Clause + ( , / 那么 / 才 ) + Result Clause",
    "examples": [
      {
        "cn": "除非你更努力工作，否则你会丢掉这个工作的。",
        "pinyin": "Chúfēi nǐ gèng nǔlì gōngzuò, fǒuzé nǐ huì diū diào zhège gōngzuò de.",
        "en": "Unless you work harder, you will lose this job.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你更努力工作否则你会丢掉这个工作的.mp3"
      },
      {
        "cn": "除非我们早点出发，否则我们会错过火车的。",
        "pinyin": "Chúfēi wǒmen zǎodiǎn chūfā, fǒuzé wǒmen huì cuòguò huǒchē de.",
        "en": "Unless we leave early, we will miss the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非我们早点出发否则我们会错过火车的.mp3"
      },
      {
        "cn": "除非你告诉我真相，我才会相信你。",
        "pinyin": "Chúfēi nǐ gàosù wǒ zhēnxiàng, wǒ cái huì xiāngxìn nǐ.",
        "en": "I will believe you only if you tell me the truth.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你告诉我真相我才会相信你.mp3"
      },
      {
        "cn": "除非你采取行动，你的梦想才会成真。",
        "pinyin": "Chúfēi nǐ cǎiqǔ xíngdòng, nǐ de mèngxiǎng cái huì chéng zhēn.",
        "en": "Your dreams will only come true if you take action.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你采取行动你的梦想才会成真.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "以便 (yǐbiàn) - So that, in order to",
    "short_explanation": "Used to express purpose or aims of implication.",
    "long_explanation": "The Mandarin Chinese word '以便 (yǐbiàn)' is used to express a purpose or intention. It helps to clarify an action that is done in order to achieve a certain goal or make something possible in future. Similar to 'so that' or 'in order to' in English, '以便 (yǐbiàn)' is often used in sentences that express cause and effect or a certain condition that needs to be fulfilled.",
    "formation": "Subject + Verb + Object + 以便 + Result clause",
    "examples": [
      {
        "cn": "我每天都努力学习中文，以便能与中国的朋友们沟通无障碍。",
        "pinyin": "Wǒ měitiān dōu nǔlì xuéxí Zhōngwén, yǐbiàn néng yǔ Zhōngguó de péngyǒumen gōutōng wú zhàng'ài.",
        "en": "I study Chinese diligently every day so that I can communicate with my friends in China without barriers.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_我每天都努力学习中文以便能与中国的朋友们沟通无障碍.mp3"
      },
      {
        "cn": "他提前一个月开始准备，以便能通过即将到来的考试。",
        "pinyin": "Tā tíqián yīgè yuè kāishǐ zhǔnbèi, yǐbiàn néng tōngguò jíjiāng dàolái de kǎoshì.",
        "en": "He started preparations a month in advance in order to pass the upcoming exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_他提前一个月开始准备以便能通过即将到来的考试.mp3"
      },
      {
        "cn": "我把地址写在纸上，以便你找到我们的家。",
        "pinyin": "Wǒ bǎ dìzhǐ xiě zài zhǐ shàng, yǐbiàn nǐ zhǎodào wǒmen de jiā.",
        "en": "I write the address on a piece of paper so that you can find our house.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_我把地址写在纸上以便你找到我们的家.mp3"
      },
      {
        "cn": "妈妈给我做了丰盛的早餐，以便我有足够的能量去学校。",
        "pinyin": "Māmā gěi wǒ zuòle fēngshèng de zǎocān, yǐbiàn wǒ yǒu zúgòu de néngliàng qù xuéxiào.",
        "en": "Mum cooked a hearty breakfast for me so that I would have enough energy for school.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_妈妈给我做了丰盛的早餐以便我有足够的能量去学校.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "无论...都... (wúlùn... dōu...) - No matter how... always...",
    "short_explanation": "Used to express 'no matter what or how, always or no matter how...can still'.",
    "long_explanation": "The Mandarin Chinese phrase '无论...都... (wúlùn... dōu...)' is a grammatical structure used to express the concept 'no matter what or how, always or no matter how...can still'. It emphasizes that no matter what the conditions or circumstances are, the result or action is always the same or stays consistent. The result or action does not vary regardless of the different conditions or variables put forth.",
    "formation": "无论 + Condition/Subjunctive Clause + 都/也 + Result",
    "examples": [
      {
        "cn": "无论你多么努力，你都不能改变这个事实。",
        "pinyin": "Wúlùn nǐ duōme nǔlì, nǐ dōu bùnéng gǎibiàn zhège shìshí.",
        "en": "No matter how hard you try, you can't change this fact.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_how_always_20231230_无论你多么努力你都不能改变这个事实.mp3"
      },
      {
        "cn": "无论天气如何，他都每天跑步。",
        "pinyin": "Wúlùn tiānqì rúhé, tā dōu měitiān pǎobù.",
        "en": "No matter what the weather is like, he goes for a run every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_how_always_20231230_无论天气如何他都每天跑步.mp3"
      },
      {
        "cn": "无论她多么富有，她都会将钱花在别人身上。",
        "pinyin": "Wúlùn tā duōme fùyǒu, tā dōu huì jiāng qián huā zài biérén shēnshàng.",
        "en": "No matter how rich she is, she always spends money on others.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_how_always_20231230_无论她多么富有她都会将钱花在别人身上.mp3"
      },
      {
        "cn": "无论你在哪里，你都会想家。",
        "pinyin": "Wúlùn nǐ zài nǎlǐ, nǐ dōu huì xiǎng jiā.",
        "en": "No matter where you are, you will always miss home.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_how_always_20231230_无论你在哪里你都会想家.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "既...又... (jì... yòu...) - Both... and...",
    "short_explanation": "Used to express that something or someone possesses multiple characteristics, abilities, or tendencies at the same time.",
    "long_explanation": "The Mandarin Chinese phrase '既...又...' (jì... yòu...) is used to show that something or someone has two or more features or qualities simultaneously. This pattern is similar to 'both... and...' in English. It is commonly used in sentences to express overlapping properties or simultaneous actions, and it emphasizes that all the features or qualities mentioned are equally applicable or carried out.",
    "formation": "Subject + 既 + Adj/Verb 1 + 又 + Adj/Verb 2",
    "examples": [
      {
        "cn": "这部电影既有趣又激动人心。",
        "pinyin": "Zhè bù diànyǐng jì yǒuqù yòu jīdòng rénxīn.",
        "en": "This movie is both interesting and thrilling.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这部电影既有趣又激动人心.mp3"
      },
      {
        "cn": "他既聪明又勤奋，是我们班上的优秀学生。",
        "pinyin": "Tā jì cōngmíng yòu qínfèn, shì wǒmen bān shàng de yōuxiù xuéshēng.",
        "en": "He is both intelligent and diligent, and is an excellent student in our class.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_他既聪明又勤奋是我们班上的优秀学生.mp3"
      },
      {
        "cn": "我既想去旅行又想保持安全，所以我选择在国内旅行。",
        "pinyin": "Wǒ jì xiǎng qù lǚxíng yòu xiǎng bǎochí ānquán, suǒyǐ wǒ xuǎnzé zài guónèi lǚxíng.",
        "en": "I want both to travel and to stay safe, so I choose to travel within the country.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_我既想去旅行又想保持安全所以我选择在国内旅行.mp3"
      },
      {
        "cn": "这个故事既简单又深刻，给我留下了很大的印象。",
        "pinyin": "Zhège gùshì jì jiǎndān yòu shēnkè, gěi wǒ liú xiàle hěn dà de yìnxiàng.",
        "en": "This story is both simple and profound, and it left a big impression on me.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这个故事既简单又深刻给我留下了很大的印象.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "即使 (jíshǐ) - Even if",
    "short_explanation": "Used to express a condition that is presumed or assumed.",
    "long_explanation": "The Mandarin Chinese phrase '即使 (jíshǐ)' is a conjunction that is equivalent to 'even if' or 'even though' in English. It is used to indicate a condition or hypothesis, often indicating an unlikely condition or pertaining to an extreme hypothetical situation. The sentence typically includes a main clause that reveals the outcome if the stated condition were to occur.",
    "formation": "即使 + Hypothetical Situation + Outcome",
    "examples": [
      {
        "cn": "即使下雨，我们还是会去公园玩。",
        "pinyin": "Jíshǐ xià yǔ, wǒmen háishì huì qù gōngyuán wán.",
        "en": "Even if it rains, we will still go to the park to play.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_20231230_即使下雨我们还是会去公园玩.mp3"
      },
      {
        "cn": "即使工作很忙，她每天还是会尽快回复你的邮件。",
        "pinyin": "Jíshǐ gōngzuò hěn máng, tā měitiān háishì huì jǐnkuài huífù nǐ de yóujiàn.",
        "en": "Even if her work is very busy, she will still reply to your emails as soon as possible every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_20231230_即使工作很忙她每天还是会尽快回复你的邮件.mp3"
      },
      {
        "cn": "即使他不希望我们来，我们还是要去看他。",
        "pinyin": "Jíshǐ tā bù xīwàng wǒmen lái, wǒmen háishì yào qù kàn tā.",
        "en": "Even if he doesn't want us to come, we will still go to see him.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_20231230_即使他不希望我们来我们还是要去看他.mp3"
      },
      {
        "cn": "即使我们知道这个任务很困难，我们仍然会尝试去完成它。",
        "pinyin": "Jíshǐ wǒmen zhīdào zhège rènwù hěn kùnnán, wǒmen réngrán huì chángshì qù wánchéng tā.",
        "en": "Even if we know that this task is difficult, we will still try to complete it.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_20231230_即使我们知道这个任务很困难我们仍然会尝试去完成它.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "甚至 (shènzhì) - Even, so much so that",
    "short_explanation": "Used to emphasize the surprising or extreme result of a situation.",
    "long_explanation": "The Mandarin Chinese phrase '甚至 (shènzhì)' is used to emphasize the extent or degree of a certain situation or condition, indicating the result is surprising, unexpected, or more extreme than previously stated. It is similar to 'even' or 'so much so that' in English. It is usually used in formal contexts.",
    "formation": "Phrase 1, 甚至 + Phrase 2",
    "examples": [
      {
        "cn": "他不仅喜欢踢足球，甚至每天都要训练几个小时。",
        "pinyin": "Tā bùjǐn xǐhuān tī zúqiú, shènzhì měitiān dū yào xùnliàn jǐ gè xiǎoshí.",
        "en": "He not only likes to play football, he even trains for several hours every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_他不仅喜欢踢足球甚至每天都要训练几个小时.mp3"
      },
      {
        "cn": "我在这个城市生活了很多年，甚至我已经忘记了我是从哪里来的。",
        "pinyin": "Wǒ zài zhège chéngshì shēnghuóle hěnduō nián, shènzhì wǒ yǐjīng wàngjìle wǒ shì cóng nǎlǐ lái de.",
        "en": "I have lived in this city for many years, so much so that I have even forgotten where I came from.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_我在这个城市生活了很多年甚至我已经忘记了我是从哪里来的.mp3"
      },
      {
        "cn": "她对这个电视剧如此痴迷，甚至忘记了吃晚饭。",
        "pinyin": "Tā duì zhège diànshì jù rúcǐ chīmí, shènzhì wàngjìle chī wǎnfàn.",
        "en": "She's so obsessed with this TV drama that she even forgets to eat dinner.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_她对这个电视剧如此痴迷甚至忘记了吃晚饭.mp3"
      },
      {
        "cn": "这个决定非常重要，甚至可能改变我们公司的整个未来。",
        "pinyin": "Zhège juédìng fēicháng zhòngyào, shènzhì kěnéng gǎibiàn wǒmen gōngsī de zhěnggè wèilái.",
        "en": "This decision is extremely important, it could even change the entire future of our company.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_这个决定非常重要甚至可能改变我们公司的整个未来.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "以免 (yǐmiǎn) - In order to avoid",
    "short_explanation": "This phrase is used to express an action taken in order to prevent something undesirable from happening.",
    "long_explanation": "The Mandarin Chinese phrase '以免 (yǐmiǎn)' represents a conjunction used for prevention, meaning 'in order to avoid' or 'so as not to'. It implies that the action stated after 以免 is intended to prevent the occurrence of the action stated before 以免. It's used when you take precautionary measures against a potentially unfavorable outcome.",
    "formation": "First part (Potential situation we want to avoid) + 以免 + Second part (Preventative action)",
    "examples": [
      {
        "cn": "我们早点出发，以免赶不上火车。",
        "pinyin": "Wǒmen zǎodiǎn chūfā, yǐmiǎn gǎn bù shàng huǒchē.",
        "en": "We set off early in order not to miss the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_以免_yǐmiǎn_-_In_order_to_avoid_20231230_我们早点出发以免赶不上火车.mp3"
      },
      {
        "cn": "你应该把钥匙放在安全的地方，以免丢失。",
        "pinyin": "Nǐ yīnggāi bǎ yàoshí fàng zài ānquán de dìfāng, yǐmiǎn diūshī.",
        "en": "You should keep your keys in a safe place to avoid losing them.",
        "grammar_audio": "/audio/mandarin/grammar/s_以免_yǐmiǎn_-_In_order_to_avoid_20231230_你应该把钥匙放在安全的地方以免丢失.mp3"
      },
      {
        "cn": "我写了一份详细的清单，以免忘记带什么。",
        "pinyin": "Wǒ xiěle yī fèn xiángxì de qīngdān, yǐmiǎn wàngjì dài shénme.",
        "en": "I wrote a detailed list in order not to forget to bring anything.",
        "grammar_audio": "/audio/mandarin/grammar/s_以免_yǐmiǎn_-_In_order_to_avoid_20231230_我写了一份详细的清单以免忘记带什么.mp3"
      },
      {
        "cn": "在节日期间，我倾向于提前购物，以免商店的人太多。",
        "pinyin": "Zài jiérì qījiān, wǒ qīngxiàng yú tíqián gòuwù, yǐmiǎn shāngdiàn de rén tài duō.",
        "en": "During the holidays, I tend to shop in advance to avoid the stores being too crowded.",
        "grammar_audio": "/audio/mandarin/grammar/s_以免_yǐmiǎn_-_In_order_to_avoid_20231230_在节日期间我倾向于提前购物以免商店的人太多.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "不然 (bùrán) - Otherwise",
    "short_explanation": "Used to express a logical consequence, similar to 'otherwise' in English.",
    "long_explanation": "The Mandarin Chinese phrase '不然 (bùrán)' is a conjunction used to express the bad consequence of something not happening. It functions like 'otherwise' or 'or else' in English, explaining what will happen if the action in the previous clause does not occur.",
    "formation": "Condition + 不然 + Consequence",
    "examples": [
      {
        "cn": "你必须快点完成作业，不然老师会生气的。",
        "pinyin": "Nǐ bìxū kuài diǎn wánchéng zuòyè, bùrán lǎoshī huì shēngqì de.",
        "en": "You must finish your homework quickly, otherwise the teacher will get angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_20231230_你必须快点完成作业不然老师会生气的.mp3"
      },
      {
        "cn": "我们需要赶快离开，不然会错过火车。",
        "pinyin": "Wǒmen xūyào gǎnkuài líkāi, bùrán huì cuòguò huǒchē.",
        "en": "We need to leave quickly, otherwise we will miss the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_20231230_我们需要赶快离开不然会错过火车.mp3"
      },
      {
        "cn": "你应该多喝水，不然会脱水。",
        "pinyin": "Nǐ yīnggāi duō hē shuǐ, bùrán huì tuōshuǐ.",
        "en": "You should drink more water, otherwise you will get dehydrated.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_20231230_你应该多喝水不然会脱水.mp3"
      },
      {
        "cn": "请把音量调小一点，不然邻居会投诉的。",
        "pinyin": "Qǐng bǎ yīnliàng diào xiǎo yīdiǎn, bùrán línjū huì tóusù de.",
        "en": "Please turn down the volume a bit, otherwise the neighbors will complain.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_20231230_请把音量调小一点不然邻居会投诉的.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "正如 (zhèngrú) - Just as, as",
    "short_explanation": "Used to indicate that something is just the same as or equivalent to something else.",
    "long_explanation": "The Mandarin Chinese expression '正如 (zhèngrú)' is used to illustrate that something is exactly the same as or equivalent to something else. Its usage is similar to 'just as' or 'as' in English to draw comparisons or establish equivalences between two things, situations, or conditions.",
    "formation": "正如 + Statement 1, Statement 2",
    "examples": [
      {
        "cn": "正如你所见，这座大楼正在被拆除以便为新的购物中心留出空间。",
        "pinyin": "Zhèngrú nǐ suǒ jiàn, zhè zuò dàlóu zhèngzài bèi chāichú yǐbiàn wèi xīn de gòuwù zhōngxīn liú chū kōngjiān.",
        "en": "Just as you can see, this building is being demolished to make way for a new shopping center.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如你所见这座大楼正在被拆除以便为新的购物中心留出空间.mp3"
      },
      {
        "cn": "正如我们预期的那样，他们的回应是积极的。",
        "pinyin": "Zhèngrú wǒmen yùqí de nà yàng, tāmen de huíyìng shì jījí de.",
        "en": "Just as we expected, their response was positive.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我们预期的那样他们的回应是积极的.mp3"
      },
      {
        "cn": "正如这份报告指出的，我们需要更有效地管理我们的资源。",
        "pinyin": "Zhèngrú zhè fèn bàogào zhǐchū de, wǒmen xūyào gèng yǒuxiào de guǎnlǐ wǒmen de zīyuán.",
        "en": "As the report points out, we need to manage our resources more effectively.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如这份报告指出的我们需要更有效地管理我们的资源.mp3"
      },
      {
        "cn": "正如我昨天告诉你的，我不会参加这个聚会。",
        "pinyin": "Zhèngrú wǒ zuótiān gàosù nǐ de, wǒ bù huì cānjiā zhè gè jùhuì.",
        "en": "As I told you yesterday, I won't be attending the party.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我昨天告诉你的我不会参加这个聚会.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "虽然...但是... (suīrán... dànshì...) - Although... but...",
    "short_explanation": "Used to show a contrast between two clauses.",
    "long_explanation": "The Mandarin Chinese structure '虽然...但是...' functions to present contrasting ideas or circumstances in a sentence. The words translating to 'although' (虽然) and 'but' (但是) are used to highlight the contrast. The element that follows '虽然' is often an expected or supposed situation, while the element following '但是' is the reality or actual situation, which often goes contrary to the expectation.",
    "formation": "虽然 + Statement 1, 但是 + Statement 2",
    "examples": [
      {
        "cn": "虽然这件衣服很漂亮，但是我买不起。",
        "pinyin": "Suīrán zhè jiàn yīfu hěn piàoliang, dànshì wǒ mǎi bù qǐ.",
        "en": "Although this dress is very beautiful, I cannot afford it.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然这件衣服很漂亮但是我买不起.mp3"
      },
      {
        "cn": "虽然他没有很高的学历，但是他工作很努力。",
        "pinyin": "Suīrán tā méiyǒu hěn gāo de xuélì, dànshì tā gōngzuò hěn nǔlì.",
        "en": "Although he does not have a high degree, he works very hard.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他没有很高的学历但是他工作很努力.mp3"
      },
      {
        "cn": "虽然他是我的好朋友，但是我不能为他撒谎。",
        "pinyin": "Suīrán tā shì wǒ de hǎo péngyou, dànshì wǒ bùnéng wèi tā sāhuǎng.",
        "en": "Although he is my good friend, but I can't lie for him.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他是我的好朋友但是我不能为他撒谎.mp3"
      },
      {
        "cn": "虽然她已经80岁了，但是她每天都去跑步。",
        "pinyin": "Suīrán tā yǐjīng bāshí suì le, dànshì tā měitiān dōu qù pǎobù.",
        "en": "Although she is already 80 years old, but she goes for a run every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然她已经80岁了但是她每天都去跑步.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "根据 (gēnjù) - According to",
    "short_explanation": "Used to express 'according to' or 'based on' in the context of information sources or basis for judgment.",
    "long_explanation": "The Mandarin Chinese grammar point '根据 (gēnjù)' is employed when one needs to express 'according to' or 'based on' in relation to a source of information or a basis for judgment or action. This can be a person's opinion, a document, a fact, a situation or an event, etc.",
    "formation": "根据 + Source of information + Rest of the sentence",
    "examples": [
      {
        "cn": "根据天气预报，明天会下雨，所以我们应该带上雨伞。",
        "pinyin": "Gēnjù tiānqì yùbào, míngtiān huì xià yǔ, suǒyǐ wǒmen yīnggāi dài shàng yǔsǎn.",
        "en": "According to the weather forecast, it will rain tomorrow, so we should carry umbrellas.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_20231230_根据天气预报明天会下雨所以我们应该带上雨伞.mp3"
      },
      {
        "cn": "根据我的经验，成功需要坚持不懈的努力。",
        "pinyin": "Gēnjù wǒ de jīngyàn, chénggōng xūyào jiānchí bùxiè de nǔlì.",
        "en": "Based on my experience, success requires relentless effort.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_20231230_根据我的经验成功需要坚持不懈的努力.mp3"
      },
      {
        "cn": "根据我们的调查，大多数顾客都对我们的服务感到满意。",
        "pinyin": "Gēnjù wǒmen de diàochá, dà duōshù gùkè dōu duì wǒmen de fúwù gǎndào mǎnyì.",
        "en": "According to our survey, most customers are satisfied with our service.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_20231230_根据我们的调查大多数顾客都对我们的服务感到满意.mp3"
      },
      {
        "cn": "根据教练的建议，我每天都进行身体锻炼。",
        "pinyin": "Gēnjù jiàoliàn de jiànyì, wǒ měitiān dōu jìnxíng shēntǐ duànliàn.",
        "en": "Based on the coach's advice, I exercise every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_20231230_根据教练的建议我每天都进行身体锻炼.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "比如 (bǐrú) - For example",
    "short_explanation": "Used to introduce an example or list of examples.",
    "long_explanation": "The Mandarin Chinese phrase '比如 (bǐrú)' is used to introduce an instance or a number of instances that illustrate a particular point or concept. It is equivalent to 'for example' in English. This phrase is often used in explanations to provide specific examples or instances which help to better understand the main idea.",
    "formation": "Point + 比如 + Example(s)",
    "examples": [
      {
        "cn": "在中国，有很多美丽的地方，比如，长城，故宫和西湖。",
        "pinyin": "Zài Zhōngguó, yǒu hěnduō měilì de dìfang, bǐrú, Chángchéng, Gùgōng hé Xīhú.",
        "en": "There are many beautiful places in China, for example, the Great Wall, the Forbidden City, and West Lake.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_For_example_20231230_在中国有很多美丽的地方比如长城故宫和西湖.mp3"
      },
      {
        "cn": "你每天都应该吃很多新鲜的蔬菜和水果，比如，胡萝卜，苹果和香蕉。",
        "pinyin": "Nǐ měitiān dōu yīnggāi chī hěnduō xīnxiān de shūcài hé shuǐguǒ, bǐrú, húluóbo, píngguǒ hé xiāngjiāo.",
        "en": "You should eat lots of fresh vegetables and fruits every day, for example, carrots, apples, and bananas.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_For_example_20231230_你每天都应该吃很多新鲜的蔬菜和水果比如胡萝卜苹果和香蕉.mp3"
      },
      {
        "cn": "我喜欢各种类型的音乐，比如，流行音乐，古典音乐和乡村音乐。",
        "pinyin": "Wǒ xǐhuan gè zhǒng lèixíng de yīnyué, bǐrú, liúxíng yīnyué, gǔdiǎn yīnyué, hé xiāngcūn yīnyué.",
        "en": "I like all kinds of music, for example, pop music, classical music, and country music.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_For_example_20231230_我喜欢各种类型的音乐比如流行音乐古典音乐和乡村音乐.mp3"
      },
      {
        "cn": "中文有很多有趣的成语，比如，瓜田李下和画蛇添足。",
        "pinyin": "Zhōngwén yǒu hěn duō yǒuqù de chéngyǔ, bǐrú, guātiánlǐxià hé huàshétiānzú.",
        "en": "Chinese has many interesting idioms, for example, 'guātiánlǐxià' (meaning 'avoid doing something that could be misinterpreted'), and 'huàshétiānzú' (meaning 'do something superfluous or unnecessary').",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_For_example_20231230_中文有很多有趣的成语比如瓜田李下和画蛇添足.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "假如 (jiǎrú) - If, suppose",
    "short_explanation": "Used to hypothesize or conditionally propose a certain situation or condition.",
    "long_explanation": "The Mandarin Chinese phrase '假如 (jiǎrú)' is a conjunction used to propose a hypothetical situation or condition. It conveys the concept of 'if' or 'suppose' in English. The phrase is commonly used to frame a scenario which has not happened yet, but is being considered or imagined.",
    "formation": "假如 + Phrase 1 (Hypothetical scenario), + Phrase 2 (Consequence)",
    "examples": [
      {
        "cn": "假如你有一百万美元，你会做什么？",
        "pinyin": "Jiǎrú nǐ yǒu yī bǎi wàn měiyuán, nǐ huì zuò shénme?",
        "en": "If you had a million dollars, what would you do?",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如你有一百万美元你会做什么.mp3"
      },
      {
        "cn": "假如明天下雨，我们的野餐就要取消了。",
        "pinyin": "Jiǎrú míngtiān xià yǔ, wǒmen de yěcān jiù yào qǔxiāo le.",
        "en": "If it rains tomorrow, we'll have to cancel our picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如明天下雨我们的野餐就要取消了.mp3"
      },
      {
        "cn": "假如我能早点知道这个消息，我就可以做出更好的决定。",
        "pinyin": "Jiǎrú wǒ néng zǎo diǎn zhīdào zhège xiāoxi, wǒ jiù kěyǐ zuò chū gèng hǎo de juédìng.",
        "en": "If I had known this news earlier, I could have made a better decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如我能早点知道这个消息我就可以做出更好的决定.mp3"
      },
      {
        "cn": "假如你不快点准备，我们就会迟到的。",
        "pinyin": "Jiǎrú nǐ bù kuài diǎn zhǔnbèi, wǒmen jiù huì chídào de.",
        "en": "If you don't hurry up and get ready, we're going to be late.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如你不快点准备我们就会迟到的.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "既然 (jìrán) - Since, now that",
    "short_explanation": "Used to indicate the reasoning behind a certain event or situation.",
    "long_explanation": "The Mandarin Chinese conjunction '既然 (jìrán)' is used to express the meaning of 'since' or 'now that' in English. It is often used to indicate the reasoning or grounds for a particular event, action, or decision that follows and is usually followed by a then clause denoting a certain conclusion.",
    "formation": "既然 + Precondition, Reason + 就,那,那么 + Result, Conclusion",
    "examples": [
      {
        "cn": "既然你不喜欢这首歌，那我们就换一首吧。",
        "pinyin": "Jìrán nǐ bù xǐhuān zhè shǒu gē, nà wǒmen jiù huàn yī shǒu ba.",
        "en": "Since you don't like this song, let's change to another one.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你不喜欢这首歌那我们就换一首吧.mp3"
      },
      {
        "cn": "既然明天是假期，那么我们可以去看电影。",
        "pinyin": "Jìrán míngtiān shì jiàqī, nàme wǒmen kěyǐ qù kàn diànyǐng.",
        "en": "Since tomorrow is a holiday, then we can go watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然明天是假期那么我们可以去看电影.mp3"
      },
      {
        "cn": "既然你决定了要去上海，那我就帮你订机票吧。",
        "pinyin": "Jìrán nǐ juédìngle yào qù Shànghǎi, nà wǒ jiù bāng nǐ dìng jīpiào ba.",
        "en": "Since you've decided to go to Shanghai, then I'll help you book the plane tickets.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你决定了要去上海那我就帮你订机票吧.mp3"
      },
      {
        "cn": "既然大家都不反对，那么我们就采取这个计划。",
        "pinyin": "Jìrán dàjiā dōu bù fǎnduì, nàme wǒmen jiù cǎiqǔ zhège jìhuà.",
        "en": "Since everyone does not object, then we will adopt this plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然大家都不反对那么我们就采取这个计划.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "无论 (wúlùn) - Regardless of, no matter",
    "short_explanation": "Used to express 'regardless of' or 'no matter what'.",
    "long_explanation": "The Chinese term '无论 (wúlùn)' is used for expressing the meaning of 'regardless of' or 'no matter what' in English. It is used to emphasize that the outcome of the situation or the action remains the same, regardless of variations in the conditions or circumstances.",
    "formation": "无论 + Condition, Main Sentence",
    "examples": [
      {
        "cn": "无论天气如何，我都会去公园散步。",
        "pinyin": "Wúlùn tiānqì rúhé, wǒ dōu huì qù gōngyuán sànbù.",
        "en": "Regardless of the weather, I will go for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_20231230_无论天气如何我都会去公园散步.mp3"
      },
      {
        "cn": "无论这个任务有多难，我都会尽力完成。",
        "pinyin": "Wúlùn zhège rènwù yǒu duō nán, wǒ dōu huì jìnlì wánchéng.",
        "en": "No matter how difficult this task is, I will do my best to complete it.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_20231230_无论这个任务有多难我都会尽力完成.mp3"
      },
      {
        "cn": "无论你在哪里，我都会找到你。",
        "pinyin": "Wúlùn nǐ zài nǎlǐ, wǒ dōu huì zhǎodào nǐ.",
        "en": "No matter where you are, I will find you.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_20231230_无论你在哪里我都会找到你.mp3"
      },
      {
        "cn": "无论你做什么，都不能忘记你的初衷。",
        "pinyin": "Wúlùn nǐ zuò shénme, dōu bùnéng wàngjì nǐ de chūzhōng.",
        "en": "No matter what you do, you can't forget your original intention.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_20231230_无论你做什么都不能忘记你的初衷.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "尽管...还... (jǐnguǎn... hái...) - Despite... still...",
    "short_explanation": "Used to express that despite a certain circumstance, there is still another result or effect.",
    "long_explanation": "The Mandarin Chinese expression '尽管...还...' (jǐnguǎn... hái...) is used to convey that although a particular situation or circumstance exists, there is nonetheless a different or unexpected result. The situation comes after '尽管' (despite), followed by a result after '还' (still).",
    "formation": "尽管 + Situation/Circumstance, 还 + Result/Effect",
    "examples": [
      {
        "cn": "尽管天气很冷，他还是去了跑步。",
        "pinyin": "Jǐnguǎn tiānqì hěn lěng, tā háishì qùle pǎobù.",
        "en": "Despite the cold weather, he still went for a run.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管还_jǐnguǎn_hái_-_Despite_still_20231230_尽管天气很冷他还是去了跑步.mp3"
      },
      {
        "cn": "尽管他很累，还是帮我把这个箱子搬上楼。",
        "pinyin": "Jǐnguǎn tā hěn lèi, hái shì bāng wǒ bǎ zhège xiāngzi bān shàng lóu.",
        "en": "Despite being very tired, he still helped me to carry this box upstairs.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管还_jǐnguǎn_hái_-_Despite_still_20231230_尽管他很累还是帮我把这个箱子搬上楼.mp3"
      },
      {
        "cn": "尽管他已经成功了，他还是坚持继续工作和创新。",
        "pinyin": "Jǐnguǎn tā yǐjīng chénggōngle, tā háishì jiānchí jìxù gōngzuò hé chuàngxīn.",
        "en": "Despite his success, he still insists on continuing to work and innovate.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管还_jǐnguǎn_hái_-_Despite_still_20231230_尽管他已经成功了他还是坚持继续工作和创新.mp3"
      },
      {
        "cn": "尽管她门晚到了，但还是能够沉着冷静完成比赛。",
        "pinyin": "Jǐnguǎn tā men wǎn dào le, dàn hái shì nénggòu chénzhuò lěngjìng wánchéng bǐsài.",
        "en": "Despite arriving late, they were still able to calmly complete the game.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管还_jǐnguǎn_hái_-_Despite_still_20231230_尽管她门晚到了但还是能够沉着冷静完成比赛.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "即便 (jíbiàn) - Even if, even though",
    "short_explanation": "Used to express concession or contrary conditions.",
    "long_explanation": "The Mandarin Chinese phrase '即便 (jíbiàn)' functions as a conjunction used to express a condition or circumstance that is contrary to the expected result or expresses a concession. It is similar to the English conjunctions 'even if' or 'even though'. The action or result in the main clause still occurs or is still true despite the condition or circumstance expressed after the conjunction '即便 (jíbiàn)'.",
    "formation": "即便 + Condition/Contrary Circumstance, + Main Clause",
    "examples": [
      {
        "cn": "即便我没有足够的时间，我也会完成这个项目。",
        "pinyin": "Jíbiàn wǒ méiyǒu zúgòu de shíjiān, wǒ yě huì wánchéng zhège xiàngmù.",
        "en": "Even if I don't have enough time, I will complete this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便我没有足够的时间我也会完成这个项目.mp3"
      },
      {
        "cn": "即便他是我的朋友，我也不会帮他做违法的事情。",
        "pinyin": "Jíbiàn tā shì wǒ de péngyǒu, wǒ yě bù huì bāng tā zuò wéifǎ de shìqíng.",
        "en": "Even though he is my friend, I will not help him do illegal things.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便他是我的朋友我也不会帮他做违法的事情.mp3"
      },
      {
        "cn": "即便这个任务非常困难，他们还是决定接受它。",
        "pinyin": "Jíbiàn zhège rènwu fēicháng kùnnán, tāmen háishì juédìng jiēshòu tā.",
        "en": "Even though this task is very difficult, they still decided to accept it.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便这个任务非常困难他们还是决定接受它.mp3"
      },
      {
        "cn": "即便明天下雨，我们的比赛还是会继续进行。",
        "pinyin": "Jíbiàn míngtiān xiàyǔ, wǒmen de bǐsài háishì huì jìxù jìnxíng.",
        "en": "Even if it rains tomorrow, our match will still continue.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便明天下雨我们的比赛还是会继续进行.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "至于 (zhìyú) - As for, regarding",
    "short_explanation": "Used to introduce a new topic or shift the focus to a different subject.",
    "long_explanation": "The Mandarin Chinese expression '至于 (zhìyú)' means 'as for' or 'regarding', and it's used to introduce a new subject or topic into the conversation, or shift the attention to a different aspect of the already discussed subject. The usage is very similar to 'as for' or 'with regard to' in English.",
    "formation": "Subject + Statement + 至于 + New subject + Statement",
    "examples": [
      {
        "cn": "我喜欢吃披萨，至于我妹妹，她更喜欢吃汉堡。",
        "pinyin": "Wǒ xǐhuān chī pīsà, zhìyú wǒ mèimei, tā gèng xǐhuān chī hànbǎo.",
        "en": "I like to eat pizza, as for my sister, she prefers hamburgers.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_我喜欢吃披萨至于我妹妹她更喜欢吃汉堡.mp3"
      },
      {
        "cn": "夏天我常常去游泳。至于冬天，我通常在家看书。",
        "pinyin": "Xiàtiān wǒ chángcháng qù yóuyǒng. Zhìyú dōngtiān, wǒ tōngcháng zài jiā kànshū.",
        "en": "In the summer, I often go swimming. As for winter, I usually read books at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_夏天我常常去游泳至于冬天我通常在家看书.mp3"
      },
      {
        "cn": "至于这个问题，我还需要多考虑一下。",
        "pinyin": "Zhìyú zhège wèntí, wǒ hái xūyào duō kǎolǜ yīxià.",
        "en": "As for this question, I still need to think about it more.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_至于这个问题我还需要多考虑一下.mp3"
      },
      {
        "cn": "他非常善于学习数学，至于物理就需要花更多的时间。",
        "pinyin": "Tā fēicháng shànyú xuéxí shùxué, zhìyú wùlǐ jiù xūyào huā gèng duō de shíjiān.",
        "en": "He is very good at studying mathematics, as for physics, it requires more time.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_他非常善于学习数学至于物理就需要花更多的时间.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "相比之下 (xiāngbǐ zhīxià) - In comparison, compared with",
    "short_explanation": "This phrase is used to compare two or more things or situations.",
    "long_explanation": "The Mandarin Chinese phrase '相比之下 (xiāngbǐ zhīxià)' is used to compare two or more things, people, situations, or events. It means 'in comparison' or 'compared with' in English, and is used to highlight contrast or differences.",
    "formation": "Object 1 + 相比之下 + Object 2 + Verb + Other Verbs or Adjectives",
    "examples": [
      {
        "cn": "相比之下，她更喜欢住在乡下而不是城市。",
        "pinyin": "Xiāngbǐ zhīxià, tā gèng xǐhuān zhù zài xiāngxià ér bùshì chéngshì.",
        "en": "In comparison, she prefers to live in the countryside rather than in the city.",
        "grammar_audio": "/audio/mandarin/grammar/s_相比之下_xiāngbǐ_zhīxià_-_In_comparison_compared_with_20231230_相比之下她更喜欢住在乡下而不是城市.mp3"
      },
      {
        "cn": "相比之下，电子书比纸质书更环保。",
        "pinyin": "Xiāngbǐ zhīxià, diànzǐ shū bǐ zhǐzhì shū gèng huánbǎo.",
        "en": "Compared with paper books, e-books are more environmentally friendly.",
        "grammar_audio": "/audio/mandarin/grammar/s_相比之下_xiāngbǐ_zhīxià_-_In_comparison_compared_with_20231230_相比之下电子书比纸质书更环保.mp3"
      },
      {
        "cn": "相比之下，我比我哥哥更喜欢数学。",
        "pinyin": "Xiāngbǐ zhīxià, wǒ bǐ wǒ gēgē gèng xǐhuān shùxué.",
        "en": "In comparison, I like maths more than my older brother does.",
        "grammar_audio": "/audio/mandarin/grammar/s_相比之下_xiāngbǐ_zhīxià_-_In_comparison_compared_with_20231230_相比之下我比我哥哥更喜欢数学.mp3"
      },
      {
        "cn": "相比之下，我更喜欢冬天，因为我喜欢下雪。",
        "pinyin": "Xiāngbǐ zhīxià, wǒ gèng xǐhuān dōngtiān, yīnwèi wǒ xǐhuān xià xuě.",
        "en": "Compared with other seasons, I prefer winter, because I like snow.",
        "grammar_audio": "/audio/mandarin/grammar/s_相比之下_xiāngbǐ_zhīxià_-_In_comparison_compared_with_20231230_相比之下我更喜欢冬天因为我喜欢下雪.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "幸亏 (xìngkuī) - Fortunately, luckily",
    "short_explanation": "Used to express relief or thankfulness for a favorable outcome or condition.",
    "long_explanation": "The term '幸亏 (xìngkuī)' in Mandarin Chinese refers to situations where something fortunately or luckily happened, preventing an undesirable outcome. It is often used in sentences expressing relief from potential trouble or expressing gratefulness for an unexpected favorable outcome. It is the equivalent of 'fortunately' or 'luckily' in English.",
    "formation": "幸亏 + (Subject + Verb/Action)",
    "examples": [
      {
        "cn": "幸亏你叫醒了我，不然我就会迟到了。",
        "pinyin": "Xìngkuī nǐ jiào xǐng le wǒ, bùrán wǒ jiù huì chídào le.",
        "en": "Luckily you woke me up, otherwise I would have been late.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏你叫醒了我不然我就会迟到了.mp3"
      },
      {
        "cn": "幸亏我昨天已经做了预备，否则我无法按时完成任务。",
        "pinyin": "Xìngkuī wǒ zuótiān yǐjīng zuò le yùbèi, fǒuzé wǒ wúfǎ àn shí wánchéng rènwù.",
        "en": "Fortunately, I got prepared yesterday, otherwise I couldn't finish the task on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏我昨天已经做了预备否则我无法按时完成任务.mp3"
      },
      {
        "cn": "幸亏有你在那场比赛中帮助我，我才能赢得冠军。",
        "pinyin": "Xìngkuī yǒu nǐ zài nà chǎng bǐsài zhōng bāngzhù wǒ, wǒ cáinéng yíngdé guànjūn.",
        "en": "Luckily, with your help in that competition, I was able to win the championship.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏有你在那场比赛中帮助我我才能赢得冠军.mp3"
      },
      {
        "cn": "幸亏有这把伞，我们才没有被雨淋湿。",
        "pinyin": "Xìngkuī yǒu zhè bǎ sǎn, wǒmen cái méiyǒu bèi yǔ línshī.",
        "en": "Fortunately we had this umbrella, otherwise we would have been soaked in the rain.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏有这把伞我们才没有被雨淋湿.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "25"
  },
  {
    "title": "趁 (chèn) - Take advantage of, while",
    "short_explanation": "趁 (chèn) is often used to express the idea of taking advantage of a certain condition or time.",
    "long_explanation": "The word '趁 (chèn)' is a preposition that signifies taking advantage of a particular situation or time, essentially doing something while a certain condition exists. It closely translates to the English phrases 'while' or 'take advantage of'. It is often used in situations where one action takes place in the framework of other conditions being present or occurring.",
    "formation": "趁 + Condition, Subject + Verb",
    "examples": [
      {
        "cn": "趁天气好，我们去公园吧。",
        "pinyin": "Chèn tiānqì hǎo, wǒmen qù gōngyuán ba.",
        "en": "While the weather is good, let's go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁天气好我们去公园吧.mp3"
      },
      {
        "cn": "趁我还在，你应该多问些问题。",
        "pinyin": "Chèn wǒ hái zài, nǐ yīnggāi duō wèn xiē wèntí.",
        "en": "Take advantage of my presence, you should ask more questions.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁我还在你应该多问些问题.mp3"
      },
      {
        "cn": "趁着夏天，我们去海边度假。",
        "pinyin": "Chènzhe xiàtiān, wǒmen qù hǎibiān dùjià.",
        "en": "Taking advantage of the summer, we should go to the seaside for a vacation.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁着夏天我们去海边度假.mp3"
      },
      {
        "cn": "趁他们没有注意，我快速离开了。”",
        "pinyin": "Chèn tāmen méiyǒu zhùyì, wǒ kuàisù líkāi le.",
        "en": "While they were not paying attention, I quickly left.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁他们没有注意我快速离开了”.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "为了 (wèile) - In order to, for the sake of",
    "short_explanation": "Used to express the purpose or motivation of an action.",
    "long_explanation": "'为了 (wèile)' is a preposition used in Mandarin Chinese to express the reason or purpose behind an action. It can be translated as 'in order to' or 'for the sake of'. Unlike its English equivalents, '为了' is typically used at the beginning of a sentence or clause, followed by the purpose, then the subject and verb.",
    "formation": "为了 + Purpose + , + Subject + Verb + Object",
    "examples": [
      {
        "cn": "为了提高我的中文水平，我每天都要花两个小时学习。",
        "pinyin": "Wèile tígāo wǒ de Zhōngwén shuǐpíng, wǒ měitiān dōu yào huā liǎng gè xiǎoshí xuéxí.",
        "en": "In order to improve my Chinese level, I spend two hours studying every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了提高我的中文水平我每天都要花两个小时学习.mp3"
      },
      {
        "cn": "她为了实现梦想，决定放弃稳定的工作去创业。",
        "pinyin": "Tā wèile shíxiàn mèngxiǎng, juédìng fàngqì wěndìng de gōngzuò qù chuàngyè.",
        "en": "In order to fulfill her dream, she decided to give up her stable job and start a business.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_她为了实现梦想决定放弃稳定的工作去创业.mp3"
      },
      {
        "cn": "为了保护环境，我们应该少用塑料袋。",
        "pinyin": "Wèile bǎohù huánjìng, wǒmen yīnggāi shǎo yòng sùliào dài.",
        "en": "In order to protect the environment, we should use fewer plastic bags.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了保护环境我们应该少用塑料袋.mp3"
      },
      {
        "cn": "为了你的健康，你应该戒烟。",
        "pinyin": "Wèile nǐ de jiànkāng, nǐ yīnggāi jiè yān.",
        "en": "For the sake of your health, you should quit smoking.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了你的健康你应该戒烟.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "假设 (jiǎshè) - Suppose, assuming",
    "short_explanation": "Used to present a hypothetical situation or condition.",
    "long_explanation": "'假设 (jiǎshè)' in Mandarin Chinese is a conjunction used to introduce a supposition or a hypothetical condition. It is similar to 'suppose' or 'assuming' in English. The statement following '假设' describes a potential circumstance or condition that is yet to occur or is purely hypothetical.",
    "formation": "假设 + Hypothetical situation + result",
    "examples": [
      {
        "cn": "假设你赢了一百万美元，你会怎么做？",
        "pinyin": "Jiǎshè nǐ yíng le yī bǎi wàn měiyuán, nǐ huì zěnme zuò?",
        "en": "Suppose you won a million dollars, what would you do?",
        "grammar_audio": "/audio/mandarin/grammar/s_假设_jiǎshè_-_Suppose_assuming_20231230_假设你赢了一百万美元你会怎么做.mp3"
      },
      {
        "cn": "假设我没有在那里，你会怎么处理这个问题？",
        "pinyin": "Jiǎshè wǒ méiyǒu zài nàlǐ, nǐ huì zěnme chǔlǐ zhè gè wèntí?",
        "en": "Assuming I wasn't there, how would you deal with this problem?",
        "grammar_audio": "/audio/mandarin/grammar/s_假设_jiǎshè_-_Suppose_assuming_20231230_假设我没有在那里你会怎么处理这个问题.mp3"
      },
      {
        "cn": "假设你能选择任何你想去的地方，你会去哪里？",
        "pinyin": "Jiǎshè nǐ néng xuǎnzé rènhé nǐ xiǎng qù de dìfāng, nǐ huì qù nǎlǐ?",
        "en": "Suppose you could choose anywhere to go, where would you go?",
        "grammar_audio": "/audio/mandarin/grammar/s_假设_jiǎshè_-_Suppose_assuming_20231230_假设你能选择任何你想去的地方你会去哪里.mp3"
      },
      {
        "cn": "假设你有机会再次学习，你会选择什么专业？",
        "pinyin": "Jiǎshè nǐ yǒu jīhuì zàicì xuéxí, nǐ huì xuǎnzé shénme zhuānyè?",
        "en": "Assuming you had the chance to study again, what major would you choose?",
        "grammar_audio": "/audio/mandarin/grammar/s_假设_jiǎshè_-_Suppose_assuming_20231230_假设你有机会再次学习你会选择什么专业.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "反而 (fǎn'ér) - Instead, on the contrary",
    "short_explanation": "Used to show a contrast or unexpected result.",
    "long_explanation": "The Mandarin Chinese adverb '反而 (fǎn'ér)' is used to express a contrasting or unexpected outcome, often when the actual result is the opposite of what one might expect. In English, this is similar to saying 'instead' or 'on the contrary'.",
    "formation": "Subject + original expectation + 但是/可是/然而 + 反而 + actual outcome",
    "examples": [
      {
        "cn": "我以为阅读中文书籍会让我感到枯燥，但是反而激发了我对中文的兴趣。",
        "pinyin": "Wǒ yǐwéi yuèdú Zhōngwén shūjí huì ràng wǒ gǎndào kūzào, dànshì fǎn'ér jīfā le wǒ duì Zhōngwén de xìngqù.",
        "en": "I thought reading Chinese books would make me feel bored, but instead it sparked my interest in Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_Instead_on_the_contrary_20231230_我以为阅读中文书籍会让我感到枯燥但是反而激发了我对中文的兴趣.mp3"
      },
      {
        "cn": "他没有感到难过，反而觉得很高兴。",
        "pinyin": "Tā méiyǒu gǎndào nánguò, fǎn'ér juédé hěn gāoxìng.",
        "en": "He didn't feel sad, instead, he felt very happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_Instead_on_the_contrary_20231230_他没有感到难过反而觉得很高兴.mp3"
      },
      {
        "cn": "我以为健身会让我感到累，可是我反而感到更有活力。",
        "pinyin": "Wǒ yǐwéi jiànshēn huì ràng wǒ gǎndào lèi, kěshì wǒ fǎn'ér gǎndào gèng yǒu huólì.",
        "en": "I thought working out would make me feel tired, but instead I feel more energetic.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_Instead_on_the_contrary_20231230_我以为健身会让我感到累可是我反而感到更有活力.mp3"
      },
      {
        "cn": "他没有生气，反而对我的建议感到很满意。",
        "pinyin": "Tā méiyǒu shēngqì, fǎn'ér duì wǒ de jiànyì gǎndào hěn mǎnyì.",
        "en": "He didn't get angry, instead, he was very satisfied with my suggestion.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_Instead_on_the_contrary_20231230_他没有生气反而对我的建议感到很满意.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "与此同时 (yǔ cǐ tóngshí) - Meanwhile, at the same time",
    "short_explanation": "Used to indicate that two actions are happening simultaneously.",
    "long_explanation": "The Mandarin Chinese phrase '与此同时 (yǔ cǐ tóngshí)' is used to describe two or more scenarios or actions that are happening at the same time, similar to the English phrases 'meanwhile' or 'at the same time'. It helps to connect events in a narrative that are occurring in parallel.",
    "formation": "与此同时 + Sentence",
    "examples": [
      {
        "cn": "我在厨房做饭，与此同时，我的朋友在客厅看电视。",
        "pinyin": "Wǒ zài chúfáng zuò fàn, yǔ cǐ tóngshí, wǒ de péngyǒu zài kètīng kàn diànshì.",
        "en": "I am cooking in the kitchen, meanwhile, my friend is watching TV in the living room.",
        "grammar_audio": "/audio/mandarin/grammar/s_与此同时_yǔ_cǐ_tóngshí_-_Meanwhile_at_the_same_time_20231230_我在厨房做饭与此同时我的朋友在客厅看电视.mp3"
      },
      {
        "cn": "他在学习汉语，与此同时，他的妹妹在玩电脑游戏。",
        "pinyin": "Tā zài xuéxí Hànyǔ, yǔ cǐ tóngshí, tā de mèimei zài wán diànnǎo yóuxì.",
        "en": "He is studying Chinese, meanwhile, his sister is playing computer games.",
        "grammar_audio": "/audio/mandarin/grammar/s_与此同时_yǔ_cǐ_tóngshí_-_Meanwhile_at_the_same_time_20231230_他在学习汉语与此同时他的妹妹在玩电脑游戏.mp3"
      },
      {
        "cn": "她在购物中心购物，与此同时，她的丈夫在健身房锻炼。",
        "pinyin": "Tā zài gòuwù zhōngxīn gòuwù, yǔ cǐ tóngshí, tā de zhàngfū zài jiànshēnfáng duànliàn.",
        "en": "She is shopping in the mall, meanwhile, her husband is working out in the gym.",
        "grammar_audio": "/audio/mandarin/grammar/s_与此同时_yǔ_cǐ_tóngshí_-_Meanwhile_at_the_same_time_20231230_她在购物中心购物与此同时她的丈夫在健身房锻炼.mp3"
      },
      {
        "cn": "我正在写作业，与此同时，我的猫在窗户边睡觉。",
        "pinyin": "Wǒ zhèngzài xiě zuòyè, yǔ cǐ tóngshí, wǒ de māo zài chuānghù biān shuìjiào.",
        "en": "I am doing my homework, meanwhile, my cat is sleeping by the window.",
        "grammar_audio": "/audio/mandarin/grammar/s_与此同时_yǔ_cǐ_tóngshí_-_Meanwhile_at_the_same_time_20231230_我正在写作业与此同时我的猫在窗户边睡觉.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "不如 (bù rú) - Not as good as, rather than",
    "short_explanation": "This phrase is used to make comparisons between two things, meaning that one thing is not as good as the other.",
    "long_explanation": "'不如 (bù rú)' is a grammatical structure in Mandarin that is used to create comparisons, roughly equivalent to the English 'not as good as' or 'rather than'. It literally means 'not like'. If you want to express that something doesn't measure up to something else in a certain aspect, you can use '不如'. This phrase is also commonly used to propose a different suggestion or to propose an alternative action.",
    "formation": "Subject + 不如 + Alternative",
    "examples": [
      {
        "cn": "他的汉语不如他的英语好。",
        "pinyin": "Tā de Hànyǔ bùrú tā de Yīngyǔ hǎo.",
        "en": "His Chinese is not as good as his English.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bù_rú_-_Not_as_good_as_rather_than_20231230_他的汉语不如他的英语好.mp3"
      },
      {
        "cn": "计划中的事情不如意料中的那么顺利。",
        "pinyin": "Jìhuà zhōng de shìqíng bùrú yìliào zhōng de nàme shùnlì.",
        "en": "Things in the plan did not go as smoothly as expected.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bù_rú_-_Not_as_good_as_rather_than_20231230_计划中的事情不如意料中的那么顺利.mp3"
      },
      {
        "cn": "不如我们明天一起去看电影吧！",
        "pinyin": "Bùrú wǒmen míngtiān yīqǐ qù kàn diànyǐng ba!",
        "en": "We might as well go watch a movie together tomorrow!",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bù_rú_-_Not_as_good_as_rather_than_20231230_不如我们明天一起去看电影吧！.mp3"
      },
      {
        "cn": "我觉得在家做饭不如去餐馆吃得方便。",
        "pinyin": "Wǒ juéde zài jiā zuòfàn bùrú qù cānguǎn chī de fāngbiàn.",
        "en": "I think cooking at home is not as convenient as eating in a restaurant.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bù_rú_-_Not_as_good_as_rather_than_20231230_我觉得在家做饭不如去餐馆吃得方便.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "反之 (fǎnzhī) - Conversely, on the other hand",
    "short_explanation": "Used to introduce a situation or fact that is the opposite of one already mentioned.",
    "long_explanation": "The Mandarin Chinese expression '反之 (fǎnzhī)' is used to introduce a fact or situation that is the reverse of one that has been already mentioned. This word is similar to saying 'on the other hand' or 'conversely' in English, allowing speakers to present opposite or contrasting ideas.",
    "formation": "Sentence 1, 反之 + Sentence 2 (The situation mentioned in Sentence 2 is contrary to that in Sentence 1).",
    "examples": [
      {
        "cn": "如果明天是晴天，我们就去公园。反之，如果下雨，我们就在家看电影。",
        "pinyin": "Rúguǒ míngtiān shì qíngtiān, wǒmen jiù qù gōngyuán. Fǎnzhī, rúguǒ xiàyǔ, wǒmen jiù zài jiā kàn diànyǐng.",
        "en": "If it's sunny tomorrow, we'll go to the park. Conversely, if it rains, we'll watch movies at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_Conversely_on_the_other_hand_20231230_如果明天是晴天我们就去公园反之如果下雨我们就在家看电影.mp3"
      },
      {
        "cn": "如果你喜欢中国菜，你可能会喜欢辣椒。反之，如果你不喜欢辣椒，你可能不会喜欢中国菜。",
        "pinyin": "Rúguǒ nǐ xǐhuān Zhōngguó cài, nǐ kěnéng huì xǐhuān làjiāo. Fǎnzhī, rúguǒ nǐ bù xǐhuān làjiāo, nǐ kěnéng bù huì xǐhuān Zhōngguó cài.",
        "en": "If you like Chinese food, you might like chili peppers. Conversely, if you don't like chili peppers, you might not like Chinese food.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_Conversely_on_the_other_hand_20231230_如果你喜欢中国菜你可能会喜欢辣椒反之如果你不喜欢辣椒你可能不会喜欢中国菜.mp3"
      },
      {
        "cn": "学生如果认真学习，一定能取得好成绩。反之，如果不努力，就难达到目标。",
        "pinyin": "Xuéshēng rúguǒ rènzhēn xuéxí, yídìng néng qǔdé hǎo chéngjī. Fǎnzhī, rúguǒ bù nǔlì, jiù nán dádào mùbiāo.",
        "en": "If students study hard, they will definitely achieve good results. Conversely, if they don't work hard, it's difficult to reach their goals.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_Conversely_on_the_other_hand_20231230_学生如果认真学习一定能取得好成绩反之如果不努力就难达到目标.mp3"
      },
      {
        "cn": "如果你定期运动，将有利于健康。反之，如果你长时间坐着不动，健康将会受到影响。",
        "pinyin": "Rúguǒ nǐ dìngqí yùndòng, jiāng yǒulìyú jiànkāng. Fǎnzhī, rúguǒ nǐ chángshíjiān zuòzhe bùdòng, jiànkāng jiāng huì shòudào yǐngxiǎng.",
        "en": "If you exercise regularly, it will be beneficial to your health. Conversely, if you sit still for a long time, your health will be affected.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_Conversely_on_the_other_hand_20231230_如果你定期运动将有利于健康反之如果你长时间坐着不动健康将会受到影响.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "由于 (yóuyú) - Due to, because of",
    "short_explanation": "Used to show the reason or cause of something.",
    "long_explanation": "The Mandarin Chinese phrase '由于 (yóuyú)' is used to express the reason or cause of a situation, similar to 'due to' or 'because of' in English. It is often placed at the beginning of a sentence to specify the reason for the subsequent result or situation.",
    "formation": "由于 + Cause, Result",
    "examples": [
      {
        "cn": "由于雨太大，我们决定待在家里。",
        "pinyin": "Yóuyú yǔ tài dà, wǒmen juédìng dāi zài jiā lǐ.",
        "en": "Due to the heavy rain, we decided to stay at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于雨太大我们决定待在家里.mp3"
      },
      {
        "cn": "由于他没有仔细读说明书，所以他不知道如何操作这个机器。",
        "pinyin": "Yóuyú tā méiyǒu zǐxì dú shuōmíngshū, suǒyǐ tā bù zhīdào rúhé cāozuò zhège jīqì.",
        "en": "Because he didn't carefully read the instructions, he didn't know how to operate the machine.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于他没有仔细读说明书所以他不知道如何操作这个机器.mp3"
      },
      {
        "cn": "由于我忘记带钱包，我不能买冰淇淋。",
        "pinyin": "Yóuyú wǒ wàngjì dài qiánbāo, wǒ bùnéng mǎi bīngqílín.",
        "en": "Because I forgot my wallet, I can't buy ice cream.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于我忘记带钱包我不能买冰淇淋.mp3"
      },
      {
        "cn": "由于他的努力工作，公司的销售额大幅度上升了。",
        "pinyin": "Yóuyú tā de nǔlì gōngzuò, gōngsī de xiāoshòu'é dàfúdù shàngshēng le.",
        "en": "Due to his hard work, the company's sales significantly increased.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于他的努力工作公司的销售额大幅度上升了.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "尽管如此 (jǐnguǎn rúcǐ) - Nevertheless, however",
    "short_explanation": "Used to express 'in spite of that' or 'however' to show contrasting ideas.",
    "long_explanation": "The Mandarin Chinese phrase '尽管如此 (jǐnguǎn rúcǐ)' is commonly used in conversation and writing to express contrast, that is, to continue the sentence with information that changes, complicates, or contrasts with what was stated before. The expression '尽管如此' can be closely translated to 'nevertheless', 'however', or 'but still' in English.",
    "formation": "Sentence/Clause, + 尽管如此, + Contrasting Sentence/Clause",
    "examples": [
      {
        "cn": "天气预报说今天会下雨，尽管如此，我还是决定出去散步。",
        "pinyin": "Tiānqì yùbào shuō jīntiān huì xià yǔ, jǐnguǎn rúcǐ, wǒ háishì juédìng chūqù sànbù.",
        "en": "The weather forecast says it will rain today, however, I still decided to go out for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_however_20231230_天气预报说今天会下雨尽管如此我还是决定出去散步.mp3"
      },
      {
        "cn": "他才七岁，尽管如此，他已经能演奏钢琴了。",
        "pinyin": "Tā cái qī suì, jǐnguǎn rúcǐ, tā yǐjīng néng yǎnzòu gāngqín le.",
        "en": "He is only seven years old, nevertheless, he can already play the piano.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_however_20231230_他才七岁尽管如此他已经能演奏钢琴了.mp3"
      },
      {
        "cn": "我们明明失去了这场比赛，尽管如此，我们都学到了宝贵的经验。",
        "pinyin": "Wǒmen míng míng shīqù le zhè chǎng bǐsài, jǐnguǎn rúcǐ, wǒmen dōu xuédào le bǎoguì de jīngyàn.",
        "en": "We clearly lost this game, nonetheless, we all learned valuable experience.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_however_20231230_我们明明失去了这场比赛尽管如此我们都学到了宝贵的经验.mp3"
      },
      {
        "cn": "我知道这门课程很难，尽管如此，我依然要选。",
        "pinyin": "Wǒ zhīdào zhè mén kèchéng hěn nán, jǐnguǎn rúcǐ, wǒ yīrán yào xuǎn.",
        "en": "I know this course is difficult, but still, I still want to choose it.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_however_20231230_我知道这门课程很难尽管如此我依然要选.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "若 (ruò) - If, in case",
    "short_explanation": "Used to express a condition or hypothesis.",
    "long_explanation": "'若 (ruò)' is a Chinese conjunction used for posing a condition or hypothesis in a sentence, similar to 'if' or 'in case' in English. The event or action appearing after this word is the hypothetical or conditional one.",
    "formation": "若 + Condition/Hypothesis, then... ",
    "examples": [
      {
        "cn": "若明天下雨，我们就不去公园散步了。",
        "pinyin": "Ruò míngtiān xià yǔ, wǒmen jiù bù qù gōngyuán sànbù le.",
        "en": "If it rains tomorrow, we will not go to the park for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若明天下雨我们就不去公园散步了.mp3"
      },
      {
        "cn": "若你不喜欢这道菜，我可以换一道。",
        "pinyin": "Ruò nǐ bù xǐhuan zhè dào cài, wǒ kěyǐ huàn yī dào.",
        "en": "If you don't like this dish, I can change it.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若你不喜欢这道菜我可以换一道.mp3"
      },
      {
        "cn": "若他们来期已过，我们就会开始开会。",
        "pinyin": "Ruò tāmen lái qī yǐguò, wǒmen jiù huì kāishǐ kāihuì.",
        "en": "If their arrival time has passed, we will start the meeting.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若他们来期已过我们就会开始开会.mp3"
      },
      {
        "cn": "若你想学钢琴，我可以教你。",
        "pinyin": "Ruò nǐ xiǎng xué gāngqín, wǒ kěyǐ jiāo nǐ.",
        "en": "If you want to learn piano, I can teach you.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若你想学钢琴我可以教你.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "鉴于 (jiànyú) - In light of, considering",
    "short_explanation": "Used to introduce a circumstance or factor that is being taken into account.",
    "long_explanation": "The Mandarin Chinese phrase '鉴于 (jiànyú)' is used to present a certain circumstance or factor that is considered or taken into account when making a particular decision or judgement. It is similar to 'in light of' or 'considering' in English. This phrase is often used at the beginning of a sentence to frame the context for what follows.",
    "formation": "鉴于 + Circumstance, + Main Sentence",
    "examples": [
      {
        "cn": "鉴于他的表现，我决定给他另一次机会。",
        "pinyin": "Jiànyú tā de biǎoxiàn, wǒ juédìng gěi tā lìng yīcì jīhuì.",
        "en": "In light of his performance, I decided to give him another chance.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于他的表现我决定给他另一次机会.mp3"
      },
      {
        "cn": "鉴于您的健康状况，我建议您减少工作的时间。",
        "pinyin": "Jiànyú nín de jiànkāng zhuàngkuàng, wǒ jiànyì nín jiǎnshǎo gōngzuò de shíjiān.",
        "en": "Considering your health condition, I suggest you reduce your working time.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于您的健康状况我建议您减少工作的时间.mp3"
      },
      {
        "cn": "鉴于这个项目的重要性，我们应该尽早开始。",
        "pinyin": "Jiànyú zhègè xiàngmù de zhòngyàoxìng, wǒmen yīnggāi jìnzǎo kāishǐ.",
        "en": "In light of the importance of this project, we should start as early as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于这个项目的重要性我们应该尽早开始.mp3"
      },
      {
        "cn": "鉴于这场比赛的难度，队员们准备了几个月。",
        "pinyin": "Jiànyú zhè chǎng bǐsài de nándù, duìyuánmen zhǔnbèi le jǐ ge yuè.",
        "en": "Considering the difficulty of this match, the team members prepared for several months.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于这场比赛的难度队员们准备了几个月.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "除了...以外 (chúle... yǐwài) - Except for, besides",
    "short_explanation": "This phrase is used to indicate an exception or contrast.",
    "long_explanation": "The Mandarin Chinese phrase '除了...以外 (chúle... yǐwài)' is used in situations where you want to indicate an exception or to express contrast. It is similar to 'except for' or 'besides' in English. This phrase allows you to highlight something or someone that stands out from the rest in a particular context.",
    "formation": "'除了' + Exception or Unique Aspect + '以外' + Rest of the sentence (can be the general or default situation)",
    "examples": [
      {
        "cn": "除了义工以外，我还有一份兼职工作。",
        "pinyin": "Chúle yìgōng yǐwài, wǒ hái yǒu yīfèn jiānzhí gōngzuò.",
        "en": "Besides volunteering, I also have a part-time job.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Except_for_besides_20231230_除了义工以外我还有一份兼职工作.mp3"
      },
      {
        "cn": "除了她以外，其他人都接受了邀请。",
        "pinyin": "Chúle tā yǐwài, qítā rén dōu jiēshòu le yāoqǐng.",
        "en": "Except for her, everyone else accepted the invitation.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Except_for_besides_20231230_除了她以外其他人都接受了邀请.mp3"
      },
      {
        "cn": "除了篮球以外，我还喜欢游泳。",
        "pinyin": "Chúle lánqiú yǐwài, wǒ hái xǐhuan yóuyǒng.",
        "en": "Besides basketball, I also like swimming.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Except_for_besides_20231230_除了篮球以外我还喜欢游泳.mp3"
      },
      {
        "cn": "除了周末以外，我每天都去健身房运动。",
        "pinyin": "Chúle zhōumò yǐwài, wǒ měitiān dōu qù jiànshēnfáng yùndòng.",
        "en": "Except for the weekend, I go to the gym every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Except_for_besides_20231230_除了周末以外我每天都去健身房运动.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "虽说 (suīshuō) - Although, though",
    "short_explanation": "A grammar point frequently used to express contrast or conflict.",
    "long_explanation": "The Mandarin Chinese word '虽说 (suīshuō)' is a conjunction that can be used to make complex sentences by showing a contrast between two clauses. It translates to 'although' or 'though' in English. Typically, the first clause after '虽说' introduces a fact or acknowledged truth, while the second clause that follows presents an unexpected or contradictory result or action.",
    "formation": "虽说 + Statement, but + Contrasting Statement",
    "examples": [
      {
        "cn": "虽说他很年轻，但他的思想却非常成熟。",
        "pinyin": "Suīshuō tā hěn niánqīng, dàn tā de sīxiǎng què fēicháng chéngshú.",
        "en": "Although he's very young, his thought is incredibly mature.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suīshuō_-_Although_though_20231230_虽说他很年轻但他的思想却非常成熟.mp3"
      },
      {
        "cn": "虽说她对画画很有热情，但她却决定成为一名医生。",
        "pinyin": "Suīshuō tā duì huàhuà hěn yǒu rèqíng, dàn tā què juédìng chéngwéi yīmíng yīshēng.",
        "en": "Although she is passionate about painting, she decided to become a doctor.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suīshuō_-_Although_though_20231230_虽说她对画画很有热情但她却决定成为一名医生.mp3"
      },
      {
        "cn": "虽说这部电影很长，但我没有觉得无聊。",
        "pinyin": "Suīshuō zhè bù diànyǐng hěn cháng, dàn wǒ méiyǒu juédé wúliáo.",
        "en": "Even though the movie was really long, I didn't feel bored.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suīshuō_-_Although_though_20231230_虽说这部电影很长但我没有觉得无聊.mp3"
      },
      {
        "cn": "虽说他很努力，但是他还是没能通过HSK 6级考试。",
        "pinyin": "Suīshuō tā hěn nǔlì, dànshì tā háishì méinéng tōngguò HSK 6 jí kǎoshì.",
        "en": "Although he studied very hard, he still didn't pass the HSK Level 6 test.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suīshuō_-_Although_though_20231230_虽说他很努力但是他还是没能通过HSK_6级考试.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "不管 (bùguǎn) - No matter (how, what, etc.)",
    "short_explanation": "Used to express 'regardless of' or 'no matter what'.",
    "long_explanation": "The Mandarin Chinese conjunction '不管 (bùguǎn)' is used to express the concept of 'no matter what' or 'regardless of'. It is used when the speaker wants to emphasize that a certain situation or event will occur or is true, irrespective of the circumstances.",
    "formation": "不管 + Condition, Main Clause",
    "examples": [
      {
        "cn": "不管天气怎么样，我都会去跑步。",
        "pinyin": "Bùguǎn tiānqì zěnme yàng, wǒ dōu huì qù pǎobù.",
        "en": "No matter what the weather is like, I will go jogging.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_No_matter_how_what_etc_20231230_不管天气怎么样我都会去跑步.mp3"
      },
      {
        "cn": "不管考试成绩如何，我已经尽力了。",
        "pinyin": "Bùguǎn kǎoshì chéngjī rúhé, wǒ yǐjīng jìnlìle.",
        "en": "No matter how the exam results turn out, I've already done my best.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_No_matter_how_what_etc_20231230_不管考试成绩如何我已经尽力了.mp3"
      },
      {
        "cn": "不管你说什么，我都不会改变我的决定。",
        "pinyin": "Bùguǎn nǐ shuō shénme, wǒ dōu bù huì gǎibiàn wǒ de juédìng.",
        "en": "No matter what you say, I will not change my decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_No_matter_how_what_etc_20231230_不管你说什么我都不会改变我的决定.mp3"
      },
      {
        "cn": "不管多远，我都会去参加你的婚礼。",
        "pinyin": "Bùguǎn duō yuǎn, wǒ dōu huì qù cānjiā nǐ de hūnlǐ.",
        "en": "No matter how far it is, I will attend your wedding.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_No_matter_how_what_etc_20231230_不管多远我都会去参加你的婚礼.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "只要 (zhǐyào) - As long as",
    "short_explanation": "Used to express a condition that if fulfilled, something else will be or become the case.",
    "long_explanation": "The Mandarin Chinese phrase '只要 (zhǐyào)' is a conjunction used to state a condition, and it essentially means 'as long as' in English. It leads a clause that sets a prerequisite for the main clause. If the condition set by '只要' is met, then the action or state in the main clause can occur or be true.",
    "formation": "只要 + Condition, Main Clause",
    "examples": [
      {
        "cn": "只要你努力，你就能成功。",
        "pinyin": "Zhǐyào nǐ nǔlì, nǐ jiù néng chénggōng.",
        "en": "As long as you work hard, you can succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要你努力你就能成功.mp3"
      },
      {
        "cn": "只要天气好，我们就去公园。",
        "pinyin": "Zhǐyào tiānqì hǎo, wǒmen jiù qù gōngyuán.",
        "en": "As long as the weather is good, we will go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要天气好我们就去公园.mp3"
      },
      {
        "cn": "只要你爱我，我就会感到幸福。",
        "pinyin": "Zhǐyào nǐ ài wǒ, wǒ jiù huì gǎndào xìngfú.",
        "en": "As long as you love me, I will feel happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要你爱我我就会感到幸福.mp3"
      },
      {
        "cn": "只要我有时间，我就会帮你学习中文。",
        "pinyin": "Zhǐyào wǒ yǒu shíjiān, wǒ jiù huì bāng nǐ xuéxí Zhōngwén.",
        "en": "As long as I have time, I will help you study Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要我有时间我就会帮你学习中文.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "宁愿 (nìngyuàn) - Would rather, prefer to",
    "short_explanation": "Used to express one's preference to do (or not do) something.",
    "long_explanation": "The Mandarin Chinese word '宁愿 (nìngyuàn)' is used to indicate a preference towards a certain action or state, often at the expense of another less preferred option. It is similar to the expression 'would rather' in English. When used in a sentence, it shows what the speaker would rather do or prefers.",
    "formation": "Subject + 宁愿 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "我宁愿读一本好书，也不想看那些没意思的电视节目。",
        "pinyin": "Wǒ nìngyuàn dú yī běn hǎoshū, yě bùxiǎng kàn nàxiē méiyìsi de diànshì jiémù.",
        "en": "I would rather read a good book than watch those boring television shows.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁愿_nìngyuàn_-_Would_rather_prefer_to_20231230_我宁愿读一本好书也不想看那些没意思的电视节目.mp3"
      },
      {
        "cn": "他宁愿早点儿起床也不想错过早晨的日出。",
        "pinyin": "Tā nìngyuàn zǎodiǎn'er qǐchuáng yě bùxiǎng cuòguò zǎochén de rìchū.",
        "en": "He would rather get up early than miss the sunrise in the morning.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁愿_nìngyuàn_-_Would_rather_prefer_to_20231230_他宁愿早点儿起床也不想错过早晨的日出.mp3"
      },
      {
        "cn": "如果有机会的话，我宁愿去度假，而不是呆在家里。",
        "pinyin": "Rúguǒ yǒu jīhuì dehuà, wǒ nìngyuàn qù dùjià, ér búshì dāi zài jiā lǐ.",
        "en": "If I have the chance, I would rather go on vacation than stay at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁愿_nìngyuàn_-_Would_rather_prefer_to_20231230_如果有机会的话我宁愿去度假而不是呆在家里.mp3"
      },
      {
        "cn": "他宁愿一个人去旅行，也不喜欢跟团游。",
        "pinyin": "Tā nìngyuàn yīgè rén qù lǚxíng, yě bù xǐhuān gēn tuányóu.",
        "en": "He would rather travel alone than join a tour group.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁愿_nìngyuàn_-_Would_rather_prefer_to_20231230_他宁愿一个人去旅行也不喜欢跟团游.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "尤其 (yóuqí) - Especially, particularly",
    "short_explanation": "Used to emphasize that something is more important or significant.",
    "long_explanation": "In Mandarin Chinese, '尤其 (yóuqí)' is used to indicate that something is of particular importance or significance, above other things. This adverb can be used to stress a point or single out one or more things in a group. In English, it would translate to 'especially', 'particularly' or 'above all'.",
    "formation": "Subject + Verb + 尤其 + rest of the sentence",
    "examples": [
      {
        "cn": "我喜欢吃水果，尤其是苹果。",
        "pinyin": "Wǒ xǐhuān chī shuǐguǒ, yóuqí shì píngguǒ.",
        "en": "I like eating fruits, especially apples.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我喜欢吃水果尤其是苹果.mp3"
      },
      {
        "cn": "这部电影很感人，尤其是最后一幕。",
        "pinyin": "Zhè bù diànyǐng hěn gǎnrén, yóuqí shì zuìhòu yīmù.",
        "en": "This movie is very touching, especially the last scene.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_这部电影很感人尤其是最后一幕.mp3"
      },
      {
        "cn": "这个城市的建筑风格很特别，尤其是那些老房子。",
        "pinyin": "Zhè gè chéngshì de jiànzhú fēnggé hěn tèbié, yóuqí shì nàxiē lǎofángzi.",
        "en": "The architectural style of this city is quite special, especially those old houses.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_这个城市的建筑风格很特别尤其是那些老房子.mp3"
      },
      {
        "cn": "我喜欢听音乐，尤其是古典音乐。",
        "pinyin": "Wǒ xǐhuān tīng yīnyuè, yóuqí shì gǔdiǎn yīnyuè.",
        "en": "I like listening to music, particularly classical music.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我喜欢听音乐尤其是古典音乐.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "一旦 (yīdàn) - Once, in case",
    "short_explanation": "This phrase is used to describe a condition that once it happened, a certain result will follow.",
    "long_explanation": "'一旦 (yīdàn)' is a conjunction in Mandarin that translates as 'once' or 'in case'. This phrase is used to denote a hypothetical situation, which indicates that if such a situation occurs or once it occurs, a certain result or consequence will happen. It typically accompanies certain verbs to reflect this consequential relationship between two scenarios.",
    "formation": "一旦 + Condition, Consequence",
    "examples": [
      {
        "cn": "一旦下雨，我们就必须取消我们的野餐计划。",
        "pinyin": "Yīdàn xià yǔ, wǒmen jiù bìxū qǔxiāo wǒmen de yěcān jìhuà.",
        "en": "Once it rains, we must cancel our picnic plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_20231230_一旦下雨我们就必须取消我们的野餐计划.mp3"
      },
      {
        "cn": "你们一旦签了这份合同，就不能再改变主意了。",
        "pinyin": "Nǐmen yīdàn qiān le zhè fèn hétóng, jiù bùnéng zài gǎibiàn zhǔyi le.",
        "en": "Once you sign this contract, you can't change your mind anymore.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_20231230_你们一旦签了这份合同就不能再改变主意了.mp3"
      },
      {
        "cn": "一旦他决定做某事，就没有人能阻止他。",
        "pinyin": "Yīdàn tā juédìng zuò mǒushì, jiù méiyǒu rén néng zǔzhǐ tā.",
        "en": "Once he decides to do something, no one can stop him.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_20231230_一旦他决定做某事就没有人能阻止他.mp3"
      },
      {
        "cn": "一旦爸爸知道了这件事，妈妈肯定会有麻烦。",
        "pinyin": "Yīdàn bàba zhīdào le zhè jiàn shì, māma kěndìng huì yǒu máfan.",
        "en": "Once dad knows about this, mom will definitely be in trouble.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_20231230_一旦爸爸知道了这件事妈妈肯定会有麻烦.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "否则 (fǒuzé) - Otherwise",
    "short_explanation": "Used to express the consequence of an unfulfilled condition.",
    "long_explanation": "The Mandarin Chinese phrase '否则 (fǒuzé)' is a conjunction that is used to indicate the negative consequences or outcomes that may occur if a certain condition is not met. It is similar to the English term 'otherwise'. This phrase is often used as a warning or to provide an alternative outcome to a given situation.",
    "formation": "Condition (clause) + 否则 + Consequence (clause)",
    "examples": [
      {
        "cn": "你应该多吃一点，否则你会饿的。",
        "pinyin": "Nǐ yīnggāi duō chī yīdiǎn, fǒuzé nǐ huì è de.",
        "en": "You should eat a bit more, otherwise you will be hungry.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_20231230_你应该多吃一点否则你会饿的.mp3"
      },
      {
        "cn": "我们必须即时行动，否则就来不及了。",
        "pinyin": "Wǒmen bìxū jíshí xíngdòng, fǒuzé jiù lái bùjí le.",
        "en": "We must act immediately, otherwise it will be too late.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_20231230_我们必须即时行动否则就来不及了.mp3"
      },
      {
        "cn": "记得要带伞出门，否则如果下雨你会淋湿。",
        "pinyin": "Jìdé yào dài sǎn chūmén, fǒuzé rúguǒ xià yǔ nǐ huì línshī.",
        "en": "Remember to bring an umbrella when you go out, otherwise you will get wet if it rains.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_20231230_记得要带伞出门否则如果下雨你会淋湿.mp3"
      },
      {
        "cn": "请输入您的密码，否则您将无法登录您的账户。",
        "pinyin": "Qǐngshūrù nín de mìmǎ, fǒuzé nín jiāng wúfǎ dēnglù nín de zhànghù.",
        "en": "Please enter your password, otherwise you will not be able to log in to your account.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_20231230_请输入您的密码否则您将无法登录您的账户.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "偶尔 (ǒu'ěr) - Occasionally, now and then",
    "short_explanation": "Used to express the occurrence of an action or event at infrequent intervals.",
    "long_explanation": "偶尔 (ǒu'ěr) is a Mandarin Chinese adverb used to indicate that something happens sometimes, but not often or regularly. It translates to 'occasionally' or 'now and then' in English. It conveys the sense of randomness and infrequency associated with the occurrence of an event or action.",
    "formation": "Subject + 偶尔 + Verb + Object",
    "examples": [
      {
        "cn": "我偶尔去公园散步。",
        "pinyin": "Wǒ ǒu'ěr qù gōngyuán sànbù.",
        "en": "I occasionally go for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_now_and_then_20231230_我偶尔去公园散步.mp3"
      },
      {
        "cn": "他偶尔会喝一杯咖啡提神。",
        "pinyin": "Tā ǒu'ěr huì hē yībēi kāfēi tíshén.",
        "en": "He occasionally drinks a cup of coffee to refresh himself.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_now_and_then_20231230_他偶尔会喝一杯咖啡提神.mp3"
      },
      {
        "cn": "我偶尔也会感到紧张。",
        "pinyin": "Wǒ ǒu'ěr yě huì gǎndào jǐnzhāng.",
        "en": "I occasionally feel nervous too.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_now_and_then_20231230_我偶尔也会感到紧张.mp3"
      },
      {
        "cn": "他偶尔写一些诗歌，但从不公开。",
        "pinyin": "Tā ǒu'ěr xiě yīxiē shīgē, dàn cóng bù gōngkāi.",
        "en": "He occasionally writes some poems, but never makes them public.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_now_and_then_20231230_他偶尔写一些诗歌但从不公开.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "此外 (cǐwài) - In addition, moreover",
    "short_explanation": "Used to introduce additional information or points.",
    "long_explanation": "'此外 (cǐwài)' is a conjunction commonly used in Mandarin Chinese to present additional information, similar to 'in addition' or 'moreover' in English. When you want to talk about more than one point or detail something further, you can use '此外'.",
    "formation": "此外，+ Sentence",
    "examples": [
      {
        "cn": "他是个很好的老师。此外，他还是一个优秀的父亲。",
        "pinyin": "Tā shì gè hěn hǎo de lǎoshī. Cǐwài, tā hái shì yīgè yōuxiù de fùqīn.",
        "en": "He is a great teacher. In addition, he is also an excellent father.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_In_addition_moreover_20231230_他是个很好的老师此外他还是一个优秀的父亲.mp3"
      },
      {
        "cn": "我喜欢看书和画画。此外，我也喜欢听音乐。",
        "pinyin": "Wǒ xǐhuān kànshū hé huàhuà. Cǐwài, wǒ yě xǐhuān tīng yīnyuè.",
        "en": "I like reading and drawing. Moreover, I also enjoy listening to music.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_In_addition_moreover_20231230_我喜欢看书和画画此外我也喜欢听音乐.mp3"
      },
      {
        "cn": "我们需要购买新的家电。此外，我们还需要装修客厅。",
        "pinyin": "Wǒmen xūyào gòumǎi xīn de jiādiàn. Cǐwài, wǒmen hái xūyào zhuāngxiū kètīng.",
        "en": "We need to purchase new appliances. In addition, we also need to renovate the living room.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_In_addition_moreover_20231230_我们需要购买新的家电此外我们还需要装修客厅.mp3"
      },
      {
        "cn": "他已经获得了硕士学位。此外，他还学过两种外语。",
        "pinyin": "Tā yǐjīng huòdéle shuòshì xuéwèi. Cǐwài, tā hái xuéguò liǎng zhǒng wàiyǔ.",
        "en": "He has already obtained a master's degree. Moreover, he has also learned two foreign languages.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_In_addition_moreover_20231230_他已经获得了硕士学位此外他还学过两种外语.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "起初 (qǐchū) - At first, originally",
    "short_explanation": "This phrase is used to refer to the beginning of a situation or a period of time.",
    "long_explanation": "起初 (qǐchū) is a Mandarin Chinese adverb of time which is used to indicate the very beginning of a situation, an event, or a timeframe. It is equivalent to the English phrases 'at first' or 'originally'. This phrase is used in contexts where there is a change or shift from the original state as the situation evolves.",
    "formation": "起初 + sentence",
    "examples": [
      {
        "cn": "起初，他对学习中文没有兴趣，但现在他很喜欢。",
        "pinyin": "Qǐchū, tā duì xuéxí Zhōngwén méiyǒu xìngqù, dàn xiànzài tā hěn xǐhuān.",
        "en": "At first, he was not interested in learning Chinese, but now he likes it very much.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初他对学习中文没有兴趣但现在他很喜欢.mp3"
      },
      {
        "cn": "起初，我们认为这个项目会很容易，但实际上它非常复杂。",
        "pinyin": "Qǐchū, wǒmen rènwéi zhège xiàngmù huì hěn róngyì, dàn shíjì shàng tā fēicháng fùzá.",
        "en": "At first, we thought this project would be easy, but it actually turned out to be extremely complex.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初我们认为这个项目会很容易但实际上它非常复杂.mp3"
      },
      {
        "cn": "起初，我对这家公司的工作环境有所怀疑，但我现在很适应。",
        "pinyin": "Qǐchū, wǒ duì zhè jiā gōngsī de gōngzuò huánjìng yǒusuǒ huáiyí, dàn wǒ xiànzài hěn shìyìng.",
        "en": "Originally, I had reservations about the work environment of this company, but I am quite comfortable with it now.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初我对这家公司的工作环境有所怀疑但我现在很适应.mp3"
      },
      {
        "cn": "起初，他们反对这个提案，但经过讨论，他们改变了立场。",
        "pinyin": "Qǐchū, tāmen fǎnduì zhège tí'àn, dàn jīngguò tǎolùn, tāmen gǎibiànle lìchǎng.",
        "en": "At first, they were opposed to the proposal, but after discussions, they changed their stand.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初他们反对这个提案但经过讨论他们改变了立场.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "依然 (yīrán) - Still, as before",
    "short_explanation": "Used to express that something remains the same or continues in the same state.",
    "long_explanation": "'依然 (yīrán)' is a Mandarin Chinese adverb that indicates something continues to be in the same state, condition or manner, similar to 'still' or 'as before' in English. It is used to stress the continuous existence or happening of something, despite changes in circumstances or passage of time.",
    "formation": "Subject + 依然 + Predicate",
    "examples": [
      {
        "cn": "虽然我们已经离开了那个城市，但我对它的爱依然如初。",
        "pinyin": "Suīrán wǒmen yǐjīng líkāile nàgè chéngshì, dàn wǒ duì tā de ài yīrán rúchū.",
        "en": "Although we have already left that city, my love for it is still as before.",
        "grammar_audio": "/audio/mandarin/grammar/s_依然_yīrán_-_Still_as_before_20231230_虽然我们已经离开了那个城市但我对它的爱依然如初.mp3"
      },
      {
        "cn": "她虽然年纪大了，但她的眼睛依然明亮。",
        "pinyin": "Tā suīrán niánjì dàle, dàn tā de yǎnjīng yīrán míngliàng.",
        "en": "Although she is old, her eyes are still bright.",
        "grammar_audio": "/audio/mandarin/grammar/s_依然_yīrán_-_Still_as_before_20231230_她虽然年纪大了但她的眼睛依然明亮.mp3"
      },
      {
        "cn": "尽管已经过去了很多年，但我对你的怀念依然满满。",
        "pinyin": "Jǐnguǎn yǐjīng guòqùle hěnduō nián, dàn wǒ duì nǐ de huáiniàn yīrán mǎnmǎn.",
        "en": "Although many years have passed, my longing for you is still full.",
        "grammar_audio": "/audio/mandarin/grammar/s_依然_yīrán_-_Still_as_before_20231230_尽管已经过去了很多年但我对你的怀念依然满满.mp3"
      },
      {
        "cn": "他虽然失败了，但他的决心依然坚定。",
        "pinyin": "Tā suīrán shībàile, dàn tā de juéxīn yīrán jiāndìng.",
        "en": "Although he failed, his determination is still firm.",
        "grammar_audio": "/audio/mandarin/grammar/s_依然_yīrán_-_Still_as_before_20231230_他虽然失败了但他的决心依然坚定.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "毕竟 (bìjìng) - After all, all in all",
    "short_explanation": "Used to indicate that an action or situation is determined by considering all factors.",
    "long_explanation": "The Mandarin Chinese word '毕竟 (bìjìng)' is often used to express a concession or a summary of factors. It is equivalent to 'after all' or 'all in all' in English. This word is typically used to describe a realization that comes after considering all relevant factors or circumstances.",
    "formation": "Sentence + 毕竟 + Sentence.",
    "examples": [
      {
        "cn": "你毕竟是我的朋友, 我会帮你的。",
        "pinyin": "Nǐ bìjìng shì wǒ de péngyǒu, wǒ huì bāng nǐ de.",
        "en": "After all, you are my friend, I will help you.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_all_in_all_20231230_你毕竟是我的朋友_我会帮你的.mp3"
      },
      {
        "cn": "毕竟我是他的老师，有责任引导他走向正确的道路。",
        "pinyin": "Bìjìng wǒ shì tā de lǎoshī, yǒu zérèn yǐndǎo tā zǒu xiàng zhèngquè de dàolù.",
        "en": "After all, I am his teacher and have the responsibility to guide him to the right path.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_all_in_all_20231230_毕竟我是他的老师有责任引导他走向正确的道路.mp3"
      },
      {
        "cn": "毕竟他是新员工，我们需要给他一些时间来了解工作。",
        "pinyin": "Bìjìng tā shì xīn yuángōng, wǒmen xūyào gěi tā yīxiē shíjiān lái liǎojiě gōngzuò.",
        "en": "After all, he is a new employee, we need to give him some time to understand the work.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_all_in_all_20231230_毕竟他是新员工我们需要给他一些时间来了解工作.mp3"
      },
      {
        "cn": "他毕竟是个孩子，他需要我们的爱和关怀。",
        "pinyin": "Tā bìjìng shì gè háizi, tā xūyào wǒmen de ài hé guānhuái.",
        "en": "After all, he is a child, he needs our love and care.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_all_in_all_20231230_他毕竟是个孩子他需要我们的爱和关怀.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "不同于 (bùtóngyú) - Different from",
    "short_explanation": "Used to express difference between two things or situations.",
    "long_explanation": "The Mandarin Chinese phrase '不同于 (bùtóngyú)' is used to indicate distinction or difference between two entities, situations, or ideas. It is equivalent to 'different from' in English. This phrase is often used in situations where a comparison is being made to draw attention to the differences or unique qualities of something.",
    "formation": "Subject + 不同于 + Object",
    "examples": [
      {
        "cn": "中国的文化不同于美国的文化。",
        "pinyin": "Zhōngguó de wénhuà bùtóngyú Měiguó de wénhuà.",
        "en": "Chinese culture is different from American culture.",
        "grammar_audio": "/audio/mandarin/grammar/s_不同于_bùtóngyú_-_Different_from_20231230_中国的文化不同于美国的文化.mp3"
      },
      {
        "cn": "爵士音乐不同于古典音乐。",
        "pinyin": "Juéshì yīnyuè bùtóngyú gǔdiǎn yīnyuè.",
        "en": "Jazz music is different from classical music.",
        "grammar_audio": "/audio/mandarin/grammar/s_不同于_bùtóngyú_-_Different_from_20231230_爵士音乐不同于古典音乐.mp3"
      },
      {
        "cn": "我哥哥的性格不同于我，他比我更开朗。",
        "pinyin": "Wǒ gēgē de xìnggé bùtóngyú wǒ, tā bǐ wǒ gèng kāilǎng.",
        "en": "My brother's personality is different from mine, he is more outgoing than I am.",
        "grammar_audio": "/audio/mandarin/grammar/s_不同于_bùtóngyú_-_Different_from_20231230_我哥哥的性格不同于我他比我更开朗.mp3"
      },
      {
        "cn": "这个设计的独特之处在于，它的颜色与形状不同于市场上的其他产品。",
        "pinyin": "Zhège shèjì de dútè zhī chù zàiyú, tā de yánsè yǔ xíngzhuàng bùtóngyú shìchǎng shàng de qítā chǎnpǐn.",
        "en": "The uniqueness of this design lies in that its color and shape are different from other products on the market.",
        "grammar_audio": "/audio/mandarin/grammar/s_不同于_bùtóngyú_-_Different_from_20231230_这个设计的独特之处在于它的颜色与形状不同于市场上的其他产品.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "50"
  },
  {
    "title": "除非 (chúfēi) - Unless",
    "short_explanation": "Used to express the condition that must be fulfilled for a certain result to happen.",
    "long_explanation": "In Mandarin Chinese, '除非 (chúfēi)' is a conditional conjunction equivalent to the English 'unless'. It is used to express the specific condition under which a certain event can occur. In other words, if the condition stated after 'chúfēi' isn't fulfilled, the result stated in the main clause won't happen.",
    "formation": "除非 + Condition, Main Sentence",
    "examples": [
      {
        "cn": "除非你努力学习，否则你不能通过HSK考试。",
        "pinyin": "Chúfēi nǐ nǔlì xuéxí, fǒuzé nǐ bùnéng tōngguò HSK kǎoshì.",
        "en": "Unless you study hard, you cannot pass the HSK exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你努力学习否则你不能通过HSK考试.mp3"
      },
      {
        "cn": "除非下雨，我明天就去公园跑步。",
        "pinyin": "Chúfēi xià yǔ, wǒ míngtiān jiù qù gōngyuán pǎobù.",
        "en": "Unless it rains, I am going to the park to run tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非下雨我明天就去公园跑步.mp3"
      },
      {
        "cn": "除非他改变态度，我们不会再和他合作。",
        "pinyin": "Chúfēi tā gǎibiàn tàidù, wǒmen bú huì zài hé tā hézuò.",
        "en": "Unless he changes his attitude, we will not cooperate with him again.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非他改变态度我们不会再和他合作.mp3"
      },
      {
        "cn": "除非你每天练习，否则你的中文不会提高。",
        "pinyin": "Chúfēi nǐ měitiān liànxí, fǒuzé nǐ de zhōngwén bú huì tígāo.",
        "en": "Unless you practice every day, your Chinese won't improve.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你每天练习否则你的中文不会提高.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "反映 (fǎnyìng) - Reflect, mirror",
    "short_explanation": "Used to express 'reflect' or 'mirror' in specific situations or actions.",
    "long_explanation": "The Mandarin Chinese term '反映 (fǎnyìng)' is used to indicate the reflection or the mirroring of a specific event, situation, or action. It's often used in describing the representation of reality, sentiments, or presenting results or outcomes. It can also imply the reflection of someone's thought or opinion.",
    "formation": "Subject + 反映 + Object",
    "examples": [
      {
        "cn": "这篇文章反映了作者对环保问题的看法。",
        "pinyin": "Zhè piān wénzhāng fǎnyìngle zuòzhě duì huánbǎo wèntí de kànfǎ.",
        "en": "This article reflects the author's views on environmental issues.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_mirror_20231230_这篇文章反映了作者对环保问题的看法.mp3"
      },
      {
        "cn": "他的行为反映了他的不成熟。",
        "pinyin": "Tā de xíngwéi fǎnyìngle tā de bù chéngshú.",
        "en": "His behavior reflects his immaturity.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_mirror_20231230_他的行为反映了他的不成熟.mp3"
      },
      {
        "cn": "考试的结果反映了你的努力程度。",
        "pinyin": "Kǎoshì de jiéguǒ fǎnyìngle nǐ de nǔlì chéngdù.",
        "en": "The results of the exam reflect your level of effort.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_mirror_20231230_考试的结果反映了你的努力程度.mp3"
      },
      {
        "cn": "人们的投票反映了他们对政府的不满。",
        "pinyin": "Rénmen de tóupiào fǎnyìngle tāmen duì zhèngfǔ de bùmǎn.",
        "en": "People's votes reflect their dissatisfaction with the government.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_mirror_20231230_人们的投票反映了他们对政府的不满.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "根据 (gēnjù) - Based on, According to",
    "short_explanation": "Used to refer to a basis or reference for making a statement or conducting an action.",
    "long_explanation": "The Mandarin Chinese phrase '根据 (gēnjù)' is used to signify the basis or reference from which a certain statement or action is derived. This phrase is equivalent to 'based on' or 'according to' in English. It sets the ground for the action or statement that follows, providing clarity and context.",
    "formation": "根据 + Noun (info, report, etc.) + Sentence",
    "examples": [
      {
        "cn": "根据天气预报，明天将会下雨。",
        "pinyin": "Gēnjù tiānqì yùbào, míngtiān jiānghuì xià yǔ.",
        "en": "Based on the weather forecast, it will rain tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_Based_on_According_to_20231230_根据天气预报明天将会下雨.mp3"
      },
      {
        "cn": "根据他的描述，我想那个人就是我正在找的。",
        "pinyin": "Gēnjù tā de miáoshù, wǒ xiǎng nàgè rén jiùshì wǒ zhèngzài zhǎo de.",
        "en": "Based on his description, I think that person is the one I'm looking for.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_Based_on_According_to_20231230_根据他的描述我想那个人就是我正在找的.mp3"
      },
      {
        "cn": "根据这篇报告，我们的销售额增长了。",
        "pinyin": "Gēnjù zhè piān bàogào, wǒmen de xiāoshòu é zēngzhǎng le.",
        "en": "According to this report, our sales have increased.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_Based_on_According_to_20231230_根据这篇报告我们的销售额增长了.mp3"
      },
      {
        "cn": "根据调查，大多数人支持这个政策。",
        "pinyin": "Gēnjù diàochá, dà duōshù rén zhīchí zhège zhèngcè.",
        "en": "According to the survey, most people support this policy.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_Based_on_According_to_20231230_根据调查大多数人支持这个政策.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "对比 (duìbǐ) - Compare, contrast",
    "short_explanation": "Used to compare or contrast two or more things, people, events or ideas.",
    "long_explanation": "The Mandarin Chinese phrase '对比 (duìbǐ)' is used when you want to make a comparison or highlight the contrast between two or more things, people, events or ideas. It is equivalent to 'compare, contrast' in English. This phrase is quite often used in discussions, arguments or simply in stating observations.",
    "formation": "Subject + 对比 + Object",
    "examples": [
      {
        "cn": "我们可以对比一下这两组数据，看看哪个方案更好。",
        "pinyin": "Wǒmen kěyǐ duìbǐ yīxià zhè liǎng zǔ shùjù, kàn kàn nǎge fāng'àn gèng hǎo.",
        "en": "We can compare these two sets of data to see which plan is better.",
        "grammar_audio": "/audio/mandarin/grammar/s_对比_duìbǐ_-_Compare_contrast_20231230_我们可以对比一下这两组数据看看哪个方案更好.mp3"
      },
      {
        "cn": "遇到困难时，我们应该对比成功的例子，找出问题的解决之道。",
        "pinyin": "Yùdào kùnnán shí, wǒmen yīnggāi duìbǐ chénggōng de lìzi, zhǎochū wèntí de jiějué zhī dào.",
        "en": "When facing difficulties, we should compare successful examples to find solutions to the problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_对比_duìbǐ_-_Compare_contrast_20231230_遇到困难时我们应该对比成功的例子找出问题的解决之道.mp3"
      },
      {
        "cn": "他喜欢对比不同音乐风格的特点和差异。",
        "pinyin": "Tā xǐhuān duìbǐ bùtóng yīnyuè fēnggé de tèdiǎn hé chāyì.",
        "en": "He likes to compare the characteristics and differences of different music styles.",
        "grammar_audio": "/audio/mandarin/grammar/s_对比_duìbǐ_-_Compare_contrast_20231230_他喜欢对比不同音乐风格的特点和差异.mp3"
      },
      {
        "cn": "通过对比他的早期作品和后期作品，你会发现他的成长。",
        "pinyin": "Tōngguò duìbǐ tā de zǎoqí zuòpǐn hé hòuqī zuòpǐn, nǐ huì fāxiàn tā de chéngzhǎng.",
        "en": "By comparing his early works and later works, you will see his growth.",
        "grammar_audio": "/audio/mandarin/grammar/s_对比_duìbǐ_-_Compare_contrast_20231230_通过对比他的早期作品和后期作品你会发现他的成长.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "不如 (bùrú) - Inferior to, not as good as",
    "short_explanation": "Used to express that something is not as good as something else.",
    "long_explanation": "The phrase '不如 (bùrú)' is used to compare two things, expressing the idea that one thing is inferior to or not as good as another. It can be used in various contexts and can compare people, things, or scenarios. It is an easy way to indicate preference or superiority.",
    "formation": "Subject + 不如 + Comparison target",
    "examples": [
      {
        "cn": "我觉得苹果不如香蕉好吃。",
        "pinyin": "Wǒ juédé píngguǒ bùrú xiāngjiāo hào chī.",
        "en": "I think apples are not as tasty as bananas.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Inferior_to_not_as_good_as_20231230_我觉得苹果不如香蕉好吃.mp3"
      },
      {
        "cn": "他的中文水平不如你高。",
        "pinyin": "Tā de zhōngwén shuǐpíng bùrú nǐ gāo.",
        "en": "His level of Chinese is not as high as yours.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Inferior_to_not_as_good_as_20231230_他的中文水平不如你高.mp3"
      },
      {
        "cn": "我不如他跑步快。",
        "pinyin": "Wǒ bùrú tā pǎobù kuài.",
        "en": "I'm not as fast as him in running.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Inferior_to_not_as_good_as_20231230_我不如他跑步快.mp3"
      },
      {
        "cn": "今天的天气不如昨天好。",
        "pinyin": "Jīntiān de tiānqì bùrú zuótiān hǎo.",
        "en": "Today's weather is not as good as yesterday's.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Inferior_to_not_as_good_as_20231230_今天的天气不如昨天好.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "替代 (tìdài) - Replace, substitute",
    "short_explanation": "Used to express the action of replacing or substituting one thing with another.",
    "long_explanation": "The Mandarin Chinese word '替代 (tìdài)' is used when we want to express the action of replacing one thing with another. We can use it to talk about replacing people, objects, or concepts with others. Usually, it is used in situations where an alternative is introduced as a substitute for a previous option. The structure of the sentence is noun + 被 + substituting noun + 替代.",
    "formation": "Noun 1 + 被 + Noun 2 + 替代",
    "examples": [
      {
        "cn": "传统的教学方式已经被在线教育替代了。",
        "pinyin": "Chuántǒng de jiàoxué fāngshì yǐjīng bèi zàixiàn jiàoyù tìdài le.",
        "en": "The traditional way of teaching has been replaced by online education.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_substitute_20231230_传统的教学方式已经被在线教育替代了.mp3"
      },
      {
        "cn": "肉类食物被素食替代，可以降低患心脏病的风险。",
        "pinyin": "Ròulèi shíwù bèi sùshí tìdài, kěyǐ jiàngdī huàn xīnzàngbìng de fēngxiǎn.",
        "en": "Replacing meat-based foods with vegetarian food can reduce the risk of heart disease.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_substitute_20231230_肉类食物被素食替代可以降低患心脏病的风险.mp3"
      },
      {
        "cn": "这款新手机目标是要替代现在市场上的老旧手机。",
        "pinyin": "Zhè kuǎn xīn shǒujī mùbiāo shì yào tìdài xiànzài shìchǎng shàng de lǎojiù shǒujī.",
        "en": "The goal of this new phone is to replace the old phones on the market.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_substitute_20231230_这款新手机目标是要替代现在市场上的老旧手机.mp3"
      },
      {
        "cn": "他被新来的员工替代了。",
        "pinyin": "Tā bèi xīn lái de yuángōng tìdài le.",
        "en": "He was replaced by a new employee.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_substitute_20231230_他被新来的员工替代了.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "好像 (hǎoxiàng) - Seem, be like",
    "short_explanation": "Used to express a similarity or resemblance to something.",
    "long_explanation": "The phrase '好像 (hǎoxiàng)' in Mandarin Chinese is used to portray a comparison or resemblance between things or actions. This is similar to using 'seem' or 'be like' in English. The expression is often used when making assumptions or speculating.",
    "formation": "Subject + 好像 + Predicate",
    "examples": [
      {
        "cn": "他好像生病了。",
        "pinyin": "Tā hǎoxiàng shēngbìng le.",
        "en": "He seems to be sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_好像_hǎoxiàng_-_Seem_be_like_20231230_他好像生病了.mp3"
      },
      {
        "cn": "这家餐厅的菜好像我妈妈做的一样。",
        "pinyin": "Zhè jiā cāntīng de cài hǎoxiàng wǒ māmā zuò de yīyàng.",
        "en": "The food at this restaurant is like the one my mother makes.",
        "grammar_audio": "/audio/mandarin/grammar/s_好像_hǎoxiàng_-_Seem_be_like_20231230_这家餐厅的菜好像我妈妈做的一样.mp3"
      },
      {
        "cn": "你好像有事要说。",
        "pinyin": "Nǐ hǎoxiàng yǒu shì yào shuō.",
        "en": "You seem to have something to say.",
        "grammar_audio": "/audio/mandarin/grammar/s_好像_hǎoxiàng_-_Seem_be_like_20231230_你好像有事要说.mp3"
      },
      {
        "cn": "外面好像要下雨。",
        "pinyin": "Wàimiàn hǎoxiàng yào xià yǔ.",
        "en": "It seems like it's going to rain outside.",
        "grammar_audio": "/audio/mandarin/grammar/s_好像_hǎoxiàng_-_Seem_be_like_20231230_外面好像要下雨.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "接着 (jiēzhe) - Following, then",
    "short_explanation": "Used to show the sequence of actions or events.",
    "long_explanation": "The Mandarin Chinese word '接着 (jiēzhe)' is used to indicate the sequence of events or actions, expressing 'following that' or 'then' in English. This adverb is used to connect two actions that happen one after the other.",
    "formation": "Action 1 + 接着 + Action 2",
    "examples": [
      {
        "cn": "我运动完，接着就去洗澡。",
        "pinyin": "Wǒ yùndòng wán, jiēzhe jiù qù xǐzǎo.",
        "en": "After I finished exercising, I went to take a shower.",
        "grammar_audio": "/audio/mandarin/grammar/s_接着_jiēzhe_-_Following_then_20231230_我运动完接着就去洗澡.mp3"
      },
      {
        "cn": "他吃完饭，接着去看电影。",
        "pinyin": "Tā chīwán fàn, jiēzhe qù kàn diànyǐng.",
        "en": "He finished eating, then he went to watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_接着_jiēzhe_-_Following_then_20231230_他吃完饭接着去看电影.mp3"
      },
      {
        "cn": "我先帮她做完了作业，接着我们一起看了个电视节目。",
        "pinyin": "Wǒ xiān bāng tā zuò wánle zuòyè, jiēzhe wǒmen yīqǐ kànle gè diànshì jiémù.",
        "en": "I first helped her finish her homework, then we watched a TV program together.",
        "grammar_audio": "/audio/mandarin/grammar/s_接着_jiēzhe_-_Following_then_20231230_我先帮她做完了作业接着我们一起看了个电视节目.mp3"
      },
      {
        "cn": "她听完音乐，接着开始阅读.",
        "pinyin": "Tā tīngwán yīnyuè, jiēzhe kāishǐ yuèdú.",
        "en": "She finished listening to the music, then she started to read.",
        "grammar_audio": "/audio/mandarin/grammar/s_接着_jiēzhe_-_Following_then_20231230_她听完音乐接着开始阅读.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "好处 (hǎochù) - Advantage/Benefit",
    "short_explanation": "Used to refer to the advantages or benefits of something or a situation.",
    "long_explanation": "The Mandarin Chinese word '好处 (hǎochù)' is used to talk about the benefits or positive aspects of something. It can be used in daily conversation when discussing the advantages of an activity, an object, or a situation. Similar to 'benefits' or 'advantages' in English, it often followed by a phrase or a sentence that indicates what the benefits are.",
    "formation": "Subject + Verb + 的 + 好处",
    "examples": [
      {
        "cn": "锻炼的好处是可以保持身体健康和精力充沛。",
        "pinyin": "Duànliàn de hǎochù shì kěyǐ bǎochí shēntǐ jiànkāng hé jīnglì chōngpèi.",
        "en": "The benefit of exercise is that it can maintain physical health and vitality.",
        "grammar_audio": "/audio/mandarin/grammar/s_好处_hǎochù_-_Advantage/Benefit_20231230_锻炼的好处是可以保持身体健康和精力充沛.mp3"
      },
      {
        "cn": "学习外语的好处不仅仅是能够与更多的人交流，还可以开阔我们的视野。",
        "pinyin": "Xuéxí wàiyǔ de hǎochù bù jǐnjǐn shì nénggòu yǔ gèng duō de rén jiāoliú, hái kěyǐ kāikuò wǒmen de shìyě.",
        "en": "The benefits of learning a foreign language are not only being able to communicate with more people, but also broadening our horizons.",
        "grammar_audio": "/audio/mandarin/grammar/s_好处_hǎochù_-_Advantage/Benefit_20231230_学习外语的好处不仅仅是能够与更多的人交流还可以开阔我们的视野.mp3"
      },
      {
        "cn": "我们需要了解环保的好处，才能更好地保护我们的地球。",
        "pinyin": "Wǒmen xūyào liǎojiě huánbǎo de hǎochù, cái néng gèng hǎo de bǎohù wǒmen de dìqiú.",
        "en": "We need to understand the benefits of environmental protection in order to better protect our earth.",
        "grammar_audio": "/audio/mandarin/grammar/s_好处_hǎochù_-_Advantage/Benefit_20231230_我们需要了解环保的好处才能更好地保护我们的地球.mp3"
      },
      {
        "cn": "读书的好处是可以提高我们的知识和技能。",
        "pinyin": "Dúshū de hǎochù shì kěyǐ tí gāo wǒmen de zhīshì hé jì néng.",
        "en": "The benefit of reading is it can improve our knowledge and skills.",
        "grammar_audio": "/audio/mandarin/grammar/s_好处_hǎochù_-_Advantage/Benefit_20231230_读书的好处是可以提高我们的知识和技能.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "到底 (dàodǐ) - After all, in the end",
    "short_explanation": "Used to express impatience or to emphasize a question.",
    "long_explanation": "The Mandarin Chinese phrase '到底 (dàodǐ)' is a commonly used to add emphasis to a question or a concept, equivalent to 'after all', 'in the end' or 'what on earth' in English. It expresses a kind of impatience or urgency and is usually used in questions, showing the questioner's eager to know the answer.",
    "formation": "Subject + 到底 + Verb + Object",
    "examples": [
      {
        "cn": "他到底是谁？我一直都不知道。",
        "pinyin": "Tā dàodǐ shì shéi? Wǒ yīzhí dōu bù zhīdào.",
        "en": "Who is he after all? I have always not known.",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_After_all_in_the_end_20231230_他到底是谁我一直都不知道.mp3"
      },
      {
        "cn": "你到底想不想去那个晚会？你一直改变你的主意。",
        "pinyin": "Nǐ dàodǐ xiǎng bùxiǎng qù nàgè wǎnhuì? Nǐ yīzhí gǎibiàn nǐ de zhǔyì.",
        "en": "Do you want to go to that party or not, after all? You keep changing your mind.",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_After_all_in_the_end_20231230_你到底想不想去那个晚会你一直改变你的主意.mp3"
      },
      {
        "cn": "这道数学问题你到底解决了没有？我已经等了很久。",
        "pinyin": "Zhè dào shùxué wèntí nǐ dàodǐ jiějuéle méiyǒu? Wǒ yǐjīng děngle hěnjiǔ.",
        "en": "Have you solved this math problem or not, after all? I've been waiting for a long time.",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_After_all_in_the_end_20231230_这道数学问题你到底解决了没有我已经等了很久.mp3"
      },
      {
        "cn": "这个任务你到底完成了没有？时间快到了。",
        "pinyin": "Zhège rènwu nǐ dàodǐ wánchéngle méiyǒu? Shíjiān kuài dàole.",
        "en": "Have you completed this task or not, after all? Time is almost up.",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_After_all_in_the_end_20231230_这个任务你到底完成了没有时间快到了.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "相当于 (xiāngdāngyú) - Equivalent to",
    "short_explanation": "Used to indicate equivalence or corresponding relationship between two things.",
    "long_explanation": "The Mandarin Chinese term '相当于 (xiāngdāngyú)' is used to express the concept of equivalence, or the idea that one thing corresponds to or is equivalent to another. It's similar in usage to the English phrase 'equivalent to'. This phrase is often used in comparisons to indicate that two elements possess the same value, function, role or effect.",
    "formation": "Noun 1 + 相当于 + Noun 2",
    "examples": [
      {
        "cn": "在美国中学，高中相当于我们的高中。",
        "pinyin": "Zài Měiguó zhōngxué, gāozhōng xiāngdāngyú wǒmen de gāozhōng.",
        "en": "In American secondary education, high school is equivalent to our high school.",
        "grammar_audio": "/audio/mandarin/grammar/s_相当于_xiāngdāngyú_-_Equivalent_to_20231230_在美国中学高中相当于我们的高中.mp3"
      },
      {
        "cn": "一英里相当于一点六公里。",
        "pinyin": "Yī yīnglǐ xiāngdāngyú yīdiǎn liù gōnglǐ.",
        "en": "One mile is equivalent to 1.6 kilometers.",
        "grammar_audio": "/audio/mandarin/grammar/s_相当于_xiāngdāngyú_-_Equivalent_to_20231230_一英里相当于一点六公里.mp3"
      },
      {
        "cn": "在这个项目中，他相当于我们的领导。",
        "pinyin": "Zài zhège xiàngmù zhōng, tā xiāngdāngyú wǒmen de lǐngdǎo.",
        "en": "In this project, he is equivalent to our leader.",
        "grammar_audio": "/audio/mandarin/grammar/s_相当于_xiāngdāngyú_-_Equivalent_to_20231230_在这个项目中他相当于我们的领导.mp3"
      },
      {
        "cn": "对我来说，读书相当于呼吸一样重要。",
        "pinyin": "Duì wǒ lái shuō, dúshū xiāngdāngyú hūxī yīyàng zhòngyào.",
        "en": "For me, reading is as important as breathing.",
        "grammar_audio": "/audio/mandarin/grammar/s_相当于_xiāngdāngyú_-_Equivalent_to_20231230_对我来说读书相当于呼吸一样重要.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "难怪 (nánguài) - No wonder, so that's why",
    "short_explanation": "Used to express understanding when something has been explained or becomes clear.",
    "long_explanation": "The Mandarin Chinese phrase '难怪 (nánguài)' is used when something previous unclear or puzzling becomes comprehensible or logical. It roughly translates to 'no wonder' or 'so that's why' in English. It signals realization of a reason or explanation for a certain situation.",
    "formation": "难怪 + Reason.",
    "examples": [
      {
        "cn": "难怪你不回我的电话，你的手机丢了。",
        "pinyin": "Nánguài nǐ bù huí wǒ de diànhuà, nǐ de shǒujī diūle.",
        "en": "No wonder you didn’t answer my phone calls, you lost your phone.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪你不回我的电话你的手机丢了.mp3"
      },
      {
        "cn": "难怪他今天没来上课，他生病了。",
        "pinyin": "Nánguài tā jīntiān méi lái shàngkè, tā shēngbìng le.",
        "en": "No wonder he didn't come to class today, he's sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪他今天没来上课他生病了.mp3"
      },
      {
        "cn": "难怪这个菜这么好吃，原来是你做的。",
        "pinyin": "Nánguài zhège cài zhème hào chī, yuánlái shì nǐ zuò de.",
        "en": "No wonder this dish is so delicious, it turns out you made it.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪这个菜这么好吃原来是你做的.mp3"
      },
      {
        "cn": "难怪你这么熟悉这个地方，你在这里住了五年。",
        "pinyin": "Nánguài nǐ zhème shúxī zhège dìfāng, nǐ zài zhèlǐ zhùle wǔ nián.",
        "en": "No wonder you're so familiar with this place, you've lived here for five years.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪你这么熟悉这个地方你在这里住了五年.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "似乎 (sìhū) - It seems that, as if",
    "short_explanation": "It is used to express uncertainty or an estimation.",
    "long_explanation": "The phrase '似乎 (sìhū)' is used in Mandarin Chinese to express a feeling of uncertainty or to make an estimate about a situation. It can be used to imply conjecture or an indirect observation about something. It translates to 'it seems that' or 'as if' in English.",
    "formation": "Subject + 似乎 + Verb/Adjective + Rest of the sentence.",
    "examples": [
      {
        "cn": "他似乎不太喜欢吃辣的食物，每次有辣椒他都会避开。",
        "pinyin": "Tā sìhū bù tài xǐhuān chī là de shíwù, měicì yǒu làjiāo tā dōu huì bìkāi.",
        "en": "It seems that he doesn't like spicy food much, he always avoids chilli every time.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_It_seems_that_as_if_20231230_他似乎不太喜欢吃辣的食物每次有辣椒他都会避开.mp3"
      },
      {
        "cn": "她似乎在找什么，四处张望。",
        "pinyin": "Tā sìhū zài zhǎo shénme, sìchù zhāngwàng.",
        "en": "She seems to be looking for something, looking around everywhere.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_It_seems_that_as_if_20231230_她似乎在找什么四处张望.mp3"
      },
      {
        "cn": "明天的天气似乎会很冷，记得多穿衣物。",
        "pinyin": "Míngtiān de tiānqì sìhū huì hěn lěng, jìdé duō chuān yīwù.",
        "en": "The weather seems to be very cold tomorrow, remember to wear more clothes.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_It_seems_that_as_if_20231230_明天的天气似乎会很冷记得多穿衣物.mp3"
      },
      {
        "cn": "似乎有人在敲门，你去开一下。",
        "pinyin": "Sìhū yǒurén zài qiāo mén, nǐ qù kāi yīxià.",
        "en": "It seems that someone is knocking on the door, you go and open it.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_It_seems_that_as_if_20231230_似乎有人在敲门你去开一下.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "逐渐 (zhújiàn) - Gradually",
    "short_explanation": "Used to describe an action or event that happens slowly over a period of time.",
    "long_explanation": "The Mandarin Chinese term '逐渐 (zhújiàn)' is used to describe an action, event or process that happens slowly and steadily, progressing over a period of time. It is equivalent to the concept of 'gradually' or 'little by little' in English. It is often used when referring to changes and developments that are not sudden, but instead, unfold progressively.",
    "formation": "Subject + 逐渐 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "他的中文语言技能逐渐提高。",
        "pinyin": "Tā de Zhōngwén yǔyán jìnéng zhújiàn tígāo.",
        "en": "His Chinese language skills are gradually improving.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_他的中文语言技能逐渐提高.mp3"
      },
      {
        "cn": "天色逐渐变暗。",
        "pinyin": "Tiānsè zhújiàn biàn'àn.",
        "en": "The sky is gradually getting darker.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_天色逐渐变暗.mp3"
      },
      {
        "cn": "随着时间的推移，他逐渐习惯了新的生活方式。",
        "pinyin": "Suízhe shíjiān de tuīyí, tā zhújiàn xíguàn le xīn de shēnghuó fāngshì.",
        "en": "As time went on, he gradually got used to the new lifestyle.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_随着时间的推移他逐渐习惯了新的生活方式.mp3"
      },
      {
        "cn": "她逐渐意识到自己对这个问题的看法是错误的。",
        "pinyin": "Tā zhújiàn yìshí dào zìjǐ duì zhège wèntí de kànfǎ shì cuòwù de.",
        "en": "She gradually realized that her views on the issue were wrong.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_她逐渐意识到自己对这个问题的看法是错误的.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "由此 (yóucǐ) - Hence, thus",
    "short_explanation": "Used to indicate a conclusion or result based on the previously mentioned situation or facts.",
    "long_explanation": "The Mandarin Chinese term '由此 (yóucǐ)' is used to draw a conclusion or explain a result that is based directly on the previously mentioned circumstances or facts. This term is roughly equivalent to saying 'hence', 'thus', or 'therefore' in English. When using '由此', you are emphasizing the causal relationship between two ideas or events. The consequent part that follows '由此' is usually a conclusion, suggestion, or inference based on the antecedent part.",
    "formation": "Situation/Facts + 由此 + Conclusion/Result",
    "examples": [
      {
        "cn": "他长期缺乏锻炼，由此导致他的健康状况下降。",
        "pinyin": "Tā chángqī quēfá duànliàn, yóucǐ dǎozhì tā de jiànkāng zhuàngkuàng xiàjiàng.",
        "en": "He lacks exercise for a long time, hence his health condition has declined.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Hence_thus_20231230_他长期缺乏锻炼由此导致他的健康状况下降.mp3"
      },
      {
        "cn": "市场上诸多产品的供应超过了需求，由此造成了价格的下降。",
        "pinyin": "Shìchǎng shàng zhūduō chǎnpǐn de gōngyìng chāoguòle xūqiú, yóucǐ zàochéngle jiàgé de xiàjiàng.",
        "en": "The supply of many products on the market exceeds demand, hence the drop in prices.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Hence_thus_20231230_市场上诸多产品的供应超过了需求由此造成了价格的下降.mp3"
      },
      {
        "cn": "正因为他的不再采用旧的方法，由此，他的公司产量大大提高。",
        "pinyin": "Zhèng yīnwèi tā de bù zài cǎiyòng jiù de fāngfǎ, yóucǐ, tā de gōngsī chǎnliàng dàdà tígāo.",
        "en": "Precisely because he no longer uses the old methods, hence, the output of his company has greatly increased.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Hence_thus_20231230_正因为他的不再采用旧的方法由此他的公司产量大大提高.mp3"
      },
      {
        "cn": "全球气候变暖，由此，极地冰川融化速度加快。",
        "pinyin": "Quánqiú qìhòu biàn nuǎn, yóucǐ, jídì bīngchuān rónghuà sùdù jiākuài.",
        "en": "Global warming is happening, hence, the melting rate of polar glaciers is accelerating.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Hence_thus_20231230_全球气候变暖由此极地冰川融化速度加快.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "相对于 (xiāngduìyú) - Relative to, Compared with",
    "short_explanation": "Used to compare one thing relative to or in relation to another thing.",
    "long_explanation": "In Mandarin Chinese, '相对于 (xiāngduìyú)' is used to introduce comparisons. This phrase is structured to phrase one thing in comparison to another. It's the equivalent of saying 'relative to' or 'compared with' in English and is often used to highlight differences or similarities.",
    "formation": "Object 1 + 相对于 + Object 2 + ，+ Sentence",
    "examples": [
      {
        "cn": "相对于其他国家，中国的人口非常庞大。",
        "pinyin": "Xiāng duì yú qítā guójiā，Zhōngguó de rénkǒu fēicháng pángdà.",
        "en": "Compared with other countries, China has a huge population.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对于_xiāngduìyú_-_Relative_to_Compared_with_20231230_相对于其他国家中国的人口非常庞大.mp3"
      },
      {
        "cn": "相对于生活在城市的人，农村人的生活节奏更加慢。",
        "pinyin": "Xiāng duì yú shēnghuó zài chéngshì de rén，nóngcūn rén de shēnghuó jiézòu gèng jiā màn.",
        "en": "Compared with people who live in the city, the pace of life for people in the countryside is slower.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对于_xiāngduìyú_-_Relative_to_Compared_with_20231230_相对于生活在城市的人农村人的生活节奏更加慢.mp3"
      },
      {
        "cn": "相对于上一年，今年的销售量有明显的增长。",
        "pinyin": "Xiāng duì yú shàng yī nián，jīnnián de xiāoshòu liàng yǒu míngxiǎn de zēngzhǎng.",
        "en": "Relative to the previous year, there has been a significant increase in sales this year.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对于_xiāngduìyú_-_Relative_to_Compared_with_20231230_相对于上一年今年的销售量有明显的增长.mp3"
      },
      {
        "cn": "相对于学习中文，学习英文对我来说更简单。",
        "pinyin": "Xiāng duì yú xuéxí Zhōngwén，xuéxí Yīngwén duì wǒ lái shuō gèng jiǎndān.",
        "en": "Compared with learning Chinese, learning English is simpler for me.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对于_xiāngduìyú_-_Relative_to_Compared_with_20231230_相对于学习中文学习英文对我来说更简单.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "关于 (guānyú) - About, regarding",
    "short_explanation": "This is used to specify the topic under discussion or consideration.",
    "long_explanation": "The Mandarin Chinese preposition '关于 (guānyú)' is equivalent to 'about' or 'regarding' in English. It is often used in formal contexts to indicate the subject matter or topic of the sentence or discussion. The topic usually follows '关于', and then the rest of the sentence that shares or inquires into information about that topic.",
    "formation": "关于 + Topic + Rest of the sentence",
    "examples": [
      {
        "cn": "请你告诉我关于这个项目的信息。",
        "pinyin": "Qǐng nǐ gàosù wǒ guānyú zhège xiàngmù de xìnxī.",
        "en": "Please tell me about the information of this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_关于_guānyú_-_About_regarding_20231230_请你告诉我关于这个项目的信息.mp3"
      },
      {
        "cn": "我正在阅读关于中国历史的书籍。",
        "pinyin": "Wǒ zhèngzài yuèdú guānyú Zhōngguó lìshǐ de shūjí.",
        "en": "I am reading books about Chinese history.",
        "grammar_audio": "/audio/mandarin/grammar/s_关于_guānyú_-_About_regarding_20231230_我正在阅读关于中国历史的书籍.mp3"
      },
      {
        "cn": "他告诉我一些关于他的旅行经历的事。",
        "pinyin": "Tā gàosù wǒ yǐxiē guānyú tā de lǚxíng jīnglì de shì.",
        "en": "He told me some things about his travel experiences.",
        "grammar_audio": "/audio/mandarin/grammar/s_关于_guānyú_-_About_regarding_20231230_他告诉我一些关于他的旅行经历的事.mp3"
      },
      {
        "cn": "你有任何关于这个主题的想法吗？",
        "pinyin": "Nǐ yǒurénhé guānyú zhège zhǔtí de xiǎngfǎ ma?",
        "en": "Do you have any ideas about this topic?",
        "grammar_audio": "/audio/mandarin/grammar/s_关于_guānyú_-_About_regarding_20231230_你有任何关于这个主题的想法吗.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "即便 (jíbiàn) - Even if, even though",
    "short_explanation": "Used to express a condition or assumption, followed by a concession or an unexpected result.",
    "long_explanation": "The Mandarin Chinese phrase '即便 (jíbiàn)' is similar to 'even if' or 'even though' in English. It is used to state a condition or assumption, followed by a concession or an unexpected result. The common structure is '即便 + condition, main clause', which often implies a defiant or persistent attitude despite potential difficulties or unfavorable circumstances.",
    "formation": "即便 + Condition/Assumption, Main Clause",
    "examples": [
      {
        "cn": "即便下雨，她也选择步行去商店。",
        "pinyin": "Jíbiàn xià yǔ, tā yě xuǎnzé bùxíng qù shāngdiàn.",
        "en": "Even if it rains, she chooses to walk to the store.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便下雨她也选择步行去商店.mp3"
      },
      {
        "cn": "即便作业很难，他也不向老师求助。",
        "pinyin": "Jíbiàn zuòyè hěn nán, tā yě bù xiàng lǎoshī qiúzhù.",
        "en": "Even though the homework is difficult, he doesn't ask the teacher for help.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便作业很难他也不向老师求助.mp3"
      },
      {
        "cn": "即便在冬天，他每天还是会去跑步。",
        "pinyin": "Jíbiàn zài dōngtiān, tā měitiān háishì huì qù pǎobù.",
        "en": "Even in winter, he still goes running every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便在冬天他每天还是会去跑步.mp3"
      },
      {
        "cn": "即便知道答案可能是错误的，他依然选择坚持自己的观点。",
        "pinyin": "Jíbiàn zhīdào dá'àn kěnéng shì cuòwù de, tā yīrán xuǎnzé jiānchí zìjǐ de guāndiǎn.",
        "en": "Even though he knows the answer might be wrong, he still chooses to stick to his point of view.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便知道答案可能是错误的他依然选择坚持自己的观点.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "因此 (yīncǐ) - Therefore, so",
    "short_explanation": "Used to express the conclusion or result of a given situation or reason.",
    "long_explanation": "'因此 (yīncǐ)' is a transition phrase in Mandarin Chinese that indicates the consequence or result derived from the previous statement. It is equivalent to 'therefore' or 'so' in English. In Chinese sentences, '因此' is often placed at the beginning of the sentence or clause to demonstrate this consequential relationship.",
    "formation": "clause1，因此 + clause2",
    "examples": [
      {
        "cn": "天气非常热，因此他决定留在家里。",
        "pinyin": "Tiānqì fēicháng rè, yīncǐ tā juédìng liú zài jiā lǐ.",
        "en": "The weather is very hot, therefore he decided to stay at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_so_20231230_天气非常热因此他决定留在家里.mp3"
      },
      {
        "cn": "他学习了很多年的中文，因此能流利地说中文。",
        "pinyin": "Tā xuéxíle hěnduō nián de Zhōngwén, yīncǐ néng liúlì de shuō Zhōngwén.",
        "en": "He has studied Chinese for many years, therefore he can speak Chinese fluently.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_so_20231230_他学习了很多年的中文因此能流利地说中文.mp3"
      },
      {
        "cn": "公司的销售额下降了，因此我们需要改进市场策略。",
        "pinyin": "Gōngsī de xiāoshòu é xiàjiàngle, yīncǐ wǒmen xūyào gǎijìn shìchǎng cèlüè.",
        "en": "The company's sales have dropped, therefore we need to improve our market strategy.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_so_20231230_公司的销售额下降了因此我们需要改进市场策略.mp3"
      },
      {
        "cn": "他没有及时完成作业，因此老师批评了他。",
        "pinyin": "Tā méiyǒu jítí wánchéng zuòyè, yīncǐ lǎoshī pīpíngle tā.",
        "en": "He didn't finish his homework on time, therefore the teacher criticized him.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_so_20231230_他没有及时完成作业因此老师批评了他.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "究竟 (jiūjìng) - After all, in the end",
    "short_explanation": "Used to emphasize a question or express a doubt, or to suggest a desire to know the truth about something.",
    "long_explanation": "The Mandarin Chinese term '究竟 (jiūjìng)' indicates a strong conviction to find out the final result or true nature of a situation. It translates to 'after all' or 'in the end' in English, often expressing inquiry, doubt or the desire for a conclusive answer. It adds an emphatic tone when used in questions, which makes the speaker sound concerned or curious.",
    "formation": "Subj + 究竟 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他究竟是喜欢你还是喜欢她？",
        "pinyin": "Tā jiūjìng shì xǐhuān nǐ háishi xǐhuān tā?",
        "en": "Does he like you or her, after all?",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_他究竟是喜欢你还是喜欢她.mp3"
      },
      {
        "cn": "我们究竟应该怎么做才能解决这个问题？",
        "pinyin": "Wǒmen jiūjìng yīnggāi zěnme zuò cáinéng jiějué zhège wèntí?",
        "en": "What should we do to solve this problem, in the end?",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_我们究竟应该怎么做才能解决这个问题.mp3"
      },
      {
        "cn": "你究竟是否同意我们的提议？",
        "pinyin": "Nǐ jiūjìng shìfǒu tóngyì wǒmen de tíyì?",
        "en": "Are you agreeing to our proposal, after all?",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_你究竟是否同意我们的提议.mp3"
      },
      {
        "cn": "他究竟做了些什么，你能告诉我吗？",
        "pinyin": "Tā jiūjìng zuòle xiē shénme, nǐ néng gàosu wǒ ma?",
        "en": "Can you tell me what he did, after all?",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_他究竟做了些什么你能告诉我吗.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "除...之外 (chú...zhīwài) - Besides, in addition to",
    "short_explanation": "This phrase is used to express 'besides' or 'in addition to' in Mandarin Chinese.",
    "long_explanation": "The Mandarin Chinese expression '除...之外 (chú... zhīwài)' is used to indicate 'besides' or 'in addition to'. It is used to show that there is more to something, or there are additional items or elements to be considered apart from the ones mentioned.",
    "formation": "除 + Mentioned thing(s) + 之外 + Rest of the sentence",
    "examples": [
      {
        "cn": "除了学习汉语之外，我也喜欢学习日语。",
        "pinyin": "Chúle xuéxí hànyǔ zhīwài, wǒ yě xǐhuān xuéxí rìyǔ.",
        "en": "Besides studying Chinese, I also like learning Japanese.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chúzhīwài_-_Besides_in_addition_to_20231230_除了学习汉语之外我也喜欢学习日语.mp3"
      },
      {
        "cn": "除了苹果之外，我还买了一些香蕉和橙子。",
        "pinyin": "Chúle píngguǒ zhīwài, wǒ hái mǎi le yīxiē xiāngjiāo hé chéngzi.",
        "en": "Besides apples, I also bought some bananas and oranges.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chúzhīwài_-_Besides_in_addition_to_20231230_除了苹果之外我还买了一些香蕉和橙子.mp3"
      },
      {
        "cn": "除了工作之外，他没有其他的爱好。",
        "pinyin": "Chúle gōngzuò zhīwài, tā méiyǒu qítā de àihào.",
        "en": "Besides work, he has no other hobbies.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chúzhīwài_-_Besides_in_addition_to_20231230_除了工作之外他没有其他的爱好.mp3"
      },
      {
        "cn": "除了你之外，没有人理解我。",
        "pinyin": "Chúle nǐ zhīwài, méiyǒu rén lǐjiě wǒ.",
        "en": "Besides you, no one understands me.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chúzhīwài_-_Besides_in_addition_to_20231230_除了你之外没有人理解我.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "宁可 (nìngkě) - Would rather, prefer to",
    "short_explanation": "Used to express a preference for one thing over another.",
    "long_explanation": "The Mandarin Chinese phrase '宁可 (nìngkě)' is used to express a preference or a greater willingness to choose one thing over another, regardless of potential negative consequences. It is equivalent to saying 'would rather' or 'prefer to' in English. This phrase is often used to indicate a personal preference or choice.",
    "formation": "Subject + 宁可 + Preferred Action + 也不 + Non-preferred Action",
    "examples": [
      {
        "cn": "我宁可在家看书，也不去参加那个无聊的派对。",
        "pinyin": "Wǒ nìngkě zài jiā kànshū, yě bù qù cānjiā nàgè wúliáo de pàiduì.",
        "en": "I would rather stay home and read a book than go to that boring party.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_prefer_to_20231230_我宁可在家看书也不去参加那个无聊的派对.mp3"
      },
      {
        "cn": "他宁可饿着肚子，也不吃那个他不喜欢的菜。",
        "pinyin": "Tā nìngkě è zhe dùzi, yě bù chī nàgè tā bù xǐhuān de cài.",
        "en": "He would rather go hungry than eat the dish he doesn't like.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_prefer_to_20231230_他宁可饿着肚子也不吃那个他不喜欢的菜.mp3"
      },
      {
        "cn": "她宁可早点起床，也不要迟到。",
        "pinyin": "Tā nìngkě zǎo diǎn qǐchuáng, yě bùyào chídào.",
        "en": "She would rather get up early than be late.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_prefer_to_20231230_她宁可早点起床也不要迟到.mp3"
      },
      {
        "cn": "我们宁可多花点钱，也不愿住在那个脏乱的宾馆。",
        "pinyin": "Wǒmen nìngkě duō huā diǎn qián, yě bùyuàn zhù zài nàgè zāng luàn de bīnguǎn.",
        "en": "We would rather spend a bit more money than stay in that dirty, chaotic hotel.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_prefer_to_20231230_我们宁可多花点钱也不愿住在那个脏乱的宾馆.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "由于 (yóuyú) - Due to, because of",
    "short_explanation": "Used to express the cause or reason for an event or situation.",
    "long_explanation": "The Mandarin Chinese phrase '由于 (yóuyú)' is used to highlight the cause or reason behind an occurrence, event, or situation. It is equivalent to the English phrases 'due to' or 'because of'. This phrase is often followed by a result clause, expressed with '所以 (suǒyǐ)' meaning 'therefore' or 'so'.",
    "formation": "由于 + Cause, 所以 + Result",
    "examples": [
      {
        "cn": "由于下雨，我们不得不取消比赛。",
        "pinyin": "Yóuyú xiàyǔ, wǒmen bùdébù qǔxiāo bǐsài.",
        "en": "Due to the rain, we had to cancel the match.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于下雨我们不得不取消比赛.mp3"
      },
      {
        "cn": "由于交通堵塞，他迟到了。",
        "pinyin": "Yóuyú jiāotōng dǔsè, tā chídào le.",
        "en": "He was late because of traffic congestion.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于交通堵塞他迟到了.mp3"
      },
      {
        "cn": "由于工作繁忙，我没有时间去健身房。",
        "pinyin": "Yóuyú gōngzuò fánmáng, wǒ méiyǒu shíjiān qù jiànshēnfáng.",
        "en": "Due to busy work, I don't have time to go to the gym.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于工作繁忙我没有时间去健身房.mp3"
      },
      {
        "cn": "由于她的帮助，我完成了我所有的工作。",
        "pinyin": "Yóuyú tā de bāngzhù, wǒ wánchéng le wǒ suǒyǒu de gōngzuò.",
        "en": "Due to her help, I finished all my work.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于她的帮助我完成了我所有的工作.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "假如 (jiǎrú) - If, suppose",
    "short_explanation": "Used to describe hypothetical or suppositional scenarios.",
    "long_explanation": "The Mandarin Chinese word '假如 (jiǎrú)' is a conjunction used to introduce a hypothetical or suppositional situation, similar to English 'if' or 'suppose'. It is often used to speculate about possible future events or outcomes, or to describe scenarios that did not actually happen, but could have happened under certain conditions.",
    "formation": "假如 + Condition, Outcome",
    "examples": [
      {
        "cn": "假如我是你，我就会去那个音乐会。",
        "pinyin": "Jiǎrú wǒ shì nǐ, wǒ jiù huì qù nàgè yīnyuèhuì.",
        "en": "If I were you, I would go to that concert.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如我是你我就会去那个音乐会.mp3"
      },
      {
        "cn": "假如我没有遇到你，我可能还在做我不喜欢的工作。",
        "pinyin": "Jiǎrú wǒ méiyǒu yùdào nǐ, wǒ kěnéng hái zài zuò wǒ bù xǐhuān de gōngzuò.",
        "en": "If I hadn't met you, I might still be doing the job I don't like.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如我没有遇到你我可能还在做我不喜欢的工作.mp3"
      },
      {
        "cn": "假如下雨，我们的野餐计划就会取消。",
        "pinyin": "Jiǎrú xià yǔ, wǒmen de yěcān jìhuà jiù huì qǔxiāo.",
        "en": "If it rains, our picnic will be cancelled.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如下雨我们的野餐计划就会取消.mp3"
      },
      {
        "cn": "假如你不理解这个问题，你可以问我。",
        "pinyin": "Jiǎrú nǐ bù lǐjiě zhège wèntí, nǐ kěyǐ wèn wǒ.",
        "en": "If you don't understand this question, you can ask me.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_suppose_20231230_假如你不理解这个问题你可以问我.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "值得 (zhídé) - Worth, deserving",
    "short_explanation": "This is used to express that something is worth doing or deserves time, effort, or attention.",
    "long_explanation": "In Mandarin Chinese, '值得 (zhídé)' is used to indicate the worthiness or merit of an action, task, object, or event. It can refer to the worthiness of your time, efforts, or resources. Its placement in a sentence often precedes the action that is deemed 'worthwhile' or 'deserving', also initiating a new clause.",
    "formation": "Subject + 值得 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "学习中文不容易，但是我觉得值得。",
        "pinyin": "Xuéxí Zhōngwén bù róngyì, dànshì wǒ juédé zhídé.",
        "en": "Learning Chinese is not easy, but I think it's worth it.",
        "grammar_audio": "/audio/mandarin/grammar/s_值得_zhídé_-_Worth_deserving_20231230_学习中文不容易但是我觉得值得.mp3"
      },
      {
        "cn": "这个电影非常有趣，值得一看。",
        "pinyin": "Zhège diànyǐng fēicháng yǒuqù, zhídé yī kàn.",
        "en": "This movie is very interesting, it's worth watching.",
        "grammar_audio": "/audio/mandarin/grammar/s_值得_zhídé_-_Worth_deserving_20231230_这个电影非常有趣值得一看.mp3"
      },
      {
        "cn": "你的好友值得你去信任。",
        "pinyin": "Nǐ de hǎoyǒu zhídé nǐ qù xìnrèn.",
        "en": "Your good friends are worth your trust.",
        "grammar_audio": "/audio/mandarin/grammar/s_值得_zhídé_-_Worth_deserving_20231230_你的好友值得你去信任.mp3"
      },
      {
        "cn": "这个项目特别困难，但我觉得值得尝试。",
        "pinyin": "Zhège xiàngmù tèbié kùnnán, dàn wǒ juédé zhídé chángshì.",
        "en": "This project is particularly difficult, but I think it's worth a try.",
        "grammar_audio": "/audio/mandarin/grammar/s_值得_zhídé_-_Worth_deserving_20231230_这个项目特别困难但我觉得值得尝试.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "75"
  },
  {
    "title": "其次 (qícì) - Secondly, next",
    "short_explanation": "Used to create an order of steps, events, or reasons, generally after stating the first or main point.",
    "long_explanation": "'其次 (qícì)' is a conjunction often used in Mandarin Chinese to express 'secondly' or 'next' in English. It is primarily used to denote the subsequent point after the primary one, when discussing steps, events or reasons. Its use helps create a structured, organized progression.",
    "formation": "First point +，其次 + Second point",
    "examples": [
      {
        "cn": "我喜欢读书。首先，书籍是知识的源泉；其次，读书能让我放松。",
        "pinyin": "Wǒ xǐhuān dúshū. Shǒuxiān, shūjí shì zhīshì de yuánquán; qícì, dúshū néng ràng wǒ fàngsōng.",
        "en": "I love reading. First, books are the source of knowledge; secondly, reading allows me to relax.",
        "grammar_audio": "/audio/mandarin/grammar/s_其次_qícì_-_Secondly_next_20231230_我喜欢读书首先书籍是知识的源泉；其次读书能让我放松.mp3"
      },
      {
        "cn": "你需要学好中文。首先，这是你的学业要求；其次，通晓中文能让你在中国旅行更方便。",
        "pinyin": "Nǐ xūyào xué hǎo Zhōngwén. Shǒuxiān, zhè shì nǐ de xuéyè yāoqiú; qícì, tōngxiǎo Zhōngwén néng ràng nǐ zài Zhōngguó lǚxíng gèng fāngbiàn.",
        "en": "You need to learn Chinese well. Firstly, this is your academic requirement; secondly, being proficient in Chinese will make your travel in China more convenient.",
        "grammar_audio": "/audio/mandarin/grammar/s_其次_qícì_-_Secondly_next_20231230_你需要学好中文首先这是你的学业要求；其次通晓中文能让你在中国旅行更方便.mp3"
      },
      {
        "cn": "我打算早起床。首先，我要去跑步；其次，我要赶在8点之前吃完早餐。",
        "pinyin": "Wǒ dǎsuàn zǎo qǐchuáng. Shǒuxiān, wǒ yào qù pǎobù; qícì, wǒ yào gǎn zài 8 diǎn zhīqián chī wán zǎocān.",
        "en": "I plan to wake up early. Firstly, I'm going to go for a run; secondly, I want to finish breakfast before 8 o'clock.",
        "grammar_audio": "/audio/mandarin/grammar/s_其次_qícì_-_Secondly_next_20231230_我打算早起床首先我要去跑步；其次我要赶在8点之前吃完早餐.mp3"
      },
      {
        "cn": "学习新语言有很多好处。首先，它能提高你的思维能力；其次，它有助于你理解不同文化。",
        "pinyin": "Xuéxí xīn yǔyán yǒu hěn duō hǎochù. Shǒuxiān, tā néng tígāo nǐ de sīwéi nénglì; qícì, tā yǒuzhù yú nǐ lǐjiě bùtóng wénhuà.",
        "en": "Learning a new language has many benefits. Firstly, it can improve your thinking abilities; secondly, it can help you understand different cultures.",
        "grammar_audio": "/audio/mandarin/grammar/s_其次_qícì_-_Secondly_next_20231230_学习新语言有很多好处首先它能提高你的思维能力；其次它有助于你理解不同文化.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "一方面...另一方面... (yī fāngmiàn... lìng yī fāngmiàn...) - On one hand... on the other hand...",
    "short_explanation": "Used to express contrasting ideas or facts.",
    "long_explanation": "The Mandarin Chinese phrase '一方面...另一方面...' is used to highlight contrasting ideas or facts, akin to the English expression 'on one hand... on the other hand...'. It is often used when there are two aspects of a situation, one being positive and the other being negative, or when there are two opposing viewpoints or considerations. ",
    "formation": "一方面...另一方面... + Sentence 1 + Sentence 2",
    "examples": [
      {
        "cn": "一方面我喜欢吃巧克力，因为它的味道很好，另一方面我担心会变胖。",
        "pinyin": "Yī fāngmiàn wǒ xǐhuan chī qiǎokèlì, yīnwèi tā de wèidào hěn hǎo, lìng yī fāngmiàn wǒ dānxīn huì biàn pàng.",
        "en": "On one hand, I like eating chocolate because it tastes good, on the other hand, I'm worried about gaining weight.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我喜欢吃巧克力因为它的味道很好另一方面我担心会变胖.mp3"
      },
      {
        "cn": "一方面我想留在家里看电视，另一方面我也想去公园锻炼。",
        "pinyin": "Yī fāngmiàn wǒ xiǎng liú zài jiālǐ kàn diànshì, lìng yī fāngmiàn wǒ yě xiǎng qù gōngyuán duànliàn.",
        "en": "On one hand, I want to stay home and watch TV, on the other hand, I also want to go to the park for exercise.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我想留在家里看电视另一方面我也想去公园锻炼.mp3"
      },
      {
        "cn": "一方面她希望得到更高的薪水，另一方面她又不愿意换工作。",
        "pinyin": "Yī fāngmiàn tā xīwàng dédào gèng gāo de xīnshuǐ, lìng yī fāngmiàn tā yòu bù yuànyì huàn gōngzuò.",
        "en": "On one hand, she hopes to have a higher salary, on the other hand, she is not willing to change jobs.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面她希望得到更高的薪水另一方面她又不愿意换工作.mp3"
      },
      {
        "cn": "一方面他喜欢城市的繁华，另一方面他又想念农村的宁静。",
        "pinyin": "Yī fāngmiàn tā xǐhuan chéngshì de fánhuá, lìng yī fāngmiàn tā yòu xiǎngniàn nóngcūn de níngjìng.",
        "en": "On one hand, he likes the hustle and bustle of the city, on the other hand, he misses the tranquillity of the countryside.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面他喜欢城市的繁华另一方面他又想念农村的宁静.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "照 (zhào) - According to, in accordance with",
    "short_explanation": "Used to indicate compliance or agreement with a certain rule, order, or request.",
    "long_explanation": "The word '照 (zhào)' in Mandarin Chinese is utilized to express the idea of doing something 'according to' or 'in accordance with' a specific rule, instruction, or request. This word denotes a sense of compliance or adherence, and it is commonly used in the formation of sentences to elaborate the action or behaviour corresponding to specific conditions.",
    "formation": "照 + Story/Requirement + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "照你的建议，我已经开始学习绘画了。",
        "pinyin": "Zhào nǐ de jiànyì, wǒ yǐjīng kāishǐ xuéxí huìhuà le.",
        "en": "According to your suggestion, I have started learning painting.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_照你的建议我已经开始学习绘画了.mp3"
      },
      {
        "cn": "照爸爸的计划，我们下周要去爬山。",
        "pinyin": "Zhào bàba de jìhuà, wǒmen xià zhōu yào qù pá shān.",
        "en": "According to Dad's plan, we are going to hike next week.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_照爸爸的计划我们下周要去爬山.mp3"
      },
      {
        "cn": "照规定，我们不能带食物进电影院。",
        "pinyin": "Zhào guīdìng, wǒmen bùnéng dài shíwù jìn diànyǐngyuàn.",
        "en": "According to the rules, we can't bring food into the cinema.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_照规定我们不能带食物进电影院.mp3"
      },
      {
        "cn": "照我妈妈的说法，我是个很聪明的孩子。",
        "pinyin": "Zhào wǒ māma de shuōfǎ, wǒ shì gè hěn cōngmíng de háizi.",
        "en": "According to my mom, I am a very smart child.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_照我妈妈的说法我是个很聪明的孩子.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "例如 (lìrú) - For instance, for example",
    "short_explanation": "Used to provide an example or illustrate a point.",
    "long_explanation": "The Mandarin Chinese phrase '例如 (lìrú)' is used to provide examples to clarify a point or situation. It is equivalent to saying 'for instance' or 'for example' in English. This phrase is generally placed before the example to signify that the following information is illustrative or explanatory.",
    "formation": "Point/statement + 例如 + Example",
    "examples": [
      {
        "cn": "我喜欢很多水果，例如苹果、香蕉和葡萄。",
        "pinyin": "Wǒ xǐhuān hěnduō shuǐguǒ, lìrú píngguǒ, xiāngjiāo hé pútáo.",
        "en": "I like many fruits, for example, apples, bananas, and grapes.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_instance_for_example_20231230_我喜欢很多水果例如苹果香蕉和葡萄.mp3"
      },
      {
        "cn": "在中国有很多美丽的城市，例如北京、上海和杭州。",
        "pinyin": "Zài Zhōngguó yǒu hěnduō měilì de chéngshì, lìrú Běijīng, Shànghǎi hé Hángzhōu.",
        "en": "There are many beautiful cities in China, for example, Beijing, Shanghai, and Hangzhou.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_instance_for_example_20231230_在中国有很多美丽的城市例如北京上海和杭州.mp3"
      },
      {
        "cn": "他学过很多外语，例如法语、日语和韩语。",
        "pinyin": "Tā xuéguò hěnduō wàiyǔ, lìrú fǎyǔ, rìyǔ hé hányǔ.",
        "en": "He has studied many foreign languages, for instance, French, Japanese, and Korean.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_instance_for_example_20231230_他学过很多外语例如法语日语和韩语.mp3"
      },
      {
        "cn": "在我们的生活中有很多健康的习惯，例如每天喝足够的水、吃得健康，以及保持良好的睡眠。",
        "pinyin": "Zài wǒmen de shēnghuó zhōng yǒu hěnduō jiànkāng de xíguàn, lìrú měitiān hē zúgòu de shuǐ, chī dé jiànkāng, yǐjí bǎochí liánghǎo de shuìmián.",
        "en": "There are many healthy habits in our life, for example, drinking enough water every day, eating healthily, and maintaining good sleep.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_instance_for_example_20231230_在我们的生活中有很多健康的习惯例如每天喝足够的水吃得健康以及保持良好的睡眠.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "以为 (yǐwéi) - Assume, think (incorrectly)",
    "short_explanation": "Used to indicate a mistaken belief or assumption.",
    "long_explanation": "The Mandarin Chinese phrase '以为 (yǐwéi)' expresses the idea of wrongly assuming or thinking something. It is typically used in situations where the speaker or another person had a misconception or an incorrect belief about something. It corresponds to the English expressions 'to think' or 'to assume' used in the context of being mistaken.",
    "formation": "Subject + 以为 + Misconception",
    "examples": [
      {
        "cn": "我以为你今天不会来，所以我已经开始吃饭了。",
        "pinyin": "Wǒ yǐwéi nǐ jīntiān bù huì lái, suǒyǐ wǒ yǐjīng kāishǐ chīfàn le.",
        "en": "I thought you wouldn't come today, so I already started eating.",
        "grammar_audio": "/audio/mandarin/grammar/s_以为_yǐwéi_-_Assume_think_incorrectly_20231230_我以为你今天不会来所以我已经开始吃饭了.mp3"
      },
      {
        "cn": "他们以为这是一个轻松的工作，结果却发现它非常困难。",
        "pinyin": "Tāmen yǐwéi zhè shì yīgè qīngsōng de gōngzuò, jiéguǒ què fāxiàn tā fēicháng kùnnán.",
        "en": "They thought this was an easy job, but they found it to be very difficult.",
        "grammar_audio": "/audio/mandarin/grammar/s_以为_yǐwéi_-_Assume_think_incorrectly_20231230_他们以为这是一个轻松的工作结果却发现它非常困难.mp3"
      },
      {
        "cn": "我以为你喜欢吃苹果，没想到你其实不喜欢。",
        "pinyin": "Wǒ yǐwéi nǐ xǐhuān chī píngguǒ, méi xiǎngdào nǐ qíshí bù xǐhuān.",
        "en": "I thought you liked eating apples, but it turns out you actually don't.",
        "grammar_audio": "/audio/mandarin/grammar/s_以为_yǐwéi_-_Assume_think_incorrectly_20231230_我以为你喜欢吃苹果没想到你其实不喜欢.mp3"
      },
      {
        "cn": "他以为我会迟到，没想到我提早到了。",
        "pinyin": "Tā yǐwéi wǒ huì chídào, méi xiǎngdào wǒ tízǎo dào le.",
        "en": "He thought I would be late, but I arrived early.",
        "grammar_audio": "/audio/mandarin/grammar/s_以为_yǐwéi_-_Assume_think_incorrectly_20231230_他以为我会迟到没想到我提早到了.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "无论 (wúlùn) - Regardless of, no matter what/who/etc.",
    "short_explanation": "Used to indicate that the action or state in the main clause will take place or continue regardless of the condition stipulated in the subordinate clause.",
    "long_explanation": "The Mandarin Chinese conjunction '无论 (wúlùn)' is used to introduce a condition or circumstances that would not affect a certain situation, action, or state. It emphasizes an indefeasibility and is equivalent to 'regardless of' or 'no matter what/who/etc.' in English. It is often used in combination with '都 (dōu)' or '也 (yě)' in the main clause.",
    "formation": "无论 + Condition, (都 / 也) + Main Clause",
    "examples": [
      {
        "cn": "无论天气如何，我都会去公园散步。",
        "pinyin": "Wúlùn tiānqì rúhé, wǒ dōu huì qù gōngyuán sànbù.",
        "en": "No matter what the weather is like, I will go to the park for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_what/who/etc_20231230_无论天气如何我都会去公园散步.mp3"
      },
      {
        "cn": "无论你说什么，我都不会改变我的决定。",
        "pinyin": "Wúlùn nǐ shuō shénme, wǒ dōu bù huì gǎibiàn wǒ de juédìng.",
        "en": "Regardless of what you say, I won't change my decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_what/who/etc_20231230_无论你说什么我都不会改变我的决定.mp3"
      },
      {
        "cn": "无论他是谁，你也不能对他如此无礼。",
        "pinyin": "Wúlùn tā shì shuí, nǐ yě bùnéng duì tā rúcǐ wúlǐ.",
        "en": "No matter who he is, you can't be so rude to him.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_what/who/etc_20231230_无论他是谁你也不能对他如此无礼.mp3"
      },
      {
        "cn": "无论明天会发生什么，我们都应该保持积极的态度。",
        "pinyin": "Wúlùn míngtiān huì fāshēng shénme, wǒmen dōu yīnggāi bǎochí jījí de tàidù.",
        "en": "No matter what will happen tomorrow, we should all maintain a positive attitude.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论_wúlùn_-_Regardless_of_no_matter_what/who/etc_20231230_无论明天会发生什么我们都应该保持积极的态度.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "只要 (zhǐyào) - As long as",
    "short_explanation": "Used to express a condition that if satisfied, another action or situation can occur.",
    "long_explanation": "The Mandarin Chinese term '只要 (zhǐyào)' is a conditional phrase that means 'as long as' in English. It is used to indicate a circumstance or condition that, once fulfilled, another event or situation can happen. Often used in scenarios where a desired result or outcome depends on fulfilling a certain condition.",
    "formation": "只要 + Condition, Main Clause",
    "examples": [
      {
        "cn": "只要你努力，你就能通过HSK的测试。",
        "pinyin": "Zhǐyào nǐ nǔlì, nǐ jiù néng tōngguò HSK de cèshì.",
        "en": "As long as you work hard, you can pass the HSK test.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要你努力你就能通过HSK的测试.mp3"
      },
      {
        "cn": "只要天气好，我们就可以去公园。",
        "pinyin": "Zhǐyào tiānqì hǎo, wǒmen jiù kěyǐ qù gōngyuán.",
        "en": "As long as the weather is good, we can go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要天气好我们就可以去公园.mp3"
      },
      {
        "cn": "只要你坚持不懈，你就能实现你的目标。",
        "pinyin": "Zhǐyào nǐ jiānchí bùxiè, nǐ jiù néng shíxiàn nǐ de mùbiāo.",
        "en": "As long as you persist, you can achieve your goals.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要你坚持不懈你就能实现你的目标.mp3"
      },
      {
        "cn": "只要你愿意，我们每个周末都可以去爬山。",
        "pinyin": "Zhǐyào nǐ yuànyì, wǒmen měi gè zhōumò dōu kěyǐ qù páshān.",
        "en": "As long as you are willing, we can go hiking every weekend.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要_zhǐyào_-_As_long_as_20231230_只要你愿意我们每个周末都可以去爬山.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "除非 (chúfēi) - Unless",
    "short_explanation": "Used to express a condition that must be fulfilled before an event or situation can occur.",
    "long_explanation": "The Mandarin Chinese phrase '除非 (chúfēi)' is used to signify a condition that must be realised for an action or event to take place. It is the equivalent of the English conjunction 'unless'. It is typically used in a condition-consequence structure where the condition (preceded by '除非') must be satisfied for the consequence to occur.",
    "formation": "除非 + Condition, + Consequence",
    "examples": [
      {
        "cn": "除非你努力学习，否则你无法通过这个考试。",
        "pinyin": "Chúfēi nǐ nǔlì xuéxí, fǒuzé nǐ wúfǎ tōngguò zhège kǎoshì.",
        "en": "Unless you study hard, you can't pass this exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你努力学习否则你无法通过这个考试.mp3"
      },
      {
        "cn": "除非你给我一个好的理由，否则我不会帮你做这件事。",
        "pinyin": "Chúfēi nǐ gěi wǒ yīgè hǎo de lǐyóu, fǒuzé wǒ bù huì bāng nǐ zuò zhè jiàn shì.",
        "en": "Unless you give me a good reason, I won't help you do this.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你给我一个好的理由否则我不会帮你做这件事.mp3"
      },
      {
        "cn": "除非他道歉，否则我不会原谅他。",
        "pinyin": "Chúfēi tā dàoqiàn, fǒuzé wǒ bù huì yuánliàng tā.",
        "en": "Unless he apologizes, I won't forgive him.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非他道歉否则我不会原谅他.mp3"
      },
      {
        "cn": "除非你早点起床，否则你会错过火车。",
        "pinyin": "Chúfēi nǐ zǎodiǎn qǐchuáng, fǒuzé nǐ huì cuòguò huǒchē.",
        "en": "Unless you get up early, you will miss the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_20231230_除非你早点起床否则你会错过火车.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "幸亏 (xìngkuī) - Fortunately, luckily",
    "short_explanation": "Used to express relief about a positive outcome or a fortunate event that happened.",
    "long_explanation": "The Mandarin Chinese phrase '幸亏 (xìngkuī)' is used to express relief for a fortunate circumstance or favorable event that happened, especially in situations where negative outcomes could have occurred. It is akin to the English expressions 'fortunately' or 'luckily'. You can use this term when you want to express gratitude or relief over a situation that turned out favorably for you.",
    "formation": "幸亏 + Positive Outcome, Consequence/Result",
    "examples": [
      {
        "cn": "幸亏我带了伞，否则我今天就要淋湿了。",
        "pinyin": "Xìngkuī wǒ dài le sǎn, fǒuzé wǒ jīntiān jiù yào línshī le.",
        "en": "Fortunately I brought an umbrella, otherwise I would have gotten wet today.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏我带了伞否则我今天就要淋湿了.mp3"
      },
      {
        "cn": "幸亏她提醒我，我差点儿忘了妈妈的生日。",
        "pinyin": "Xìngkuī tā tíxǐng wǒ, wǒ chàdiǎnr wàng le māma de shēngrì.",
        "en": "Luckily she reminded me, I almost forgot my mom's birthday.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏她提醒我我差点儿忘了妈妈的生日.mp3"
      },
      {
        "cn": "幸亏我们早点离开，否则就会碰到大堵车。",
        "pinyin": "Xìngkuī wǒmen zǎo diǎn líkāi, fǒuzé jiù huì pèng dào dà dǔchē.",
        "en": "Luckily, we left early or else we would have hit heavy traffic.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏我们早点离开否则就会碰到大堵车.mp3"
      },
      {
        "cn": "幸亏你让我带手机，不然我找不到路回家。",
        "pinyin": "Xìngkuī nǐ ràng wǒ dài shǒujī, bùrán wǒ zhǎo bùdào lù huí jiā.",
        "en": "Fortunately, you told me to bring my phone, otherwise, I couldn't find the way home.",
        "grammar_audio": "/audio/mandarin/grammar/s_幸亏_xìngkuī_-_Fortunately_luckily_20231230_幸亏你让我带手机不然我找不到路回家.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "只是 (zhǐshì) - Just, only, merely",
    "short_explanation": "Used to indicate that something is not as big a deal as it might seem, or to emphasize the limit or insignificance of something.",
    "long_explanation": "The Mandarin Chinese phrase '只是 (zhǐshì)' is an adverb used to convey that something is 'just' or 'only' or 'merely'. This can be used to simplify or downplay a situation or to emphasize the limitation or triviality of something. It is often used to restrict a statement to one particular quality or detail. ",
    "formation": "只是 + Sentence",
    "examples": [
      {
        "cn": "我只是想问你一个问题，你为什么总是避开我？",
        "pinyin": "Wǒ zhǐshì xiǎng wèn nǐ yīgè wèntí, nǐ wèishéme zǒngshì bìkāi wǒ?",
        "en": "I just want to ask you one question, why do you always avoid me?",
        "grammar_audio": "/audio/mandarin/grammar/s_只是_zhǐshì_-_Just_only_merely_20231230_我只是想问你一个问题你为什么总是避开我.mp3"
      },
      {
        "cn": "这只是一个小问题，我相信我们很快就能解决。",
        "pinyin": "Zhè zhǐshì yīgè xiǎo wèntí, wǒ xiāngxìn wǒmen hěn kuài jiù néng jiějué.",
        "en": "This is just a small issue, I believe we will be able to solve it soon.",
        "grammar_audio": "/audio/mandarin/grammar/s_只是_zhǐshì_-_Just_only_merely_20231230_这只是一个小问题我相信我们很快就能解决.mp3"
      },
      {
        "cn": "她只是一位助手，但她对我们的项目做出了巨大的贡献。",
        "pinyin": "Tā zhǐshì yī wèi zhùshǒu, dàn tā duì wǒmen de xiàngmù zuò chūle jùdà de gòngxiàn.",
        "en": "She is just an assistant, but she has made a huge contribution to our project.",
        "grammar_audio": "/audio/mandarin/grammar/s_只是_zhǐshì_-_Just_only_merely_20231230_她只是一位助手但她对我们的项目做出了巨大的贡献.mp3"
      },
      {
        "cn": "只是因为你年轻，这并不意味着你不能成功。",
        "pinyin": "Zhǐshì yīnwèi nǐ niánqīng, zhè bìngbù yìwèi néng nǐ bùnéng chénggōng.",
        "en": "Just because you are young, it doesn't mean that you can't be successful.",
        "grammar_audio": "/audio/mandarin/grammar/s_只是_zhǐshì_-_Just_only_merely_20231230_只是因为你年轻这并不意味着你不能成功.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "据说 (jùshuō) - It is said, reportedly",
    "short_explanation": "Used to introduce information or opinions that the speaker heard from others.",
    "long_explanation": "The Mandarin Chinese expression '据说 (jùshuō)' is used to introduce information or opinions that the speaker has heard from others, not their personal opinion or direct knowledge. It translates as 'it is said' or 'reportedly' in English. This phrase is often used to share rumors, hearsay information, general knowledge or established opinions among a group.",
    "formation": "据说 + Sentence",
    "examples": [
      {
        "cn": "据说他是一个非常有才华的画家，但我从未见过他的作品。",
        "pinyin": "Jùshuō tā shì yīgè fēicháng yǒu cáihuá de huàjiā, dàn wǒ cóngwèi jiàn guò tā de zuòpǐn.",
        "en": "It is said that he is a very talented painter, but I have never seen his work.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_reportedly_20231230_据说他是一个非常有才华的画家但我从未见过他的作品.mp3"
      },
      {
        "cn": "据说下个月他们就要结婚了，不过我还没有收到请帖。",
        "pinyin": "Jùshuō xià gè yuè tāmen jiù yào jiéhūn le, bùguò wǒ hái méiyǒu shōudào qǐng tiě.",
        "en": "It is said that they are getting married next month, but I haven't received the invitation yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_reportedly_20231230_据说下个月他们就要结婚了不过我还没有收到请帖.mp3"
      },
      {
        "cn": "据说这个地方的冬天非常冷，温度可以降到零下四十度。",
        "pinyin": "Jùshuō zhège dìfāng de dōngtiān fēicháng lěng, wēndù kěyǐ jiàng dào líng xià sìshí dù.",
        "en": "It is said that it's very cold in winter here, temperatures can drop to minus forty degrees.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_reportedly_20231230_据说这个地方的冬天非常冷温度可以降到零下四十度.mp3"
      },
      {
        "cn": "据说吃这种水果对皮肤有好处，但我还没有尝试过。",
        "pinyin": "Jùshuō chī zhè zhǒng shuǐguǒ duì pífū yǒu hǎochù, dàn wǒ hái méiyǒu chángshì guò.",
        "en": "It is said that eating this fruit is good for the skin, but I have not tried it yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_reportedly_20231230_据说吃这种水果对皮肤有好处但我还没有尝试过.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "既...又... (jì...yòu...) - Both... and...",
    "short_explanation": "Used to indicate that something or someone has two or more qualities or characteristics simultaneously.",
    "long_explanation": "The Mandarin Chinese conjunction '既...又...' is a construction used to signify that something or someone possesses two or more attributes or characteristics at the same time. This format is akin to 'both... and...' in English. It's a powerful tool for adding detail and complexity to your descriptions, allowing you to express multiple simultaneous characteristics or situations.",
    "formation": "Subject + 既 + Adjective 1/Verb Phrase 1 + 又 + Adjective 2/Verb Phrase 2",
    "examples": [
      {
        "cn": "他既聪明又勤奋，很快就学会了这个技能。",
        "pinyin": "Tā jì cōngmíng yòu qínfèn, hěn kuài jiù xuéhuì le zhège jìnéng.",
        "en": "He is both smart and diligent, and quickly learned this skill.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jìyòu_-_Both_and_20231230_他既聪明又勤奋很快就学会了这个技能.mp3"
      },
      {
        "cn": "这份工作既有趣又有挑战，我非常喜欢。",
        "pinyin": "Zhè fèn gōngzuò jì yǒuqù yòu yǒu tiǎozhàn, wǒ fēicháng xǐhuan.",
        "en": "This job is both interesting and challenging, I really like it.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jìyòu_-_Both_and_20231230_这份工作既有趣又有挑战我非常喜欢.mp3"
      },
      {
        "cn": "我的老板既公正又公平，是一个非常好的领导者。",
        "pinyin": "Wǒ de lǎobǎn jì gōngzhèng yòu gōngpíng, shì yīgè fēicháng hǎo de lǐngdǎo zhě.",
        "en": "My boss is both just and fair, is a very good leader.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jìyòu_-_Both_and_20231230_我的老板既公正又公平是一个非常好的领导者.mp3"
      },
      {
        "cn": "她既会说英语又会说法语，真是个语言天才。",
        "pinyin": "Tā jì huì shuō Yīngyǔ yòu huì shuō Fǎyǔ, zhēn shì gè yǔyán tiāncái.",
        "en": "She can both speak English and French, truly a language genius.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jìyòu_-_Both_and_20231230_她既会说英语又会说法语真是个语言天才.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "几乎 (jīhū) - Almost, Nearly",
    "short_explanation": "Used to express that something is nearly, almost, or very close to a certain state or degree.",
    "long_explanation": "The Mandarin Chinese phrase '几乎 (jīhū)' is used to indicate that something is almost, nearly, or very close to a certain state, degree, or amount. It is equivalent to the English words 'almost' or 'nearly'. It implies the concept of something being close to the point of almost happening or being true, yet narrowly missing the mark.",
    "formation": "几乎 + Verb/Adjective / 几乎 + Quantity Word + Measure Word/Noun",
    "examples": [
      {
        "cn": "我几乎每天都去健身房锻炼，所以我非常健康。",
        "pinyin": "Wǒ jīhū měitiān dōu qù jiànshēnfáng duànliàn, suǒyǐ wǒ fēicháng jiànkāng.",
        "en": "I go to the gym almost every day, so I'm very healthy.",
        "grammar_audio": "/audio/mandarin/grammar/s_几乎_jīhū_-_Almost_Nearly_20231230_我几乎每天都去健身房锻炼所以我非常健康.mp3"
      },
      {
        "cn": "他的汉语说得几乎和中国人一样好。",
        "pinyin": "Tā de Hànyǔ shuō de jīhū hé Zhōngguórén yīyàng hǎo.",
        "en": "His Chinese is spoken almost as well as a Chinese person.",
        "grammar_audio": "/audio/mandarin/grammar/s_几乎_jīhū_-_Almost_Nearly_20231230_他的汉语说得几乎和中国人一样好.mp3"
      },
      {
        "cn": "这场比赛太激烈了，我们的队伍几乎赢了。",
        "pinyin": "Zhè chǎng bǐsài tài jīliè le, wǒmen de duìwǔ jīhū yíng le.",
        "en": "The game was so intense, our team nearly won.",
        "grammar_audio": "/audio/mandarin/grammar/s_几乎_jīhū_-_Almost_Nearly_20231230_这场比赛太激烈了我们的队伍几乎赢了.mp3"
      },
      {
        "cn": "他跑得很快，我几乎追不上他。",
        "pinyin": "Tā pǎo dé hěn kuài, wǒ jīhū zhuī bù shàng tā.",
        "en": "He runs so fast that I can hardly catch up with him.",
        "grammar_audio": "/audio/mandarin/grammar/s_几乎_jīhū_-_Almost_Nearly_20231230_他跑得很快我几乎追不上他.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "不得不 (bùdébù) - Have to, can't help but",
    "short_explanation": "Used to express a situation in which one has no other choice.",
    "long_explanation": "The Mandarin Chinese phrase '不得不 (bùdébù)' is used when you have to do something and have no other choice. It is often equivalent to saying 'have to' or 'can't help but' in English. This phrase expresses a certain compulsion or necessity to conduct an action due to circumstances beyond one's control.",
    "formation": "Subject + 不得不 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "因为下雨，我不得不取消了我的跑步计划。",
        "pinyin": "Yīnwèi xià yǔ, wǒ bùdébù qǔxiāo le wǒ de pǎobù jìhuà.",
        "en": "Because of the rain, I had no choice but to cancel my running plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_因为下雨我不得不取消了我的跑步计划.mp3"
      },
      {
        "cn": "我今天感觉很累，但因为有个重要的会议，我不得不去公司。",
        "pinyin": "Wǒ jīntiān gǎnjué hěn lèi, dàn yīnwèi yǒu gè zhòngyào de huìyì, wǒ bùdébù qù gōngsī.",
        "en": "I feel very tired today, but because of an important meeting, I have to go to the company.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_我今天感觉很累但因为有个重要的会议我不得不去公司.mp3"
      },
      {
        "cn": "我不得不承认，也虽然我不喜欢他，但他是一个非常聪明的人。",
        "pinyin": "Wǒ bùdébù chéngrèn, yě suīrán wǒ bù xǐhuān tā, dàn tā shì yīgè fēicháng cōngmíng de rén.",
        "en": "I have to admit, even though I don't like him, he is a very smart person.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_我不得不承认也虽然我不喜欢他但他是一个非常聪明的人.mp3"
      },
      {
        "cn": "虽然我知道这个过程会让我疼痛，但我不得不忍受。",
        "pinyin": "Suīrán wǒ zhīdào zhège guòchéng huì ràng wǒ téngtòng, dàn wǒ bùdébù rěnshòu.",
        "en": "Even though I know that this process will make me suffer, I have to endure it.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_虽然我知道这个过程会让我疼痛但我不得不忍受.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "总的来说 (zǒng de lái shuō) - Generally speaking",
    "short_explanation": "Used to summarize or to make a general overall statement.",
    "long_explanation": "The Mandarin Chinese phrase '总的来说 (zǒng de lái shuō)' is used to make a general or overall summary about something. It is akin to using 'generally speaking' or 'in summary' in English. It's predominantly used when you want to give an overall perspective or summarizing multiple points.",
    "formation": "At the beginning or end of sentence + 总的来说 + Statement",
    "examples": [
      {
        "cn": "总的来说，这是一个十分成功的项目。",
        "pinyin": "Zǒng de lái shuō, zhè shì yīgè shífēn chénggōng de xiàngmù.",
        "en": "Generally speaking, this is a very successful project.",
        "grammar_audio": "/audio/mandarin/grammar/s_总的来说_zǒng_de_lái_shuō_-_Generally_speaking_20231230_总的来说这是一个十分成功的项目.mp3"
      },
      {
        "cn": "总的来说，我觉得我们的计划进行得不错。",
        "pinyin": "Zǒng de lái shuō, wǒ juédé wǒmen de jìhuà jìnxíng dé bùcuò.",
        "en": "Generally speaking, I think our plan is going well.",
        "grammar_audio": "/audio/mandarin/grammar/s_总的来说_zǒng_de_lái_shuō_-_Generally_speaking_20231230_总的来说我觉得我们的计划进行得不错.mp3"
      },
      {
        "cn": "这个政策有好有坏，但是总的来说，它对我们的影响是积极的。",
        "pinyin": "Zhè ge zhèngcè yǒu hǎo yǒu huài, dànshì zǒng de lái shuō, tā duì wǒmen de yǐngxiǎng shì jījí de.",
        "en": "This policy has its pros and cons, but generally speaking, its impact on us is positive.",
        "grammar_audio": "/audio/mandarin/grammar/s_总的来说_zǒng_de_lái_shuō_-_Generally_speaking_20231230_这个政策有好有坏但是总的来说它对我们的影响是积极的.mp3"
      },
      {
        "cn": "虽然我今天遇到了一些困难，但总的来说，我觉得这是一个很好的一天。",
        "pinyin": "Suīrán wǒ jīntiān yù dàole yīxiē kùnnán, dàn zǒng de lái shuō, wǒ juédé zhè shì yīgè hěn hǎo de yītiān.",
        "en": "Even though I encountered some difficulties today, generally speaking, I think it was a good day.",
        "grammar_audio": "/audio/mandarin/grammar/s_总的来说_zǒng_de_lái_shuō_-_Generally_speaking_20231230_虽然我今天遇到了一些困难但总的来说我觉得这是一个很好的一天.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "尽量 (jǐnliàng) - As much as possible, to the best of one’s ability",
    "short_explanation": "Used to express 'trying one's best' or 'as much as possible'.",
    "long_explanation": "The Mandarin Chinese phrase '尽量 (jǐnliàng)' is often used when someone is trying to do something to the best of their ability or as much as possible. It is generally used in front of a verb, suggesting that the action should be done as much or as well as the subject can manage.",
    "formation": "Subject + 尽量 + Verb + Object.",
    "examples": [
      {
        "cn": "你尽量准时到达那里，我们会等你。",
        "pinyin": "Nǐ jǐnliàng zhǔnshí dàodá nàlǐ, wǒmen huì děng nǐ.",
        "en": "Try your best to get there on time, we will wait for you.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_你尽量准时到达那里我们会等你.mp3"
      },
      {
        "cn": "他尽量每天做一些运动以保持健康。",
        "pinyin": "Tā jǐnliàng měitiān zuò yīxiē yùndòng yǐ bǎochí jiànkāng.",
        "en": "He tries his best to do some exercise every day to stay healthy.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_他尽量每天做一些运动以保持健康.mp3"
      },
      {
        "cn": "我们应该尽量减少浪费食物的行为。",
        "pinyin": "Wǒmen yīnggāi jǐnliàng jiǎnshǎo làngfèi shíwù de xíngwéi.",
        "en": "We should try our best to reduce the behavior of wasting food.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_我们应该尽量减少浪费食物的行为.mp3"
      },
      {
        "cn": "我会尽量少使用我手机。",
        "pinyin": "Wǒ huì jǐnliàng shǎo shǐyòng wǒ de shǒujī.",
        "en": "I will try to use my phone as little as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_我会尽量少使用我手机.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "为了 (wèile) - In order to, for the sake of",
    "short_explanation": "Used to express purpose or motivation behind an action.",
    "long_explanation": "The Mandarin Chinese preposition '为了 (wèile)' is used to express the purpose or motivation behind an action. It can be directly translated to 'in order to' or 'for the sake of' in English. This word often precedes the action it affects, showing the cause or reason for that action to be performed.",
    "formation": "为了 + Purpose/Motive + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "为了健康，我每天都去健身房运动。",
        "pinyin": "Wèile jiànkāng, wǒ měitiān dōu qù jiànshēnfáng yùndòng.",
        "en": "In order to stay healthy, I exercise at the gym every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了健康我每天都去健身房运动.mp3"
      },
      {
        "cn": "她为了学好中文，决定去中国留学。",
        "pinyin": "Tā wèile xué hǎo Zhōngwén, juédìng qù Zhōngguó liúxué.",
        "en": "For the sake of mastering Chinese, she decided to study abroad in China.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_她为了学好中文决定去中国留学.mp3"
      },
      {
        "cn": "小朋友们为了能看到圣诞老人，熬夜不睡觉。",
        "pinyin": "Xiǎo péngyǒumen wèile néng kàn dào shèngdàn lǎorén, áoyè bù shuìjiào.",
        "en": "In order to see Santa Claus, the children stayed up all night without sleeping.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_小朋友们为了能看到圣诞老人熬夜不睡觉.mp3"
      },
      {
        "cn": "他为了实现梦想，每天都坚持画画。",
        "pinyin": "Tā wèile shíxiàn mèngxiǎng, měitiān dōu jiānchí huàhuà.",
        "en": "For the sake of realizing his dream, he insists on painting every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_他为了实现梦想每天都坚持画画.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "既然 (jìrán) - Since, now that",
    "short_explanation": "Used to show that one event or situation is the consequence of another.",
    "long_explanation": "The Mandarin Chinese phrase '既然 (jìrán)' is used to indicate that one event or situation is the result of another. It is equivalent to 'since' or 'now that' in English. This phrase is often used to hold a causal relationship between two events or situations, where the first event or situation is the reason or cause of the second event or situation.",
    "formation": "既然 + Known Condition, Main Sentence",
    "examples": [
      {
        "cn": "既然你不喜欢吃鱼，我们就点别的菜吧。",
        "pinyin": "Jìrán nǐ bù xǐhuān chī yú, wǒmen jiù diǎn bié de cài ba.",
        "en": "Since you don't like fish, let's order something else.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你不喜欢吃鱼我们就点别的菜吧.mp3"
      },
      {
        "cn": "既然你们已经决定了，那我就全力以赴支持你们。",
        "pinyin": "Jìrán nǐmen yǐjīng juédìng le, nà wǒ jiù quánlìyǐfù zhīchí nǐmen.",
        "en": "Since you have already decided, I will support you wholeheartedly.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你们已经决定了那我就全力以赴支持你们.mp3"
      },
      {
        "cn": "既然明天要早起，那我们今晚就早点去睡吧。",
        "pinyin": "Jìrán míngtiān yào zǎo qǐ, nà wǒmen jīnwǎn jiù zǎodiǎn qù shuì ba.",
        "en": "Since we have to get up early tomorrow, let's go to bed early tonight.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然明天要早起那我们今晚就早点去睡吧.mp3"
      },
      {
        "cn": "既然你已经看过这部电影，那我们换一部吧。",
        "pinyin": "Jìrán nǐ yǐjīng kànguò zhè bù diànyǐng, nà wǒmen huàn yī bù ba.",
        "en": "Since you have already watched this movie, let's change to another one.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你已经看过这部电影那我们换一部吧.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "无法 (wúfǎ) - Unable to, can't",
    "short_explanation": "Used to express inability to do something.",
    "long_explanation": "The Mandarin Chinese phrase '无法 (wúfǎ)' is used to convey the inability to do something. It signals a limitation or incapacity to perform an action or to do a particular thing. Unlike the English 'can't' or 'unable to', '无法' does not need a negative auxiliary verb, instead, it inherently carries a negative meaning.",
    "formation": "Subject + 无法 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "我无法接受她的离开，因为我太爱她了。",
        "pinyin": "Wǒ wúfǎ jiēshòu tā de líkāi, yīnwèi wǒ tài ài tā le.",
        "en": "I can't accept her departure, because I love her too much.",
        "grammar_audio": "/audio/mandarin/grammar/s_无法_wúfǎ_-_Unable_to_cant_20231230_我无法接受她的离开因为我太爱她了.mp3"
      },
      {
        "cn": "他无法解释他为什么迟到，因为他刚刚醒来。",
        "pinyin": "Tā wúfǎ jiěshì tā wèishéme chídào, yīnwèi tā gānggāng xǐnglái.",
        "en": "He can't explain why he is late, because he just woke up.",
        "grammar_audio": "/audio/mandarin/grammar/s_无法_wúfǎ_-_Unable_to_cant_20231230_他无法解释他为什么迟到因为他刚刚醒来.mp3"
      },
      {
        "cn": "由于缺乏资源，我们无法完成这个项目。",
        "pinyin": "Yóuyú quēfá zīyuán, wǒmen wúfǎ wánchéng zhège xiàngmù.",
        "en": "Due to lack of resources, we are unable to complete this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_无法_wúfǎ_-_Unable_to_cant_20231230_由于缺乏资源我们无法完成这个项目.mp3"
      },
      {
        "cn": "我无法理解他的行为，他似乎毫无道理。",
        "pinyin": "Wǒ wúfǎ lǐjiě tā de xíngwéi, tā sìhū háo wú dàolǐ.",
        "en": "I can't understand his behavior, it seems completely unreasonable.",
        "grammar_audio": "/audio/mandarin/grammar/s_无法_wúfǎ_-_Unable_to_cant_20231230_我无法理解他的行为他似乎毫无道理.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "由 (yóu) - By (indicating a passive voice)",
    "short_explanation": "Used to indicate a passive voice, expressing an action done by the agent.",
    "long_explanation": "The Mandarin Chinese phrase '由 (yóu)' is used to denote a passive voice. It is placed in front of the agent (the one doing the action), to express that the action is done 'by' them. It is similar to using 'by' in English when constructing passive sentences.",
    "formation": "Subject + 被/由 + Agent + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "这个项目由他们的团队负责。",
        "pinyin": "Zhège xiàngmù yóu tāmen de tuánduì fùzé.",
        "en": "This project is handled by their team.",
        "grammar_audio": "/audio/mandarin/grammar/s_由_yóu_-_By_indicating_a_passive_voice_20231230_这个项目由他们的团队负责.mp3"
      },
      {
        "cn": "这间房间的设计是由著名的建筑师完成的。",
        "pinyin": "Zhè jiān fángjiān de shèjì shì yóu zhùmíng de jiànzhùshī wánchéng de.",
        "en": "The design of this room was done by a famous architect.",
        "grammar_audio": "/audio/mandarin/grammar/s_由_yóu_-_By_indicating_a_passive_voice_20231230_这间房间的设计是由著名的建筑师完成的.mp3"
      },
      {
        "cn": "这部电影是由李安导演的。",
        "pinyin": "Zhè bù diànyǐng shì yóu Lǐ ān dǎoyǎn de.",
        "en": "This movie was directed by Ang Lee.",
        "grammar_audio": "/audio/mandarin/grammar/s_由_yóu_-_By_indicating_a_passive_voice_20231230_这部电影是由李安导演的.mp3"
      },
      {
        "cn": "这篇论文是由我负责写的。",
        "pinyin": "Zhè piān lùnwén shì yóu wǒ fùzé xiě de.",
        "en": "This thesis was written by me.",
        "grammar_audio": "/audio/mandarin/grammar/s_由_yóu_-_By_indicating_a_passive_voice_20231230_这篇论文是由我负责写的.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "比如 (bǐrú) - Such as, For example",
    "short_explanation": "This phrase is used to give examples in a discussion or explanation.",
    "long_explanation": "The phrase '比如 (bǐrú)' is used to list specific examples when you are discussing a general idea or illustrating a specific concept. You will usually mention it before the examples that you want to give. Its usage is very similar to 'for example' or 'such as' in English. This phrase is quite beneficial when you'd like to give more concrete details in your conversation or narrative.",
    "formation": "Statement + 比如 + Example(s)",
    "examples": [
      {
        "cn": "我喜欢果汁，比如苹果汁或者橙汁。",
        "pinyin": "Wǒ xǐhuān guǒzhī, bǐrú píngguǒ zhī huòzhě chéng zhī.",
        "en": "I like fruit juices, such as apple juice or orange juice.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_Such_as_For_example_20231230_我喜欢果汁比如苹果汁或者橙汁.mp3"
      },
      {
        "cn": "我们可以去很多有趣的地方，比如博物馆、公园或者影院。",
        "pinyin": "Wǒmen kěyǐ qù hěnduō yǒuqù de dìfāng, bǐrú bówùguǎn, gōngyuán huòzhě yǐngyuàn.",
        "en": "We can go to many interesting places, for example, museums, parks, or cinemas.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_Such_as_For_example_20231230_我们可以去很多有趣的地方比如博物馆公园或者影院.mp3"
      },
      {
        "cn": "这个城市有很多美食，比如饺子、拉面和烤鸭。",
        "pinyin": "Zhège chéngshì yǒu hěnduō měishí, bǐrú jiǎozi, lāmiàn hé kǎoyā.",
        "en": "This city has many delicious foods, such as dumplings, ramen, and roast duck.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_Such_as_For_example_20231230_这个城市有很多美食比如饺子拉面和烤鸭.mp3"
      },
      {
        "cn": "我在书店买了一些书，比如科普书、小说和旅游指南。",
        "pinyin": "Wǒ zài shūdiàn mǎi le yīxiē shū, bǐrú kēpǔ shū, xiǎoshuō hé lǚyóu zhǐnán.",
        "en": "I bought some books at the bookstore, for example, science books, novels, and travel guides.",
        "grammar_audio": "/audio/mandarin/grammar/s_比如_bǐrú_-_Such_as_For_example_20231230_我在书店买了一些书比如科普书小说和旅游指南.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "即使 (jíshǐ) - Even if, even though",
    "short_explanation": "Used to express a hypothetical condition or concession.",
    "long_explanation": "The Mandarin Chinese conjunction '即使 (jíshǐ)' works similarly to 'even if' or 'even though' in English. It introduces a situation or condition that holds regardless of circumstances, even if it may be extreme or unlikely. It often precedes a negative outcome, emphasizing the situation's gravity.",
    "formation": "即使 + Hypothetical Condition + , + Outcome/Situation",
    "examples": [
      {
        "cn": "即使明天下雨，我们也要去爬山。",
        "pinyin": "Jíshǐ míngtiān xiàyǔ, wǒmen yě yào qù páshān.",
        "en": "Even if it rains tomorrow, we are still going to climb the mountain.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使明天下雨我们也要去爬山.mp3"
      },
      {
        "cn": "即使我给你所有的时间，你还是完不成这个任务。",
        "pinyin": "Jíshǐ wǒ gěi nǐ suǒyǒu de shíjiān, nǐ háishì wán bùchéng zhège rènwù.",
        "en": "Even if I give you all the time, you still can't finish this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使我给你所有的时间你还是完不成这个任务.mp3"
      },
      {
        "cn": "即使他是总裁，他也不能随意违反规定。",
        "pinyin": "Jíshǐ tā shì zǒngcái, tā yě bùnéng suíyì wéifǎn guīdìng.",
        "en": "Even though he is the president, he can't freely violate the rules.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使他是总裁他也不能随意违反规定.mp3"
      },
      {
        "cn": "即使你不喜欢吃蔬菜，你也应该为了你的健康来吃。",
        "pinyin": "Jíshǐ nǐ bù xǐhuān chī shūcài, nǐ yě yīnggāi wèile nǐ de jiànkāng lái chī.",
        "en": "Even if you don't like eating vegetables, you should eat them for your health.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使你不喜欢吃蔬菜你也应该为了你的健康来吃.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "只有...才... (zhǐyǒu...cái...) - Only if/when... then...",
    "short_explanation": "Used to express that 'only if/when' condition X happens 'then' Y will happen.",
    "long_explanation": "The Mandarin Chinese phrase '只有...才...' (zhǐyǒu...cái...) is a conditional construction used to highlight that only under a certain condition, then a particular result can arise. This construction helps to emphasize the exclusivity of the necessary condition for the subsequent result. It is equivalent to saying 'only if or only when' a condition is met in English.",
    "formation": "只有 + Condition + 才 + Result",
    "examples": [
      {
        "cn": "只有通过努力学习，才能通过HSK考试。",
        "pinyin": "Zhǐyǒu tōngguò nǔlì xuéxí, cái néng tōngguò HSK kǎoshì.",
        "en": "Only by studying hard, can you pass the HSK exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒucái_-_Only_if/when_then_20231230_只有通过努力学习才能通过HSK考试.mp3"
      },
      {
        "cn": "只有当你真心对待别人，别人才会真心对待你。",
        "pinyin": "Zhǐyǒu dāng nǐ zhēnxīn duìdài biérén, biérén cái huì zhēnxīn duìdài nǐ.",
        "en": "Only when you treat others sincerely, will others treat you sincerely.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒucái_-_Only_if/when_then_20231230_只有当你真心对待别人别人才会真心对待你.mp3"
      },
      {
        "cn": "只有具备了足够的知识，才能解决这个难题。",
        "pinyin": "Zhǐyǒu jùbèi le zúgòu de zhīshi, cái néng jiějué zhège nántí.",
        "en": "Only with sufficient knowledge, can this difficult problem be solved.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒucái_-_Only_if/when_then_20231230_只有具备了足够的知识才能解决这个难题.mp3"
      },
      {
        "cn": "只有努力了，才没有遗憾。",
        "pinyin": "Zhǐyǒu nǔlì le, cái méiyǒu yíhàn.",
        "en": "Only by trying hard, can there be no regrets.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒucái_-_Only_if/when_then_20231230_只有努力了才没有遗憾.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "甚至 (shènzhì) - Even, so much so that",
    "short_explanation": "It is used to emphasize the high degree of something.",
    "long_explanation": "The Mandarin Chinese word '甚至 (shènzhì)' is used to emphasize the unexpected extremity or the high degree of a situation, event, or action. It is equivalent to 'even' or 'so much so that' in English. This term is often used to highlight something surprisingly exceeding expectations, either in a positive or negative sense.",
    "formation": "Sentence + 甚至 + Extremity statement",
    "examples": [
      {
        "cn": "这个电影我非常喜欢，甚至买了很多相关的周边产品。",
        "pinyin": "Zhège diànyǐng wǒ fēicháng xǐhuān, shènzhì mǎi le hěn duō xiāngguān de zhōubīn chǎnpǐn.",
        "en": "I really like this movie; I even bought many related merchandise.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_这个电影我非常喜欢甚至买了很多相关的周边产品.mp3"
      },
      {
        "cn": "他每天工作到很晚，甚至有时候不吃晚饭。",
        "pinyin": "Tā měitiān gōngzuò dào hěn wǎn, shènzhì yǒu shíhou bù chī wǎnfàn.",
        "en": "He works late every day, he even sometimes skips dinner.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_他每天工作到很晚甚至有时候不吃晚饭.mp3"
      },
      {
        "cn": "她十分爱她的猫，甚至为它庆祝生日。",
        "pinyin": "Tā shífēn ài tā de māo, shènzhì wèi tā qìngzhù shēngrì.",
        "en": "She loves her cat very much, so much so that she celebrates its birthday.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_她十分爱她的猫甚至为它庆祝生日.mp3"
      },
      {
        "cn": "我很喜欢画画，甚至想去艺术学院学习。",
        "pinyin": "Wǒ hěn xǐhuān huàhuà, shènzhì xiǎng qù yìshù xuéyuàn xuéxí.",
        "en": "I really like painting, even to the point where I want to study in an art academy.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_我很喜欢画画甚至想去艺术学院学习.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "反而 (fǎn'ér) - On the contrary, instead",
    "short_explanation": "Used to express a contrast or unexpected result.",
    "long_explanation": "The Mandarin Chinese phrase '反而 (fǎn'ér)' is used to propose an alternative or even opposite consequence or result to what was previously expected or mentioned. It is similar in usage to 'on the contrary' or 'instead' in English. This phrase is often used to point out contrasts or unexpected results.",
    "formation": "Original situation + 反而 + Contrasting result",
    "examples": [
      {
        "cn": "你再早去，反而会在路上塞车，所以应该稍微晚一点走。",
        "pinyin": "Nǐ zài zǎo qù, fǎn'ér huì zài lù shàng sāichē, suǒyǐ yīng gāi shāowēi wǎn yī diǎn zǒu.",
        "en": "If you go earlier, instead you will be stuck in traffic, so you should leave a bit later.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_你再早去反而会在路上塞车所以应该稍微晚一点走.mp3"
      },
      {
        "cn": "他不但没有哭，反而笑了出来。",
        "pinyin": "Tā bùdàn méiyǒu kū, fǎn'ér xiào le chūlái.",
        "en": "He did not cry, on the contrary, he burst out laughing.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_他不但没有哭反而笑了出来.mp3"
      },
      {
        "cn": "我以为他会生我气，反而他对我更好了。",
        "pinyin": "Wǒ yǐwéi tā huì shēng wǒ qì, fǎn'ér tā duì wǒ gènghǎo le.",
        "en": "I thought he would be angry with me, but on the contrary, he treated me even better.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我以为他会生我气反而他对我更好了.mp3"
      },
      {
        "cn": "降低价格并没有增加销售额，反而让人们质疑产品的质量。",
        "pinyin": "jiàngdī jiàgé bìng méiyǒu zēngjiā xiāoshòu é, fǎn'ér ràng rénmen zhìyí chǎnpǐn de zhìliàng.",
        "en": "Lowering the price did not increase sales, on the contrary, it made people question the quality of the product.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_降低价格并没有增加销售额反而让人们质疑产品的质量.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "100"
  },
  {
    "title": "无论...都... (wúlùn...dōu...) - No matter what/who/etc., always...",
    "short_explanation": "This pattern indicates that a certain result will always happen, regardless of changes in the condition expressed in the '无论' clause.",
    "long_explanation": "In the Mandarin Chinese language, '无论...都...' (wúlùn...dōu...) functions as a complex sentence pattern denoting 'no matter what, who, where, etc.' The structure is used to emphasize the point that regardless of the situation or condition depicted in the '无论' clause, the outcome expressed in the '都' clause will always hold true. It is akin to the English expressions 'regardless of...' or 'no matter what...'",
    "formation": "无论 + Statement, + 都 + Result",
    "examples": [
      {
        "cn": "无论我们在哪里，我们都是最好的朋友。",
        "pinyin": "Wúlùn wǒmen zài nǎlǐ, wǒmen dōu shì zuì hǎo de péngyǒu.",
        "en": "No matter where we are, we are best friends.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùndōu_-_No_matter_what/who/etc_always_20231230_无论我们在哪里我们都是最好的朋友.mp3"
      },
      {
        "cn": "无论你说什么，我都会支持你的决定。",
        "pinyin": "Wúlùn nǐ shuō shénme, wǒ dōu huì zhīchí nǐ de juédìng.",
        "en": "No matter what you say, I will always support your decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùndōu_-_No_matter_what/who/etc_always_20231230_无论你说什么我都会支持你的决定.mp3"
      },
      {
        "cn": "无论天气多么糟糕，她都会按时完成她的跑步训练。",
        "pinyin": "Wúlùn tiānqì duōme zāogāo, tā dōu huì ànshí wánchéng tā de pǎobù xùnliàn.",
        "en": "No matter how bad the weather is, she always finishes her running training on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùndōu_-_No_matter_what/who/etc_always_20231230_无论天气多么糟糕她都会按时完成她的跑步训练.mp3"
      },
      {
        "cn": "无论你去哪里，我都会跟随你。",
        "pinyin": "Wúlùn nǐ qù nǎlǐ, wǒ dōu huì gēnsuí nǐ.",
        "en": "No matter where you go, I will follow you.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùndōu_-_No_matter_what/who/etc_always_20231230_无论你去哪里我都会跟随你.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "不过 (bùguò) - However, but",
    "short_explanation": "Used to introduce a contrast or exception to a previously stated fact or argument.",
    "long_explanation": "The Mandarin Chinese conjunction '不过 (bùguò)' is used to introduce a contrast or exception in relation to a previously stated fact, suggestion, or argument. It is equivalent to the use of 'however' or 'but' in English. This conjunction is often used to clarify or provide additional information that may contradict or limit the preceding statement.",
    "formation": "Sentence 1, 不过 + Sentence 2",
    "examples": [
      {
        "cn": "我原来想去超市买东西，不过我太累了，所以我决定明天去。",
        "pinyin": "Wǒ yuánlái xiǎng qù chāoshì mǎi dōngxi, bùguò wǒ tài lèi le, suǒyǐ wǒ juédìng míngtiān qù.",
        "en": "I originally wanted to go to the supermarket to buy things, however, I was too tired, so I decided to go tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_bùguò_-_However_but_20231230_我原来想去超市买东西不过我太累了所以我决定明天去.mp3"
      },
      {
        "cn": "他是我的好朋友，不过我不能借钱给他，因为我自己也需要钱。",
        "pinyin": "Tā shì wǒ de hǎo péngyǒu, bùguò wǒ bù néng jiè qián gěi tā, yīnwèi wǒ zìjǐ yě xūyào qián.",
        "en": "He's my good friend, however, I can't lend him money because I need money myself.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_bùguò_-_However_but_20231230_他是我的好朋友不过我不能借钱给他因为我自己也需要钱.mp3"
      },
      {
        "cn": "我喜欢这件衣服的样式，不过我觉得它的颜色和我不搭配。",
        "pinyin": "Wǒ xǐhuān zhè jiàn yīfu de yàngshì, bùguò wǒ juéde tā de yánsè hé wǒ bù dāpèi.",
        "en": "I like the style of this dress, but I think its color doesn't match me.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_bùguò_-_However_but_20231230_我喜欢这件衣服的样式不过我觉得它的颜色和我不搭配.mp3"
      },
      {
        "cn": "我每周都去游泳，不过这个星期我太忙了，我没有时间去。",
        "pinyin": "Wǒ měizhōu dōu qù yóuyǒng, bùguò zhège xīngqī wǒ tài mángle, wǒ méiyǒu shíjiān qù.",
        "en": "I go swimming every week, but this week I'm too busy, I don't have time to go.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_bùguò_-_However_but_20231230_我每周都去游泳不过这个星期我太忙了我没有时间去.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "正好 (zhènghǎo) - Just in time, just right",
    "short_explanation": "Used to describe a coincidence or timing that fits a situation perfectly.",
    "long_explanation": "The Mandarin Chinese phrase '正好 (zhènghǎo)' is used to describe a situation or timing that is fortuitous, perfect, or just right. It conveys the idea of something happening exactly at the right moment or something fitting a situation perfectly. It can be used in scenarios where there is a good match in size, quantity, timing, or situation. The phrase is often used to communicate a sense of perfect coincidence or just-in-time event.",
    "formation": "Subject + Verb + 正好 + Situation",
    "examples": [
      {
        "cn": "我到达车站的时候，火车正好要离开。",
        "pinyin": "Wǒ dàodá chēzhàn de shíhou, huǒchē zhènghǎo yào líkāi.",
        "en": "When I arrived at the station, the train was just about to leave.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_我到达车站的时候火车正好要离开.mp3"
      },
      {
        "cn": "你正好有空，我们一起去看电影怎么样？",
        "pinyin": "Nǐ zhènghǎo yǒu kòng, wǒmen yīqǐ qù kàn diànyǐng zěnme yàng?",
        "en": "You have some free time just right, how about we go to see a movie together?",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_你正好有空我们一起去看电影怎么样.mp3"
      },
      {
        "cn": "我正好在这附近，所以我就过来看你了。",
        "pinyin": "Wǒ zhènghǎo zài zhè fùjìn, suǒyǐ wǒ jiù guòlái kàn nǐ le.",
        "en": "I happened to be nearby, so I came to see you.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_我正好在这附近所以我就过来看你了.mp3"
      },
      {
        "cn": "你正好需要帮助，我也正好有空闲时间。",
        "pinyin": "Nǐ zhènghǎo xūyào bāngzhù, wǒ yě zhènghǎo yǒu xiánxí shíjiān.",
        "en": "You need help just in time, and I just happen to have free time.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_你正好需要帮助我也正好有空闲时间.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "正如 (zhèngrú) - Just as, as",
    "short_explanation": "Used to express similarity or equivalence between two things or situations.",
    "long_explanation": "The Mandarin Chinese phrase '正如 (zhèngrú)' is used to draw a comparison between two things or situations, indicating a likeness or similarity. It can be translated as 'just as' or 'as' in English. This phrase is often used to highlight a particular attribute or characteristic shared between two items, individuals, or circumstances.",
    "formation": "正如 + Subject/Clause 1 + , + Verb/Adjective + Subject/Clause 2",
    "examples": [
      {
        "cn": "正如你可以看见的，他是一个绝对的专家。",
        "pinyin": "Zhèngrú nǐ kěyǐ kànjiàn de, tā shì yīgè juéduì de zhuānjiā.",
        "en": "Just as you can see, he is an absolute expert.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如你可以看见的他是一个绝对的专家.mp3"
      },
      {
        "cn": "正如老师告诉我们的，我们需要多加实践。",
        "pinyin": "Zhèngrú lǎoshī gàosù wǒmen de, wǒmen xūyào duō jiā shíjiàn.",
        "en": "As the teacher told us, we need more practice.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如老师告诉我们的我们需要多加实践.mp3"
      },
      {
        "cn": "正如我们预期的那样，他们赢得了这场比赛。",
        "pinyin": "Zhèngrú wǒmen yùqī de nà yàng, tāmen yíngdé le zhè chǎng bǐsài.",
        "en": "Just as we expected, they won the game.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我们预期的那样他们赢得了这场比赛.mp3"
      },
      {
        "cn": "正如金钱无法买到幸福，名声也无法带来内心的平静。",
        "pinyin": "Zhèngrú jīnqián wúfǎ mǎidào xìngfú, míngshēng yě wúfǎ dài lái nèixīn de píngjìng.",
        "en": "Just as money can't buy happiness, fame doesn't bring inner peace.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如金钱无法买到幸福名声也无法带来内心的平静.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "随着 (suízhe) - Along with, in pace with",
    "short_explanation": "This is used to show that an action or a change occurs concurrently with another action or change.",
    "long_explanation": "The Mandarin Chinese phrase '随着 (suízhe)' is a preposition that illustrates the simultaneous occurrence of two actions or changes. It conveys the fact that a certain action is happening along with or in pace with another action. This grammar rule is often used to demonstrate correlation between two events where one event's progression or development accompanies another's.",
    "formation": "随着 + Event 1, Event 2",
    "examples": [
      {
        "cn": "随着科技的发展，人们的生活也变得越来越便利。",
        "pinyin": "Suízhe kējì de fāzhǎn, rénmen de shēnghuó yě biàn de yuè lái yuè biànlì.",
        "en": "With the advancement of technology, people's lives are becoming more and more convenient.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_pace_with_20231230_随着科技的发展人们的生活也变得越来越便利.mp3"
      },
      {
        "cn": "随着年龄的增长，他的责任感也在增强。",
        "pinyin": "Suízhe niánlíng de zēngzhǎng, tā de zérèn gǎn yě zài zēngqiáng.",
        "en": "With the growth of age, his sense of responsibility is also strengthening.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_pace_with_20231230_随着年龄的增长他的责任感也在增强.mp3"
      },
      {
        "cn": "随着气温的升高，冰雪开始融化。",
        "pinyin": "Suízhe qìwēn de shēnggāo, bīngxuě kāishǐ rónghuà.",
        "en": "Along with the rise of temperature, the ice and snow begin to melt.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_pace_with_20231230_随着气温的升高冰雪开始融化.mp3"
      },
      {
        "cn": "随着瑜伽的普及，越来越多的人领悟到其对身心健康的好处。",
        "pinyin": "Suízhe yújiā de pǔjí, yuè lái yuè duō de rén lǐngwù dào qí duì shēnxīn jiànkāng de hǎochù.",
        "en": "With the popularity of yoga, more and more people realize its benefits to physical and mental health.",
        "grammar_audio": "/audio/mandarin/grammar/s_随着_suízhe_-_Along_with_in_pace_with_20231230_随着瑜伽的普及越来越多的人领悟到其对身心健康的好处.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "与其...不如... (yǔqí... bùrú...) - Rather than... it's better to...",
    "short_explanation": "Used to compare two choice or actions and state that one is prefered.",
    "long_explanation": "The Mandarin Chinese phrase '与其...不如...' (yǔqí... bùrú...) is a comparative structure used to express the speaker's preference or advice toward one choice or action over another. It is roughly equivalent to saying 'rather than... it's better to...' in English. It can be used in discussing preferences, offering advice, or drawing comparisons.",
    "formation": "'与其 + undesired action + 不如 + preferred action",
    "examples": [
      {
        "cn": "与其在家里看电视，不如去公园散步。",
        "pinyin": "Yǔqí zài jiā lǐ kàn diànshì, bùrú qù gōngyuán sànbù.",
        "en": "Rather than watching TV at home, it's better to go for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其在家里看电视不如去公园散步.mp3"
      },
      {
        "cn": "与其花大量的时间担心，不如行动起来解决问题。",
        "pinyin": "Yǔqí huā dàliàng de shíjiān dānxīn, bùrú xíngdòng qǐlái jiějué wèntí.",
        "en": "Rather than spending a lot of time worrying, it's better to take action to solve the problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其花大量的时间担心不如行动起来解决问题.mp3"
      },
      {
        "cn": "与其抱怨工作太累，不如换一份新工作。",
        "pinyin": "Yǔqí bàoyuàn gōngzuò tài lèi, bùrú huàn yī fèn xīn gōngzuò.",
        "en": "Rather than complaining that work is too tiring, it's better to change to a new job.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其抱怨工作太累不如换一份新工作.mp3"
      },
      {
        "cn": "与其每天吃外卖，不如自己做健康的食物。",
        "pinyin": "Yǔqí měitiān chī wàimài, bùrú zìjǐ zuò jiànkāng de shíwù.",
        "en": "Rather than eating takeout every day, it's better to cook healthy food by yourself.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其每天吃外卖不如自己做健康的食物.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "只不过 (zhǐ bùguò) - Merely, simply",
    "short_explanation": "Used to express that something is merely or simply the case and no more than what is stated.",
    "long_explanation": "'只不过 (zhǐ bùguò)' in Mandarin Chinese is used to convey that a particular situation, condition, or result is merely or simply the case, and there is nothing more than what has been stated. It often underplays the severity or importance of the situation or indicates an alternative perspective.",
    "formation": "只不过 + Statement",
    "examples": [
      {
        "cn": "这只不过是一个小误会，没必要大惊小怪的。",
        "pinyin": "Zhè zhǐ bùguò shì yīgè xiǎo wùhuì, méi bìyào dàjīngxiǎoguài de.",
        "en": "This is merely a small misunderstanding, there's no need to make a big deal out of it.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐ_bùguò_-_Merely_simply_20231230_这只不过是一个小误会没必要大惊小怪的.mp3"
      },
      {
        "cn": "他只不过是个小职员，没有什么决定权。",
        "pinyin": "Tā zhǐ bùguò shì gè xiǎo zhíyuán, méiyǒu shé me juédìng quán.",
        "en": "He is merely a small employee, he does not have any decision-making power.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐ_bùguò_-_Merely_simply_20231230_他只不过是个小职员没有什么决定权.mp3"
      },
      {
        "cn": "只不过是我吃了一块蛋糕，你不必如此生气。",
        "pinyin": "Zhǐ bùguò shì wǒ chīle yī kuài dàngāo, nǐ búbì rúcǐ shēngqì.",
        "en": "I merely ate a piece of cake, you don't have to be so angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐ_bùguò_-_Merely_simply_20231230_只不过是我吃了一块蛋糕你不必如此生气.mp3"
      },
      {
        "cn": "他只不过想早点回家，休息一下。",
        "pinyin": "Tā zhǐ bùguò xiǎng zǎodiǎn huí jiā, xiūxí yīxià.",
        "en": "He simply wants to go home earlier to rest.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐ_bùguò_-_Merely_simply_20231230_他只不过想早点回家休息一下.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "除了...还/也... (chúle... hái/yě...) - Apart from... also...",
    "short_explanation": "Used to express 'not only... but also...' or 'in addition to... also...' in a sentence.",
    "long_explanation": "The phrase '除了...还/也...' in Mandarin Chinese is used to show that in addition to what is mentioned in the first part of the sentence (the part after '除了'), there is another circumstance, condition or attribute mentioned in the second part of the sentence (the part after '还' or '也'). It is similar to 'not only... but also...' or 'in addition to... also...' in English. The use of '还' or '也' depends on the context. '还' is used when the second part adds new information, while '也' is used when the second part emphasizes a shared attribute or action.",
    "formation": "除了 + Sentence 1, 还/也 + Sentence 2",
    "examples": [
      {
        "cn": "除了读书，她还喜欢画画。",
        "pinyin": "Chúle dúshū, tā hái xǐhuān huàhuà.",
        "en": "Apart from studying, she also likes drawing.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了还/也_chúle_hái/yě_-_Apart_from_also_20231230_除了读书她还喜欢画画.mp3"
      },
      {
        "cn": "除了英语，他也会说一点法语。",
        "pinyin": "Chúle yīngyǔ, tā yě huì shuō yīdiǎn fǎyǔ.",
        "en": "Not only can he speak English, but he can also speak a little French.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了还/也_chúle_hái/yě_-_Apart_from_also_20231230_除了英语他也会说一点法语.mp3"
      },
      {
        "cn": "除了是一个优秀的作家，她还是一个熟练的摄影师。",
        "pinyin": "Chúle shì yīgè yōuxiù de zuòjiā, tā hái shì yīgè shúliàn de shèyǐngshī.",
        "en": "Apart from being an excellent writer, she is also a proficient photographer.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了还/也_chúle_hái/yě_-_Apart_from_also_20231230_除了是一个优秀的作家她还是一个熟练的摄影师.mp3"
      },
      {
        "cn": "除了下雨，今天还很冷。",
        "pinyin": "Chúle xià yǔ, jīntiān hái hěn lěng.",
        "en": "Apart from raining, it's also very cold today.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了还/也_chúle_hái/yě_-_Apart_from_also_20231230_除了下雨今天还很冷.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "至于 (zhìyú) - As for, regarding",
    "short_explanation": "Used to introduce a new topic or shift the focus in a conversation.",
    "long_explanation": "The Mandarin Chinese phrase '至于 (zhìyú)' is often used to shift focus or introduce a new subject in a conversation or discussion. It is similar to the phrases 'as for', 'regarding' or 'with respect to' in English. This phrase helps in transitioning smoothly between different topics within the same conversation.",
    "formation": "Statement + 至于 + New Topic",
    "examples": [
      {
        "cn": "我妹妹已经决定去美国留学了，至于我，还没决定。",
        "pinyin": "Wǒ mèimei yǐjīng juédìng qù Měiguó liúxué le, zhìyú wǒ, hái méi juédìng.",
        "en": "My sister has already decided to study in America. As for me, I haven't decided yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_我妹妹已经决定去美国留学了至于我还没决定.mp3"
      },
      {
        "cn": "这个问题我们之后再讨论，至于现在，我们应该先完成我们的工作。",
        "pinyin": "Zhège wèntí wǒmen zhīhòu zài tǎolùn, zhìyú xiànzài, wǒmen yīnggāi xiān wánchéng wǒmen de gōngzuò.",
        "en": "We'll discuss this issue later. As for now, we should first complete our work.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_这个问题我们之后再讨论至于现在我们应该先完成我们的工作.mp3"
      },
      {
        "cn": "你的想法我明白了，至于他的想法，我还不清楚。",
        "pinyin": "Nǐ de xiǎngfǎ wǒ míngbái le, zhìyú tā de xiǎngfǎ, wǒ hái bù qīngchǔ.",
        "en": "I understand your ideas. As for his ideas, I'm not sure yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_你的想法我明白了至于他的想法我还不清楚.mp3"
      },
      {
        "cn": "她喜欢看浪漫的电影，至于我，我更喜欢科幻电影。",
        "pinyin": "Tā xǐhuān kàn làngmàn de diànyǐng, zhìyú wǒ, wǒ gèng xǐhuān kēhuàn diànyǐng.",
        "en": "She likes to watch romantic movies. As for me, I prefer science fiction movies.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_她喜欢看浪漫的电影至于我我更喜欢科幻电影.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "虽然...但是... (suīrán... dànshì...) - Although... but...",
    "short_explanation": "This structure expresses a contrast or contradiction, typically used to describe a fact or situation that is opposite to expectations.",
    "long_explanation": "The Mandarin Chinese phrase '虽然...但是...' (suīrán... dànshì...) signifies a form of contradiction or contrast, indicating that, whilst recognising the one aspect described after '虽然 (suīrán)', there exists an opposing or contradictory aspect described after '但是 (dànshì...)'. This structure equates to the English expression 'although... but...'. It sets up the context with a condition or reason in the first part of the sentence (after '虽然'), and then contradicts it or offers an exception in the second part of the sentence (after '但是').",
    "formation": "虽然 + Statement 1, 但是 + Statement 2",
    "examples": [
      {
        "cn": "虽然他很皮，但是我还是很喜欢他。",
        "pinyin": "Suīrán tā hěn pí, dànshì wǒ háishì hěn xǐhuān tā.",
        "en": "Although he's very naughty, I still like him very much.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他很皮但是我还是很喜欢他.mp3"
      },
      {
        "cn": "虽然我很累，但是我要继续学习。",
        "pinyin": "Suīrán wǒ hěn lèi, dànshì wǒ yào jìxù xuéxí.",
        "en": "Although I'm very tired, I want to continue studying.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然我很累但是我要继续学习.mp3"
      },
      {
        "cn": "虽然这件衣服很贵，但是我决定买它。",
        "pinyin": "Suīrán zhè jiàn yīfu hěn guì, dànshì wǒ juédìng mǎi tā.",
        "en": "Although this dress is very expensive, I've decided to buy it.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然这件衣服很贵但是我决定买它.mp3"
      },
      {
        "cn": "虽然他对我很好，但我并不喜欢他。",
        "pinyin": "Suīrán tā duì wǒ hěn hǎo, dàn wǒ bìng bù xǐhuān tā.",
        "en": "Although he is very good to me, I don't like him.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他对我很好但我并不喜欢他.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "无论如何 (wúlùn rúhé) - No matter what, anyhow",
    "short_explanation": "Used to convey the sense of 'regardless of the situation or circumstances'.",
    "long_explanation": "In Chinese, '无论如何 (wúlùn rúhé)' is a common phrase that indicates a determined attitude or a sense of regardlessness in any given situation or circumstances. The phrase can be translated into English as 'no matter what, anyhow, anyway or regardless'. It implies that the outcome of the situation is not going to change the speaker's decision, action, or mood.",
    "formation": "无论如何 + Statement",
    "examples": [
      {
        "cn": "无论如何，你都需要完成这项任务。",
        "pinyin": "Wúlùn rúhé, nǐ dū xūyào wánchéng zhè xiàng rènwù.",
        "en": "No matter what, you have to complete this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何你都需要完成这项任务.mp3"
      },
      {
        "cn": "无论如何，我都会去看演唱会。",
        "pinyin": "Wúlùn rúhé, wǒ dū huì qù kàn yǎnchànghuì.",
        "en": "No matter what, I will go to the concert.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何我都会去看演唱会.mp3"
      },
      {
        "cn": "无论如何，你都不能放弃你的梦想。",
        "pinyin": "Wúlùn rúhé, nǐ dōu bùnéng fàngqì nǐ de mèngxiǎng.",
        "en": "No matter what, you cannot give up your dreams.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何你都不能放弃你的梦想.mp3"
      },
      {
        "cn": "无论如何，我们都会成功的。",
        "pinyin": "Wúlùn rúhé, wǒmen dū huì chénggōng de.",
        "en": "No matter what, we will be successful.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何我们都会成功的.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "到底 (dàodǐ) - At last, finally",
    "short_explanation": "Used in questions for emphasis, to express impatience or to demand a decisive answer.",
    "long_explanation": "The Mandarin Chinese phrase '到底 (dàodǐ)' is used to add emphasis in a question, much like 'finally' or 'at last' in English. It often indicates that the speaker is impatient or exasperated and wants a clear, concrete answer. This word is placed before the verb in a sentence and can be used both in spoken and written Chinese.",
    "formation": "Subject + 到底 + Verb/Adjective + Rest of the sentence?",
    "examples": [
      {
        "cn": "你到底把我的书放在哪儿了？",
        "pinyin": "Nǐ dàodǐ bǎ wǒ de shū fàng zài nǎ'er le?",
        "en": "Where on earth did you put my book?",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_At_last_finally_20231230_你到底把我的书放在哪儿了.mp3"
      },
      {
        "cn": "他们到底是不是要来这个聚会？",
        "pinyin": "Tāmen dàodǐ shì bù shì yào lái zhège jùhuì?",
        "en": "Are they finally coming to the party or not?",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_At_last_finally_20231230_他们到底是不是要来这个聚会.mp3"
      },
      {
        "cn": "你到底喜欢看什么类型的电影？",
        "pinyin": "Nǐ dàodǐ xǐhuān kàn shén me lèi xíng de diàn yǐng?",
        "en": "What type of movies do you really like to watch?",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_At_last_finally_20231230_你到底喜欢看什么类型的电影.mp3"
      },
      {
        "cn": "他们到底什么时候才能到达那里？",
        "pinyin": "Tāmen dàodǐ shénme shíhòu cái néng dàodá nàli?",
        "en": "When on earth will they finally arrive there?",
        "grammar_audio": "/audio/mandarin/grammar/s_到底_dàodǐ_-_At_last_finally_20231230_他们到底什么时候才能到达那里.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "反正 (fǎnzhèng) - Anyway, in any case",
    "short_explanation": "Used to express a sense of indifference or resignation about an outcome or result.",
    "long_explanation": "The Mandarin Chinese phrase '反正 (fǎnzhèng)' is used to show a certain disregard or a lack of care about the result of an action or situation, suggesting a kind of resignation or acceptance with the circumstances, no matter what happens. It can be considered somewhat equivalent to 'anyway' or 'in any case' in English.",
    "formation": "Sentence + 反正 + Rest of the sentence",
    "examples": [
      {
        "cn": "反正我已经做完家务了，你要不要帮我一起做晚饭？",
        "pinyin": "Fǎnzhèng wǒ yǐjīng zuò wán jiāwù le, nǐ yào bù yào bāng wǒ yìqǐ zuò wǎnfàn?",
        "en": "Anyway, I have already finished the housework, do you want to help me cook dinner?",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我已经做完家务了你要不要帮我一起做晚饭.mp3"
      },
      {
        "cn": "反正我待不住这里，我打算搬家。",
        "pinyin": "Fǎnzhèng wǒ dāi bù zhù zhèlǐ, wǒ dǎsuàn bānjiā.",
        "en": "In any case, I can't stay here, I plan to move out.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我待不住这里我打算搬家.mp3"
      },
      {
        "cn": "反正你都不会听我的，那你就去做你认为对的事吧。",
        "pinyin": "Fǎnzhèng nǐ dōu bú huì tīng wǒ de, nà nǐ jiù qù zuò nǐ rènwéi duì de shì ba.",
        "en": "Anyway, you won't listen to me, so just do what you think is right.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正你都不会听我的那你就去做你认为对的事吧.mp3"
      },
      {
        "cn": "反正我们已经迟到了，不如我们先去吃点东西吧。",
        "pinyin": "Fǎnzhèng wǒmen yǐjīng chídào le, bùrú wǒmen xiān qù chī diǎn dōngxi ba.",
        "en": "Anyway, we are already late, so we might as well go and eat something first.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我们已经迟到了不如我们先去吃点东西吧.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "不是...而是... (bùshì... érshì...) - It's not... but...",
    "short_explanation": "Used to emphasize on the correct or important information and negate the other.",
    "long_explanation": "The Mandarin Chinese structure '不是...而是...' is used to emphasize on the correct or important information by contrasting it with a statement that is not true or less important. It's similar to saying, 'It's not..., but...' in English, and used to correct a misunderstanding or clarify a point by presenting a contrast.",
    "formation": "不是 + Incorrect / Less important information + 而是 + Correct / Important information",
    "examples": [
      {
        "cn": "我去中国不是旅游，而是工作。",
        "pinyin": "Wǒ qù Zhōngguó bùshì lǚyóu, érshì gōngzuò.",
        "en": "I'm going to China not for tourism but for work.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_我去中国不是旅游而是工作.mp3"
      },
      {
        "cn": "她昨天请假不是因为身体不舒服，而是去看望她的姐姐。",
        "pinyin": "Tā zuótiān qǐngjià bùshì yīnwèi shēntǐ bù shūfú, érshì qù kàn wàng tā de jiějiě.",
        "en": "She took the day off yesterday not because she was feeling unwell, but to visit her sister.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_她昨天请假不是因为身体不舒服而是去看望她的姐姐.mp3"
      },
      {
        "cn": "他买这套房子不是为了自己住，而是投资。",
        "pinyin": "Tā mǎi zhè tào fángzi bùshì wèile zìjǐ zhù, érshì tóuzī.",
        "en": "He bought this house not for himself to live in, but as an investment.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_他买这套房子不是为了自己住而是投资.mp3"
      },
      {
        "cn": "你以为我不快乐，其实不是你，而是我的工作压力。",
        "pinyin": "Nǐ yǐwéi wǒ bù kuàilè, qíshí bùshì nǐ, érshì wǒ de gōngzuò yālì.",
        "en": "You think I'm not happy, but actually it's not you, but the stress from my work.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_你以为我不快乐其实不是你而是我的工作压力.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "原来 (yuánlái) - Originally, as it turns out",
    "short_explanation": "Used to express the idea that something is suddenly understood, or to imply that something was different from what was initially thought.",
    "long_explanation": "The Chinese term '原来 (yuánlái)' is used to show a realization or an understanding that was not previously known or affirmed. It suggests a sense of surprise or revelation as one comes to understand the true state or nature of something. '原来' can also be used to indicate a past condition or original state of something. It is equivalent to phrases like 'originally', 'as it turns out' or 'so that's why..' in English.",
    "formation": "原来 + Sentence (to express realization), or Sentence + 原来 + Sentence (to express originally)",
    "examples": [
      {
        "cn": "原来你是老板的儿子，难怪你总能得到特殊的照顾。",
        "pinyin": "Yuánlái nǐ shì lǎobǎn de érzi, nán guài nǐ zǒng néng dédào tèshū de zhàogù.",
        "en": "So you are the boss's son, no wonder you always get special treatment.",
        "grammar_audio": "/audio/mandarin/grammar/s_原来_yuánlái_-_Originally_as_it_turns_out_20231230_原来你是老板的儿子难怪你总能得到特殊的照顾.mp3"
      },
      {
        "cn": "我以为这个问题很难，原来这么简单。",
        "pinyin": "Wǒ yǐwéi zhège wèntí hěn nán, yuánlái zhème jiǎndān.",
        "en": "I thought this problem was difficult, but it turns out it's so simple.",
        "grammar_audio": "/audio/mandarin/grammar/s_原来_yuánlái_-_Originally_as_it_turns_out_20231230_我以为这个问题很难原来这么简单.mp3"
      },
      {
        "cn": "原来你们已经认识了，我还以为需要介绍。",
        "pinyin": "Yuánlái nǐmen yǐjīng rènshì le, wǒ hái yǐwéi xūyào jièshào.",
        "en": "So you've already met, and here I thought I needed to introduce you.",
        "grammar_audio": "/audio/mandarin/grammar/s_原来_yuánlái_-_Originally_as_it_turns_out_20231230_原来你们已经认识了我还以为需要介绍.mp3"
      },
      {
        "cn": "这件事原来是他做的，我一直误以为是你。",
        "pinyin": "Zhè jiàn shì yuánlái shì tā zuò de, wǒ yīzhí wù yǐwéi shì nǐ.",
        "en": "Turns out he was the one who did this, I've been mistakenly thinking it was you.",
        "grammar_audio": "/audio/mandarin/grammar/s_原来_yuánlái_-_Originally_as_it_turns_out_20231230_这件事原来是他做的我一直误以为是你.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "一旦 (yīdàn) - Once, in case (something happens)",
    "short_explanation": "Used to express a hypothetical situation and its outcome or consequence.",
    "long_explanation": "The Mandarin Chinese phrase '一旦 (yīdàn)' is used to denote a hypothetical situation that could occur in the future and the outcome or consequence that would follow. It is equivalent to saying 'once' or 'in case' in English and is often used to talk about potential scenarios or possibilities.",
    "formation": "一旦 + Hypothetical Situation, Consequence",
    "examples": [
      {
        "cn": "一旦你决定做这件事，就必须为结果负责。",
        "pinyin": "Yīdàn nǐ juédìng zuò zhè jiàn shì, jiù bìxū wèi jiéguǒ fùzé.",
        "en": "Once you decide to do this, you have to take responsibility for the result.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦你决定做这件事就必须为结果负责.mp3"
      },
      {
        "cn": "一旦我们走错了方向，就会浪费很多时间。",
        "pinyin": "Yīdàn wǒmen zǒu cuòle fāngxiàng, jiù huì làngfèi hěnduō shíjiān.",
        "en": "In case we take the wrong direction, we will waste a lot of time.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦我们走错了方向就会浪费很多时间.mp3"
      },
      {
        "cn": "一旦你完成了这项工作，就可以回家了。",
        "pinyin": "Yīdàn nǐ wánchéng le zhè xiàng gōngzuò, jiù kěyǐ huí jiā le.",
        "en": "Once you finish this task, you can go home.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦你完成了这项工作就可以回家了.mp3"
      },
      {
        "cn": "一旦有任何变化，你应该立即告诉我。",
        "pinyin": "Yīdàn yǒu rènhé biànhuà, nǐ yīnggāi lìjí gàosù wǒ.",
        "en": "In case there are any changes, you should tell me immediately.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦有任何变化你应该立即告诉我.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "不然 (bùrán) - Otherwise, or else",
    "short_explanation": "Used to suggest negative consequences if the preceding statement is not followed.",
    "long_explanation": "The Mandarin Chinese phrase '不然 (bùrán)' is a conjunctive adverb that connects two parts of a sentence, indicating that if the condition in the first part of the sentence is not fulfilled, then the negative outcome described in the second part will occur. It is equivalent to 'otherwise' or 'or else' in English. It can express a warning or a suggestion to take certain action to avoid undesirable consequences.",
    "formation": "First part of the sentence (often a suggestion or requirement) + 不然 + Second part of the sentence (often negative outcomes or consequences)",
    "examples": [
      {
        "cn": "你最好现在就做完作业，不然老师会生气的。",
        "pinyin": "Nǐ zuì hǎo xiànzài jiù zuòwán zuòyè, bùrán lǎoshī huì shēngqì de.",
        "en": "It's best if you finish your homework now, otherwise the teacher will be angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_你最好现在就做完作业不然老师会生气的.mp3"
      },
      {
        "cn": "我们应该早点出发，不然肯定会迟到。",
        "pinyin": "Wǒmen yīnggāi zǎo diǎn chūfā, bùrán kěndìng huì chídào.",
        "en": "We should leave early, otherwise we will definitely be late.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_我们应该早点出发不然肯定会迟到.mp3"
      },
      {
        "cn": "你需要多喝水，不然你会脱水。",
        "pinyin": "Nǐ xūyào duō hē shuǐ, bùrán nǐ huì tuōshuǐ.",
        "en": "You need to drink more water, otherwise you will be dehydrated.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_你需要多喝水不然你会脱水.mp3"
      },
      {
        "cn": "他们必须重新设计这个项目，不然他们将失去投资者。",
        "pinyin": "Tāmen bìxū chóngxīn shèjì zhège xiàngmù, bùrán tāmen jiāng shīqù tóuzīzhě.",
        "en": "They must redesign this project, otherwise they will lose investors.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_他们必须重新设计这个项目不然他们将失去投资者.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "并且 (bìngqiě) - And, moreover, furthermore",
    "short_explanation": "Used to connect sentences or phrases, indicating an additional point or further information.",
    "long_explanation": "The Mandarin Chinese conjunction '并且 (bìngqiě)' is used to add an additional point, or to extend or intensify the impact of the previous clause. It translates into English as 'and', 'moreover', or 'furthermore'. Moreover, it can also be used to emphasize that one action follows another.",
    "formation": "Sentence 1 + 并且 + Sentence 2",
    "examples": [
      {
        "cn": "他非常努力，并且他也很聪明。",
        "pinyin": "Tā fēicháng nǔlì, bìngqiě tā yě hěn cōngmíng.",
        "en": "He works very hard, and furthermore, he is very intelligent.",
        "grammar_audio": "/audio/mandarin/grammar/s_并且_bìngqiě_-_And_moreover_furthermore_20231230_他非常努力并且他也很聪明.mp3"
      },
      {
        "cn": "我喜欢汉语，其音乐性十足，并且汉字的象形性也令我着迷。",
        "pinyin": "Wǒ xǐhuān Hànyǔ, qí yīnyuèxìng shízú, bìngqiě Hànzì de xiàngxíngxìng yě lìng wǒ zháomí.",
        "en": "I like Chinese, it is full of musicality, and moreover, the pictographic nature of Chinese characters also fascinates me.",
        "grammar_audio": "/audio/mandarin/grammar/s_并且_bìngqiě_-_And_moreover_furthermore_20231230_我喜欢汉语其音乐性十足并且汉字的象形性也令我着迷.mp3"
      },
      {
        "cn": "你要追求梦想，并且要有决心去实现它。",
        "pinyin": "Nǐ yào zhuīqiú mèngxiǎng, bìngqiě yào yǒu juéxīn qù shíxiàn tā.",
        "en": "You have to pursue your dreams, and moreover, you have to have the determination to realize it.",
        "grammar_audio": "/audio/mandarin/grammar/s_并且_bìngqiě_-_And_moreover_furthermore_20231230_你要追求梦想并且要有决心去实现它.mp3"
      },
      {
        "cn": "妈妈做了一桌好吃的菜，并且买了我最喜欢的蛋糕。",
        "pinyin": "Māmā zuòle yī zhuō hǎochī de cài, bìngqiě mǎile wǒ zuì xǐhuān de dàngāo.",
        "en": "Mom cooked a table of delicious food, and moreover, she bought my favorite cake.",
        "grammar_audio": "/audio/mandarin/grammar/s_并且_bìngqiě_-_And_moreover_furthermore_20231230_妈妈做了一桌好吃的菜并且买了我最喜欢的蛋糕.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  },
  {
    "title": "若 (ruò) - If, In case",
    "short_explanation": "Used to indicate a situation or condition that might happen.",
    "long_explanation": "The Mandarin Chinese word '若 (ruò)' is a conditional word used to express 'if' or 'in case' in English. It's a formal expression often observed in written texts or speeches, rather than colloquial conversation. It's used to present a hypothetical situation or condition whose realization is dependent on another event.",
    "formation": "若 + Condition/Event, [Outcome/Conclusion]",
    "examples": [
      {
        "cn": "若你明天有空，我们可以去看电影。",
        "pinyin": "Ruò nǐ míngtiān yǒu kòng, wǒmen kěyǐ qù kàn diànyǐng.",
        "en": "If you are free tomorrow, we can go watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_In_case_20231230_若你明天有空我们可以去看电影.mp3"
      },
      {
        "cn": "若他不能完成任务，我将代替他。",
        "pinyin": "Ruò tā bùnéng wánchéng rènwù, wǒ jiāng dàitì tā.",
        "en": "If he can't finish the task, I will replace him.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_In_case_20231230_若他不能完成任务我将代替他.mp3"
      },
      {
        "cn": "若你错过了这班火车，需要等下一班。",
        "pinyin": "Ruò nǐ cuòguòle zhè bān huǒchē, xūyào děng xià yī bān.",
        "en": "If you miss this train, you will have to wait for the next one.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_In_case_20231230_若你错过了这班火车需要等下一班.mp3"
      },
      {
        "cn": "若天气好，我们可以去公园。",
        "pinyin": "Ruò tiānqì hǎo, wǒmen kěyǐ qù gōngyuán.",
        "en": "If the weather is good, we can go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_In_case_20231230_若天气好我们可以去公园.mp3"
      }
    ],
    "p_tag": "HSK_4",
    "s_tag": "125"
  }
]