[
  {
    "title": "假如 (jiǎrú) - If, supposing",
    "short_explanation": "Used to express hypothetical situations or conditions.",
    "long_explanation": "The Mandarin Chinese phrase '假如 (jiǎrú)' is a conjunction that is used to suppose or imagine a hypothetical situation or condition in the future or present. It is equivalent to 'if' or 'supposing' in English. When using '假如', it is important to note that it is usually used in more formal or written language.",
    "formation": "'假如' + Condition clause + ', ' + Result clause.",
    "examples": [
      {
        "cn": "假如你来我家，我会做好吃的给你。",
        "pinyin": "Jiǎrú nǐ lái wǒ jiā, wǒ huì zuò hǎochī de gěi nǐ.",
        "en": "If you come to my house, I will make delicious food for you.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如你来我家我会做好吃的给你.mp3"
      },
      {
        "cn": "假如明天下雨，我们的照片就得取消了。",
        "pinyin": "Jiǎrú míngtiān xià yǔ, wǒmen de zhàopiàn jiù dé qǔxiāo le.",
        "en": "If it rains tomorrow, our picnic will have to be cancelled.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如明天下雨我们的照片就得取消了.mp3"
      },
      {
        "cn": "假如我有一百万美元，我会买一栋大房子。",
        "pinyin": "Jiǎrú wǒ yǒu yī bǎi wàn měiyuán, wǒ huì mǎi yī dòng dà fángzi.",
        "en": "If I had a million dollars, I would buy a big house.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如我有一百万美元我会买一栋大房子.mp3"
      },
      {
        "cn": "假如你不喜欢这个礼物，我可以去换一个你喜欢的。",
        "pinyin": "Jiǎrú nǐ bù xǐhuān zhège lǐwù, wǒ kěyǐ qù huàn yīgè nǐ xǐhuān de.",
        "en": "If you don't like this gift, I can go exchange it for one you do like.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如你不喜欢这个礼物我可以去换一个你喜欢的.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "非...不可 (fēi... bùkě) - Must, have to",
    "short_explanation": "Used to express necessity or imperative action.",
    "long_explanation": "The phrase '非...不可 (fēi... bùkě)' in Mandarin Chinese is used to express the idea of 'must' or 'have to' in English. It enforces a strong necessity or emphasizes the importance of a particular action, showing that there is no other option or alternatives.",
    "formation": "Subject + 非 + Verb/Action + 不可",
    "examples": [
      {
        "cn": "为了健康，每天锻炼身体非常健康非健康不可。",
        "pinyin": "Wèile jiànkāng, měitiān duànliàn shēntǐ fēicháng jiànkāng fēi jiànkāng bùkě.",
        "en": "For health, exercising every day is a must.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_为了健康每天锻炼身体非常健康非健康不可.mp3"
      },
      {
        "cn": "要想学好中文，持之以恒非要学不可。",
        "pinyin": "Yào xiǎng xué hǎo Zhōngwén, chízhīyǐhéng fēi yào xué bùkě.",
        "en": "To learn Chinese well, you must persevere.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_要想学好中文持之以恒非要学不可.mp3"
      },
      {
        "cn": "参加这次旅行的人非买机票不可。",
        "pinyin": "Cānjiā zhè cì lǚxíng de rén fēi mǎi jīpiào bùkě.",
        "en": "People participating in this trip must buy airplane tickets.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_参加这次旅行的人非买机票不可.mp3"
      },
      {
        "cn": "他为了要得到那份工作非得全力以赴不可。",
        "pinyin": "Tā wèile yào dédào nà fèn gōngzuò fēi děi quánlì yǐfù bùkě.",
        "en": "He must do his best in order to get that job.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_他为了要得到那份工作非得全力以赴不可.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "即便 (jíbiàn) - Even if, even though",
    "short_explanation": "Used to indicate a condition and its supposed or actual conclusion.",
    "long_explanation": "'即便 (jíbiàn)' is a conjunction used in Mandarin Chinese to illustrate a hypothetical situation where certain circumstances don't prevent a result from happening. It is akin to 'even if' or 'even though' in English and is used to express the idea that despite a certain situation or condition, a particular outcome will still occur.",
    "formation": "即便 + Condition, Result",
    "examples": [
      {
        "cn": "即便今天下雨，我们还是会去公园烧烤。",
        "pinyin": "Jíbiàn jīntiān xià yǔ, wǒmen háishi huì qù gōngyuán shāokǎo.",
        "en": "Even if it rains today, we will still go to the park for a barbecue.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便今天下雨我们还是会去公园烧烤.mp3"
      },
      {
        "cn": "即便他还是一个学生，他已经写了很多科学论文。",
        "pinyin": "Jíbiàn tā háishì yīgè xuéshēng, tā yǐjīng xiěle hěnduō kēxué lùnwén.",
        "en": "Even though he is still a student, he has already written many scientific papers.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便他还是一个学生他已经写了很多科学论文.mp3"
      },
      {
        "cn": "即便她对电影不感兴趣，她还是会陪我去电影院。",
        "pinyin": "Jíbiàn tā duì diànyǐng bù gǎnxìngqù, tā háishi huì péi wǒ qù diànyǐngyuàn.",
        "en": "Even if she's not interested in movies, she will still accompany me to the cinema.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便她对电影不感兴趣她还是会陪我去电影院.mp3"
      },
      {
        "cn": "即便我的中国朋友不会说英语，我仍然可以用中文和他们交流。",
        "pinyin": "Jíbiàn wǒ de Zhōngguó péngyǒu bù huì shuō Yīngyǔ, wǒ réngrán kěyǐ yòng Zhōngwén hé tāmen jiāoliú.",
        "en": "Even though my Chinese friends can't speak English, I can still communicate with them in Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便我的中国朋友不会说英语我仍然可以用中文和他们交流.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "据说 (jùshuō) - It is said that, reportedly",
    "short_explanation": "It is used to report or convey information that the speaker has heard but not directly experienced or observed.",
    "long_explanation": "The Mandarin Chinese phrase '据说 (jùshuō)' is used to introduce a hearsay or to convey an information that is said to be true but which the speaker doesn't have personal confirmation or doesn't personally witnessed. It is often used when sharing news, stories or rumours, and is equivalent to the English expressions 'it is said that', 'reportedly', 'apparently'. The usage is widespread in both written and spoken Chinese.",
    "formation": "据说 + Statement",
    "examples": [
      {
        "cn": "据说那家餐厅的菜超级美味，我明天想去尝试一下。",
        "pinyin": "Jùshuō nà jiā cāntīng de cài chāojí měiwèi, wǒ míngtiān xiǎng qù chángshì yīxià.",
        "en": "It is said that the food at that restaurant is super delicious, I want to try it tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_that_reportedly_20231230_据说那家餐厅的菜超级美味我明天想去尝试一下.mp3"
      },
      {
        "cn": "据说他失败了，没有过HSK五级的考试。",
        "pinyin": "Jùshuō tā shībài le, méiyǒu guò HSK wǔ jí de kǎoshì.",
        "en": "It is reportedly that he failed, he didn't pass the HSK Level 5 exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_that_reportedly_20231230_据说他失败了没有过HSK五级的考试.mp3"
      },
      {
        "cn": "据说这个电影非常感人，许多观众都哭了。",
        "pinyin": "Jùshuō zhège diànyǐng fēicháng gǎnrén, xǔduō guānzhòng dōu kū le.",
        "en": "It is said that this movie is very touching, many audiences cried.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_that_reportedly_20231230_据说这个电影非常感人许多观众都哭了.mp3"
      },
      {
        "cn": "据说这位艺术家的新作品将在下个月展出，我非常期待看到它。",
        "pinyin": "Jùshuō zhè wèi yìshùjiā de xīn zuòpǐn jiāng zài xià gè yuè zhǎnchū, wǒ fēicháng qīdài kàn dào tā.",
        "en": "Reportedly, this artist's new work will be exhibited next month, I am really looking forward to seeing it.",
        "grammar_audio": "/audio/mandarin/grammar/s_据说_jùshuō_-_It_is_said_that_reportedly_20231230_据说这位艺术家的新作品将在下个月展出我非常期待看到它.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不是...而是... (bùshì... érshì...) - It's not... but...",
    "short_explanation": "This pattern is used to correct a mistaken assumption or to emphasize a contrast.",
    "long_explanation": "The phrase '不是...而是...' (bùshì... érshì...) in Mandarin Chinese is used to correct a mistaken assumption, emphasize a contrast, or to clarify the speaker's point. '不是' negates the idea or action that comes after it, while '而是' emphasizes the more correct or intended idea or action that follows. It is similar to the English usage of 'It's not... but...'.",
    "formation": "不是 + Mistaken Assumption/Contrasting Element + 而是 + Correct Information/New Element",
    "examples": [
      {
        "cn": "我来这里不是去购物，而是看电影。",
        "pinyin": "Wǒ lái zhèlǐ bùshì qù gòuwù, érshì kàn diànyǐng.",
        "en": "I came here not to shop, but to watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_我来这里不是去购物而是看电影.mp3"
      },
      {
        "cn": "我喜欢的不是咖啡，而是茶。",
        "pinyin": "Wǒ xǐhuān de bùshì kāfēi, érshì chá.",
        "en": "What I like is not coffee, but tea.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_我喜欢的不是咖啡而是茶.mp3"
      },
      {
        "cn": "他不是我的朋友，而是我的兄弟。",
        "pinyin": "Tā bùshì wǒ de péngyǒu, érshì wǒ de xiōngdì.",
        "en": "He is not my friend, but my brother.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_他不是我的朋友而是我的兄弟.mp3"
      },
      {
        "cn": "这不是我的错，而是他的错。",
        "pinyin": "Zhè bùshì wǒ de cuò, érshì tā de cuò.",
        "en": "It's not my fault, but his.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_这不是我的错而是他的错.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "至多 (zhìduō) - At most",
    "short_explanation": "Used to denote the maximum extent or quantity.",
    "long_explanation": "The Mandarin Chinese phrase '至多 (zhìduō)' is a common adverb used to represent the maximum amount or extent of something achievable, hence being equivalent to 'at most' in English. You may see this grammar point in situations where someone is making an estimation or setting an upper limit.",
    "formation": "Quantity + 至多 + Noun",
    "examples": [
      {
        "cn": "我至多只能待一小时。",
        "pinyin": "Wǒ zhìduō zhǐ néng dāi yīxiǎoshí.",
        "en": "At most, I can only stay for one hour.",
        "grammar_audio": "/audio/mandarin/grammar/s_至多_zhìduō_-_At_most_20231230_我至多只能待一小时.mp3"
      },
      {
        "cn": "这件事至多需要三天的时间来完成。",
        "pinyin": "Zhè jiàn shì zhìduō xūyào sān tiān de shíjiān lái wánchéng.",
        "en": "This task at most requires three days to complete.",
        "grammar_audio": "/audio/mandarin/grammar/s_至多_zhìduō_-_At_most_20231230_这件事至多需要三天的时间来完成.mp3"
      },
      {
        "cn": "一个人至多吃两个汉堡就足够了。",
        "pinyin": "Yīgè rén zhìduō chī liǎng gè hànbǎo jiù zúgòu le.",
        "en": "A person would be full with, at most, two hamburgers.",
        "grammar_audio": "/audio/mandarin/grammar/s_至多_zhìduō_-_At_most_20231230_一个人至多吃两个汉堡就足够了.mp3"
      },
      {
        "cn": "这个房间至多可以容纳十个人。",
        "pinyin": "Zhège fángjiān zhìduō kěyǐ róngnà shí gè rén.",
        "en": "This room can accommodate at most ten people.",
        "grammar_audio": "/audio/mandarin/grammar/s_至多_zhìduō_-_At_most_20231230_这个房间至多可以容纳十个人.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "毫无 (háo wú) - Without, not in the least",
    "short_explanation": "Used to express the complete absence of something.",
    "long_explanation": "'毫无 (háo wú)' is a Chinese phrase meaning 'without' or 'not in the least'. It is used to emphasize the total absence or lack of a particular object, quality, or condition. This phrase is particularly common in written Chinese and is especially used over '没有' when you want to add more emphasis on the fact that there is not even a slight bit or hint of something.",
    "formation": "毫无 + Noun / Adjective",
    "examples": [
      {
        "cn": "他对音乐毫无兴趣。",
        "pinyin": "Tā duì yīnyuè háo wú xìngqù.",
        "en": "He has no interest in music at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_not_in_the_least_20231230_他对音乐毫无兴趣.mp3"
      },
      {
        "cn": "经过一天的辛苦努力，我们毫无收获。",
        "pinyin": "Jīngguò yītiān de xīnkǔ nǔlì, wǒmen háo wú shōuhuò.",
        "en": "After a whole day's hard work, we gained nothing at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_not_in_the_least_20231230_经过一天的辛苦努力我们毫无收获.mp3"
      },
      {
        "cn": "她对自己的未来毫无信心。",
        "pinyin": "Tā duì zìjǐ de wèilái háo wú xìnxīn.",
        "en": "She has no confidence at all in her future.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_not_in_the_least_20231230_她对自己的未来毫无信心.mp3"
      },
      {
        "cn": "即使面对困难，他也毫无退缩。",
        "pinyin": "Jíshǐ miàn duì kùnnan, tā yě háo wú tuì suō.",
        "en": "Even when facing difficulties, he doesn't retreat at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_not_in_the_least_20231230_即使面对困难他也毫无退缩.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "则 (zé) - Then, thus",
    "short_explanation": "Used to denote a result or consequence.",
    "long_explanation": "The Mandarin Chinese word '则 (zé)' is a conjunction that's equivalent to 'then' or 'thus' in English, primarily used as a transitional word to denote a result, a contrast, or a condition-consequence relationship. It helps in creating a sequence of events or a logical progression in a discussion or argument.",
    "formation": "Sentence 1, 则 + Sentence 2",
    "examples": [
      {
        "cn": "如果你不好好学习，你则将无法顺利通过HSK考试。",
        "pinyin": "Rúguǒ nǐ bù hǎohāo xuéxí，nǐ zé jiāng wúfǎ shùnlì tōngguò HSK kǎoshì。",
        "en": "If you don't study well, then you will not be able to pass the HSK exam smoothly.",
        "grammar_audio": "/audio/mandarin/grammar/s_则_zé_-_Then_thus_20231230_如果你不好好学习你则将无法顺利通过HSK考试.mp3"
      },
      {
        "cn": "全家人都去参加了派对，她则选择留在家里读书。",
        "pinyin": "Quánjiā rén dōu qù cānjiāle pàiduì, tā zé xuǎnzé liú zài jiā lǐ dúshū.",
        "en": "The whole family went to the party, and she, however, chose to stay home and read.",
        "grammar_audio": "/audio/mandarin/grammar/s_则_zé_-_Then_thus_20231230_全家人都去参加了派对她则选择留在家里读书.mp3"
      },
      {
        "cn": "他不吃肉，他的妹妹则喜欢吃肉。",
        "pinyin": "Tā bù chī ròu, tā de mèimei zé xǐhuan chī ròu.",
        "en": "He doesn't eat meat, his sister, on the other hand, likes eating meat.",
        "grammar_audio": "/audio/mandarin/grammar/s_则_zé_-_Then_thus_20231230_他不吃肉他的妹妹则喜欢吃肉.mp3"
      },
      {
        "cn": "如果你迟到，你则需要接受由老师处罚。",
        "pinyin": "Rúguǒ nǐ chídào，nǐ zé xūyào jiēshòu yóu lǎoshī chǔfá。",
        "en": "If you are late, then you need to accept the punishment from the teacher.",
        "grammar_audio": "/audio/mandarin/grammar/s_则_zé_-_Then_thus_20231230_如果你迟到你则需要接受由老师处罚.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "而已 (éryǐ) - That's all, nothing more than",
    "short_explanation": "Used to express that something is just like that and there is nothing more to it.",
    "long_explanation": "The Mandarin Chinese phrase '而已 (éryǐ)' is used to emphasize that the situation or action described is just as it appears, there's nothing more to it or no other higher, complex, or special significance. It translates to 'that's all', 'just', or 'nothing more than' in English.",
    "formation": "Subject + Predicate + 而已",
    "examples": [
      {
        "cn": "他只是个孩子而已，不要对他期望太高。",
        "pinyin": "Tā zhǐshì gè háizi éryǐ, bú yào duì tā qīwàng tài gāo.",
        "en": "He is just a child, nothing more. Don't have too high expectations for him.",
        "grammar_audio": "/audio/mandarin/grammar/s_而已_éryǐ_-_Thats_all_nothing_more_than_20231230_他只是个孩子而已不要对他期望太高.mp3"
      },
      {
        "cn": "这只是个错误而已，我们可以更正它。",
        "pinyin": "Zhè zhǐshì gè cuòwù éryǐ, wǒmen kěyǐ gēngzhèng tā.",
        "en": "This is just a mistake, nothing more. We can correct it.",
        "grammar_audio": "/audio/mandarin/grammar/s_而已_éryǐ_-_Thats_all_nothing_more_than_20231230_这只是个错误而已我们可以更正它.mp3"
      },
      {
        "cn": "我只是喜欢喝咖啡而已，并不是咖啡成瘾。",
        "pinyin": "Wǒ zhǐshì xǐhuān hē kāfēi éryǐ, bìng búshì kāfēi chéng yǐn.",
        "en": "I just like drinking coffee, it's not a coffee addiction.",
        "grammar_audio": "/audio/mandarin/grammar/s_而已_éryǐ_-_Thats_all_nothing_more_than_20231230_我只是喜欢喝咖啡而已并不是咖啡成瘾.mp3"
      },
      {
        "cn": "他只是迟到了一次而已，不要对他这么严格。",
        "pinyin": "Tā zhǐshì chídào le yīcì éryǐ, bú yào duì tā zhème yángé.",
        "en": "He just arrived late once, don't be so strict with him.",
        "grammar_audio": "/audio/mandarin/grammar/s_而已_éryǐ_-_Thats_all_nothing_more_than_20231230_他只是迟到了一次而已不要对他这么严格.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "难道 (nándào) - Could it be that, isn't it?",
    "short_explanation": "Used to express surprise or doubt regarding something.",
    "long_explanation": "In Mandarin Chinese, '难道 (nándào)' is an adverb used to express disbelief, surprise, or apprehension regarding a particular situation or fact. It is equivalent to phrases like 'could it be that' or 'isn't it' in English. It's typically used in rhetorical questions where the speaker expects agreement or is sure of the statement's accuracy.",
    "formation": "难道 + sentence (containing an assertion)",
    "examples": [
      {
        "cn": "难道你不知道他已经结婚了吗？",
        "pinyin": "Nándào nǐ bù zhīdào tā yǐjīng jiéhūn le ma?",
        "en": "Could it be that you don't know he's already married?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_20231230_难道你不知道他已经结婚了吗.mp3"
      },
      {
        "cn": "难道你不喜欢吃巧克力吗？我以为所有的人都喜欢。",
        "pinyin": "Nándào nǐ bù xǐhuān chī qiǎokèlì ma? Wǒ yǐwéi suǒyǒu de rén dōu xǐhuān.",
        "en": "Could it be that you don't like eating chocolate? I thought everyone likes it.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_20231230_难道你不喜欢吃巧克力吗我以为所有的人都喜欢.mp3"
      },
      {
        "cn": "难道你没听到我刚才说的话吗？",
        "pinyin": "Nándào nǐ méi tīngdào wǒ gāngcái shuō de huà ma?",
        "en": "Could it be that you didn't hear what I said just now?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_20231230_难道你没听到我刚才说的话吗.mp3"
      },
      {
        "cn": "难道他真的不知道这个规则吗？那简直不可能。",
        "pinyin": "Nándào tā zhēn de bù zhīdào zhège guīzé ma? Nà jiǎnzhí bù kěnéng.",
        "en": "Could it be that he really doesn't know this rule? That's simply impossible.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_20231230_难道他真的不知道这个规则吗那简直不可能.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不如 (bùrú) - Not as good as, inferior to",
    "short_explanation": "Used to indicate that something or someone is not as good as something or someone else.",
    "long_explanation": "The Mandarin phrase '不如 (bùrú)' is used to make comparisons, often expressing that something or someone is not as good as, or is inferior to, another thing or person. It is often used to express self-deprecation, or when comparing and finding oneself or another thing lacking in some way.",
    "formation": "Subject + 不如 + Comparative Subject + Rest of the sentence",
    "examples": [
      {
        "cn": "我不如他跑得快。",
        "pinyin": "Wǒ bùrú tā pǎo de kuài.",
        "en": "I'm not as fast as him running.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_我不如他跑得快.mp3"
      },
      {
        "cn": "这个新项目不如我们预期的那么成功。",
        "pinyin": "Zhège xīn xiàngmù bùrú wǒmen yùqí de nàme chénggōng.",
        "en": "This new project is not as successful as we had anticipated.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_这个新项目不如我们预期的那么成功.mp3"
      },
      {
        "cn": "她的烹饪技术不如她的母亲。",
        "pinyin": "Tā de pēngrèn jìshù bùrú tā de mǔqīn.",
        "en": "Her cooking skills are not as good as her mother's.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_她的烹饪技术不如她的母亲.mp3"
      },
      {
        "cn": "就学术知识来说，我觉得我不如你。",
        "pinyin": "Jiù xuéshù zhīshi lái shuō, wǒ juédé wǒ bùrú nǐ.",
        "en": "In terms of academic knowledge, I feel I'm not as good as you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_就学术知识来说我觉得我不如你.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "无论如何 (wúlùn rúhé) - Anyhow, anyway, in any case",
    "short_explanation": "Used to express a certainty or determination that a particular outcome will occur, no matter what the circumstances may be.",
    "long_explanation": "The Mandarin Chinese phrase '无论如何 (wúlùn rúhé)' is used when you want to emphasize that no matter what the circumstances are, something must be done or something will happen. It is equivalent to saying 'anyhow', 'anyway', 'in any case' or 'no matter what' in English. It often appears at the beginning of the sentence to express a very strong determination.",
    "formation": "无论如何, [what must happen] or [what one is determined to do].",
    "examples": [
      {
        "cn": "无论如何, 我都要成功。",
        "pinyin": "Wúlùn rúhé, wǒ dōu yào chénggōng.",
        "en": "No matter what, I must succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyhow_anyway_in_any_case_20231230_无论如何_我都要成功.mp3"
      },
      {
        "cn": "无论如何, 你都不能错过这次的音乐会。",
        "pinyin": "Wúlùn rúhé, nǐ dōu bùnéng cuòguò zhè cì de yīnyuè huì.",
        "en": "Anyhow, you can't miss this concert.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyhow_anyway_in_any_case_20231230_无论如何_你都不能错过这次的音乐会.mp3"
      },
      {
        "cn": "无论如何, 我们必须保护环境。",
        "pinyin": "Wúlùn rúhé, wǒmen bìxū bǎohù huánjìng.",
        "en": "In any case, we must protect the environment.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyhow_anyway_in_any_case_20231230_无论如何_我们必须保护环境.mp3"
      },
      {
        "cn": "无论如何, 我都会支持你的决定。",
        "pinyin": "Wúlùn rúhé, wǒ dōu huì zhīchí nǐ de juédìng.",
        "en": "Anyway, I will support your decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyhow_anyway_in_any_case_20231230_无论如何_我都会支持你的决定.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不得不 (bùdébù) - Have to, can't but",
    "short_explanation": "This phrase expresses an obligation or the inevitable.",
    "long_explanation": "The Mandarin phrase '不得不 (bùdébù)' indicates a necessity or compulsion. It can be translated to 'have to' or 'can't but' in English. It is used when the action is unavoidable or a responsibility that must be fulfilled. The cause of the necessity is often due to circumstance, rules, or natural causes.",
    "formation": "Subject + 不得不 + Verb + Rest of the sentence.",
    "examples": [
      {
        "cn": "我明天有个重要的面试，所以今晚我不得不提早入睡。",
        "pinyin": "Wǒ míngtiān yǒu gè zhòngyào de miànshì, suǒyǐ jīnwǎn wǒ bùdébù tízǎo rùshuì.",
        "en": "I have an important interview tomorrow, so I have to go to bed early tonight.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_but_20231230_我明天有个重要的面试所以今晚我不得不提早入睡.mp3"
      },
      {
        "cn": "由于航班延误，我们不得不在机场待一夜。",
        "pinyin": "Yóuyú hángbān yánwù, wǒmen bùdébù zài jīchǎng dāi yī yè.",
        "en": "Due to the flight delay, we have to stay overnight at the airport.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_but_20231230_由于航班延误我们不得不在机场待一夜.mp3"
      },
      {
        "cn": "因为我忘记带伞，我不得不在雨中等公车。",
        "pinyin": "Yīnwèi wǒ wàngjì dài sǎn, wǒ bùdébù zài yǔ zhōng děng gōngchē.",
        "en": "Since I forgot to bring an umbrella, I had to wait for the bus in the rain.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_but_20231230_因为我忘记带伞我不得不在雨中等公车.mp3"
      },
      {
        "cn": "我不得不承认，这门课比我想象的要难多了。",
        "pinyin": "Wǒ bùdébù chéngrèn, zhè mén kè bǐ wǒ xiǎngxiàng de yào nán duōle.",
        "en": "I have to admit, this class is much harder than I thought it would be.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_but_20231230_我不得不承认这门课比我想象的要难多了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不然 (bùrán) - Otherwise, If not",
    "short_explanation": "Used to express a hypothetical consequence that is undesirable or unwanted.",
    "long_explanation": "The Mandarin Chinese phrase '不然 (bùrán)' is equivalent to 'otherwise' or 'if not' in English. It's usually used in a conditional sentence to express a consequence that would happen if the condition in the first part of the sentence is not met. This consequence is typically undesirable or unfavorable.",
    "formation": "Condition + 不然 + Consequence",
    "examples": [
      {
        "cn": "我们必须得快点儿，不然火车就走了。",
        "pinyin": "Wǒmen bìxū děi kuàidiǎner, bùrán huǒchē jiù zǒu le.",
        "en": "We must hurry, otherwise the train will leave.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_If_not_20231230_我们必须得快点儿不然火车就走了.mp3"
      },
      {
        "cn": "你必须要等他回来才可以走，不然他会很担心你。",
        "pinyin": "Nǐ bìxū yào děng tā huílái cái kěyǐ zǒu, bùrán tā huì hěn dānxīn nǐ.",
        "en": "You must wait for him to return before you can leave, otherwise he will worry about you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_If_not_20231230_你必须要等他回来才可以走不然他会很担心你.mp3"
      },
      {
        "cn": "你最好把作业写完，不然老师会生你的气。",
        "pinyin": "Nǐ zuì hǎo bǎ zuòyè xiě wán, bùrán lǎoshī huì shēng nǐ de qì.",
        "en": "You'd better finish your homework, otherwise the teacher will be angry with you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_If_not_20231230_你最好把作业写完不然老师会生你的气.mp3"
      },
      {
        "cn": "吃早餐，不然你会饿在上课的时候。",
        "pinyin": "Chī zǎocān, bùrán nǐ huì è zài shàngkè de shíhòu.",
        "en": "Eat breakfast, otherwise you will get hungry during class.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_If_not_20231230_吃早餐不然你会饿在上课的时候.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不管...都... (bùguǎn... dōu...) - Regardless of... always...",
    "short_explanation": "This structure is used to convey 'no matter what/who/where, etc., always...'",
    "long_explanation": "In Mandarin Chinese, '不管...都...' is a common grammatical framework that expresses 'regardless of certain conditions, the following statement is always true'. It is akin to 'no matter what/who/where/etc., always' in English. The condition statement is preceded by 不管, and the consequential statement or result follows 都.",
    "formation": "不管 + Condition, 都 + Consequence",
    "examples": [
      {
        "cn": "不管你是否同意，我都要做这件事。",
        "pinyin": "Bùguǎn nǐ shìfǒu tóngyì, wǒ dōu yào zuò zhè jiàn shì.",
        "en": "Regardless of whether you agree or not, I will do this.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_Regardless_of_always_20231230_不管你是否同意我都要做这件事.mp3"
      },
      {
        "cn": "不管天气怎么样，他都会每天运动一个小时。",
        "pinyin": "Bùguǎn tiānqì zěnme yàng, tā dōu huì měitiān yùndòng yī gè xiǎoshí.",
        "en": "No matter what the weather is like, he will exercise for an hour every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_Regardless_of_always_20231230_不管天气怎么样他都会每天运动一个小时.mp3"
      },
      {
        "cn": "不管多么困难，我都不会放弃帮助你。",
        "pinyin": "Bùguǎn duōme kùnnán, wǒ dōu bù huì fàngqì bāngzhù nǐ.",
        "en": "No matter how difficult it is, I will never give up helping you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_Regardless_of_always_20231230_不管多么困难我都不会放弃帮助你.mp3"
      },
      {
        "cn": "不管他说什么，我都不会改变我的决定。",
        "pinyin": "Bùguǎn tā shuō shénme, wǒ dōu bù huì gǎibiàn wǒ de juédìng.",
        "en": "No matter what he says, I will not change my decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_Regardless_of_always_20231230_不管他说什么我都不会改变我的决定.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "唯有 (wéiyǒu) - Only, alone",
    "short_explanation": "唯有 (wéiyǒu) is used to express exclusivity or to suggest a single solution to a problem or condition.",
    "long_explanation": "唯有 (wéiyǒu) literally translates to 'only have'. This phrase usually indicates an exclusive single possibility, solution, condition or criterion. It generally emphasizes that only a particular factor is capable of achieving certain goals or making the situation change.",
    "formation": "唯有 + Noun/Pronoun/Verb",
    "examples": [
      {
        "cn": "唯有努力学习，才能通过汉语水平考试。",
        "pinyin": "Wéiyǒu nǔlì xuéxí, cáinéng tōngguò Hànyǔ shuǐpíng kǎoshì.",
        "en": "Only by studying hard can you pass the Chinese proficiency test.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_alone_20231230_唯有努力学习才能通过汉语水平考试.mp3"
      },
      {
        "cn": "唯有时间能治愈我们心中的伤痛。",
        "pinyin": "Wéiyǒu shíjiān néng zhìyù wǒmen xīnzhōng de shāngtòng.",
        "en": "Only time can heal the pain in our hearts.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_alone_20231230_唯有时间能治愈我们心中的伤痛.mp3"
      },
      {
        "cn": "唯有保持积极的态度，我们才能战胜困难。",
        "pinyin": "Wéiyǒu bǎochí jījí de tàidù, wǒmen cáinéng zhànshèng kùnnán.",
        "en": "Only by maintaining a positive attitude can we overcome difficulties.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_alone_20231230_唯有保持积极的态度我们才能战胜困难.mp3"
      },
      {
        "cn": "唯有你，我才会感到完整。",
        "pinyin": "Wéiyǒu nǐ, wǒ cái huì gǎndào wánzhěng.",
        "en": "Only with you, will I feel complete.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_alone_20231230_唯有你我才会感到完整.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "那般 (nà bān) - So, such",
    "short_explanation": "Used to express the extent or degree of something.",
    "long_explanation": "The Mandarin Chinese phrase '那般 (nà bān)' is used to describe the extent or degree of a particular trait, action, or situation. This phrase is typically used to emphasize the degree or extent to which something is true or evident, providing an equivalent expression to 'so' or 'such' in English.",
    "formation": "Subject + Verb + 那般 + Adjective",
    "examples": [
      {
        "cn": "他那般喜欢你，你难道没感觉吗？",
        "pinyin": "Tā nà bān xǐhuān nǐ, nǐ nándào méi gǎnjué ma?",
        "en": "He likes you so much, don't you feel it?",
        "grammar_audio": "/audio/mandarin/grammar/s_那般_nà_bān_-_So_such_20231230_他那般喜欢你你难道没感觉吗.mp3"
      },
      {
        "cn": "我从未见过那般美丽的风景。",
        "pinyin": "Wǒ cóngwèi jiànguò nà bān měilì de fēngjǐng.",
        "en": "I have never seen such beautiful scenery.",
        "grammar_audio": "/audio/mandarin/grammar/s_那般_nà_bān_-_So_such_20231230_我从未见过那般美丽的风景.mp3"
      },
      {
        "cn": "这个问题那般复杂，你怎么能那么轻易就解决了它？",
        "pinyin": "Zhège wèntí nà bān fùzá, nǐ zěnme néng nàme qīngyì jiù jiějuéle tā?",
        "en": "The problem is so complex, how did you solve it so easily?",
        "grammar_audio": "/audio/mandarin/grammar/s_那般_nà_bān_-_So_such_20231230_这个问题那般复杂你怎么能那么轻易就解决了它.mp3"
      },
      {
        "cn": "那个人那般善良，你为什么要伤害他？",
        "pinyin": "Nàgè rén nà bān shànliáng, nǐ wèishéme yào shānghài tā?",
        "en": "That person is so kind, why do you want to hurt him?",
        "grammar_audio": "/audio/mandarin/grammar/s_那般_nà_bān_-_So_such_20231230_那个人那般善良你为什么要伤害他.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "以至于 (yǐzhìyú) - So... that...",
    "short_explanation": "Used to indicate the result of something to a certain extent or degree.",
    "long_explanation": "The Mandarin Chinese phrase '以至于 (yǐzhìyú)' indicates a certain result that comes about due to an extent or degree of a situation, event, or action. It is equivalent to 'so... that...' in English and is used to highlight the impact or outcome of a scenario. This phrase is useful when you want to emphasize the significance or severity of a result or consequence.",
    "formation": "Statement, 以至于 + Result",
    "examples": [
      {
        "cn": "他工作太努力，以至于没有时间照顾自己的健康。",
        "pinyin": "Tā gōngzuò tài nǔlì, yǐzhìyú méiyǒu shíjiān zhàogù zìjǐ de jiànkāng.",
        "en": "He works so hard that he doesn't have time to take care of his health.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_20231230_他工作太努力以至于没有时间照顾自己的健康.mp3"
      },
      {
        "cn": "他的中文说得太好，以至于我以为他是中国人。",
        "pinyin": "Tā de Zhōngwén shuō dé tài hǎo, yǐzhìyú wǒ yǐwéi tā shì Zhōngguó rén.",
        "en": "His Chinese is so good that I thought he was Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_20231230_他的中文说得太好以至于我以为他是中国人.mp3"
      },
      {
        "cn": "她钢琴弹得太好听，以至于每次听到她的演奏，我都会感动得流泪。",
        "pinyin": "Tā gāngqín dàn de tài hǎotīng, yǐzhìyú měicì tīng dào tā de yǎnzòu, wǒ dōu huì gǎndòng de liúlèi.",
        "en": "She plays the piano so beautifully that every time I hear her play, I'm moved to tears.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_20231230_她钢琴弹得太好听以至于每次听到她的演奏我都会感动得流泪.mp3"
      },
      {
        "cn": "这部电影太搞笑，以至于我笑得肚子都疼了。",
        "pinyin": "Zhè bù diànyǐng tài gǎoxiào, yǐzhìyú wǒ xiào de dùzi dōu téng le.",
        "en": "The movie was so funny that I laughed until my stomach hurt.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_20231230_这部电影太搞笑以至于我笑得肚子都疼了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "若非 (ruò fēi) - If not for, but for",
    "short_explanation": "Used to express condition and hypothetical situations, indicating 'if it were not for' or 'but for'.",
    "long_explanation": "The Mandarin Chinese phrase '若非 (ruò fēi)' is used to describe a hypothetical condition, and is similar to the English phrases 'if it were not for' or 'but for'. This phrase is often used to emphasize the importance of a certain condition or factor in a situation, and to speculate about what would happen if that condition or factor were not present.",
    "formation": "若非 + Condition, Result.",
    "examples": [
      {
        "cn": "若非你的帮助，我可能无法完成这项任务。",
        "pinyin": "Ruò fēi nǐ de bāngzhù, wǒ kěnéng wúfǎ wánchéng zhè xiàng rènwù.",
        "en": "If not for your help, I might not be able to complete this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_若非_ruò_fēi_-_If_not_for_but_for_20231230_若非你的帮助我可能无法完成这项任务.mp3"
      },
      {
        "cn": "若非她的鼓励，我可能早就放弃了。",
        "pinyin": "Ruò fēi tā de gǔlì, wǒ kěnéng zǎojiù fàngqìle.",
        "en": "If not for her encouragement, I might have given up a long time ago.",
        "grammar_audio": "/audio/mandarin/grammar/s_若非_ruò_fēi_-_If_not_for_but_for_20231230_若非她的鼓励我可能早就放弃了.mp3"
      },
      {
        "cn": "若非他的指导，我们无法做好这项工作。",
        "pinyin": "Ruò fēi tā de zhǐdǎo, wǒmen wúfǎ zuò hǎo zhè xiàng gōngzuò.",
        "en": "If it were not for his guidance, we could not do this job well.",
        "grammar_audio": "/audio/mandarin/grammar/s_若非_ruò_fēi_-_If_not_for_but_for_20231230_若非他的指导我们无法做好这项工作.mp3"
      },
      {
        "cn": "若非你提醒我，我可能会忘记这个重要的约会。",
        "pinyin": "Ruò fēi nǐ tíxǐng wǒ, wǒ kěnéng huì wàngjì zhè gè zhòngyào de yuēhuì.",
        "en": "But for your reminder, I might forget this important appointment.",
        "grammar_audio": "/audio/mandarin/grammar/s_若非_ruò_fēi_-_If_not_for_but_for_20231230_若非你提醒我我可能会忘记这个重要的约会.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "要么...要么... (yàome... yàome...) - Either... or...",
    "short_explanation": "Used to present alternatives or to indicate that there are only two choices.",
    "long_explanation": "The Mandarin Chinese phrase '要么...要么...' (yàome... yàome...) is a conversational structure used to express the idea of 'either... or...'. This structure is used when there are two alternative choices and one must be selected. It suggests that if the first condition isn't met, then the second condition will be.",
    "formation": "Subject + 要么 + Option A, 要么 + Option B",
    "examples": [
      {
        "cn": "你要么吃了午饭再继续工作，要么就是现在就休息一下。",
        "pinyin": "Nǐ yàome chī le wǔfàn zài jìxù gōngzuò, yàome jiùshì xiànzài jiù xiūxí yīxià.",
        "en": "Either have lunch first and then continue to work, or take a break now.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么吃了午饭再继续工作要么就是现在就休息一下.mp3"
      },
      {
        "cn": "这个周末我们要么去山上爬山，要么去海边游泳。",
        "pinyin": "Zhège zhōumò wǒmen yàome qù shānshàng páshān, yàome qù hǎibiān yóuyǒng.",
        "en": "This weekend, we either go mountain climbing, or go swimming at the beach.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_这个周末我们要么去山上爬山要么去海边游泳.mp3"
      },
      {
        "cn": "你要么接受这个工作，要么去其他的公司寻找。",
        "pinyin": "Nǐ yàome jiēshòu zhège gōngzuò, yàome qù qítā de gōngsī xúnzhǎo.",
        "en": "You either accept this job, or look for others in different companies.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么接受这个工作要么去其他的公司寻找.mp3"
      },
      {
        "cn": "你要么忍受他的行为，要么就与他分手。",
        "pinyin": "Nǐ yàome rěnshòu tā de xíngwéi, yàome jiù yǔ tā fēnshǒu.",
        "en": "Either put up with his behavior, or break up with him.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么忍受他的行为要么就与他分手.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "不是...就是... (bùshì... jiùshì...) - Either... or...",
    "short_explanation": "This is used to present two or more possibilities.",
    "long_explanation": "The phrase '不是...就是...' in Mandarin Chinese expresses the meaning of 'either... or...'. It's used to indicate two or more possibilities or alternatives. You use it when you want to express that the scenario or outcome must be one of the options provided in the sentence.",
    "formation": "不是 + Option 1 + 就是 + Option 2",
    "examples": [
      {
        "cn": "他们周末不是去爬山就是去逛公园。",
        "pinyin": "Tāmen zhōumò bùshì qù páshān jiùshì qù guàng gōngyuán.",
        "en": "On the weekends, they either go mountain climbing or go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是就是_bùshì_jiùshì_-_Either_or_20231230_他们周末不是去爬山就是去逛公园.mp3"
      },
      {
        "cn": "小明不是忘记带钥匙就是忘记带钱包。",
        "pinyin": "Xiǎo Míng bùshì wàngjì dài yàoshi jiùshì wàngjì dài qiánbāo.",
        "en": "Xiao Ming either forgets to bring his keys or forgets to bring his wallet.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是就是_bùshì_jiùshì_-_Either_or_20231230_小明不是忘记带钥匙就是忘记带钱包.mp3"
      },
      {
        "cn": "你看，他不是在看电视就是在玩手机。",
        "pinyin": "Nǐ kàn, tā bùshì zài kàn diànshì jiùshì zài wán shǒujī.",
        "en": "Look, he is either watching TV or playing with his phone.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是就是_bùshì_jiùshì_-_Either_or_20231230_你看他不是在看电视就是在玩手机.mp3"
      },
      {
        "cn": "我妹妹不是喜欢唱歌就是喜欢跳舞。",
        "pinyin": "Wǒ mèimei bùshì xǐhuan chànggē jiùshì xǐhuan tiàowǔ.",
        "en": "My sister either likes singing or likes dancing.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是就是_bùshì_jiùshì_-_Either_or_20231230_我妹妹不是喜欢唱歌就是喜欢跳舞.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "尽管...但是... (jǐnguǎn... dànshì...) - Although... but...",
    "short_explanation": "Used to present contrast between two clauses.",
    "long_explanation": "The Mandarin Chinese phrase '尽管...但是... (jǐnguǎn... dànshì...)' is a structure used to introduce a contrast or discrepancy between two situations or facts. The clause following '尽管 (jǐnguǎn)' states a circumstance, and the clause after '但是 (dànshì)' presents an unexpected or contrary result. It is equivalent to the 'although... but...' structure in English.",
    "formation": "尽管 + Statement A, 但是 + Statement B",
    "examples": [
      {
        "cn": "尽管他已经很努力的工作，但是他还是没有完成任务。",
        "pinyin": "Jǐnguǎn tā yǐjīng hěn nǔlì de gōngzuò, dànshì tā háishì méiyǒu wánchéng rènwu.",
        "en": "Although he has been working hard, he still hasn't completed the task.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管他已经很努力的工作但是他还是没有完成任务.mp3"
      },
      {
        "cn": "尽管今天天气很冷，但是我们还是去公园玩了。",
        "pinyin": "Jǐnguǎn jīntiān tiānqì hěn lěng, dànshì wǒmen háishì qù gōngyuán wán le.",
        "en": "Although it is cold today, we still went to the park to have fun.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管今天天气很冷但是我们还是去公园玩了.mp3"
      },
      {
        "cn": "尽管他们的团队人数少，但是他们赢了比赛。",
        "pinyin": "Jǐnguǎn tāmen de tuánduì rénshù shǎo, dànshì tāmen yíng le bǐsài.",
        "en": "Although their team was few in number, they won the match.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管他们的团队人数少但是他们赢了比赛.mp3"
      },
      {
        "cn": "尽管她的成绩好，但是她仍然每天都在学习。",
        "pinyin": "Jǐnguǎn tā de chéngjì hǎo, dànshì tā réngrán měitiān dōu zài xuéxí.",
        "en": "Although her grades are good, she still studies every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管她的成绩好但是她仍然每天都在学习.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "除非...否则... (chúfēi... fǒuzé...) - Unless... otherwise...",
    "short_explanation": "Used to express the meaning of 'unless... otherwise...' in English. It represents a condition and a consequence.",
    "long_explanation": "The Chinese phrase '除非...否则...' is used to express a conditional sentence that shows the understanding of 'unless... otherwise...'. '除非' presents the condition, and '否则' introduces the result that will happen if the condition is not met.",
    "formation": "除非 + Condition, 否则 + Consequence",
    "examples": [
      {
        "cn": "除非你努力工作，否则你不能得到晋升。",
        "pinyin": "Chúfēi nǐ nǔlì gōngzuò, fǒuzé nǐ bùnéng dédào jìnshēng.",
        "en": "Unless you work hard, you can't get a promotion.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你努力工作否则你不能得到晋升.mp3"
      },
      {
        "cn": "除非你吃药，否则发烧就不会降低。",
        "pinyin": "Chúfēi nǐ chī yào, fǒuzé fāshāo jiù bù huì jiàngdī.",
        "en": "Unless you take medicine, the fever won't come down.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你吃药否则发烧就不会降低.mp3"
      },
      {
        "cn": "除非你每天都练习，否则你的中文不会提高。",
        "pinyin": "Chúfēi nǐ měitiān dōu liànxí, fǒuzé nǐ de Zhōngwén bù huì tígāo.",
        "en": "Unless you practice every day, your Chinese won't improve.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你每天都练习否则你的中文不会提高.mp3"
      },
      {
        "cn": "除非你现在就开始准备，否则你可能无法及时完成这项任务。",
        "pinyin": "Chúfēi nǐ xiànzài jiù kāishǐ zhǔnbèi, fǒuzé nǐ kěnéng wúfǎ jíshí wánchéng zhè xiàng rènwù.",
        "en": "Unless you start preparing now, you may not be able to complete this task on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你现在就开始准备否则你可能无法及时完成这项任务.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "与其...不如... (yǔqí... bùrú...) - Rather than... it's better to...",
    "short_explanation": "Used to express a preference for one action or situation over another.",
    "long_explanation": "The Mandarin Chinese phrase '与其...不如...' (yǔqí... bùrú...) is equivalent to 'rather than... it's better to...' in English. It is used to indicate that one action or situation is preferred or considered more beneficial or suitable over another. This phrase is commonly used to express decision-making or preference based on a comparison between two possible options.",
    "formation": "与其 + Action or situation A + 不如 + Preferred action or situation B",
    "examples": [
      {
        "cn": "与其在家里看电视，不如出去散步。",
        "pinyin": "Yǔqí zài jiālǐ kàn diànshì, bùrú chūqù sànbù.",
        "en": "Rather than watching TV at home, it's better to go out for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其在家里看电视不如出去散步.mp3"
      },
      {
        "cn": "与其花很多钱买一个新手机，不如修理我现有的手机。",
        "pinyin": "Yǔqí huā hěnduō qián mǎi yīgè xīn shǒujī, bùrú xiūlǐ wǒ xiànyǒu de shǒujī.",
        "en": "Rather than spend a lot of money on a new phone, it's better to fix my existing phone.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其花很多钱买一个新手机不如修理我现有的手机.mp3"
      },
      {
        "cn": "与其每天吃快餐，不如自己学做饭。",
        "pinyin": "Yǔqí měitiān chī kuàicān, bùrú zìjǐ xué zuòfàn.",
        "en": "Rather than eating fast food every day, it's better to learn to cook for yourself.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其每天吃快餐不如自己学做饭.mp3"
      },
      {
        "cn": "与其早早儿起床去游泳，不如睡个懒觉。",
        "pinyin": "Yǔqí zǎozǎo er qǐchuáng qù yóuyǒng, bùrú shuì gè lǎnjiào.",
        "en": "Rather than getting up early to go swimming, it's better to sleep in.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其早早儿起床去游泳不如睡个懒觉.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "即使 (jíshǐ) - Even if, even though",
    "short_explanation": "Used to indicate hypothetical situations or conditions.",
    "long_explanation": "The Mandarin Chinese phrase '即使 (jíshǐ)' is used to express the meaning of 'even if' or 'even though'. It introduces a hypothetical or concessive clause, setting up a condition that, despite its fulfillment, will not affect the outcome of the main clause. The structure is often used to display a strong determination or an unchangeable fact.",
    "formation": "即使 + Hypothetical Situation + Main Clause",
    "examples": [
      {
        "cn": "即使下大雨，他也决定出门去跑步。",
        "pinyin": "Jíshǐ xià dàyǔ, tā yě juédìng chūmén qù pǎobù.",
        "en": "Even if it rains heavily, he decides to go out for a run.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使下大雨他也决定出门去跑步.mp3"
      },
      {
        "cn": "即使他们一开始并不理解，我还是会坚持去做我认为正确的事情。",
        "pinyin": "Jíshǐ tāmen yī kāishǐ bìng bù lǐjiě, wǒ háishì huì jiānchí qù zuò wǒ rènwéi zhèngquè de shìqíng.",
        "en": "Even if they don't understand at first, I will still insist on doing what I believe to be right.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使他们一开始并不理解我还是会坚持去做我认为正确的事情.mp3"
      },
      {
        "cn": "即使明天是世界末日，我今天还会做我的功课。",
        "pinyin": "Jíshǐ míngtiān shì shìjiè mòrì, wǒ jīntiān hái huì zuò wǒ de gōngkè.",
        "en": "Even if tomorrow is the end of the world, I will still do my homework today.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使明天是世界末日我今天还会做我的功课.mp3"
      },
      {
        "cn": "即使我明天有很重要的考试，我今天晚上还想看这场篮球比赛。",
        "pinyin": "Jíshǐ wǒ míngtiān yǒu hěn zhòngyào de kǎoshì, wǒ jīntiān wǎnshàng hái xiǎng kàn zhè chǎng lánqiú bǐsài.",
        "en": "Even if I have a very important exam tomorrow, I still want to watch this basketball game tonight.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_even_though_20231230_即使我明天有很重要的考试我今天晚上还想看这场篮球比赛.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "25"
  },
  {
    "title": "既...又... (jì... yòu...) - Both... and...",
    "short_explanation": "A coordinative structure used to express and emphasize both qualities or actions in Mandarin Chinese.",
    "long_explanation": "The grammar structure '既...又...' in Mandarin Chinese is a coordinative structure used to express two or more qualities or actions happening at the same time. It serves a similar purpose to 'both...and...' in English. Usually, the characteristics or actions expressed by '既...又...' are in a positive light and are mutually reinforcing.",
    "formation": "Subject + 既 + Description 1 + 又 + Description 2",
    "examples": [
      {
        "cn": "这个手机既轻又薄，非常适合带出门。",
        "pinyin": "Zhège shǒujī jì qīng yòu báo, fēicháng shìhé dài chūmén.",
        "en": "This mobile phone is both light and thin, very suitable to carry out.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这个手机既轻又薄非常适合带出门.mp3"
      },
      {
        "cn": "她既聪明又勤奋，成绩总是名列前茅。",
        "pinyin": "Tā jì cōngmíng yòu qínfèn, chéngjì zǒng shì míngliè qiánmáo.",
        "en": "She is both smart and diligent, her grades are always at the top.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_她既聪明又勤奋成绩总是名列前茅.mp3"
      },
      {
        "cn": "这家餐厅的食物既美味又健康。",
        "pinyin": "Zhè jiā cāntīng de shíwù jì měiwèi yòu jiànkāng.",
        "en": "The food in this restaurant is both delicious and healthy.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这家餐厅的食物既美味又健康.mp3"
      },
      {
        "cn": "我喜欢这个城市，既有现代化的设施，又保留了古老的风貌。",
        "pinyin": "Wǒ xǐhuān zhège chéngshì, jì yǒu xiàndàihuà de shèshī, yòu bǎoliúle gǔlǎo de fēngmào.",
        "en": "I like this city, it both has modern facilities and retains the old look.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_我喜欢这个城市既有现代化的设施又保留了古老的风貌.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "由此可见 (yóucǐ kějiàn) - From this, one can see that...",
    "short_explanation": "Used to draw a conclusion based on the previous information or statement.",
    "long_explanation": "'由此可见 (yóucǐ kějiàn)' is a logical expression in Mandarin Chinese that means 'from this, one can see that...'. It's typically used after presenting some facts or observations, and it helps to summarize or draw a conclusion based on the information previously mentioned. It is similar to saying 'therefore' or 'hence' in English.",
    "formation": "由此可见 + Conclusion/Result",
    "examples": [
      {
        "cn": "他每天都在学习上花费了很多时间，由此可见，他对学习非常认真。",
        "pinyin": "Tā měitiān dōu zài xuéxí shàng huāfèi le hěnduō shíjiān, yóucǐ kějiàn, tā duì xuéxí fēicháng rènzhēn.",
        "en": "He spends a lot of time studying every day, from this, one can see that he takes his studies very seriously.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóucǐ_kějiàn_-_From_this_one_can_see_that_20231230_他每天都在学习上花费了很多时间由此可见他对学习非常认真.mp3"
      },
      {
        "cn": "他经常帮助别人，由此可见，他是一个善良的人。",
        "pinyin": "Tā jīngcháng bāngzhù biérén, yóucǐ kějiàn, tā shì yīgè shànliáng de rén.",
        "en": "He often helps others, from this, one can see that he is a kind person.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóucǐ_kějiàn_-_From_this_one_can_see_that_20231230_他经常帮助别人由此可见他是一个善良的人.mp3"
      },
      {
        "cn": "他每天都坚持锻炼，由此可见，他很注意健康。",
        "pinyin": "Tā měitiān dōu jiānchí duànliàn, yóucǐ kějiàn, tā hěn zhùyì jiànkāng.",
        "en": "He insists on exercising every day, from this, one can see that he pays great attention to his health.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóucǐ_kějiàn_-_From_this_one_can_see_that_20231230_他每天都坚持锻炼由此可见他很注意健康.mp3"
      },
      {
        "cn": "他的篮球技术在同学中是最好的，由此可见，他在篮球方面肯定投入了很多时间和努力。",
        "pinyin": "Tā de lánqiú jìshù zài tóngxué zhōng shì zuì hǎo de, yóucǐ kějiàn, tā zài lánqiú fāngmiàn kěndìng tóurù le hěnduō shíjiān hé nǔlì.",
        "en": "His basketball skills are the best among his classmates, from this, one can see that he must have put a lot of time and effort into basketball.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóucǐ_kějiàn_-_From_this_one_can_see_that_20231230_他的篮球技术在同学中是最好的由此可见他在篮球方面肯定投入了很多时间和努力.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "至于 (zhìyú) - As for, regarding",
    "short_explanation": "Used to change the topic or to mention another subject related to the previous one.",
    "long_explanation": "The Mandarin Chinese phrase '至于 (zhìyú)' is a conjunction used to transition to a new topic that is somewhat related to the previous one, or to provide additional information or comments about a different aspect of the matter under discussion. It can be translated as 'as for,' 'regarding,' 'concerning,' or 'with respect to' in English.",
    "formation": "Paragraph + 至于 + New Topic + Comment",
    "examples": [
      {
        "cn": "我喜欢吃苹果，至于你，你喜欢吃什么？",
        "pinyin": "Wǒ xǐhuān chī píngguǒ, zhìyú nǐ, nǐ xǐhuān chī shénme?",
        "en": "I like to eat apples, as for you, what do you like to eat?",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_我喜欢吃苹果至于你你喜欢吃什么.mp3"
      },
      {
        "cn": "你弟弟已经决定去北京大学。至于你，你有没有想过读研究生的打算？",
        "pinyin": "Nǐ dìdì yǐjīng juédìng qù Běijīng Dàxué. Zhìyú nǐ, nǐ yǒu méiyǒu xiǎngguò dú yánjiūshēng de dǎsuàn?",
        "en": "Your younger brother has decided to go to Beijing University. As for you, have you ever thought about the plan to read a postgraduate?",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_你弟弟已经决定去北京大学至于你你有没有想过读研究生的打算.mp3"
      },
      {
        "cn": "我父母会去买东西，至于我，我将留在家里修理自行车。",
        "pinyin": "Wǒ fùmǔ huì qù mǎi dōngxī, zhìyú wǒ, wǒ jiāng liú zài jiā lǐ xiūlǐ zìxíngchē.",
        "en": "My parents will go shopping, as for me, I will stay at home to fix the bicycle.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_我父母会去买东西至于我我将留在家里修理自行车.mp3"
      },
      {
        "cn": "这个问题我可以解决。至于其他问题，我们需要找专家来帮忙。",
        "pinyin": "Zhège wèntí wǒ kěyǐ jiějué. Zhìyú qítā wèntí, wǒmen xūyào zhǎo zhuānjiā lái bāngmáng.",
        "en": "I can solve this problem. As for other problems, we need to find experts to help.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_这个问题我可以解决至于其他问题我们需要找专家来帮忙.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "毕竟 (bìjìng) - After all / When all is said and done",
    "short_explanation": "Used to convey the essential facts of a situation that need to be considered or remembered.",
    "long_explanation": "The Mandarin Chinese phrase '毕竟 (bìjìng)' is used to highlight the essential facts or reality of a situation, particularly after considering various factors. It's equivalent to the English phrases 'after all' or 'when all is said and done'. This phrase is often used to emphasize the overall significance or important aspects of a phenomenon or occurrence.",
    "formation": "毕竟 + Statement",
    "examples": [
      {
        "cn": "毕竟我是你的朋友，我会帮你的。",
        "pinyin": "Bìjìng wǒ shì nǐ de péngyǒu, wǒ huì bāng nǐ de.",
        "en": "After all, I am your friend, I will help you.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_/_When_all_is_said_and_done_20231230_毕竟我是你的朋友我会帮你的.mp3"
      },
      {
        "cn": "虽然他不太善于表达自己，但是毕竟他是个好人。",
        "pinyin": "Suīrán tā bù tài shàn yú biǎodá zìjǐ, dànshì bìjìng tā shìgè hǎorén.",
        "en": "Although he is not good at expressing himself, after all, he is a good person.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_/_When_all_is_said_and_done_20231230_虽然他不太善于表达自己但是毕竟他是个好人.mp3"
      },
      {
        "cn": "这个项目虽然有挑战，但毕竟有益于我们的业务发展。",
        "pinyin": "Zhège xiàngmù suīrán yǒu tiǎozhàn, dàn bìjìng yǒuyì yú wǒmen de yèwù fāzhǎn.",
        "en": "This project is challenging, but after all, it is beneficial to our business development.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_/_When_all_is_said_and_done_20231230_这个项目虽然有挑战但毕竟有益于我们的业务发展.mp3"
      },
      {
        "cn": "他的房子离市中心很远，但毕竟他住得很舒服。",
        "pinyin": "Tā de fángzi lí shì zhōngxīn hěn yuǎn, dàn bìjìng tā zhù dé hěn shūfú.",
        "en": "His house is far from the city center, but after all, he lives very comfortably.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_/_When_all_is_said_and_done_20231230_他的房子离市中心很远但毕竟他住得很舒服.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "反之 (fǎnzhī) - On the contrary, conversely",
    "short_explanation": "Used to express an opposite situation or condition.",
    "long_explanation": "The Mandarin Chinese phrase '反之 (fǎnzhī)' is most equivalent to 'on the contrary' or 'conversely' in English. It is used to introduce a statement or idea which reverses the one that has just been mentioned. It serves as a contrasting conjunction that provides a helpful way of stressing a reverse situation or condition.",
    "formation": "Event/Statement 1 +，反之 + Event/Statement 2",
    "examples": [
      {
        "cn": "他对我非常友好，反之我对他冷淡。",
        "pinyin": "Tā duì wǒ fēicháng yǒuhǎo, fǎnzhī wǒ duì tā lěngdàn.",
        "en": "He is very friendly to me, on the contrary, I am indifferent to him.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_contrary_conversely_20231230_他对我非常友好反之我对他冷淡.mp3"
      },
      {
        "cn": "如果你尊重别人，别人也会尊重你，反之，如果你不尊重别人，别人也会不尊重你。",
        "pinyin": "Rúguǒ nǐ zūnzhòng biérén, biérén yě huì zūnzhòng nǐ, fǎnzhī, rúguǒ nǐ bù zūnzhòng biérén, biérén yě huì bù zūnzhòng nǐ.",
        "en": "If you respect others, others will respect you, conversely, if you don't respect others, others will not respect you.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_contrary_conversely_20231230_如果你尊重别人别人也会尊重你反之如果你不尊重别人别人也会不尊重你.mp3"
      },
      {
        "cn": "做运动可以让你的身体健康，反之，如果你不运动，你的身体可能会变得很弱。",
        "pinyin": "Zuò yùndòng kěyǐ ràng nǐ de shēntǐ jiànkāng, fǎnzhī, rúguǒ nǐ bù yùndòng, nǐ de shēntǐ kěnéng huì biàn dé hěn ruò.",
        "en": "Exercising can make your body healthy, on the contrary, if you do not exercise, your body may become very weak.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_contrary_conversely_20231230_做运动可以让你的身体健康反之如果你不运动你的身体可能会变得很弱.mp3"
      },
      {
        "cn": "如果你努力学习，你可以取得好成绩，反之，如果你不努力学习，你可能会挂科。",
        "pinyin": "Rúguǒ nǐ nǔlì xuéxí, nǐ kěyǐ qǔdé hǎo chéngjì, fǎnzhī, rúguǒ nǐ bù nǔlì xuéxí, nǐ kěnéng huì guà kē.",
        "en": "If you study hard, you can achieve good grades, conversely, if you do not study hard, you may fail.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_contrary_conversely_20231230_如果你努力学习你可以取得好成绩反之如果你不努力学习你可能会挂科.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "除了...以外 (chúle... yǐwài) - Apart from, besides",
    "short_explanation": "This phrase is used to indicate exception or exclusion, usually translated as 'apart from', 'besides', or 'except'.",
    "long_explanation": "The Mandarin Chinese expression '除了...以外 (chúle... yǐwài)' is primarily used in situations when we want to talk about exceptions or exclusions. In other words, it means that except for the person or thing mentioned, the statement remains true for all others.",
    "formation": "{除了 + exception + 以外}, [+ rest of sentence]",
    "examples": [
      {
        "cn": "除了跑步以外，我还喜欢游泳。",
        "pinyin": "Chúle pǎobù yǐwài, wǒ hái xǐhuān yóuyǒng.",
        "en": "Apart from running, I also like swimming.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Apart_from_besides_20231230_除了跑步以外我还喜欢游泳.mp3"
      },
      {
        "cn": "除了周末以外，他每天都在学习。",
        "pinyin": "Chúle zhōumò yǐwài, tā měitiān dū zài xuéxí.",
        "en": "Apart from weekends, he studies every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Apart_from_besides_20231230_除了周末以外他每天都在学习.mp3"
      },
      {
        "cn": "除了音乐以外，我对画画也非常感兴趣。",
        "pinyin": "Chúle yīnyuè yǐwài, wǒ duì huà huà yě fēicháng gǎn xìngqù.",
        "en": "Besides music, I am also very interested in painting.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Apart_from_besides_20231230_除了音乐以外我对画画也非常感兴趣.mp3"
      },
      {
        "cn": "除了数学和物理以外，他对所有科目都很擅长。",
        "pinyin": "Chúle shùxué hé wùlǐ yǐwài, tā duì suǒyǒu kēmù dōu hěn shàncháng.",
        "en": "Apart from mathematics and physics, he is good at all subjects.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外_chúle_yǐwài_-_Apart_from_besides_20231230_除了数学和物理以外他对所有科目都很擅长.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "不仅...而且... (bùjǐn... érqiě...) - Not only... but also...",
    "short_explanation": "This is a compound conjunction used to show that besides the first point, there is also a second point.",
    "long_explanation": "The basic structure '不仅...而且...' in Mandarin Chinese serves to introduce not only one but two related aspects, events, or actions. It is similar to the English 'not only... but also...' The phrase emphasizes that both statements are true and might be relevant or surprising.",
    "formation": "Subject + 不仅 + Statement 1 + ，而且 + Statement 2.",
    "examples": [
      {
        "cn": "她不仅开朗，而且十分大方。",
        "pinyin": "Tā bùjǐn kāilǎng, érqiě shífēn dàfāng.",
        "en": "She is not only cheerful, but also very generous.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_她不仅开朗而且十分大方.mp3"
      },
      {
        "cn": "我不仅喜欢吃中国菜，而且也喜欢学习如何烹饪这些菜。",
        "pinyin": "Wǒ bùjǐn xǐhuan chī Zhōngguó cài, érqiě yě xǐhuan xuéxí rúhé pēngrèn zhèxiē cài.",
        "en": "I not only enjoy eating Chinese food, but also love learning how to cook these dishes.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_我不仅喜欢吃中国菜而且也喜欢学习如何烹饪这些菜.mp3"
      },
      {
        "cn": "这个城市不仅有美丽的风景，而且有浓厚的历史文化氛围。",
        "pinyin": "Zhège chéngshì bùjǐn yǒu měilì de fēngjǐng, érqiě yǒu nónghòu de lìshǐ wénhuà fēnwéi.",
        "en": "This city not only features beautiful scenery, but also has a rich historical and cultural atmosphere.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_这个城市不仅有美丽的风景而且有浓厚的历史文化氛围.mp3"
      },
      {
        "cn": "他不仅会说普通话，而且会说五种不同的方言。",
        "pinyin": "Tā bùjǐn huì shuō pǔtōnghuà, érqiě huì shuō wǔ zhǒng bùtóng de fāngyán.",
        "en": "He not only speaks Mandarin, but also can speak five different dialects.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_他不仅会说普通话而且会说五种不同的方言.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "何况 (hékuàng) - Let alone, not to mention",
    "short_explanation": "Used to express 'even more so' or 'not to mention'.",
    "long_explanation": "The Mandarin Chinese phrase '何况 (hékuàng)' is a conjunction used to indicate that the following statement or situation is even more true or applicable, given the truth of the preceding statement. In English, it is equivalent to phrases such as 'let alone', 'not to mention' or 'much less'. This phrase is typically known for showing a comparison by expressing something that is even more certain or extreme than what has previously been said.",
    "formation": "Clause 1 + ，何况 + Clause 2",
    "examples": [
      {
        "cn": "我连汉语的基本字都写不好，何况复杂的汉字。",
        "pinyin": "Wǒ lián hànyǔ de jīběn zì dōu xiě bù hǎo, hékuàng fùzá de hànzì.",
        "en": "I can't even write the basic Chinese characters well, let alone the complex ones.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_我连汉语的基本字都写不好何况复杂的汉字.mp3"
      },
      {
        "cn": "他连自己的工作都做不好，何况管理别人。",
        "pinyin": "Tā lián zìjǐ de gōngzuò dū zuò bù hǎo , hékuàng guǎnlǐ biéren.",
        "en": "He can't even do his own job well, let alone manage others.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_他连自己的工作都做不好何况管理别人.mp3"
      },
      {
        "cn": "她连基本的炒菜都不会，何况做复杂的菜肴。",
        "pinyin": "Tā lián jīběn de chǎocài dū bù huì, hékuàng zuò fùzá de càiyáo.",
        "en": "She can't even basic fry dishes, let alone make complicated cuisine.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_她连基本的炒菜都不会何况做复杂的菜肴.mp3"
      },
      {
        "cn": "他已经疲倦得连走路都觉得困难，何况跑步。",
        "pinyin": "Tā yǐjīng píjuàn de lián zǒulù dōu juédé kùnnan, hékuàng pǎobù.",
        "en": "He is already so tired that even walking feels difficult, let alone running.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_他已经疲倦得连走路都觉得困难何况跑步.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "假使 (jiǎshǐ) - Supposing, if",
    "short_explanation": "Used to express hypothetical situations or conditions.",
    "long_explanation": "The Mandarin Chinese expression '假使 (jiǎshǐ)' is used to articulate hypothetical scenarios or conditions. It translates to 'supposing' or 'if' and is used to begin a supposition in the sentence. The structure is typically used to express 'if' in the hypothetical sense and is frequently employed in formal or written contexts.",
    "formation": "假使 + Hypothetical situation / condition, then... (outcome)",
    "examples": [
      {
        "cn": "假使你中了彩票，你会做什么？我会买一所大房子。",
        "pinyin": "Jiǎshǐ nǐ zhòng le cǎipiào, nǐ huì zuò shénme? Wǒ huì mǎi yī suǒ dà fángzi.",
        "en": "If you won the lottery, what would you do? I would buy a big house.",
        "grammar_audio": "/audio/mandarin/grammar/s_假使_jiǎshǐ_-_Supposing_if_20231230_假使你中了彩票你会做什么我会买一所大房子.mp3"
      },
      {
        "cn": "假使我有足够的时间，我会去看世界各地的风景。",
        "pinyin": "Jiǎshǐ wǒ yǒu zúgòu de shíjiān, wǒ huì qù kàn shìjiè gèdì de fēngjǐng.",
        "en": "If I had enough time, I would travel to see the world's various landscapes.",
        "grammar_audio": "/audio/mandarin/grammar/s_假使_jiǎshǐ_-_Supposing_if_20231230_假使我有足够的时间我会去看世界各地的风景.mp3"
      },
      {
        "cn": "假使他明天来这里，你能不能接他？当然，我会去接他。",
        "pinyin": "Jiǎshǐ tā míngtiān lái zhèlǐ, nǐ néng bùnéng jiē tā? Dāngrán, wǒ huì qù jiē tā.",
        "en": "If he comes here tomorrow, could you pick him up? Of course, I will pick him up.",
        "grammar_audio": "/audio/mandarin/grammar/s_假使_jiǎshǐ_-_Supposing_if_20231230_假使他明天来这里你能不能接他当然我会去接他.mp3"
      },
      {
        "cn": "假使我是你，我会选择去旅游。",
        "pinyin": "Jiǎshǐ wǒ shì nǐ, wǒ huì xuǎnzé qù lǚyóu.",
        "en": "If I were you, I would choose to go on a trip.",
        "grammar_audio": "/audio/mandarin/grammar/s_假使_jiǎshǐ_-_Supposing_if_20231230_假使我是你我会选择去旅游.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "倘若 (tǎngruò) - If, supposing",
    "short_explanation": "An expression used to indicate a hypothetical condition.",
    "long_explanation": "The phrase '倘若 (tǎngruò)' is used in Mandarin Chinese to express 'if' or 'supposing,' akin to an 'if' clause in English. It introduces a hypothesized event, condition or situation. The event following '倘若' is the assumed or hypothetical situation, and the event following is the consequent outcome of that hypothetical scenario. ",
    "formation": "倘若 + Hypothetical condition, + Outcome",
    "examples": [
      {
        "cn": "倘若明天不下雨，我们就去爬山。",
        "pinyin": "Tǎngruò míngtiān bù xià yǔ, wǒmen jiù qù páshān.",
        "en": "If it does not rain tomorrow, we will go mountain climbing.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若明天不下雨我们就去爬山.mp3"
      },
      {
        "cn": "倘若我有足够的钱，我会去旅行。",
        "pinyin": "Tǎngruò wǒ yǒu zúgòu de qián, wǒ huì qù lǚxíng.",
        "en": "If I have enough money, I will go traveling.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若我有足够的钱我会去旅行.mp3"
      },
      {
        "cn": "倘若他得知这个消息，他肯定会很高兴。",
        "pinyin": "Tǎngruò tā dézhī zhège xiāoxi, tā kěndìng huì hěn gāoxìng.",
        "en": "If he finds out this news, he will definitely be happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若他得知这个消息他肯定会很高兴.mp3"
      },
      {
        "cn": "倘若你需要帮助，随时向我求助。",
        "pinyin": "Tǎngruò nǐ xūyào bāngzhù, suíshí xiàng wǒ qiúzhù.",
        "en": "If you need help, you can ask me at any time.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若你需要帮助随时向我求助.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "正如 (zhèngrú) - Just as, as",
    "short_explanation": "正如 (zhèngrú) is used to indicate that one situation or fact is similar to or the same as another.",
    "long_explanation": "The phrase '正如 (zhèngrú)' in Mandarin Chinese is employed to draw a comparison between two situations, facts, or things, suggesting a similarity or parallelism between them. This phrase is similar to 'just as' or 'as' in English. It is commonly used to highlight the likeness or equivalence between two aspects or points of consideration.",
    "formation": "正如 + Situation/Fact 1, (so) Situation/Fact 2",
    "examples": [
      {
        "cn": "正如你所看到的，我现在非常忙。",
        "pinyin": "Zhèngrú nǐ suǒ kàndào de, wǒ xiànzài fēicháng máng.",
        "en": "Just as you can see, I am very busy right now.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如你所看到的我现在非常忙.mp3"
      },
      {
        "cn": "他的专业知识非常丰富，正如我之前告诉你的那样。",
        "pinyin": "Tā de zhuānyè zhīshì fēicháng fēngfù, zhèngrú wǒ zhīqián gàosù nǐ de nà yàng.",
        "en": "His professional knowledge is very rich, just as I told you before.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_他的专业知识非常丰富正如我之前告诉你的那样.mp3"
      },
      {
        "cn": "正如我所预料的，他没有按时完成任务。",
        "pinyin": "Zhèngrú wǒ suǒ yùliào de, tā méiyǒu àn shí wánchéng rènwù.",
        "en": "Just as I expected, he did not complete the task on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我所预料的他没有按时完成任务.mp3"
      },
      {
        "cn": "正如我了解的，他是个非常有天赋的艺术家。",
        "pinyin": "Zhèngrú wǒ liǎojiě de, tā shì gè fēicháng yǒu tiānfù de yìshùjiā.",
        "en": "As I understand, he is a very talented artist.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我了解的他是个非常有天赋的艺术家.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "正因为...所以... (zhèng yīnwèi... suǒyǐ...) - Precisely because... therefore...",
    "short_explanation": "Used to express the relationship of cause and effect between two sentences.",
    "long_explanation": "The Mandarin Chinese phrase '正因为...所以...' is a structure used to show the cause and effect relationship between two situations or events. It can be translated as 'precisely because... therefore...' in English. The sentence pattern begins with '正因为' (precisely because) to state the cause, followed by '所以' (therefore) to indicate the effect.",
    "formation": "正因为 + Cause, 所以 + Effect",
    "examples": [
      {
        "cn": "正因为他每天努力学习，所以他的成绩一直很好。",
        "pinyin": "Zhèng yīnwèi tā měitiān nǔlì xuéxí, suǒyǐ tā de chéngjī yīzhí hěn hǎo.",
        "en": "Precisely because he studies hard every day, therefore his grades have always been good.",
        "grammar_audio": "/audio/mandarin/grammar/s_正因为所以_zhèng_yīnwèi_suǒyǐ_-_Precisely_because_therefore_20231230_正因为他每天努力学习所以他的成绩一直很好.mp3"
      },
      {
        "cn": "正因为他不怕困难，所以他能够完成这个任务。",
        "pinyin": "Zhèng yīnwèi tā bù pà kùnnan, suǒyǐ tā nénggòu wánchéng zhège rènwù.",
        "en": "Precisely because he is not afraid of difficulties, therefore he can complete this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_正因为所以_zhèng_yīnwèi_suǒyǐ_-_Precisely_because_therefore_20231230_正因为他不怕困难所以他能够完成这个任务.mp3"
      },
      {
        "cn": "正因为你善良，所以大家都喜欢你。",
        "pinyin": "Zhèng yīnwèi nǐ shànliáng, suǒyǐ dàjiā dōu xǐhuān nǐ.",
        "en": "Precisely because you are kind, therefore everyone likes you.",
        "grammar_audio": "/audio/mandarin/grammar/s_正因为所以_zhèng_yīnwèi_suǒyǐ_-_Precisely_because_therefore_20231230_正因为你善良所以大家都喜欢你.mp3"
      },
      {
        "cn": "正因为我爱吃中国菜，所以我学会了做饭。",
        "pinyin": "Zhèng yīnwèi wǒ ài chī zhōngguó cài, suǒyǐ wǒ xuéhuì le zuò fàn.",
        "en": "Precisely because I love Chinese food, therefore I learned to cook.",
        "grammar_audio": "/audio/mandarin/grammar/s_正因为所以_zhèng_yīnwèi_suǒyǐ_-_Precisely_because_therefore_20231230_正因为我爱吃中国菜所以我学会了做饭.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "而非 (érfēi) - Rather than",
    "short_explanation": "Used to express preference or selection between two options or to correct a mistaken identity or clarification.",
    "long_explanation": "The Mandarin Chinese phrase '而非 (érfēi)' is a conjunction commonly used to indicate a preference or choice between two options, or to correct a mistaken identity or statement. It is equivalent to 'rather than' in English. With this phrase, you can emphasize that one thing is true or appropriate instead of another.",
    "formation": "Item A + 而非 + Item B",
    "examples": [
      {
        "cn": "他是一个教师而非学生。",
        "pinyin": "Tā shì yīgè jiàoshī érfēi xuéshēng.",
        "en": "He is a teacher rather than a student.",
        "grammar_audio": "/audio/mandarin/grammar/s_而非_érfēi_-_Rather_than_20231230_他是一个教师而非学生.mp3"
      },
      {
        "cn": "我们应该以事实为依据而非假设。",
        "pinyin": "Wǒmen yīnggāi yǐ shìshí wéi yījù érfēi jiǎshè.",
        "en": "We should base on facts rather than assumptions.",
        "grammar_audio": "/audio/mandarin/grammar/s_而非_érfēi_-_Rather_than_20231230_我们应该以事实为依据而非假设.mp3"
      },
      {
        "cn": "我更喜欢用电子邮件而非传统的信件方式来沟通。",
        "pinyin": "Wǒ gèng xǐhuān yòng diànzǐ yóujiàn érfēi chuántǒng de xìnjiàn fāngshì lái gōutōng.",
        "en": "I prefer to communicate by email rather than traditional letters.",
        "grammar_audio": "/audio/mandarin/grammar/s_而非_érfēi_-_Rather_than_20231230_我更喜欢用电子邮件而非传统的信件方式来沟通.mp3"
      },
      {
        "cn": "他们选择走路去公园，而非乘坐公共汽车。",
        "pinyin": "Tāmen xuǎnzé zǒulù qù gōngyuán, érfēi chéngzuò gōnggòng qìchē.",
        "en": "They chose to walk to the park rather than take the bus.",
        "grammar_audio": "/audio/mandarin/grammar/s_而非_érfēi_-_Rather_than_20231230_他们选择走路去公园而非乘坐公共汽车.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "若是 (ruòshì) - If, in case",
    "short_explanation": "Used to express a conditional or hypothetical situation.",
    "long_explanation": "The Mandarin Chinese conjunction '若是 (ruòshì)' is equivalent to the English 'if' or 'in case'. It introduces a hypothetical condition or situation, which is usually followed by a possible outcome or consequence.",
    "formation": "若是 + Condition, Consequence/Outcome",
    "examples": [
      {
        "cn": "若是你感觉不舒服，就早点回家休息吧。",
        "pinyin": "Ruòshì nǐ gǎnjué bù shūfú, jiù zǎodiǎn huíjiā xiūxí ba.",
        "en": "If you're not feeling well, go home and rest early.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是你感觉不舒服就早点回家休息吧.mp3"
      },
      {
        "cn": "若是你明天空闲，我们可以去看电影。",
        "pinyin": "Ruòshì nǐ míngtiān kòngxián, wǒmen kěyǐ qù kàn diànyǐng.",
        "en": "If you are free tomorrow, we can go watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是你明天空闲我们可以去看电影.mp3"
      },
      {
        "cn": "若是我达不到这个目标，我会非常失望。",
        "pinyin": "Ruòshì wǒ dá bù dào zhège mùbiāo, wǒ huì fēicháng shīwàng.",
        "en": "If I don't reach this goal, I'll be very disappointed.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是我达不到这个目标我会非常失望.mp3"
      },
      {
        "cn": "若是遇到问题，你可以随时联系我。",
        "pinyin": "Ruòshì yù dào wèntí, nǐ kěyǐ suíshí liánxì wǒ.",
        "en": "If you encounter problems, you can contact me at any time.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是遇到问题你可以随时联系我.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "鉴于 (jiànyú) - In light of, considering",
    "short_explanation": "Used in Mandarin to express a cause or reason that calls for a certain action or result.",
    "long_explanation": "The Mandarin Chinese phrase '鉴于 (jiànyú)' is commonly used to introduce a reason or cause that prompts a particular action or result. The phrase is similar in context to English expressions like 'in light of' or 'considering'. It indicates a basis for the action stated in the consequent clause.",
    "formation": "鉴于 + Reason/Cause, Subject + Action/Result",
    "examples": [
      {
        "cn": "鉴于他的努力和才华，我们决定提升他为经理。",
        "pinyin": "Jiànyú tā de nǔlì hé cáihuá, wǒmen juédìng tíshēng tā wéi jīnglǐ.",
        "en": "In light of his effort and talent, we have decided to promote him to manager.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于他的努力和才华我们决定提升他为经理.mp3"
      },
      {
        "cn": "鉴于你已经完成了全部课程，你可以申请毕业了。",
        "pinyin": "Jiànyú nǐ yǐjīng wánchéng le quánbù kèchéng, nǐ kěyǐ shēnqǐng bìyè le.",
        "en": "Considering you have completed all the courses, you can apply for graduation.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于你已经完成了全部课程你可以申请毕业了.mp3"
      },
      {
        "cn": "鉴于天气预报表示今天会下雨，我们决定取消今天的野餐。",
        "pinyin": "Jiànyú tiānqì yùbào biǎoshì jīntiān huì xià yǔ, wǒmen juédìng qǔxiāo jīntiān de yěcān.",
        "en": "In light of the weather forecast suggesting it will rain today, we decided to cancel the picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于天气预报表示今天会下雨我们决定取消今天的野餐.mp3"
      },
      {
        "cn": "鉴于他的年龄和健康状况，他不太可能出任这个职位。",
        "pinyin": "Jiànyú tā de niánlíng hé jiànkāng zhuàngkuàng, tā bù tài kěnéng chūrèn zhège zhíwèi.",
        "en": "Considering his age and health condition, it's unlikely that he will take up this position.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于他的年龄和健康状况他不太可能出任这个职位.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "尽可能 (jǐn kěnéng) - As much as possible",
    "short_explanation": "Used to express 'as much as possible' or 'to the best one can'.",
    "long_explanation": "The Mandarin Chinese phrase '尽可能 (jǐn kěnéng)' is used to indicate trying to achieve something to the greatest extent possible, or doing something to the best of one's ability. It is equivalent to saying 'as much as possible' or 'as well as possible' in English. This phrase can be used with verbs, adjectives, and nouns to express the idea of maximising one's effort or optimising a situation.",
    "formation": "尽可能 + Verb/Adjective/Noun",
    "examples": [
      {
        "cn": "我会尽可能地帮你准备汉语水平考试。",
        "pinyin": "Wǒ huì jǐn kěnéng de bāng nǐ zhǔnbèi hànyǔ shuǐpíng kǎoshì.",
        "en": "I will help you to prepare for the Chinese proficiency test as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽可能_jǐn_kěnéng_-_As_much_as_possible_20231230_我会尽可能地帮你准备汉语水平考试.mp3"
      },
      {
        "cn": "请你尽可能快地走，否则我们会迟到的。",
        "pinyin": "Qǐng nǐ jǐn kěnéng kuài de zǒu, fǒuzé wǒmen huì chídào de.",
        "en": "Please walk as fast as possible, otherwise we will be late.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽可能_jǐn_kěnéng_-_As_much_as_possible_20231230_请你尽可能快地走否则我们会迟到的.mp3"
      },
      {
        "cn": "他尽可能地吃了很多水果来保持健康。",
        "pinyin": "Tā jǐn kěnéng de chīle hěnduō shuǐguǒ lái bǎochí jiànkāng.",
        "en": "He has eaten as many fruits as possible to stay healthy.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽可能_jǐn_kěnéng_-_As_much_as_possible_20231230_他尽可能地吃了很多水果来保持健康.mp3"
      },
      {
        "cn": "我们应该尽可能地利用我们的时间。",
        "pinyin": "Wǒmen yīnggāi jǐn kěnéng de lìyòng wǒmen de shíjiān.",
        "en": "We should make use of our time as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽可能_jǐn_kěnéng_-_As_much_as_possible_20231230_我们应该尽可能地利用我们的时间.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "并非 (bìngfēi) - Not at all, is not",
    "short_explanation": "Used to express the negation of a fact or a statement.",
    "long_explanation": "The Mandarin Chinese phrase '并非 (bìngfēi)' is used to deny a situation or fact. It refers to something that is not the case or untrue, essentially denoting the opposite of what may initially appear to be true. Unlike the basic negative 不 (bù), '并非 (bìngfēi)' is stronger in tone and usually used in written Chinese or formal contexts.",
    "formation": "Subject + 并非 + Comment.",
    "examples": [
      {
        "cn": "他并非我最好的朋友，但我们很长时间都在一起。",
        "pinyin": "Tā bìngfēi wǒ zuì hǎo de péngyǒu, dàn wǒmen hěn cháng shíjiān dōu zài yīqǐ.",
        "en": "He is not at all my best friend, but we have been together for a long time.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_他并非我最好的朋友但我们很长时间都在一起.mp3"
      },
      {
        "cn": "这个问题并非一朝一夕就能解决的。",
        "pinyin": "Zhègè wèntí bìngfēi yīzhāoyīxī jiù néng jiějué de.",
        "en": "This problem is not something that can be solved overnight.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_这个问题并非一朝一夕就能解决的.mp3"
      },
      {
        "cn": "他并非没有心，他只是沉默不语。",
        "pinyin": "Tā bìngfēi méiyǒu xīn, tā zhǐshì chénmò bùyǔ.",
        "en": "It's not that he doesn't care, he just remains silent.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_他并非没有心他只是沉默不语.mp3"
      },
      {
        "cn": "我并非不想去，我只是没有时间。",
        "pinyin": "Wǒ bìngfēi bùxiǎng qù, wǒ zhǐshì méiyǒu shíjiān.",
        "en": "It's not that I don't want to go, it's just that I don't have the time.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_我并非不想去我只是没有时间.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "无论...都... (wúlùn... dōu...) - No matter...always...",
    "short_explanation": "This pattern is used to express 'no matter what/who/how etc...always...'.",
    "long_explanation": "The Mandarin Chinese phrase '无论...都... (wúlùn... dōu...)' is used to indicate that the action or situation expressed in the main clause happens or is true regardless of the different conditions or possibilities expressed in the subordinate clause. It is equivalent to the English pattern 'no matter (what/who/how)...always...'.",
    "formation": "无论 + Condition 1 [Phrase 1], 都 + Condition 2 [Phrase 2]",
    "examples": [
      {
        "cn": "无论多么困难，我们都不应放弃。",
        "pinyin": "Wúlùn duōme kùnnan, wǒmen dōu bù yīng fàngqì.",
        "en": "No matter how difficult it is, we should never give up.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matteralways_20231230_无论多么困难我们都不应放弃.mp3"
      },
      {
        "cn": "无论你去哪里，他都会找到你。",
        "pinyin": "Wúlùn nǐ qù nǎlǐ, tā dōu huì zhǎo dào nǐ.",
        "en": "No matter where you go, he will always find you.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matteralways_20231230_无论你去哪里他都会找到你.mp3"
      },
      {
        "cn": "无论我做什么，他们都会支持我。",
        "pinyin": "Wúlùn wǒ zuò shénme, tāmen dōu huì zhīchí wǒ.",
        "en": "No matter what I do, they will always support me.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matteralways_20231230_无论我做什么他们都会支持我.mp3"
      },
      {
        "cn": "无论风雨多大，邮递员都会按时送到邮件。",
        "pinyin": "Wúlùn fēngyǔ duō dà, yóudìyuán dōu huì ànshí sòng dào yóujiàn.",
        "en": "No matter how bad the weather is, the postman always delivers the mail on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matteralways_20231230_无论风雨多大邮递员都会按时送到邮件.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "不然 (bùrán) - Otherwise, or else",
    "short_explanation": "Used to indicate the consequence if the action or condition in the first part of the sentence does not happen or is not met.",
    "long_explanation": "The Mandarin Chinese phrase '不然 (bùrán)' is utilized to signify the repercussions that might occur if a preceding action or condition is not accomplished or fulfilled. In English, it is similar to saying 'otherwise', or 'or else', suggesting a negative outcome that is to be avoided.",
    "formation": "Clause1 + 不然 + Clause2",
    "examples": [
      {
        "cn": "你应该早点睡觉，不然明天你会感觉累。",
        "pinyin": "Nǐ yīnggāi zǎodiǎn shuìjiào, bùrán míngtiān nǐ huì gǎnjué lèi.",
        "en": "You should go to bed earlier, otherwise, you will feel tired tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_你应该早点睡觉不然明天你会感觉累.mp3"
      },
      {
        "cn": "我们必须立刻出发，不然我们会错过火车。",
        "pinyin": "Wǒmen bìxū lìkè chūfā, bùrán wǒmen huì cuòguò huǒchē.",
        "en": "We must set off immediately, or else we will miss the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_我们必须立刻出发不然我们会错过火车.mp3"
      },
      {
        "cn": "请你把音乐声音调小一点，不然邻居会投诉。",
        "pinyin": "Qǐng nǐ bǎ yīnyuè shēngyīn tiáoxiǎo yīdiǎn, bùrán línjū huì tóusù.",
        "en": "Please turn down the music volume, otherwise, the neighbors will complain.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_请你把音乐声音调小一点不然邻居会投诉.mp3"
      },
      {
        "cn": "饭菜要全部吃完，不然你妈会生气的。",
        "pinyin": "Fàncài yào quánbù chī wán, bùrán nǐ mā huì shēngqì de.",
        "en": "You should finish all your food, or else your mom will get angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_or_else_20231230_饭菜要全部吃完不然你妈会生气的.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "趁 (chèn) - While, take advantage of",
    "short_explanation": "Used to indicate doing something while taking advantage of a certain situation or condition.",
    "long_explanation": "In Mandarin Chinese, '趁 (chèn)' is a preposition used to describe an action or activity performed while taking advantage of a certain time or situation. This is usually used when the condition or situation is favorable or timely for carrying out a particular action. It's equivalent to English expressions 'while' or 'take advantage of'.",
    "formation": "趁 + Time/Situation/Opportunity, Subject + Verb/Action",
    "examples": [
      {
        "cn": "趁天气还好，我们应该出去散步。",
        "pinyin": "Chèn tiānqì hái hǎo, wǒmen yīnggāi chūqù sànbù.",
        "en": "We should go for a walk while the weather is still good.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_While_take_advantage_of_20231230_趁天气还好我们应该出去散步.mp3"
      },
      {
        "cn": "趁周末，我通常会去图书馆看书。",
        "pinyin": "Chèn zhōumò, wǒ tōngcháng huì qù túshūguǎn kànshū.",
        "en": "I usually go to the library to read books over the weekend.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_While_take_advantage_of_20231230_趁周末我通常会去图书馆看书.mp3"
      },
      {
        "cn": "趁我妈妈不在家，我和我的朋友在客厅打电子游戏。",
        "pinyin": "Chèn wǒ māmā bù zài jiā, wǒ hé wǒ de péngyǒu zài kètīng dǎ diànzǐ yóuxì.",
        "en": "While my mom was not at home, my friend and I played video games in the living room.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_While_take_advantage_of_20231230_趁我妈妈不在家我和我的朋友在客厅打电子游戏.mp3"
      },
      {
        "cn": "趁他们在商店，你可以在家里准备晚餐。",
        "pinyin": "Chèn tāmen zài shāngdiàn, nǐ kěyǐ zài jiālǐ zhǔnbèi wǎncān.",
        "en": "While they are at the store, you can prepare dinner at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_While_take_advantage_of_20231230_趁他们在商店你可以在家里准备晚餐.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "无非 (wúfēi) - Nothing but, only",
    "short_explanation": "Used to emphasize that a situation or thing is really quite simple or only involves very few elements.",
    "long_explanation": "The phrase '无非 (wúfēi)' in Mandarin Chinese is used to emphasize that something is simple, or only involves certain elements or aspects. It is equivalent to 'nothing but' or 'only' in English. This phrase is often used to downplay the complexity of a situation or to emphasize the simplicity of a matter.",
    "formation": "无非 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他无非是想让你理解他的立场。",
        "pinyin": "Tā wúfēi shì xiǎng ràng nǐ lǐjiě tā de lìchǎng.",
        "en": "He wants nothing more than for you to understand his position.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_only_20231230_他无非是想让你理解他的立场.mp3"
      },
      {
        "cn": "这个问题无非关于他们谁应该负责。",
        "pinyin": "Zhège wèntí wúfēi guānyú tāmen shuí yīnggāi fùzé.",
        "en": "This problem is really nothing but about who should be responsible.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_only_20231230_这个问题无非关于他们谁应该负责.mp3"
      },
      {
        "cn": "我无非只是想让她感到幸福。",
        "pinyin": "Wǒ wúfēi zhǐshì xiǎng ràng tā gǎndào xìngfú.",
        "en": "I want nothing but to make her happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_only_20231230_我无非只是想让她感到幸福.mp3"
      },
      {
        "cn": "这个方案无非就是要我们付出更大的牺牲。",
        "pinyin": "Zhège fāng'àn wúfēi jiùshì yào wǒmen fùchū gèng dà de xīshēng.",
        "en": "This plan is nothing but asking us to make bigger sacrifices.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_only_20231230_这个方案无非就是要我们付出更大的牺牲.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "只要...就... (zhǐyào... jiù...) - As long as... then...",
    "short_explanation": "This structure is used for conditional sentences, meaning 'as long as... then...'.",
    "long_explanation": "Only if/ as long as... then...” is a structure used in Chinese to talk about certain conditions and what will happen provided that these conditions are met. '只要 (zhǐyào)' represents the condition, while '就 (jiù)' represents the result or consequence of that condition.",
    "formation": "只要 + Condition, 就 + Result",
    "examples": [
      {
        "cn": "只要你努力，就会有好结果。",
        "pinyin": "Zhǐyào nǐ nǔlì, jiù huì yǒu hǎo jiéguǒ.",
        "en": "As long as you work hard, there will be good results.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你努力就会有好结果.mp3"
      },
      {
        "cn": "只要我们相信自己，就能够克服任何困难。",
        "pinyin": "Zhǐyào wǒmen xiāngxìn zìjǐ, jiù nénggòu kèfú rènhé kùnnán.",
        "en": "As long as we believe in ourselves, we can overcome any difficulties.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要我们相信自己就能够克服任何困难.mp3"
      },
      {
        "cn": "只要天气好，我们就去公园。",
        "pinyin": "Zhǐyào tiānqì hǎo, wǒmen jiù qù gōngyuán.",
        "en": "As long as the weather is good, we will go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要天气好我们就去公园.mp3"
      },
      {
        "cn": "只要你不放弃，就有可能成功。",
        "pinyin": "Zhǐyào nǐ bú fàngqì, jiù yǒu kěnéng chénggōng.",
        "en": "As long as you don't give up, there's a possibility of success.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你不放弃就有可能成功.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "除非 (chúfēi) - Only if, unless",
    "short_explanation": "Used to present a necessary condition for a particular outcome to happen.",
    "long_explanation": "The Mandarin Chinese phrase '除非 (chúfēi)' is used to indicate that a specific circumstance is the only scenario in which a certain result will occur, it is equivalent to saying 'only if' or 'unless' in English. This phrase is typically used to bring attention to the one requirement or prerequisite that must be satisfied for a certain outcome to happen.",
    "formation": "除非 + Condition, Main Clause",
    "examples": [
      {
        "cn": "除非你努力工作，否则你不会成功。",
        "pinyin": "Chúfēi nǐ nǔlì gōngzuò, fǒuzé nǐ bú huì chénggōng.",
        "en": "Only if you work hard, will you be successful.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Only_if_unless_20231230_除非你努力工作否则你不会成功.mp3"
      },
      {
        "cn": "除非明天下雨，我才不去公园。",
        "pinyin": "Chúfēi míngtiān xià yǔ, wǒ cái bù qù gōngyuán.",
        "en": "I won't go to the park tomorrow unless it rains.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Only_if_unless_20231230_除非明天下雨我才不去公园.mp3"
      },
      {
        "cn": "除非你早点睡觉，你明天肯定会疲倦。",
        "pinyin": "Chúfēi nǐ zǎo diǎn shuìjiào, nǐ míngtiān kěndìng huì píjuàn.",
        "en": "You will definitely be tired tomorrow unless you go to sleep early.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Only_if_unless_20231230_除非你早点睡觉你明天肯定会疲倦.mp3"
      },
      {
        "cn": "除非你告诉他真相，他永远不会相信你。",
        "pinyin": "Chúfēi nǐ gàosù tā zhēnxiàng, tā yǒngyuǎn bù huì xiāngxìn nǐ.",
        "en": "He will never believe you unless you tell him the truth.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Only_if_unless_20231230_除非你告诉他真相他永远不会相信你.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "无论如何 (wúlùn rúhé) - No matter what, anyhow",
    "short_explanation": "Used to express a determination to overcome any situation or obstacle.",
    "long_explanation": "'无论如何 (wúlùn rúhé)' is a Chinese phrase used to demonstrate an unwavering determination to proceed or continue, regardless of the situation or circumstances. It implies a will to overcome challenges or problems no matter what they may be, and is equivalent to the English phrases 'no matter what' or 'anyhow'.",
    "formation": "无论如何 + statement",
    "examples": [
      {
        "cn": "无论如何，我都会完成这个任务的。",
        "pinyin": "Wúlùn rúhé, wǒ dōu huì wánchéng zhège rènwù de.",
        "en": "No matter what, I will complete this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何我都会完成这个任务的.mp3"
      },
      {
        "cn": "无论如何，你都不能放弃学习中文。",
        "pinyin": "Wúlùn rúhé, nǐ dōu bùnéng fàngqì xuéxí Zhōngwén.",
        "en": "No matter what, you can't give up learning Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_无论如何你都不能放弃学习中文.mp3"
      },
      {
        "cn": "我无论如何都会赢这场比赛的。",
        "pinyin": "Wǒ wúlùn rúhé dōu huì yíng zhè chǎng bǐsài de.",
        "en": "No matter what, I will win this game.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_我无论如何都会赢这场比赛的.mp3"
      },
      {
        "cn": "明天无论如何我都必须去北京。",
        "pinyin": "Míngtiān wúlùn rúhé wǒ dōu bìxū qù Běijīng.",
        "en": "No matter what, I have to go to Beijing tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_No_matter_what_anyhow_20231230_明天无论如何我都必须去北京.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "只怕 (zhǐpà) - I'm afraid that, perhaps",
    "short_explanation": "Only afraid (zhǐpà) is used to express the possibility of an undesirable situation.",
    "long_explanation": "只怕 (zhǐpà) is a conjunction often used in Mandarin Chinese to introduce a clause that expresses a worry or fear about a possible situation or event. It can be translated to 'I'm afraid that' or 'perhaps' in English, reflecting hesitation or uncertainty. It should follow a subject and precede a verb or an adjective.",
    "formation": "Subject + 只怕 + Verb or Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "我只怕他们会在你身上取笑。",
        "pinyin": "Wǒ zhǐpà tāmen huì zài nǐ shēnshang qǔxiào.",
        "en": "I'm afraid they might mock you.",
        "grammar_audio": "/audio/mandarin/grammar/s_只怕_zhǐpà_-_Im_afraid_that_perhaps_20231230_我只怕他们会在你身上取笑.mp3"
      },
      {
        "cn": "只怕明天下雨，我们的野餐就得取消。",
        "pinyin": "Zhǐpà míngtiān xià yǔ, wǒmen de yěcān jiù děi qǔxiāo.",
        "en": "I'm afraid that if it rains tomorrow, we'll have to cancel our picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_只怕_zhǐpà_-_Im_afraid_that_perhaps_20231230_只怕明天下雨我们的野餐就得取消.mp3"
      },
      {
        "cn": "我只怕没做好准备的学生会找不到合适的工作。",
        "pinyin": "Wǒ zhǐpà méi zuò hǎo zhǔnbèi de xuéshēng huì zhǎobudào héshì de gōngzuò.",
        "en": "I'm afraid that unprepared students might struggle to find suitable jobs.",
        "grammar_audio": "/audio/mandarin/grammar/s_只怕_zhǐpà_-_Im_afraid_that_perhaps_20231230_我只怕没做好准备的学生会找不到合适的工作.mp3"
      },
      {
        "cn": "这个房子很漂亮，只怕价格太高了。",
        "pinyin": "Zhè ge fángzi hěn piàoliang, zhǐpà jiàgé tài gāo le.",
        "en": "This house is very nice, I'm afraid that the price might be too high.",
        "grammar_audio": "/audio/mandarin/grammar/s_只怕_zhǐpà_-_Im_afraid_that_perhaps_20231230_这个房子很漂亮只怕价格太高了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "50"
  },
  {
    "title": "尽管如此 (jǐnguǎn rúcǐ) - Even so, nonetheless",
    "short_explanation": "Used to express contrast or concession, similar to 'even so' or 'nonetheless' in English.",
    "long_explanation": "尽管如此 (jǐnguǎn rúcǐ) is a conjunction used in Mandarin Chinese to express contrast, specifically a situation that departs from an expectation or norm previously mentioned. Normally used in formal or written Chinese, it's commonly translated into English as 'even so' or 'nonetheless'. It helps to highlight a point of contradiction or concession that exists despite a previously stated fact.",
    "formation": "Statement 1 + 尽管如此 + statement of contrast",
    "examples": [
      {
        "cn": "他的工作非常繁忙，尽管如此，他总是找时间与家人在一起。",
        "pinyin": "Tā de gōngzuò fēicháng fánmáng, jǐnguǎn rúcǐ, tā zǒng shì zhǎo shíjiān yǔ jiārén zài yīqǐ.",
        "en": "His job is very busy, even so, he always finds time to be with his family.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nonetheless_20231230_他的工作非常繁忙尽管如此他总是找时间与家人在一起.mp3"
      },
      {
        "cn": "这部电影的结局并不是我喜欢的类型，尽管如此，我还是感到非常触动。",
        "pinyin": "Zhè bù diànyǐng de jiéjú bìng bùshì wǒ xǐhuan de lèixíng, jǐnguǎn rúcǐ, wǒ háishì gǎndào fēicháng chùdòng.",
        "en": "The ending of this movie isn't the type I like, nonetheless, I was very moved.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nonetheless_20231230_这部电影的结局并不是我喜欢的类型尽管如此我还是感到非常触动.mp3"
      },
      {
        "cn": "尽管如此，我对我能成功还是非常有信心。",
        "pinyin": "Jǐnguǎn rúcǐ, wǒ duì wǒ néng chénggōng háishì fēicháng yǒu xìnxīn.",
        "en": "Nonetheless, I still have great confidence that I can succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nonetheless_20231230_尽管如此我对我能成功还是非常有信心.mp3"
      },
      {
        "cn": "看上去要下大雨了，尽管如此，他还是决定骑自行车出门。",
        "pinyin": "Kàn shàngqu yào xià dà yǔ le, jǐnguǎn rúcǐ, tā hái shì juédìng qí zìxíngchē chūmén.",
        "en": "It looks like it's going to rain heavily, even so, he still decided to go out on his bike.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nonetheless_20231230_看上去要下大雨了尽管如此他还是决定骑自行车出门.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "难怪 (nánguài) - No wonder, so that's why",
    "short_explanation": "Used to express realization of a previously unknown cause of a situation.",
    "long_explanation": "The Mandarin Chinese phrase '难怪 (nánguài)' is used to express a sudden realization or understanding about the reason or cause of a certain situation. It can be used in the beginning or end of a sentence, and translates to 'no wonder' or 'so that's why' in English.",
    "formation": "难怪 + Sentence OR Sentence + 难怪",
    "examples": [
      {
        "cn": "今天你表现得很奇怪，难怪，昨天晚上你根本没睡觉。",
        "pinyin": "Jīntiān nǐ biǎoxiàn dé hěn qíguài, nánguài, zuótiān wǎnshàng nǐ gēnběn méi shuìjiào.",
        "en": "You are behaving very strangely today, no wonder, you didn't sleep at all last night.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_今天你表现得很奇怪难怪昨天晚上你根本没睡觉.mp3"
      },
      {
        "cn": "这本书真的非常好看，难怪你推荐我买。",
        "pinyin": "Zhè běn shū zhēn de fēicháng hǎo kàn, nánguài nǐ tuījiàn wǒ mǎi.",
        "en": "This book is really good, no wonder you recommended me to buy it.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_这本书真的非常好看难怪你推荐我买.mp3"
      },
      {
        "cn": "难怪你写中文那么好，你在北京住了五年。",
        "pinyin": "Nánguài nǐ xiě Zhōngwén nàme hǎo, nǐ zài Běijīng zhù le wǔ nián.",
        "en": "No wonder your Chinese writing is so good, you've lived in Beijing for five years.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪你写中文那么好你在北京住了五年.mp3"
      },
      {
        "cn": "难怪天这么冷，原来冬天已经来了。",
        "pinyin": "Nánguài tiān zhème lěng, yuánlái dōngtiān yǐjīng lái le.",
        "en": "No wonder it's so cold, it turns out that winter is here.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪天这么冷原来冬天已经来了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "尽早 (jǐnzǎo) - As early as possible",
    "short_explanation": "Used to express the need to do something as early as possible.",
    "long_explanation": "The Mandarin Chinese phrase '尽早 (jǐnzǎo)' implies a sense of urgency and is used when something needs to be done as soon as possible, or 'at the earliest convenience'. It holds the similar meaning as 'as soon as possible' or 'at your earliest convenience' in English. The use of '尽早' can make a sentence sound more polite, formal and businesslike.",
    "formation": "Subject + Verb + Objective + 尽早",
    "examples": [
      {
        "cn": "请尽早完成这个项目，以便我们可以提早开始下一个。",
        "pinyin": "Qǐng jǐnzǎo wánchéng zhège xiàngmù, yǐbiàn wǒmen kěyǐ tízǎo kāishǐ xià yīgè.",
        "en": "Please complete this project as early as possible so that we can start the next one earlier.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_early_as_possible_20231230_请尽早完成这个项目以便我们可以提早开始下一个.mp3"
      },
      {
        "cn": "尽早支付您的账单，以避免任何可能的延误。",
        "pinyin": "Jǐnzǎo zhīfù nín de zhàngdān, yǐ bìmiǎn rènhé kěnéng de yánwù.",
        "en": "Pay your bill as early as possible to avoid any possible delay.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_early_as_possible_20231230_尽早支付您的账单以避免任何可能的延误.mp3"
      },
      {
        "cn": "我会尽早将这个信息告诉他。",
        "pinyin": "Wǒ huì jǐnzǎo jiāng zhège xìnxī gàosù tā.",
        "en": "I will tell him this information as early as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_early_as_possible_20231230_我会尽早将这个信息告诉他.mp3"
      },
      {
        "cn": "请尽早回复这封电子邮件。",
        "pinyin": "Qǐng jǐnzǎo huífù zhè fēng diànzǐ yóujiàn.",
        "en": "Please reply to this email as early as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_early_as_possible_20231230_请尽早回复这封电子邮件.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "一旦 (yīdàn) - Once, in case (something happens)",
    "short_explanation": "Used to express a hypothetical condition, often indicative of a change or turning point.",
    "long_explanation": "The Mandarin Chinese term '一旦 (yīdàn)' is a conjunction that sets a condition, under which something will happen or a situation will change. It is equivalent to saying 'once' or 'in case' in English. This word is typically used in formal or written Chinese to express potential major changes or turning points.",
    "formation": "一旦 + situation or condition, the rest of the sentence determines the outcome.",
    "examples": [
      {
        "cn": "一旦失去健康，你将意识到它的重要性。",
        "pinyin": "Yīdàn shīqù jiànkāng, nǐ jiāng yìshí dào tā de zhòngyàoxìng.",
        "en": "Once you lose your health, you will realize its importance.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦失去健康你将意识到它的重要性.mp3"
      },
      {
        "cn": "一旦发生火灾，你必须立即离开建筑物。",
        "pinyin": "Yīdàn fāshēng huǒzhài, nǐ bìxū lìjí líkāi jiànzhúwù.",
        "en": "In case of a fire, you must leave the building immediately.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦发生火灾你必须立即离开建筑物.mp3"
      },
      {
        "cn": "一旦你确定了目标，就要全力以赴实现它。",
        "pinyin": "Yīdàn nǐ quèdìngle mùbiāo, jiù yào quánlì yǐfù shíxiàn tā.",
        "en": "Once you have set a goal, you have to do your utmost to achieve it.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦你确定了目标就要全力以赴实现它.mp3"
      },
      {
        "cn": "一旦我们做出决定，我们就不能轻易改变。",
        "pinyin": "Yīdàn wǒmen zuò chū juédìng, wǒmen jiù bùnéng qīngyì gǎibiàn.",
        "en": "Once we make a decision, we cannot change it easily.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦我们做出决定我们就不能轻易改变.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "虽说 (suī shuō) - Although, though",
    "short_explanation": "Used to introduce a concession or acknowledgment in a logical argument or statement.",
    "long_explanation": "The Mandarin Chinese connective phrase '虽说 (suī shuō)' is an expression used to demonstrate a concession, contradiction or opposition in a statement or argument. It is equivalent to saying 'although' or 'though' in English. This phrase often precedes an acknowledged fact or argument, yet introduces a contrasting view or outcome in the latter part of the sentence.",
    "formation": "虽说 + Statement +，+ Contrasting statement",
    "examples": [
      {
        "cn": "虽说他常常迟到，但是他的工作成绩总是很好。",
        "pinyin": "Suī shuō tā chángcháng chídào, dànshì tā de gōngzuò chéngjì zǒngshì hěn hǎo.",
        "en": "Although he often arrives late, his work performance is always good.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suī_shuō_-_Although_though_20231230_虽说他常常迟到但是他的工作成绩总是很好.mp3"
      },
      {
        "cn": "虽说我不喜欢吃辣，我还是会尝试一下四川菜。",
        "pinyin": "Suī shuō wǒ bù xǐhuān chī là, wǒ háishì huì chángshì yīxià Sìchuān cài.",
        "en": "Although I don't like spicy food, I will still try Sichuan cuisine.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suī_shuō_-_Although_though_20231230_虽说我不喜欢吃辣我还是会尝试一下四川菜.mp3"
      },
      {
        "cn": "虽说这份工作很有压力，我还是决定接受。",
        "pinyin": "Suī shuō zhè fèn gōngzuò hěn yǒu yālì, wǒ háishì juédìng jiēshòu.",
        "en": "Although this job is very stressful, I still decided to accept it.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suī_shuō_-_Although_though_20231230_虽说这份工作很有压力我还是决定接受.mp3"
      },
      {
        "cn": "虽说他们的产品质量好，我还是不打算购买。",
        "pinyin": "Suī shuō tāmen de chǎnpǐn zhìliàng hǎo, wǒ háishì bù dǎsuàn gòumǎi.",
        "en": "Although their product quality is good, I still do not plan to buy.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽说_suī_shuō_-_Although_though_20231230_虽说他们的产品质量好我还是不打算购买.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "不得不 (bùdébù) - Have to, can't avoid",
    "short_explanation": "Used to express strong obligation or necessity.",
    "long_explanation": "In Mandarin Chinese, '不得不 (bùdébù)' is used to convey a strong obligation or necessity. It is equivalent to saying 'have to' or 'can't avoid' in English. This phrase is used to describe a situation where someone is compelled to do something, often due to circumstances beyond their control.",
    "formation": "Subject + 不得不 + Verb",
    "examples": [
      {
        "cn": "因为下雨，我不得不取消了我们的户外旅行。",
        "pinyin": "Yīnwèi xià yǔ, wǒ bùdébù qǔxiāo le wǒmen de hùwài lǚxíng.",
        "en": "Because of the rain, I had to cancel our outdoor trip.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_avoid_20231230_因为下雨我不得不取消了我们的户外旅行.mp3"
      },
      {
        "cn": "不得不承认，他的这个在工作上的表现比我出色。",
        "pinyin": "Bùdébù chéngrèn, tā de zhège zài gōngzuò shàng de biǎoxiàn bǐ wǒ chūsè.",
        "en": "I have to admit, his performance at work is better than mine.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_avoid_20231230_不得不承认他的这个在工作上的表现比我出色.mp3"
      },
      {
        "cn": "尽管我不愿意，但我不得不接受他的决定。",
        "pinyin": "Jǐnguǎn wǒ bù yuànyì, dàn wǒ bùdébù jiēshòu tā de juédìng.",
        "en": "Although I don't want to, I have to accept his decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_avoid_20231230_尽管我不愿意但我不得不接受他的决定.mp3"
      },
      {
        "cn": "孩子生病了，我不得不留在家里照顾他们。",
        "pinyin": "Háizǐ shēngbìng le, wǒ bùdébù liú zài jiā lǐ zhàogù tāmen.",
        "en": "The kids are sick, I have to stay at home to take care of them.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_avoid_20231230_孩子生病了我不得不留在家里照顾他们.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "难道 (nándào) - Could it be that, isn't it the case?",
    "short_explanation": "Used to pose a rhetorical question, expressing surprise or doubt.",
    "long_explanation": "难道 (nándào) is a Mandarin Chinese interrogative adverb used to express doubt or surprise in a rhetorical question. It is often translated as 'Could it be that?' or 'Isn't it the case?' in English. It does not require a response since the speaker does not anticipate an answer.",
    "formation": "难道 + Statement?",
    "examples": [
      {
        "cn": "难道你真的不知道熊猫是中国的国宝吗？我真的感到惊讶。",
        "pinyin": "Nándào nǐ zhēndé bù zhīdào xióngmāo shì Zhōngguó de guóbǎo ma? Wǒ zhēndé gǎndào jīngyà.",
        "en": "Could it be that you really don't know pandas are the Chinese national treasure? I'm really surprised.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_the_case_20231230_难道你真的不知道熊猫是中国的国宝吗我真的感到惊讶.mp3"
      },
      {
        "cn": "难道你还没完成家庭作业吗？我们已经有足够的时间来完成它了。",
        "pinyin": "Nándào nǐ hái méi wánchéng jiātíng zuòyè ma? Wǒmen yǐjīng yǒu zúgòu de shíjiān lái wánchéng tāle.",
        "en": "Could it be that you haven't finished the homework yet? We already had enough time to finish it.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_the_case_20231230_难道你还没完成家庭作业吗我们已经有足够的时间来完成它了.mp3"
      },
      {
        "cn": "难道这就是你的最好的解决方案吗？我期待更多。",
        "pinyin": "Nándào zhè jiùshì nǐ de zuì hǎo de jiějué fāng'àn ma? Wǒ qídài gèng duō.",
        "en": "Could this really be your best solution? I was hoping for more.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_the_case_20231230_难道这就是你的最好的解决方案吗我期待更多.mp3"
      },
      {
        "cn": "难道你不喜欢这件衬衫吗？我本以为你会喜欢的。",
        "pinyin": "Nándào nǐ bù xǐhuān zhè jiàn chènshān ma? Wǒ běn yǐwéi nǐ huì xǐhuān de.",
        "en": "Could it be that you don't like this shirt? I thought you would.",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_isnt_it_the_case_20231230_难道你不喜欢这件衬衫吗我本以为你会喜欢的.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "一直 (yīzhí) - All along, continuously",
    "short_explanation": "Used to describe continuous or unbroken action or state.",
    "long_explanation": "'一直 (yīzhí)' in Mandarin Chinese conveys a sense of continuity or an unbroken state of affairs. Comparable to the English expressions 'all along' or 'continuously', this term denotes that an action or condition has been ongoing for a period of time, without interruption. It can be employed to describe both actions and states, emphasizing that they continue unabated from the past to the future.",
    "formation": "Subject + 一直 + Verb/Adjective",
    "examples": [
      {
        "cn": "我一直在等你，你怎么现在才来？",
        "pinyin": "Wǒ yīzhí zài děng nǐ, nǐ zěnme xiànzài cái lái?",
        "en": "I've been waiting for you all along, why are you only coming now?",
        "grammar_audio": "/audio/mandarin/grammar/s_一直_yīzhí_-_All_along_continuously_20231230_我一直在等你你怎么现在才来.mp3"
      },
      {
        "cn": "他一直在工作，没有休息。",
        "pinyin": "Tā yīzhí zài gōngzuò, méiyǒu xiūxí.",
        "en": "He's been working continuously, without any rest.",
        "grammar_audio": "/audio/mandarin/grammar/s_一直_yīzhí_-_All_along_continuously_20231230_他一直在工作没有休息.mp3"
      },
      {
        "cn": "她一直想要去看那部电影，但是还没机会。",
        "pinyin": "Tā yīzhí xiǎng yào qù kàn nà bù diànyǐng, dànshì hái méi jīhuì.",
        "en": "She's wanted to see that movie all along, but still hasn't had the chance.",
        "grammar_audio": "/audio/mandarin/grammar/s_一直_yīzhí_-_All_along_continuously_20231230_她一直想要去看那部电影但是还没机会.mp3"
      },
      {
        "cn": "我一直都住在这个城市，从来没有搬过家。",
        "pinyin": "Wǒ yīzhí dōu zhù zài zhège chéngshì, cónglái méiyǒu bānguò jiā.",
        "en": "I've lived in this city continuously, never having moved houses.",
        "grammar_audio": "/audio/mandarin/grammar/s_一直_yīzhí_-_All_along_continuously_20231230_我一直都住在这个城市从来没有搬过家.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "终于 (zhōngyú) - Finally, At Last",
    "short_explanation": "Used to express something that has happened after a long wait or many difficulties.",
    "long_explanation": "The Mandarin Chinese word '终于 (zhōngyú)' is used to express the idea that something has finally occurred after a long period of waiting, or after overcoming many obstacles or challenges. It can be likened to the English words 'finally' or 'at last'. It usually conveys a sense of relief, accomplishment, or even surprise.",
    "formation": "Subject + Time + 终于 + Verb + Result",
    "examples": [
      {
        "cn": "经过一天的忙碌，我终于完成了这个项目。",
        "pinyin": "Jīngguò yītiān de mánglù, wǒ zhōngyú wánchéng le zhège xiàngmù.",
        "en": "After a busy day, I finally completed the project.",
        "grammar_audio": "/audio/mandarin/grammar/s_终于_zhōngyú_-_Finally_At_Last_20231230_经过一天的忙碌我终于完成了这个项目.mp3"
      },
      {
        "cn": "等了这么久，火车终于到了。",
        "pinyin": "Děngle zhème jiǔ, huǒchē zhōngyú dào le.",
        "en": "After such a long wait, the train has finally arrived.",
        "grammar_audio": "/audio/mandarin/grammar/s_终于_zhōngyú_-_Finally_At_Last_20231230_等了这么久火车终于到了.mp3"
      },
      {
        "cn": "我终于明白了为什么他那么开心了，他升职了。",
        "pinyin": "Wǒ zhōngyú míngbái le wèishéme tā nàme kāixīn le, tā shēngzhí le.",
        "en": "I finally understand why he's so happy, he got a promotion.",
        "grammar_audio": "/audio/mandarin/grammar/s_终于_zhōngyú_-_Finally_At_Last_20231230_我终于明白了为什么他那么开心了他升职了.mp3"
      },
      {
        "cn": "经过半年的努力，我终于通过了汉语水平考试。",
        "pinyin": "Jīngguò bàn nián de nǔlì, wǒ zhōngyú tōngguòle Hànyǔ shuǐpíng kǎoshì.",
        "en": "After six months of effort, I finally passed the Chinese proficiency test.",
        "grammar_audio": "/audio/mandarin/grammar/s_终于_zhōngyú_-_Finally_At_Last_20231230_经过半年的努力我终于通过了汉语水平考试.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "早已 (zǎoyǐ) - Long ago, for a long time",
    "short_explanation": "Used to refer to actions that have happened a long time ago or for a long time.",
    "long_explanation": "The Mandarin Chinese phrase '早已 (zǎoyǐ)' is utilized to indicate that an event or an action has occurred some time ago, or has been happening for a prolonged time. It provides a strong sense of past time, and emphasizes the length of time that has passed since the action has taken place. This is similar to the English phrase 'long ago' or 'for a long time'.",
    "formation": "Subject + 早已 + Verb + Rest of the Sentence",
    "examples": [
      {
        "cn": "我早已注意到你的努力，你的付出我会记在心里的。",
        "pinyin": "Wǒ zǎoyǐ zhùyì dào nǐ de nǔlì, nǐ de fùchū wǒ huì jì zài xīnlǐ de.",
        "en": "I noticed your efforts long ago, and I will remember your efforts.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_我早已注意到你的努力你的付出我会记在心里的.mp3"
      },
      {
        "cn": "他这部作品我早已读过，而且我觉得它非常引人入胜。",
        "pinyin": "Tā zhè bù zuòpǐn wǒ zǎoyǐ dúguò, érqiě wǒ juédé tā fēicháng yǐnrénrùshèng.",
        "en": "I had read this work of his long ago, and I found it very engaging.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_他这部作品我早已读过而且我觉得它非常引人入胜.mp3"
      },
      {
        "cn": "事实上，我早已接受了这个事实，虽然它很艰难。",
        "pinyin": "Shìshí shàng, wǒ zǎoyǐ jiēshòule zhège shìshí, suīrán tā hěn jiānnán.",
        "en": "In fact, I accepted this truth a long time ago, even though it was difficult.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_事实上我早已接受了这个事实虽然它很艰难.mp3"
      },
      {
        "cn": "你早已拥有了你所需要的一切，你只需要找到它在哪里。",
        "pinyin": "Nǐ zǎoyǐ yōngyǒu le nǐ suǒ xūyào de yīqiè, nǐ zhǐ xūyào zhǎodào tā zài nǎlǐ.",
        "en": "You've had all that you needed a long time ago, you only need to find out where it is.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_你早已拥有了你所需要的一切你只需要找到它在哪里.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "何况 (hékuàng) - Let alone, not to mention",
    "short_explanation": "Used to introduce an even stronger situation or point after having made a previous one.",
    "long_explanation": "The Mandarin Chinese phrase '何况 (hékuàng)' is similar to 'let alone' or 'not to mention' in English. It's used to describe an even more incisive circumstance or argument after an original point has been established, often to highlight a contrast or emphasize one's point.",
    "formation": "Statement + 何况 + Stronger statement",
    "examples": [
      {
        "cn": "我连普通的中文都说不流利，何况专业的词汇了。",
        "pinyin": "Wǒ lián pǔtōng de zhōngwén dōu shuō bùliúlì, hékuàng zhuānyè de cíhuì le.",
        "en": "I can't even speak ordinary Chinese fluently, let alone professional vocabulary.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_我连普通的中文都说不流利何况专业的词汇了.mp3"
      },
      {
        "cn": "他连他自己的房间都不会打扫，何况整个房子。",
        "pinyin": "Tā lián tā zìjǐ de fángjiān dōu bù huì dǎsǎo, hékuàng zhěnggè fángzi.",
        "en": "He can't even clean his own room, not to mention the whole house.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_他连他自己的房间都不会打扫何况整个房子.mp3"
      },
      {
        "cn": "我如果连普通的问题都不能解决，何况这样的困难题目。",
        "pinyin": "Wǒ rúguǒ lián pǔtōng de wèntí dōu bùnéng jiějué, hékuàng zhèyàng de kùnnántímù.",
        "en": "If I can't even solve ordinary problems, let alone such difficult questions.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_我如果连普通的问题都不能解决何况这样的困难题目.mp3"
      },
      {
        "cn": "他连小学的数学题都不能做，何况高中的物理题。",
        "pinyin": "Tā lián xiǎoxué de shùxué tí dōu bùnéng zuò, hékuàng gāozhōng de wùlǐ tí.",
        "en": "He can't even do primary school math problems, let alone high school physics problems.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_not_to_mention_20231230_他连小学的数学题都不能做何况高中的物理题.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "哪怕 (nǎpà) - Even if, Even though",
    "short_explanation": "This is used to show a condition upon which an action is reliant.",
    "long_explanation": "'哪怕 (nǎpà)' is a conjunction in Mandarin Chinese used to express a hypothetical condition upon which an action is based. It translates to 'even if' or 'even though' in English. When using '哪怕', we indicate an extreme situation rather than an average or expected one.",
    "formation": "哪怕 + Condition, Main clause",
    "examples": [
      {
        "cn": "哪怕下雨，我也会去公园。",
        "pinyin": "Nǎpà xiàyǔ, wǒ yě huì qù gōngyuán.",
        "en": "Even if it rains, I will go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_哪怕_nǎpà_-_Even_if_Even_though_20231230_哪怕下雨我也会去公园.mp3"
      },
      {
        "cn": "哪怕今天很忙，我也会完成我的作业。",
        "pinyin": "Nǎpà jīntiān hěn máng, wǒ yě huì wánchéng wǒ de zuòyè.",
        "en": "Even though I am busy today, I will complete my homework.",
        "grammar_audio": "/audio/mandarin/grammar/s_哪怕_nǎpà_-_Even_if_Even_though_20231230_哪怕今天很忙我也会完成我的作业.mp3"
      },
      {
        "cn": "哪怕明天考试，他还是玩电脑游戏。",
        "pinyin": "Nǎpà míngtiān kǎoshì, tā háishì wán diànnǎo yóuxì.",
        "en": "Even though he has an exam tomorrow, he still plays computer games.",
        "grammar_audio": "/audio/mandarin/grammar/s_哪怕_nǎpà_-_Even_if_Even_though_20231230_哪怕明天考试他还是玩电脑游戏.mp3"
      },
      {
        "cn": "哪怕风雪交加，他们依然坚持训练。",
        "pinyin": "Nǎpà fēng xuě jiāojiā, tāmen yīrán jiānchí xùnliàn.",
        "en": "Even though the weather is snowing violently, they still insist on training.",
        "grammar_audio": "/audio/mandarin/grammar/s_哪怕_nǎpà_-_Even_if_Even_though_20231230_哪怕风雪交加他们依然坚持训练.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "更不用说 (gèng bùyòng shuō) - Not to mention, let alone",
    "short_explanation": "Used to emphasize that if one thing is true, then something else mentioned is definitely also true.",
    "long_explanation": "The phrase '更不用说 (gèng bùyòng shuō)' is typically used in Mandarin Chinese to emphasize a point by stating that if one thing is certainly true, then the second, usually more significant or impressive, thing is undoubtedly also true. It is similar to the English phrases 'not to mention' or 'let alone'. The phrase is often used in situations when something is so obvious or certain that it does not need to be mentioned.",
    "formation": "Statement/Point A + 更不用说 + Statement/Point B",
    "examples": [
      {
        "cn": "我都没时间看电视，更不用说去电影院看电影了。",
        "pinyin": "Wǒ dōu méi shíjiān kàn diànshì, gèng bùyòng shuō qù diànyǐngyuàn kàn diànyǐng le.",
        "en": "I don't even have time to watch TV, let alone go to the cinema to watch a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_我都没时间看电视更不用说去电影院看电影了.mp3"
      },
      {
        "cn": "她连中文都说不好，更不用说写中文了。",
        "pinyin": "Tā lián Zhōngwén dōu shuō bù hǎo, gèng bùyòng shuō xiě Zhōngwén le.",
        "en": "She can't even speak Chinese well, let alone write in Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_她连中文都说不好更不用说写中文了.mp3"
      },
      {
        "cn": "他们的队伍甚至没有进入决赛，更不用说获得冠军了。",
        "pinyin": "Tāmen de duìwǔ shènzhì méiyǒu jìnrù juésài, gèng bùyòng shuō huòdé guànjūn le.",
        "en": "Their team didn't even make it to the finals, not to mention winning the championship.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_他们的队伍甚至没有进入决赛更不用说获得冠军了.mp3"
      },
      {
        "cn": "他做事不认真，更不用说负责了。",
        "pinyin": "Tā zuò shì bù rènzhēn, gèng bùyòng shuō fùzé le.",
        "en": "He is not serious when doing things, let alone be responsible.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_他做事不认真更不用说负责了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "为难 (wéinán) - To make things difficult for, to feel embarrassed",
    "short_explanation": "It is used to express the feeling of being in a difficult situation or being embarrassed.",
    "long_explanation": "The Mandarin Chinese phrase '为难 (wéinán)' translates more literally into 'for difficulty'. It is often used to express feelings of embarrassment or predicaments. It can also be used to indicate that someone is in a situation of making things difficult for others.",
    "formation": "Subject + 为难 + Rest of the sentence.",
    "examples": [
      {
        "cn": "我真不想给你带来麻烦，让你为难。",
        "pinyin": "Wǒ zhēn bùxiǎng gěi nǐ dài lái máfan, ràng nǐ wéinán.",
        "en": "I really don’t want to trouble you and put you in a difficult position.",
        "grammar_audio": "/audio/mandarin/grammar/s_为难_wéinán_-_To_make_things_difficult_for_to_feel_embarrassed_20231230_我真不想给你带来麻烦让你为难.mp3"
      },
      {
        "cn": "他把我放在一个为难的境地：我可能会丢掉工作，也可能会失去朋友。",
        "pinyin": "Tā bǎ wǒ fàng zài yīgè wéinán de jìngdì: wǒ kěnéng huì diū diào gōngzuò, yě kěnéng huì shīqù péngyǒu.",
        "en": "He put me in a difficult position: I could either lose my job or lose my friend.",
        "grammar_audio": "/audio/mandarin/grammar/s_为难_wéinán_-_To_make_things_difficult_for_to_feel_embarrassed_20231230_他把我放在一个为难的境地：我可能会丢掉工作也可能会失去朋友.mp3"
      },
      {
        "cn": "我不想在你和她之间为难。",
        "pinyin": "Wǒ bùxiǎng zài nǐ hé tā zhījiān wéinán.",
        "en": "I don't want to be caught in an awkward position between you and her.",
        "grammar_audio": "/audio/mandarin/grammar/s_为难_wéinán_-_To_make_things_difficult_for_to_feel_embarrassed_20231230_我不想在你和她之间为难.mp3"
      },
      {
        "cn": "我知道这会让你为难，但我需要你的帮助。",
        "pinyin": "Wǒ zhīdào zhè huì ràng nǐ wéinán, dàn wǒ xūyào nǐ de bāngzhù.",
        "en": "I know this will put you in a difficult position, but I need your help.",
        "grammar_audio": "/audio/mandarin/grammar/s_为难_wéinán_-_To_make_things_difficult_for_to_feel_embarrassed_20231230_我知道这会让你为难但我需要你的帮助.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "相反 (xiāngfǎn) - On the contrary, instead",
    "short_explanation": "Used to indicate a contrasting idea or fact.",
    "long_explanation": "The Mandarin Chinese expression '相反 (xiāngfǎn)' is used to introduce a contrasting idea or fact that is opposed to what has been previously mentioned. It can be seen as equivalent to using 'on the contrary' or 'instead' in English. This phrase is often used to highlight the difference between two viewpoints, actions, or outcomes.",
    "formation": "Subject + Verb/Adjective +，相反，+ Contrasting Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "我不是讨厌你，相反，我很喜欢你。",
        "pinyin": "Wǒ bùshì tǎoyàn nǐ, xiāngfǎn, wǒ hěn xǐhuān nǐ.",
        "en": "I don't hate you, on the contrary, I like you very much.",
        "grammar_audio": "/audio/mandarin/grammar/s_相反_xiāngfǎn_-_On_the_contrary_instead_20231230_我不是讨厌你相反我很喜欢你.mp3"
      },
      {
        "cn": "他不懒散，相反，他是我知道的最勤快的人。",
        "pinyin": "Tā bù lǎnsàn, xiāngfǎn, tā shì wǒ zhīdào de zuì qínkuài de rén.",
        "en": "He is not lazy, on the contrary, he is the most industrious person I know.",
        "grammar_audio": "/audio/mandarin/grammar/s_相反_xiāngfǎn_-_On_the_contrary_instead_20231230_他不懒散相反他是我知道的最勤快的人.mp3"
      },
      {
        "cn": "他们并没有失败，相反，他们取得了巨大的成功。",
        "pinyin": "Tāmen bìng méiyǒu shībài, xiāngfǎn, tāmen qǔdéle jùdà de chénggōng.",
        "en": "They did not fail, on the contrary, they achieved great success.",
        "grammar_audio": "/audio/mandarin/grammar/s_相反_xiāngfǎn_-_On_the_contrary_instead_20231230_他们并没有失败相反他们取得了巨大的成功.mp3"
      },
      {
        "cn": "我不觉得这部电影无聊，相反，我觉得非常有趣。",
        "pinyin": "Wǒ bù juédé zhè bù diànyǐng wúliáo, xiāngfǎn, wǒ juédé fēicháng yǒuqù.",
        "en": "I don't think this movie is boring, on the contrary, I find it very interesting.",
        "grammar_audio": "/audio/mandarin/grammar/s_相反_xiāngfǎn_-_On_the_contrary_instead_20231230_我不觉得这部电影无聊相反我觉得非常有趣.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "此外 (cǐwài) - Besides, in addition",
    "short_explanation": "Used to introduce supplementary information or enumerate extra items.",
    "long_explanation": "The Mandarin Chinese phrase '此外 (cǐwài)' is used to include additional information in your conversation or writing. It corresponds to 'besides' or 'in addition' in English. It is a handy term when you want to provide extra details or enumerate more items without starting a new sentence.",
    "formation": "Topic + 此外 + Supplementary statement.",
    "examples": [
      {
        "cn": "他很善良，此外他非常聪明。",
        "pinyin": "Tā hěn shànliáng, cǐwài tā fēicháng cōngmíng.",
        "en": "He is very kind, besides he is very smart.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_Besides_in_addition_20231230_他很善良此外他非常聪明.mp3"
      },
      {
        "cn": "我喜欢读小说，此外，我也喜欢看电影。",
        "pinyin": "Wǒ xǐhuān dú xiǎoshuō, cǐwài, wǒ yě xǐhuān kàn diànyǐng.",
        "en": "I like reading novels, in addition, I also like watching movies.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_Besides_in_addition_20231230_我喜欢读小说此外我也喜欢看电影.mp3"
      },
      {
        "cn": "他的主要工作是教书，此外，他还在写一本书。",
        "pinyin": "Tā de zhǔyào gōngzuò shì jiāoshū, cǐwài, tā hái zài xiě yī běn shū.",
        "en": "His main job is teaching, in addition, he is also writing a book.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_Besides_in_addition_20231230_他的主要工作是教书此外他还在写一本书.mp3"
      },
      {
        "cn": "她热心工作，此外，她对人总是非常有礼貌。",
        "pinyin": "Tā rèxīn gōngzuò, cǐwài, tā duì rén zǒng shì fēicháng yǒulǐmào.",
        "en": "She works enthusiastically, besides, she is always very polite to people.",
        "grammar_audio": "/audio/mandarin/grammar/s_此外_cǐwài_-_Besides_in_addition_20231230_她热心工作此外她对人总是非常有礼貌.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "要么...要么... (yàome... yàome...) - Either... or...",
    "short_explanation": "Used to express two or more possible alternatives or choices.",
    "long_explanation": "The Mandarin Chinese structure '要么...要么...' is used to present two or more possible options or alternatives in a situation. It's similar to the English structure 'either... or...'. This phrase is often used when the speaker wants to indicate that only one of the given options can be chosen or will happen.",
    "formation": "要么 + Option 1, 要么 + Option 2",
    "examples": [
      {
        "cn": "你要么今天来我家，要么明天来。",
        "pinyin": "Nǐ yàome jīntiān lái wǒ jiā, yàome míngtiān lái.",
        "en": "You can either come to my house today, or tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么今天来我家要么明天来.mp3"
      },
      {
        "cn": "我要么去健身房运动，要么在家休息。",
        "pinyin": "Wǒ yàome qù jiànshēnfáng yùndòng, yàome zài jiā xiūxī.",
        "en": "I will either go to the gym for a workout, or I will rest at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_我要么去健身房运动要么在家休息.mp3"
      },
      {
        "cn": "你要么专心学习，要么就离开这个教室。",
        "pinyin": "Nǐ yàome zhuānxīn xuéxí, yàome jiù líkāi zhège jiàoshì.",
        "en": "You either study with concentration, or you leave this classroom.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么专心学习要么就离开这个教室.mp3"
      },
      {
        "cn": "要么上午去公园散步，要么下午去看电影。",
        "pinyin": "Yàome shàngwǔ qù gōngyuán sànbù, yàome xiàwǔ qù kàn diànyǐng.",
        "en": "Either go to the park for a walk in the morning, or go to see a movie in the afternoon.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_要么上午去公园散步要么下午去看电影.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "与其...不如... (yǔqí... bùrú...) - Rather than... it's better to...",
    "short_explanation": "Used to express a comparative preference for one thing over another.",
    "long_explanation": "The Mandarin Chinese phrase '与其...不如...' (yǔqí... bùrú...) is used to express a preference for one action or situation over another. It is equivalent to saying 'Rather than... it's better to...' in English. It's usually used to compare two choices or alternatives, expressing that the one after '不如' is better.",
    "formation": "与其 + Action/Situation 1 + 不如 + Action/Situation 2",
    "examples": [
      {
        "cn": "与其在家里无聊，不如出去走走。",
        "pinyin": "Yǔqí zài jiā lǐ wúliáo, bùrú chūqù zǒu zǒu.",
        "en": "Rather than being bored at home, it's better to go out for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其在家里无聊不如出去走走.mp3"
      },
      {
        "cn": "与其为了小事和他争吵，不如谅解他。",
        "pinyin": "Yǔqí wèile xiǎo shì hé tā zhēngchǎo, bùrú liàngjiě tā.",
        "en": "Rather than arguing with him over small things, it's better to forgive him.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其为了小事和他争吵不如谅解他.mp3"
      },
      {
        "cn": "与其整天担心失败，不如把精力放在努力工作上。",
        "pinyin": "Yǔqí zhěngtiān dānxīn shībài, bùrú bǎ jīnglì fàng zài nǔlì gōngzuò shàng.",
        "en": "Rather than worrying about failure all day, it's better to focus your energy on working hard.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其整天担心失败不如把精力放在努力工作上.mp3"
      },
      {
        "cn": "与其浪费时间抱怨，不如行动起来改变情况。",
        "pinyin": "Yǔqí làngfèi shíjiān bàoyuàn, bùrú xíngdòng qǐlái gǎibiàn qíngkuàng.",
        "en": "Rather than wasting time complaining, it's better to take action to change the situation.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其浪费时间抱怨不如行动起来改变情况.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "根据 (gēnjù) - According to, based on",
    "short_explanation": "Used to express the source of information or basis of an action or decision.",
    "long_explanation": "The Mandarin Chinese phrase '根据 (gēnjù)' is a preposition that generally means 'according to' or 'based on'. This phrase is used to express the source or foundation from which one has obtained information, made an action or formed an opinion. It's often followed by evidence, rules, or facts.",
    "formation": "根据 + Source / Evidence / Fact + Comment / Action",
    "examples": [
      {
        "cn": "根据天气预报，明天会下雨。",
        "pinyin": "Gēnjù tiānqì yùbào, míngtiān huì xià yǔ.",
        "en": "According to the weather forecast, it will rain tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据天气预报明天会下雨.mp3"
      },
      {
        "cn": "根据我的理解，这个词的意思是'快乐'。",
        "pinyin": "Gēnjù wǒ de lǐjiě, zhège cí de yìsi shì 'kuàilè'.",
        "en": "Based on my understanding, the meaning of this word is 'happiness'.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据我的理解这个词的意思是快乐.mp3"
      },
      {
        "cn": "我们根据公司的政策更新了我们的计划。",
        "pinyin": "Wǒmen gēnjù gōngsī de zhèngcè gēngxīnle wǒmen de jìhuà.",
        "en": "We updated our plans based on the company's policy.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_我们根据公司的政策更新了我们的计划.mp3"
      },
      {
        "cn": "他根据她的脸色判断她不舒服。",
        "pinyin": "Tā gēnjù tā de liǎnsè pànduàn tā bù shūfú.",
        "en": "He judged that she was not feeling well based on her complexion.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_他根据她的脸色判断她不舒服.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "尽力 (jǐnlì) - To do one's best",
    "short_explanation": "This is used to express trying or striving to do something to the best of one's ability.",
    "long_explanation": "The Mandarin Chinese term '尽力 (jǐnlì)' is used when you want to express that you or someone else is doing their utmost or trying their best to achieve or accomplish something. It indicates a high level of effort and dedication towards a particular task or goal. This can be applied to various contexts such as doing homework, studying for an exam, running a marathon, etc.",
    "formation": "Subject + 尽力 + Verb",
    "examples": [
      {
        "cn": "我会尽力帮你解决这个问题的。",
        "pinyin": "Wǒ huì jǐnlì bāng nǐ jiějué zhège wèntí de.",
        "en": "I will do my best to help you solve this problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽力_jǐnlì_-_To_do_ones_best_20231230_我会尽力帮你解决这个问题的.mp3"
      },
      {
        "cn": "他们尽力完成了所有的任务。",
        "pinyin": "Tāmen jǐnlì wánchéngle suǒyǒu de rènwù.",
        "en": "They did their best to complete all the tasks.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽力_jǐnlì_-_To_do_ones_best_20231230_他们尽力完成了所有的任务.mp3"
      },
      {
        "cn": "为了赢得比赛，我们队尽力了。",
        "pinyin": "Wèile yíngdé bǐsài, wǒmende duì jǐnlì le.",
        "en": "Our team did its best to win the match.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽力_jǐnlì_-_To_do_ones_best_20231230_为了赢得比赛我们队尽力了.mp3"
      },
      {
        "cn": "你应该尽力学习这个新的语言。",
        "pinyin": "Nǐ yīnggāi jǐnlì xuéxí zhège xīn de yǔyán.",
        "en": "You should do your best to learn this new language.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽力_jǐnlì_-_To_do_ones_best_20231230_你应该尽力学习这个新的语言.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "除...之外 (chú... zhīwài) - Apart from, besides",
    "short_explanation": "Used to emphasize that in addition to the person or thing mentioned, there are other people or things involved.",
    "long_explanation": "'除...之外 (chú... zhīwài)' is a Mandarin Chinese grammatical structure used to indicate exception or standing out from a group. It literally translates to 'apart from' or 'besides' in English. It implies that something is not only this but also that, or someone is not only this person but also that person. It can be used with both nouns and verb phrases, and is often used in the context of making exceptions or highlighting a specific instance from a general group.",
    "formation": "(Noun/Verb Phrase) + 除...之外 + Rest of the sentence?",
    "examples": [
      {
        "cn": "除了工作之外，他还经营一家小公司。",
        "pinyin": "Chúle gōngzuò zhīwài, tā hái jīngyíng yī jiā xiǎo gōngsī.",
        "en": "Besides working, he also runs a small company.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chú_zhīwài_-_Apart_from_besides_20231230_除了工作之外他还经营一家小公司.mp3"
      },
      {
        "cn": "除了你之外，我不会喜欢别的男人。",
        "pinyin": "Chúle nǐ zhīwài, wǒ bù huì xǐhuān bié de nánrén.",
        "en": "Apart from you, I wouldn't like other men.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chú_zhīwài_-_Apart_from_besides_20231230_除了你之外我不会喜欢别的男人.mp3"
      },
      {
        "cn": "除了英语之外，他还会说法语和德语。",
        "pinyin": "Chúle yīngyǔ zhīwài, tā hái huì shuō fǎyǔ hé déyǔ.",
        "en": "He speaks French and German, in addition to English.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chú_zhīwài_-_Apart_from_besides_20231230_除了英语之外他还会说法语和德语.mp3"
      },
      {
        "cn": "除了吃和睡觉之外，猫不会做什么。",
        "pinyin": "Chúle chī hé shuìjiào zhīwài, māo bú huì zuò shénme.",
        "en": "Apart from eating and sleeping, cats don't do much.",
        "grammar_audio": "/audio/mandarin/grammar/s_除之外_chú_zhīwài_-_Apart_from_besides_20231230_除了吃和睡觉之外猫不会做什么.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "始终 (shǐzhōng) - From beginning to end, all along",
    "short_explanation": "Used to express an action or state that continuous from the first to the last without intermittence.",
    "long_explanation": "The Mandarin Chinese phrase '始终 (shǐzhōng)' is employed to describe an action or a state which continues from the first to the last without interruption. This can be something that happens 'all along', 'from beginning to end', or 'from start to finish'.",
    "formation": " 子句1 + 始终 + 子句2",
    "examples": [
      {
        "cn": "他虽然感到困惑，但是始终没有放弃学习中文。",
        "pinyin": "Tā suīrán gǎndào kùnhuò, dànshì shǐzhōng méiyǒu fàngqì xuéxí Zhōngwén.",
        "en": "Although he felt confused, he never gave up studying Chinese from beginning to end.",
        "grammar_audio": "/audio/mandarin/grammar/s_始终_shǐzhōng_-_From_beginning_to_end_all_along_20231230_他虽然感到困惑但是始终没有放弃学习中文.mp3"
      },
      {
        "cn": "我始终相信你会成功的，你必须对自己有信心。",
        "pinyin": "Wǒ shǐzhōng xiāngxìn nǐ huì chénggōng de, nǐ bìxū duì zìjǐ yǒu xìnxīn.",
        "en": "I have always believed that you will succeed, you must have confidence in yourself.",
        "grammar_audio": "/audio/mandarin/grammar/s_始终_shǐzhōng_-_From_beginning_to_end_all_along_20231230_我始终相信你会成功的你必须对自己有信心.mp3"
      },
      {
        "cn": "为了实现我的梦想，我始终都在努力。",
        "pinyin": "Wèi le shíxiàn wǒ de mèngxiǎng, wǒ shǐzhōng dōu zài nǔlì.",
        "en": "In order to achieve my dream, I have been working hard from beginning to end.",
        "grammar_audio": "/audio/mandarin/grammar/s_始终_shǐzhōng_-_From_beginning_to_end_all_along_20231230_为了实现我的梦想我始终都在努力.mp3"
      },
      {
        "cn": "她对自己的工作始终充满了热情。",
        "pinyin": "Tā duì zìjǐ de gōngzuò shǐzhōng chōngmǎnle rèqíng.",
        "en": "She is always full of passion for her work.",
        "grammar_audio": "/audio/mandarin/grammar/s_始终_shǐzhōng_-_From_beginning_to_end_all_along_20231230_她对自己的工作始终充满了热情.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "正如 (zhèngrú) - Just as, As",
    "short_explanation": "Used to express that something is exactly as stated or mentioned previously.",
    "long_explanation": "The Mandarin Chinese phrase '正如 (zhèngrú)' is an expression used to illustrate a point of comparison or similarity between two things, events, or situations. It represents the English equivalent of 'just as' or 'as'. This phrase is often used to emphasize a comparative statement or to provide an example clarifying an earlier statement.",
    "formation": "正如 + Statement 1, (so) Sentence 2",
    "examples": [
      {
        "cn": "正如你所说，学习中文需要耐心和毅力。",
        "pinyin": "Zhèngrú nǐ suǒ shuō, xuéxí Zhōngwén xūyào nàixīn hé yìlì.",
        "en": "As you said, learning Chinese requires patience and perseverance.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_As_20231230_正如你所说学习中文需要耐心和毅力.mp3"
      },
      {
        "cn": "正如他们所预期的那样，公司的销售额去年增长了20％。",
        "pinyin": "Zhèngrú tāmen suǒ yùqí de nà yàng, gōngsī de xiāoshòu'é qùnián zēngzhǎng le 20％.",
        "en": "Just as they expected, the company's sales increased by 20% last year.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_As_20231230_正如他们所预期的那样公司的销售额去年增长了20％.mp3"
      },
      {
        "cn": "正如我之前提到的，我们必须要提高产品的质量。",
        "pinyin": "Zhèngrú wǒ zhīqián tí dào de, wǒmen bìxū yào tígāo chǎnpǐn de zhìliàng.",
        "en": "As I mentioned earlier, we need to improve the quality of our products.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_As_20231230_正如我之前提到的我们必须要提高产品的质量.mp3"
      },
      {
        "cn": "正如大部分人所知，抽烟对健康有害。",
        "pinyin": "Zhèngrú dà bùfèn rén suǒ zhī, chōuyān duì jiànkāng yǒuhài.",
        "en": "As is known by most people, smoking is harmful to health.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_As_20231230_正如大部分人所知抽烟对健康有害.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "正巧 (zhèngqiǎo) - Coincidentally, just in time",
    "short_explanation": "Used to express a coincidence or a situation happening perfectly on time.",
    "long_explanation": "The Mandarin Chinese word '正巧 (zhèngqiǎo)' is used when you want to convey the sense of a situation occurring coincidentally or something happening just at the right timing. It's equivalent to saying 'coincidentally' or 'just in time' in English. Usually, it's used for unexpected but well-timed events.",
    "formation": "Subject + 正巧 + Verb/Action + Rest of the Sentence",
    "examples": [
      {
        "cn": "我正在找他, 他正巧也在找我。",
        "pinyin": "Wǒ zhèngzài zhǎo tā, tā zhèng qiǎo yě zài zhǎo wǒ.",
        "en": "I was looking for him, and coincidentally, he was also looking for me.",
        "grammar_audio": "/audio/mandarin/grammar/s_正巧_zhèngqiǎo_-_Coincidentally_just_in_time_20231230_我正在找他_他正巧也在找我.mp3"
      },
      {
        "cn": "我正巧到家, 电话就响了。",
        "pinyin": "Wǒ zhèng qiǎo dào jiā, diànhuà jiù xiǎng le.",
        "en": "I just got home when the phone rang.",
        "grammar_audio": "/audio/mandarin/grammar/s_正巧_zhèngqiǎo_-_Coincidentally_just_in_time_20231230_我正巧到家_电话就响了.mp3"
      },
      {
        "cn": "你来得正巧, 我们正在讨论你的计划。",
        "pinyin": "Nǐ lái de zhèng qiǎo, wǒmen zhèngzài tǎolùn nǐ de jìhuà.",
        "en": "You came just in time, we were discussing your plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_正巧_zhèngqiǎo_-_Coincidentally_just_in_time_20231230_你来得正巧_我们正在讨论你的计划.mp3"
      },
      {
        "cn": "我正打算去书店,正巧我妹妹也要去。",
        "pinyin": "Wǒ zhèng dǎsuàn qù shūdiàn, zhèng qiǎo wǒ mèimei yě yào qù.",
        "en": "I was just planning to go to the bookstore, coincidentally my sister also wanted to go.",
        "grammar_audio": "/audio/mandarin/grammar/s_正巧_zhèngqiǎo_-_Coincidentally_just_in_time_20231230_我正打算去书店正巧我妹妹也要去.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "若是 (ruòshì) - If, in case",
    "short_explanation": "Used to express conditions or hypothetical scenarios.",
    "long_explanation": "The Mandarin Chinese phrase '若是 (ruòshì)' is a useful term equivalent to 'if' or 'in case' in English. This phrase is typically used to introduce a condition or hypothetical scenario, followed by the consequence or result that would occur if the condition was met or the scenario took place.",
    "formation": "若是 + Condition, (then) + Result",
    "examples": [
      {
        "cn": "若是你有时间，我们可以一起去看电影。",
        "pinyin": "Ruòshì nǐ yǒu shíjiān, wǒmen kěyǐ yīqǐ qù kàn diànyǐng.",
        "en": "If you have time, we can go to watch a movie together.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是你有时间我们可以一起去看电影.mp3"
      },
      {
        "cn": "若是明天下雨，比赛可能会被取消。",
        "pinyin": "Ruòshì míngtiān xiàyǔ, bǐsài kěnéng huì bèi qǔxiāo.",
        "en": "If it rains tomorrow, the match might be cancelled.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是明天下雨比赛可能会被取消.mp3"
      },
      {
        "cn": "若是你不回来，我就自己去。",
        "pinyin": "Ruòshì nǐ bù huílái, wǒ jiù zìjǐ qù.",
        "en": "If you don't come back, I'll go by myself.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是你不回来我就自己去.mp3"
      },
      {
        "cn": "若是他问你，你告诉他真相。",
        "pinyin": "Ruòshì tā wèn nǐ, nǐ gàosu tā zhēnxiàng.",
        "en": "If he asks you, tell him the truth.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是他问你你告诉他真相.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "75"
  },
  {
    "title": "与其说...不如说... (yǔqí shuō... bùrú shuō...) - Rather than saying... it's better to say...",
    "short_explanation": "This pattern expresses that 'it is better to say... than to say...', implying that the second statement is more fitting or accurate than the first one.",
    "long_explanation": "在中文中，'与其说...不如说...'这个句型用于表述两种事实或者观点，它表明第二个陈述比第一个更加恰当或者准确。这是一种修辞手法，用来强调一个比较微妙或具有争议性的点。",
    "formation": "与其说 + Statement A + 不如说 + Statement B",
    "examples": [
      {
        "cn": "与其说他是绘画爱好者，不如说他是一个专业的画家。",
        "pinyin": "yǔqí shuō tā shì huìhuà àihào zhě, bùrú shuō tā shì yīgè zhuānyè de huàjiā.",
        "en": "Rather than saying he is a painting enthusiast, it's better to say he is a professional painter.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其说不如说_yǔqí_shuō_bùrú_shuō_-_Rather_than_saying_its_better_to_say_20231230_与其说他是绘画爱好者不如说他是一个专业的画家.mp3"
      },
      {
        "cn": "与其说我是在读书，不如说我是在通过书本了解世界。",
        "pinyin": "yǔqí shuō wǒ shì zài dúshū, bùrú shuō wǒ shì zài tōngguò shūběn liǎojiě shìjiè.",
        "en": "Rather than saying I am reading, it's better to say I am understanding the world through books.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其说不如说_yǔqí_shuō_bùrú_shuō_-_Rather_than_saying_its_better_to_say_20231230_与其说我是在读书不如说我是在通过书本了解世界.mp3"
      },
      {
        "cn": "与其说这是一个问题的解决方案，不如说这是一个避免问题的策略。",
        "pinyin": "yǔqí shuō zhè shì yīgè wèntí de jiějué fāng'àn, bùrú shuō zhè shì yīgè bìmiǎn wèntí de cèlüè.",
        "en": "Rather than saying this is a solution to a problem, it's better to say it is a strategy to avoid the problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其说不如说_yǔqí_shuō_bùrú_shuō_-_Rather_than_saying_its_better_to_say_20231230_与其说这是一个问题的解决方案不如说这是一个避免问题的策略.mp3"
      },
      {
        "cn": "与其说他对音乐感兴趣，不如说音乐是他的生命。",
        "pinyin": "yǔqí shuō tā duì yīnyuè gǎn xìngqù, bùrú shuō yīnyuè shì tā de shēngmìng.",
        "en": "Rather than saying he is interested in music, it's better to say music is his life.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其说不如说_yǔqí_shuō_bùrú_shuō_-_Rather_than_saying_its_better_to_say_20231230_与其说他对音乐感兴趣不如说音乐是他的生命.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "凭 (píng) - Rely on, according to",
    "short_explanation": "Used to express the basis or standard of something or the means by which something is done.",
    "long_explanation": "The Mandarin Chinese term '凭 (píng)' is often employed to denote the basis or standard of a certain process or conclusion. It is equivalent to 'rely on', 'according to' or 'based on' in English and is used to express the means by which something is accomplished or performed or the criterion used for judgment or decision making.",
    "formation": "凭 + Noun/Verb Phrase + Verb/Adjective + Object/Result",
    "examples": [
      {
        "cn": "我凭良心说，我并没有做错任何事情。",
        "pinyin": "Wǒ píng liángxīn shuō, wǒ bìng méiyǒu zuò cuò rènhé shìqíng.",
        "en": "I declare in good conscience that I have done nothing wrong.",
        "grammar_audio": "/audio/mandarin/grammar/s_凭_píng_-_Rely_on_according_to_20231230_我凭良心说我并没有做错任何事情.mp3"
      },
      {
        "cn": "你不能光凭外表去评价一个人。",
        "pinyin": "Nǐ bùnéng guāng píng wàibiǎo qù píngjià yīgè rén.",
        "en": "You cannot assess a person just based on their appearance.",
        "grammar_audio": "/audio/mandarin/grammar/s_凭_píng_-_Rely_on_according_to_20231230_你不能光凭外表去评价一个人.mp3"
      },
      {
        "cn": "他凭票可以不花钱进电影院看电影。",
        "pinyin": "Tā píng piào kěyǐ bù huā qián jìn diànyǐngyuàn kàn diànyǐng.",
        "en": "He can enter the cinema to watch a movie for free with his ticket.",
        "grammar_audio": "/audio/mandarin/grammar/s_凭_píng_-_Rely_on_according_to_20231230_他凭票可以不花钱进电影院看电影.mp3"
      },
      {
        "cn": "我凭记忆绘制出了这幅地图。",
        "pinyin": "Wǒ píng jìyì huìzhì chūle zhè fú dìtú.",
        "en": "I drew this map from memory.",
        "grammar_audio": "/audio/mandarin/grammar/s_凭_píng_-_Rely_on_according_to_20231230_我凭记忆绘制出了这幅地图.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "连...都/也... (lián... dōu/yě...) - Even...",
    "short_explanation": "This structure is used to express unexpected situations or emphasize the degree of something.",
    "long_explanation": "The phrase 连...都/也... is a common sentence pattern in Mandarin Chinese. It's used when the speaker wants to emphasize an unexpected situation, or that something is true to such a degree that it even applies to the person or thing being talked about. The sentence structure '连...都/也...' is often translated in English as 'even...' and is generally used to highlight the scope or extent of a particular situation.",
    "formation": "连 + Object + 都/也 + Predicate",
    "examples": [
      {
        "cn": "这个问题连我都不会回答，更不用说你了。",
        "pinyin": "Zhè ge wèntí lián wǒ dōu bù huì huídá, gèng bùyòng shuō nǐ le.",
        "en": "Even I can't answer this question, let alone you.",
        "grammar_audio": "/audio/mandarin/grammar/s_连都/也_lián_dōu/yě_-_Even_20231230_这个问题连我都不会回答更不用说你了.mp3"
      },
      {
        "cn": "他连早餐也不吃就去上班了。",
        "pinyin": "Tā lián zǎocān yě bú chī jiù qù shàngbān le.",
        "en": "He went to work without even eating breakfast.",
        "grammar_audio": "/audio/mandarin/grammar/s_连都/也_lián_dōu/yě_-_Even_20231230_他连早餐也不吃就去上班了.mp3"
      },
      {
        "cn": "连老师都没看懂那个数学题。",
        "pinyin": "Lián lǎoshī dōu méi kàn dǒng nà ge shùxué tímù.",
        "en": "Even the teacher didn't understand that math problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_连都/也_lián_dōu/yě_-_Even_20231230_连老师都没看懂那个数学题.mp3"
      },
      {
        "cn": "他连一杯水都不让我喝。",
        "pinyin": "Tā lián yī bēi shuǐ dōu bù ràng wǒ hē.",
        "en": "He wouldn't even let me have a glass of water.",
        "grammar_audio": "/audio/mandarin/grammar/s_连都/也_lián_dōu/yě_-_Even_20231230_他连一杯水都不让我喝.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "何必 (hébì) - Why should, why must",
    "short_explanation": "Used to question the necessity or need to do something.",
    "long_explanation": "The Mandarin Chinese phrase '何必 (hébì)' is often used to express doubt or question the necessity of a certain action or situation. It translates to 'why should' or 'why must' in English, and is typically used in rhetorical questions, suggesting that something is unnecessary or avoidable.",
    "formation": "何必 + Action/Event?",
    "examples": [
      {
        "cn": "何必为了那么小的事情而生气？",
        "pinyin": "Hébì wèile nàme xiǎo de shìqíng ér shēngqì?",
        "en": "Why should you get angry over such a small thing?",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_must_20231230_何必为了那么小的事情而生气.mp3"
      },
      {
        "cn": "何必跑那么远的地方去买东西？我们这里的商店也有。",
        "pinyin": "Hébì pǎo nàme yuǎn de dìfang qù mǎi dōngxi? Wǒmen zhèlǐ de shāngdiàn yě yǒu.",
        "en": "Why should you go so far to buy things? We also have them in our local store.",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_must_20231230_何必跑那么远的地方去买东西我们这里的商店也有.mp3"
      },
      {
        "cn": "你何必去参加那个没意义的会议？",
        "pinyin": "Nǐ hébì qù cānjiā nàgè méiyìyì de huìyì?",
        "en": "Why should you attend that meaningless meeting?",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_must_20231230_你何必去参加那个没意义的会议.mp3"
      },
      {
        "cn": "他何必每天工作到很晚，又疲劳又压力大？",
        "pinyin": "Tā hébì měitiān gōngzuò dào hěn wǎn, yòu píláo yòu yālì dà?",
        "en": "Why should he work until late every day, feeling both tired and stressed?",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_must_20231230_他何必每天工作到很晚又疲劳又压力大.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "除非...否则... (chúfēi... fǒuzé...) - Unless... otherwise...",
    "short_explanation": "Used to express 'unless' or 'only if' in a condition, followed by an inevitable result or a consequence.",
    "long_explanation": "The Mandarin Chinese grammar point '除非...否则...' is nearly equivalent to 'unless... otherwise...' in English. '除非' presents a condition or situation, while '否则' presents the consequences if the condition mentioned isn't met or fulfilled. It is used to express the idea that only if the condition presented by '除非' happens, the resultant effects presented by '否则' won't happen.",
    "formation": "除非 + Condition/A, 否则 + Consequence/B",
    "examples": [
      {
        "cn": "除非你把作业写完，否则不能看电视。",
        "pinyin": "Chúfēi nǐ bǎ zuòyè xiě wán, fǒuzé bù néng kàn diànshì.",
        "en": "Unless you finish your homework, you can't watch TV.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你把作业写完否则不能看电视.mp3"
      },
      {
        "cn": "除非你告诉我真相，否则我不会原谅你。",
        "pinyin": "Chúfēi nǐ gàosù wǒ zhēnxiàng, fǒuzé wǒ bù huì yuánliàng nǐ.",
        "en": "Unless you tell me the truth, I will not forgive you.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你告诉我真相否则我不会原谅你.mp3"
      },
      {
        "cn": "除非你穿上雨衣，否则你会淋湿。",
        "pinyin": "Chúfēi nǐ chuān shàng yǔ yī, fǒuzé nǐ huì lín shī.",
        "en": "Unless you put on your raincoat, you will get wet.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你穿上雨衣否则你会淋湿.mp3"
      },
      {
        "cn": "除非你好好学习，否则你不可能通过这次考试。",
        "pinyin": "Chúfēi nǐ hǎohào xuéxí, fǒuzé nǐ bù kěnéng tōngguò zhè cì kǎoshì.",
        "en": "Unless you study well, you can't possibly pass this exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你好好学习否则你不可能通过这次考试.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "只要...就... (zhǐyào... jiù...) - As long as... then...",
    "short_explanation": "Used to express the condition and result.",
    "long_explanation": "The Mandarin Chinese construction '只要...就...' is used to denote conditions and results. It means 'as long as' or 'provided that,' often introducing a necessary condition (following 只要) and a resulting action or situation (following 就). The condition is stated after '只要,' and the result or consequence is stated after '就.'",
    "formation": "'只要' + Condition + '就' + Result",
    "examples": [
      {
        "cn": "只要你努力学习，就能通过汉语水平考试。",
        "pinyin": "Zhǐyào nǐ nǔlì xuéxí, jiù néng tōngguò Hànyǔ shuǐpíng kǎoshì.",
        "en": "As long as you study hard, you can pass the Chinese Proficiency Test.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你努力学习就能通过汉语水平考试.mp3"
      },
      {
        "cn": "只要你保持健康的生活方式，就可以维持良好的身体健康。",
        "pinyin": "Zhǐyào nǐ bǎochí jiànkāng de shēnghuó fāngshì, jiù kěyǐ wéichí liánghǎo de shēntǐ jiànkāng.",
        "en": "As long as you maintain a healthy lifestyle, you can maintain good physical health.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你保持健康的生活方式就可以维持良好的身体健康.mp3"
      },
      {
        "cn": "只要我们坚持下去，就会看到成功的那一天。",
        "pinyin": "Zhǐyào wǒmen jiānchí xiàqù, jiù huì kàn dào chénggōng de nà yītiān.",
        "en": "As long as we keep going, we will see the day of success.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要我们坚持下去就会看到成功的那一天.mp3"
      },
      {
        "cn": "只要天气好，我们就去公园散步。",
        "pinyin": "Zhǐyào tiānqì hǎo, wǒmen jiù qù gōngyuán sànbù.",
        "en": "As long as the weather is good, we will go for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要天气好我们就去公园散步.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "尽管...但是... (jǐnguǎn... dànshì...) - Although... but...",
    "short_explanation": "Used to express the contrast between two situations.",
    "long_explanation": "The Mandarin Chinese phrase '尽管...但是... (jǐnguǎn... dànshì...)' is used to express two contrasting situations or facts. The first part of sentence after '尽管' expresses a condition, and the part after '但是' presents a contrast or exception to the first part. It is equivalent to 'although... but...' in English.",
    "formation": "尽管 + Statement 1, 但是 + Statement 2",
    "examples": [
      {
        "cn": "尽管他非常忙碌，但是他还是决定帮助我完成这个项目。",
        "pinyin": "Jǐnguǎn tā fēicháng mánglù, dànshì tā háishì juédìng bāngzhù wǒ wánchéng zhège xiàngmù.",
        "en": "Although he is very busy, he still decided to help me complete this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管他非常忙碌但是他还是决定帮助我完成这个项目.mp3"
      },
      {
        "cn": "尽管外面正在下雨，但是我们还是去公园散步了。",
        "pinyin": "Jǐnguǎn wàimiàn zhèngzài xià yǔ, dànshì wǒmen háishì qù gōngyuán sànbù le.",
        "en": "Although it is raining outside, we still went for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管外面正在下雨但是我们还是去公园散步了.mp3"
      },
      {
        "cn": "尽管你穿得很保暖，但是在这样的寒冷天气里，你还是会感到冷。",
        "pinyin": "Jǐnguǎn nǐ chuān dé hěn bǎonuǎn, dànshì zài zhèyàng de hánlěng tiānqì lǐ, nǐ háishi huì gǎndào lěng.",
        "en": "Although you're dressed very warmly, you will still feel cold in such cold weather.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管你穿得很保暖但是在这样的寒冷天气里你还是会感到冷.mp3"
      },
      {
        "cn": "尽管她失败了很多次，但是她仍然坚持不放弃。",
        "pinyin": "Jǐnguǎn tā shībài le hěnduō cì, dànshì tā réngrán jiānchí bù fàngqì.",
        "en": "Although she has failed many times, she still insists on not giving up.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管她失败了很多次但是她仍然坚持不放弃.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "不得不 (bùdébù) - Have to, can't help but",
    "short_explanation": "Used to express something that is inevitable or unavoidable.",
    "long_explanation": "The Mandarin Chinese phrase '不得不 (bùdébù)' is used to express the necessity or inevitability of an action or situation. This phrase is equivalent to 'have to' or 'cannot help but' in English. It is used to describe situations or actions that are not able to be avoided or that have to occur, regardless of personal preference or other factors.",
    "formation": "Subject + 不得不 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "我不得不承认，他的观点非常精确。",
        "pinyin": "Wǒ bùdébù chéngrèn, tā de guāndiǎn fēicháng jīngquè.",
        "en": "I have to admit, his view is very precise.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_我不得不承认他的观点非常精确.mp3"
      },
      {
        "cn": "因为下雨，我们不得不取消野餐。",
        "pinyin": "Yīn wèi xiàyǔ, wǒmén bùdébù qǔxiāo yěcān.",
        "en": "Because it's raining, we have to cancel the picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_因为下雨我们不得不取消野餐.mp3"
      },
      {
        "cn": "她不得不早点离开派对，因为她明天早上有一个重要的会议。",
        "pinyin": "Tā bùdébù zǎodiǎn líkāi pàiduì, yīnwèi tā míngtiān zǎoshang yǒu yīgè zhòngyào de huìyì.",
        "en": "She can't help but leave the party early, because she has an important meeting tomorrow morning.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_她不得不早点离开派对因为她明天早上有一个重要的会议.mp3"
      },
      {
        "cn": "我不得不早点睡觉，因为我明天要早起。",
        "pinyin": "Wǒ bùdébù zǎodiǎn shuìjiào, yīnwèi wǒ míngtiān yào zǎo qǐ.",
        "en": "I have to go to bed early, because I have to get up early tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_不得不_bùdébù_-_Have_to_cant_help_but_20231230_我不得不早点睡觉因为我明天要早起.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "既然 (jìrán) - Since, given that",
    "short_explanation": "Used to indicate the reasoning for a situation or action based on an existing fact or condition.",
    "long_explanation": "The Mandarin Chinese expression '既然 (jìrán)' is used to refer to an existing fact or condition and based on that, to provide a logical reason for a certain situation or action. It is similar to 'since' or 'given that' in English.",
    "formation": "既然 + Fact/Cause, Subject + should/need to + Verb/Action",
    "examples": [
      {
        "cn": "既然明天是假日，我们应该去公园散散步。",
        "pinyin": "Jìrán míngtiān shì jiàrì, wǒmen yīnggāi qù gōngyuán sànsànbù.",
        "en": "Since tomorrow is a holiday, we should go to the park for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然明天是假日我们应该去公园散散步.mp3"
      },
      {
        "cn": "既然你已经决定要去留学，那你就应该努力学习中文。",
        "pinyin": "Jìrán nǐ yǐjīng juédìng yào qù liúxué, nà nǐ jiù yīnggāi nǔlì xuéxí zhōngwén.",
        "en": "Since you have decided to study abroad, you should study Chinese hard.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然你已经决定要去留学那你就应该努力学习中文.mp3"
      },
      {
        "cn": "既然你不喜欢这家餐馆的菜，为什么还要来？",
        "pinyin": "Jìrán nǐ bù xǐhuān zhè jiā cānguǎn de cài, wèishénme hái yào lái?",
        "en": "Since you don't like the food at this restaurant, why are you still coming?",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然你不喜欢这家餐馆的菜为什么还要来.mp3"
      },
      {
        "cn": "既然天气这么冷，我们就应该多穿点儿衣服。",
        "pinyin": "Jìrán tiānqì zhème lěng, wǒmen jiù yīnggāi duō chuān diǎnr yīfu.",
        "en": "Since it's so cold, we should wear more clothes.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然天气这么冷我们就应该多穿点儿衣服.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "无论...都... (wúlùn... dōu...) - No matter... all...",
    "short_explanation": "Used to express a universal condition or conclusion regardless of varying circumstances.",
    "long_explanation": "The Mandarin Chinese phrase '无论...都...' (wúlùn... dōu...) is used to indicate that no matter the situation or condition, the conclusion or result stays the same. It can be translated into English as 'no matter...all...'. It allows a speaker to express assertive totality about a condition or outcome.",
    "formation": "无论 + Condition/Subject + 都 + Outcome/Result",
    "examples": [
      {
        "cn": "无论天气好不好，我们都要去爬山。",
        "pinyin": "Wúlùn tiānqì hǎo bú hǎo, wǒmen dōu yào qù páshān.",
        "en": "No matter whether the weather is good or not, we are going to climb the mountain.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_all_20231230_无论天气好不好我们都要去爬山.mp3"
      },
      {
        "cn": "无论你去不去，我都会去那个派对。",
        "pinyin": "Wúlùn nǐ qù bù qù, wǒ dōu huì qù nàge pàiduì.",
        "en": "No matter whether you go or not, I will go to that party.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_all_20231230_无论你去不去我都会去那个派对.mp3"
      },
      {
        "cn": "无论成绩好坏，都应该对自己有信心。",
        "pinyin": "Wúlùn chéngjī hǎo huài, dōu yīnggāi duì zìjǐ yǒu xìnxīn.",
        "en": "No matter whether the grades are good or bad, one should have confidence in themselves.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_all_20231230_无论成绩好坏都应该对自己有信心.mp3"
      },
      {
        "cn": "无论工作多么忙，我都会找时间去健身房。",
        "pinyin": "Wúlùn gōngzuò duōme máng, wǒ dōu huì zhǎo shíjiān qù jiànshēnfáng.",
        "en": "No matter how busy I am with work, I will find time to go to the gym.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_all_20231230_无论工作多么忙我都会找时间去健身房.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "无非 (wúfēi) - Nothing but, merely",
    "short_explanation": "Used to highlight that something is not more than what is being stated.",
    "long_explanation": "The Mandarin Chinese phrase '无非 (wúfēi)' is used to express 'nothing but' or 'merely'. It is used to specify the limit or simplicity of something, minimizing the complexity, diversity, or gravity by suggesting it is nothing beyond the given explanation. '无非' often functions as an adverb to modify the following sentence.",
    "formation": "Subject + 无非 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他无非是想要多争取一点时间。",
        "pinyin": "Tā wúfēi shì xiǎngyào duō zhēngqǔ yīdiǎn shíjiān.",
        "en": "He is merely trying to gain a little more time.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_merely_20231230_他无非是想要多争取一点时间.mp3"
      },
      {
        "cn": "她无非想让我们开心一点。",
        "pinyin": "Tā wúfēi xiǎng ràng wǒmen kāixīn yīdiǎn.",
        "en": "She merely wants to make us a bit happier.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_merely_20231230_她无非想让我们开心一点.mp3"
      },
      {
        "cn": "典型的柠檬汽水无非就是含有柠檬和糖。",
        "pinyin": "Diǎnxíng de níngméng qìshuǐ wúfēi jiùshì hán yǒu níngméng hé táng.",
        "en": "Typical lemon soda is nothing but contains lemon and sugar.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_merely_20231230_典型的柠檬汽水无非就是含有柠檬和糖.mp3"
      },
      {
        "cn": "这无非是一个基本的常识问题。",
        "pinyin": "Zhè wúfēi shì yīgè jīběn de chángshí wèntí.",
        "en": "This is nothing but a basic common sense issue.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_merely_20231230_这无非是一个基本的常识问题.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "难道 (nándào) - Could it be that, is it possible",
    "short_explanation": "Used to express doubt, disbelief, surprise or rhetorical questions.",
    "long_explanation": "The Mandarin Chinese phrase '难道 (nándào)' is used to indicate disbelief, doubt, surprise or to pose rhetorical questions. This phrase essentially infers 'Could it be that' or 'Is it possible' in English. It puts strong emphasis on the sentiment of the speaker, usually exhibiting shock or disbelief about a certain event or circumstances. Unlike normal questions, sentences with '难道' do not necessarily expect for an answer.",
    "formation": "难道 + Sentence",
    "examples": [
      {
        "cn": "难道你不知道今天是我的生日吗？",
        "pinyin": "Nándào nǐ bù zhīdào jīntiān shì wǒ de shēngrì ma?",
        "en": "Could it be that you didn't know today is my birthday?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_is_it_possible_20231230_难道你不知道今天是我的生日吗.mp3"
      },
      {
        "cn": "难道你不喜欢吃巧克力吗？",
        "pinyin": "Nándào nǐ bù xǐhuān chī qiǎokèlì ma?",
        "en": "Is it possible that you don't like eating chocolate?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_is_it_possible_20231230_难道你不喜欢吃巧克力吗.mp3"
      },
      {
        "cn": "难道他真的没有告诉你这个消息吗？",
        "pinyin": "Nándào tā zhēn de méiyǒu gàosù nǐ zhège xiāoxi ma?",
        "en": "Could it be that he really didn't tell you this news?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_is_it_possible_20231230_难道他真的没有告诉你这个消息吗.mp3"
      },
      {
        "cn": "难道你还没完成你的作业吗？",
        "pinyin": "Nándào nǐ hái méi wánchéng nǐ de zuòyè ma?",
        "en": "Is it possible that you still haven't finished your homework?",
        "grammar_audio": "/audio/mandarin/grammar/s_难道_nándào_-_Could_it_be_that_is_it_possible_20231230_难道你还没完成你的作业吗.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "假如 (jiǎrú) - If, supposing",
    "short_explanation": "Used to present a hypothetical condition or fact.",
    "long_explanation": "The Mandarin Chinese phrase '假如 (jiǎrú)' serves the purpose of introducing a condition or a fact that is hypothetical or yet to happen. It translates to 'if' or 'supposing' in English. In other words, '假如' is used when we want to propose a scenario and infer the result of it.",
    "formation": "假如 + Subject + Verb/Adjective, + (then) Outcome",
    "examples": [
      {
        "cn": "假如你每天读一小时的书，你的词汇量肯定会大大提升。",
        "pinyin": "Jiǎrú nǐ měitiān dú yī xiǎoshí de shū, nǐ de cíhuì liàng kěndìng huì dà dà tíshēng.",
        "en": "If you read books for an hour each day, your vocabulary will surely improve significantly.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如你每天读一小时的书你的词汇量肯定会大大提升.mp3"
      },
      {
        "cn": "假如他来北京，我们可以一起去长城游玩。",
        "pinyin": "Jiǎrú tā lái běijīng, wǒmen kěyǐ yīqǐ qù chángchéng yóuwán.",
        "en": "If he comes to Beijing, we can go to visit the Great Wall together.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如他来北京我们可以一起去长城游玩.mp3"
      },
      {
        "cn": "假如今天下雨，我们的野餐可能要取消。",
        "pinyin": "Jiǎrú jīntiān xiàyǔ, wǒmen de yěcān kěnéng yào qǔxiāo.",
        "en": "If it rains today, our picnic might have to be cancelled.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如今天下雨我们的野餐可能要取消.mp3"
      },
      {
        "cn": "假如我当初没有学习中文，我可能就没有机会在中国工作了。",
        "pinyin": "Jiǎrú wǒ dāngchū méiyǒu xuéxí Zhōngwén, wǒ kěnéng jiù méiyǒu jīhuì zài Zhōngguó gōngzuò le.",
        "en": "If I hadn't learned Chinese before, I might not have had the opportunity to work in China.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_If_supposing_20231230_假如我当初没有学习中文我可能就没有机会在中国工作了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "即使...也... (jíshǐ... yě...) - Even if... still...",
    "short_explanation": "Used to express that some condition or situation doesn't affect the outcome.",
    "long_explanation": "The Mandarin Chinese structure '即使... 也...' is similar to the English 'even if... still...' It is used to convey that irrespective of a certain condition or situation, the result remains the same. The situation or condition is put after '即使' and the result or action is placed after '也'.",
    "formation": "即使 + Condition/Situation + 也 + Result/Action ",
    "examples": [
      {
        "cn": "即使下雨，我们也要去公园看花。",
        "pinyin": "Jíshǐ xià yǔ, wǒmen yě yào qù gōngyuán kàn huā.",
        "en": "Even if it rains, we still want to go to the park to see flowers.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使也_jíshǐ_yě_-_Even_if_still_20231230_即使下雨我们也要去公园看花.mp3"
      },
      {
        "cn": "即使我很忙，我也会找时间帮助你完成作业。",
        "pinyin": "Jíshǐ wǒ hěn máng, wǒ yě huì zhǎo shíjiān bāngzhù nǐ wánchéng zuòyè.",
        "en": "Even if I am very busy, I will still find time to help you complete the homework.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使也_jíshǐ_yě_-_Even_if_still_20231230_即使我很忙我也会找时间帮助你完成作业.mp3"
      },
      {
        "cn": "即使明天是个大风天，我也会按时到达那里。",
        "pinyin": "Jíshǐ míngtiān shì gè dà fēng tiān, wǒ yě huì ànshí dàodá nàlǐ.",
        "en": "Even if there is a big wind tomorrow, I will still arrive there on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使也_jíshǐ_yě_-_Even_if_still_20231230_即使明天是个大风天我也会按时到达那里.mp3"
      },
      {
        "cn": "即使大家都不同意他的观点，他也坚持自己的看法。",
        "pinyin": "Jíshǐ dàjiā dōu bùtóngyì tā de guāndiǎn, tā yě jiānchí zìjǐ de kànfǎ.",
        "en": "Even if everyone disagrees with his point of view, he still sticks to his own opinion.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使也_jíshǐ_yě_-_Even_if_still_20231230_即使大家都不同意他的观点他也坚持自己的看法.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "唯有 (wéiyǒu) - Only have, only",
    "short_explanation": "Used to emphasize that only one specific thing or person can fulfill a certain condition or requirement.",
    "long_explanation": "The Mandarin Chinese phrase '唯有 (wéiyǒu)' is used to emphasize exclusivity, indicating that only a particular thing, item, individual, or action can satisfy a certain condition or requirement, or bring about a specific result. It is similar to the English expression 'only have' or simply 'only'. The phrase '唯有' can lead either a noun (e.g., only you, only this book) or a verb phrase (e.g., only by doing this).",
    "formation": "唯有 + Noun/Verb Phrase + Rest of the sentence",
    "examples": [
      {
        "cn": "唯有勤奋的学习，才能取得考试的成功。",
        "pinyin": "Wéiyǒu qínfèn de xuéxí, cáinéng qǔdé kǎoshì de chénggōng.",
        "en": "Only by diligent study can one achieve success in exams.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_have_only_20231230_唯有勤奋的学习才能取得考试的成功.mp3"
      },
      {
        "cn": "唯有通过大量阅读，我们才能扩大词汇量。",
        "pinyin": "Wéiyǒu tōngguò dàliàng yuèdú, wǒmen cáinéng kuòdà cíhuìliàng.",
        "en": "Only through a great deal of reading can we expand our vocabulary.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_have_only_20231230_唯有通过大量阅读我们才能扩大词汇量.mp3"
      },
      {
        "cn": "唯有你能理解我的痛苦。",
        "pinyin": "Wéiyǒu nǐ néng lǐjiě wǒ de tòngkǔ.",
        "en": "Only you can understand my pain.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_have_only_20231230_唯有你能理解我的痛苦.mp3"
      },
      {
        "cn": "唯有爱能战胜恨。",
        "pinyin": "Wéiyǒu ài néng zhànshèng hèn.",
        "en": "Only love can conquer hate.",
        "grammar_audio": "/audio/mandarin/grammar/s_唯有_wéiyǒu_-_Only_have_only_20231230_唯有爱能战胜恨.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "不如 (bùrú) - Not as good as, inferior to",
    "short_explanation": "Used to compare two things and express that the first is not as good as the second.",
    "long_explanation": "The Mandarin Chinese word '不如 (bùrú)' is a comparative term used to compare one thing with another and express an opinion that the first thing is not as good as or inferior to the second. This term is used to clearly compare various aspects such as abilities, things, situations, etc. It is basically equivalent to the English phrase 'not as good as' or 'inferior to'.",
    "formation": "Subject + 不如 + comparative object + rest of sentence.",
    "examples": [
      {
        "cn": "我的中文水平不如他的好，所以我需要更多的练习。",
        "pinyin": "Wǒ de Zhōngwén shuǐpíng bùrú tā de hǎo, suǒyǐ wǒ xūyào gèng duō de liànxí.",
        "en": "My Chinese level is not as good as his, so I need more practice.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_我的中文水平不如他的好所以我需要更多的练习.mp3"
      },
      {
        "cn": "这个餐厅的食物不如那个餐厅的美味。",
        "pinyin": "Zhège cāntīng de shíwù bùrú nàge cāntīng de měiwèi.",
        "en": "The food in this restaurant is not as delicious as in that restaurant.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_这个餐厅的食物不如那个餐厅的美味.mp3"
      },
      {
        "cn": "不如我们去看电影放松一下吧，而不是在家里做作业。",
        "pinyin": "Bùrú wǒmen qù kàn diànyǐng fàngsōng yīxià ba, ér bùshì zài jiā lǐ zuò zuòyè.",
        "en": "How about we go to see a movie and relax instead of doing homework at home?",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_不如我们去看电影放松一下吧而不是在家里做作业.mp3"
      },
      {
        "cn": "这个城市的气候不如那个城市的舒适。",
        "pinyin": "Zhège chéngshì de qìhòu bùrú nàge chéngshì de shūshì.",
        "en": "The climate in this city is not as comfortable as in that city.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_这个城市的气候不如那个城市的舒适.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "逐渐 (zhújiàn) - Gradually",
    "short_explanation": "Used to indicate that something is happening gradually over a period of time.",
    "long_explanation": "The Mandarin Chinese term '逐渐 (zhújiàn)' is used to describe something occurring gradually or bit by bit over a certain timeline. It is equivalent to 'gradually' or 'increasingly' in English. This term is often used to describe changes that do not occur instantly, but rather unfold over time.",
    "formation": "Subject + 逐渐 + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "春天来了，天气也逐渐暖和起来了。",
        "pinyin": "Chūntiān lái le, tiānqì yě zhújiàn nuǎn hé qǐlái le.",
        "en": "Spring has come, and the weather is gradually getting warmer.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_春天来了天气也逐渐暖和起来了.mp3"
      },
      {
        "cn": "通过不断的努力，她逐渐提高了她的汉语水平。",
        "pinyin": "Tōngguò bùduàn de nǔlì, tā zhújiàn tígāo le tā de hànyǔ shuǐpíng.",
        "en": "Through constant efforts, she gradually improved her Chinese level.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_通过不断的努力她逐渐提高了她的汉语水平.mp3"
      },
      {
        "cn": "随着时间的推移，我对中国文化的理解逐渐加深了。",
        "pinyin": "Suízhe shíjiān de tuīyí, wǒ duì Zhōngguó wénhuà de lǐjiě zhújiàn jiāshēn le.",
        "en": "With the passage of time, my understanding of Chinese culture has gradually deepened.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_随着时间的推移我对中国文化的理解逐渐加深了.mp3"
      },
      {
        "cn": "他逐渐适应了在中国的生活。",
        "pinyin": "Tā zhújiàn shìyìng le zài Zhōngguó de shēnghuó.",
        "en": "He gradually adapted to life in China.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_他逐渐适应了在中国的生活.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "反而 (fǎn'ér) - On the contrary, instead",
    "short_explanation": "Used to express something that happens as a result that is the opposite of what was expected or desired.",
    "long_explanation": "The Mandarin Chinese word '反而(fǎn'ér)' is often used when the outcome of an action is contrary to what was initially expected or intended. It denotes an element of surprise, as things did not go as initially predicted. As such, its closest English equivalents would be phrases like 'on the contrary', or 'instead'.",
    "formation": "Subject + Action that was expected or desired + 反而 + What actually happened.",
    "examples": [
      {
        "cn": "他本来想让步，反而让事情更复杂了。",
        "pinyin": "Tā běnlái xiǎng ràngbù, fǎn'ér ràng shìqíng gèng fùzá le.",
        "en": "He originally intended to yield, but on the contrary, he made things more complicated.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_他本来想让步反而让事情更复杂了.mp3"
      },
      {
        "cn": "我提醒她要小心，反而让她更紧张了。",
        "pinyin": "Wǒ tíxǐng tā yào xiǎoxīn, fǎn'ér ràng tā gèng jǐnzhāng le.",
        "en": "I reminded her to be careful, but instead, it made her more nervous.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我提醒她要小心反而让她更紧张了.mp3"
      },
      {
        "cn": "我以为吃药会好些，反而病得更重。",
        "pinyin": "Wǒ yǐwéi chī yào huì hǎo xiē, fǎn'ér bìng de gèng zhòng.",
        "en": "I thought taking medicine would make me feel better, but on the contrary, I got sicker.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我以为吃药会好些反而病得更重.mp3"
      },
      {
        "cn": "他想通过降价来吸引顾客，反而让顾客觉得产品质量差。",
        "pinyin": "Tā xiǎng tōngguò jiàngjià lái xīyǐn gùkè, fǎn'ér ràng gùkè juéde chǎnpǐn zhìliàng chà.",
        "en": "He thought lowering the price would attract customers, but instead, it made customers think the product was of poor quality.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_他想通过降价来吸引顾客反而让顾客觉得产品质量差.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "避免 (bìmiǎn) - To avoid, to prevent",
    "short_explanation": "Used to express the action of avoiding or preventing something from happening.",
    "long_explanation": "The Mandarin Chinese term '避免 (bìmiǎn)' represents the action of preventing or avoiding an event, situation or action from happening. It is equivalent to 'to avoid' or 'to prevent' in English. This term is often used in circumstances where one needs to sidestep or avert a potential problem or unpleasant situation.",
    "formation": "Subject + 避免 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "我每天运动来避免感觉疲劳。",
        "pinyin": "Wǒ měitiān yùndòng lái bìmiǎn gǎnjué píláo.",
        "en": "I exercise every day to avoid feeling tired.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_to_prevent_20231230_我每天运动来避免感觉疲劳.mp3"
      },
      {
        "cn": "我们必须避免浪费食物，因为这对环境非常不利。",
        "pinyin": "Wǒmen bìxū bìmiǎn làngfèi shíwù, yīnwèi zhè duì huánjìng fēicháng bùlì.",
        "en": "We must avoid wasting food because it's very harmful to the environment.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_to_prevent_20231230_我们必须避免浪费食物因为这对环境非常不利.mp3"
      },
      {
        "cn": "他戴上太阳镜以避免阳光直射他的眼睛。",
        "pinyin": "Tā dài shàng tàiyángjìng yǐ bìmiǎn yángguāng zhíshè tā de yǎnjīng.",
        "en": "He put on sunglasses to avoid direct sunlight into his eyes.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_to_prevent_20231230_他戴上太阳镜以避免阳光直射他的眼睛.mp3"
      },
      {
        "cn": "为了避免交通拥堵，我选择在早晨离开公司。",
        "pinyin": "Wèile bìmiǎn jiāotōng yōngjǔ, wǒ xuǎnzé zài zǎochén líkāi gōngsī.",
        "en": "To avoid traffic congestion, I chose to leave the office in the morning.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_to_prevent_20231230_为了避免交通拥堵我选择在早晨离开公司.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "尽管如此 (jǐnguǎn rúcǐ) - Even so, nevertheless",
    "short_explanation": "Used to express a contrast, exception or contradiction to the previous statement.",
    "long_explanation": "The Mandarin Chinese phrase '尽管如此 (jǐnguǎn rúcǐ)' is a conjunction used to provide a contrasting statement to what has previously been said. The phrase can be translated to 'even so' or 'nevertheless' in English. This phrase signifies disagreement or contradiction, and is used to introduce another perspective or comment that contrasts with the preceding information or viewpoint.",
    "formation": "Statement 1, 尽管如此, statement 2.",
    "examples": [
      {
        "cn": "他的汉语水平很高，尽管如此，他还是认为自己需要更多的练习。",
        "pinyin": "Tā de hànyǔ shuǐpíng hěn gāo, jǐnguǎn rúcǐ, tā háishì rènwéi zìjǐ xūyào gèng duō de liànxí.",
        "en": "His level of Chinese is very high, even so, he still thinks he needs more practice.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nevertheless_20231230_他的汉语水平很高尽管如此他还是认为自己需要更多的练习.mp3"
      },
      {
        "cn": "我们已经等了很长时间，尽管如此，我们决定继续等下去。",
        "pinyin": "Wǒmen yǐjīng děng le hěn cháng shíjiān, jǐnguǎn rúcǐ, wǒmen juédìng jìxù děng xiàqù.",
        "en": "We have already been waiting for a long time, nevertheless, we decided to continue to wait.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nevertheless_20231230_我们已经等了很长时间尽管如此我们决定继续等下去.mp3"
      },
      {
        "cn": "我知道考试会很难，尽管如此，我仍然全力以赴。",
        "pinyin": "Wǒ zhīdào kǎoshì huì hěn nán, jǐnguǎn rúcǐ, wǒ réngrán quánlìyǐfù.",
        "en": "I know the exam will be hard, even so, I still gave it my all.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nevertheless_20231230_我知道考试会很难尽管如此我仍然全力以赴.mp3"
      },
      {
        "cn": "虽然这个电影好看，尽管如此，我不喜欢其中的角色。",
        "pinyin": "Suīrán zhège diànyǐng hǎokàn, jǐnguǎn rúcǐ, wǒ bù xǐhuān qízhōng de juésè.",
        "en": "Even though this movie is good, nevertheless, I don't like the characters in it.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Even_so_nevertheless_20231230_虽然这个电影好看尽管如此我不喜欢其中的角色.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "为了 (wèile) - In order to, for the sake of",
    "short_explanation": "Used to indicate the purpose or intention behind an action.",
    "long_explanation": "In Mandarin Chinese, '为了 (wèile)' is a preposition that is used to express a specific purpose, intention, or goal. This phrase is typically placed at the beginning of a sentence to indicate the reason behind an action or decision. It equates to 'in order to' or 'for the sake of' in English.",
    "formation": "为了 + Purpose/Goal, Subject + Verb + Object",
    "examples": [
      {
        "cn": "为了保持健康，我决定每天做运动。",
        "pinyin": "Wèile bǎochí jiànkāng, wǒ juédìng měitiān zuò yùndòng.",
        "en": "In order to stay healthy, I decided to exercise every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了保持健康我决定每天做运动.mp3"
      },
      {
        "cn": "他为了完成项目，熬夜工作了一个星期。",
        "pinyin": "Tā wèile wánchéng xiàngmù, áoyè gōngzuòle yīgè xīngqī.",
        "en": "He worked all night for a week in order to complete the project.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_他为了完成项目熬夜工作了一个星期.mp3"
      },
      {
        "cn": "为了明年的考试，我们需要从现在开始复习。",
        "pinyin": "Wèile míngnián de kǎoshì, wǒmen xūyào cóng xiànzài kāishǐ fùxí.",
        "en": "In order to prepare for next year's exam, we need to start reviewing from now.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了明年的考试我们需要从现在开始复习.mp3"
      },
      {
        "cn": "为了她的笑容，我愿意做任何事情。",
        "pinyin": "Wèile tā de xiàoróng, wǒ yuànyì zuò rènhé shìqíng.",
        "en": "For her smile, I would do anything.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_sake_of_20231230_为了她的笑容我愿意做任何事情.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "反之 (fǎnzhī) - On the other hand, conversely",
    "short_explanation": "Used to indicate and introduce an opposing or contrasting point.",
    "long_explanation": "The Mandarin Chinese word '反之 (fǎnzhī)' is an adverb used to introduce a contrasting idea or a statement that states the reverse of a previous statement. This term can be used to present varying perspectives, differing situations or contrasting circumstances. In English, it can translate to 'on the other hand', 'conversely', or 'otherwise'.",
    "formation": "Statement 1, 反之 + Statement 2",
    "examples": [
      {
        "cn": "如果你努力学习，你会取得成功，反之，如果你骄傲自满，你会失败。",
        "pinyin": "Rúguǒ nǐ nǔlì xuéxí, nǐ huì qǔdé chénggōng, fǎnzhī, rúguǒ nǐ jiāo'ào zìmǎn, nǐ huì shībài.",
        "en": "If you study hard, you will succeed, on the other hand, if you are complacent, you will fail.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_other_hand_conversely_20231230_如果你努力学习你会取得成功反之如果你骄傲自满你会失败.mp3"
      },
      {
        "cn": "这种草药对于一些人来说很有效，反之，对于其他人可能没什么效果。",
        "pinyin": "Zhè zhǒng cǎoyào duìyú yìxiē rén lái shuō hěn yǒuxiào, fǎnzhī, duìyú qítā rén kěnéng méishénme xiàoguǒ.",
        "en": "This herbal medicine is very effective for some people, on the other hand, it may not have any effect on others.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_other_hand_conversely_20231230_这种草药对于一些人来说很有效反之对于其他人可能没什么效果.mp3"
      },
      {
        "cn": "父亲是个保守的人，总是遵循传统的做法，反之，儿子则是个勇于创新的人。",
        "pinyin": "Fùqīn shìgè bǎoshǒu de rén, zǒng shì zūnxún chuántǒng de zuòfǎ, fǎnzhī, érzi zé shìgè yǒngyú chuàngxīn de rén.",
        "en": "The father is a conservative man, always following traditional practices, on the other hand, the son is a man who dares to innovate.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_other_hand_conversely_20231230_父亲是个保守的人总是遵循传统的做法反之儿子则是个勇于创新的人.mp3"
      },
      {
        "cn": "你如果顺从了别人的意愿，那么你就永远不能满足自己，反之，如果你选择自己的道路，那你就有可能实现自己的梦想。",
        "pinyin": "Nǐ rúguǒ shùncóng le biérén de yìyuàn, nàme nǐ jiù yǒngyuǎn bùnéng mǎnzú zìjǐ, fǎnzhī, rúguǒ nǐ xuǎnzé zìjǐ de dàolù, nà nǐ jiù yǒu kěnéng shíxiàn zìjǐ de mèngxiǎng.",
        "en": "If you comply with the wishes of others, then you can never satisfy yourself, on the other hand, if you choose your own path, then you may realize your dreams.",
        "grammar_audio": "/audio/mandarin/grammar/s_反之_fǎnzhī_-_On_the_other_hand_conversely_20231230_你如果顺从了别人的意愿那么你就永远不能满足自己反之如果你选择自己的道路那你就有可能实现自己的梦想.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "例如 (lìrú) - For example",
    "short_explanation": "This is a conjunction used to introduce examples.",
    "long_explanation": "The term '例如 (lìrú)' plays the similar role as 'for example' in English. It is used when the speaker wants to provide an instance or case to illustrate a point. With the usage of '例如', the speaker doesn't have to fully explain the scenario, but can simplify the statement by giving an example.",
    "formation": "Point + 例如 + Example",
    "examples": [
      {
        "cn": "我喜欢各种运动，例如游泳、篮球和慢跑。",
        "pinyin": "Wǒ xǐhuān gè zhǒng yùndòng, lìrú yóuyǒng, lánqiú hé mànpǎo.",
        "en": "I like various sports, for example, swimming, basketball, and jogging.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_example_20231230_我喜欢各种运动例如游泳篮球和慢跑.mp3"
      },
      {
        "cn": "我们可以去很多有趣的地方，例如博物馆或者公园。",
        "pinyin": "Wǒmen kěyǐ qù hěnduō yǒuqù de dìfang, lìrú bówùguǎn huòzhě gōngyuán.",
        "en": "We can go to many interesting places, for example, museums or parks.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_example_20231230_我们可以去很多有趣的地方例如博物馆或者公园.mp3"
      },
      {
        "cn": "他善于很多艺术，例如画画和弹琴。",
        "pinyin": "Tā shànyú hěn duō yìshù, lìrú huàhuà hé tán qín.",
        "en": "He is good at many arts, for example, painting and playing the piano.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_example_20231230_他善于很多艺术例如画画和弹琴.mp3"
      },
      {
        "cn": "你可以吃很多种水果来补充维生素，例如苹果、香蕉和葡萄。",
        "pinyin": "Nǐ kěyǐ chī hěnduō zhǒng shuǐguǒ lái bǔchōng wéishēngsù, lìrú píngguǒ, xiāngjiāo hé pútáo.",
        "en": "You can eat many kinds of fruits to replenish vitamins, for example, apples, bananas, and grapes.",
        "grammar_audio": "/audio/mandarin/grammar/s_例如_lìrú_-_For_example_20231230_你可以吃很多种水果来补充维生素例如苹果香蕉和葡萄.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "尤其 (yóuqí) - Especially, particularly",
    "short_explanation": "Used to give special emphasis to the following word, phrase, or clause.",
    "long_explanation": "The Mandarin Chinese word '尤其 (yóuqí)' is used to give special emphasis or to specify something more distinctive or specific in context. It can be closely translated to 'especially' or 'particularly' in English. This adverb is used to underscore a point or to single out one or more elements in comparison to others.",
    "formation": "Subject + Verb/Adjective + 尤其 + rest of the sentence",
    "examples": [
      {
        "cn": "我喜欢各种运动，尤其喜欢游泳。",
        "pinyin": "Wǒ xǐhuan gè zhǒng yùndòng, yóuqí xǐhuan yóuyǒng.",
        "en": "I like all kinds of sports, especially swimming.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我喜欢各种运动尤其喜欢游泳.mp3"
      },
      {
        "cn": "这本书的内容都很有趣，尤其第三章的故事非常吸引人。",
        "pinyin": "Zhè běn shū de nèiróng dōu hěn yǒuqù, yóuqí dì sān zhāng de gùshì fēicháng xīyǐnrén.",
        "en": "The content of this book is very interesting, especially the story in the third chapter is very appealing.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_这本书的内容都很有趣尤其第三章的故事非常吸引人.mp3"
      },
      {
        "cn": "我喜欢吃水果，尤其喜欢吃苹果。",
        "pinyin": "Wǒ xǐhuan chī shuǐguǒ, yóuqí xǐhuan chī píngguǒ.",
        "en": "I like to eat fruits, especially apples.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我喜欢吃水果尤其喜欢吃苹果.mp3"
      },
      {
        "cn": "北京的春天和秋天尤其美丽。",
        "pinyin": "Běijīng de chūntiān hé qiūtiān yóuqí měilì.",
        "en": "The spring and autumn in Beijing are particularly beautiful.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_北京的春天和秋天尤其美丽.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "由于 (yóuyú) - Due to, because of",
    "short_explanation": "Used to indicate a reason or cause in a causal relationship.",
    "long_explanation": "The Mandarin Chinese preposition '由于 (yóuyú)' acts as a conjunction to express causation, much like 'due to' or 'because of' in English. It is often used to establish a cause-effect relationship between two clauses, with the causative clause typically preceding the result clause in a sentence.",
    "formation": "由于 + Cause, Effect.",
    "examples": [
      {
        "cn": "由于天气太冷，我们决定待在家里。",
        "pinyin": "Yóuyú tiānqì tài lěng, wǒmen juédìng dāi zài jiā lǐ.",
        "en": "Due to the weather being too cold, we decided to stay at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于天气太冷我们决定待在家里.mp3"
      },
      {
        "cn": "由于他没有提前预订，所有的房间都订满了。",
        "pinyin": "Yóuyú tā méiyǒu tíqián yùdìng, suǒyǒu de fángjiān dōu dìng mǎn le.",
        "en": "Because he didn't book in advance, all the rooms were full.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于他没有提前预订所有的房间都订满了.mp3"
      },
      {
        "cn": "由于交通堵塞，我们错过了电影。",
        "pinyin": "Yóuyú jiāotōng dǔsè, wǒmen cuòguò le diànyǐng.",
        "en": "Due to traffic jam, we missed the movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于交通堵塞我们错过了电影.mp3"
      },
      {
        "cn": "由于她总是迟到，所以经理决定解雇她。",
        "pinyin": "Yóuyú tā zǒng shì chídào, suǒyǐ jīnglǐ juédìng jiěgù tā.",
        "en": "Due to her always being late, the manager decided to fire her.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于她总是迟到所以经理决定解雇她.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "100"
  },
  {
    "title": "不管...都... (bùguǎn... dōu...) - No matter... always...",
    "short_explanation": "This is a pattern used to express 'no matter what or how...', 'regardless of...' or 'despite...' in English.",
    "long_explanation": "The structure '不管...都...' in Mandarin Chinese is a conjunction used to express a condition and the result, where the result is always the same regardless the condition. It is used to indicate a situation or action that happens irrespective of some variable factor. The '都' part can be understood as 'always' or 'in any case'.",
    "formation": "不管 + Condition, 都 + Result",
    "examples": [
      {
        "cn": "不管天气怎么样，他每天都去公园跑步。",
        "pinyin": "Bùguǎn tiānqì zěnme yàng, tā měitiān dōu qù gōngyuán pǎobù.",
        "en": "No matter what the weather is like, he always goes to the park to run every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_No_matter_always_20231230_不管天气怎么样他每天都去公园跑步.mp3"
      },
      {
        "cn": "不管你去不去，我都会参加那个派对。",
        "pinyin": "Bùguǎn nǐ qù bù qù, wǒ dōu huì cānjiā nàgè pàiduì.",
        "en": "Whether you go or not, I will attend that party.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_No_matter_always_20231230_不管你去不去我都会参加那个派对.mp3"
      },
      {
        "cn": "不管我工作多么忙，我都会找时间健身。",
        "pinyin": "Bùguǎn wǒ gōngzuò duōme máng, wǒ dōu huì zhǎo shíjiān jiànshēn.",
        "en": "No matter how busy I am with work, I always find time to work out.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_No_matter_always_20231230_不管我工作多么忙我都会找时间健身.mp3"
      },
      {
        "cn": "不管路有多远，我都会走到目的地。",
        "pinyin": "Bùguǎn lù yǒu duō yuǎn, wǒ dōu huì zǒu dào mùdìdì.",
        "en": "No matter how far the journey is, I will always reach my destination.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管都_bùguǎn_dōu_-_No_matter_always_20231230_不管路有多远我都会走到目的地.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "非...不可 (fēi... bùkě) - Must, have to",
    "short_explanation": "Used to emphasize the necessity, urgency, or inevitability of an action.",
    "long_explanation": "The Mandarin Chinese expression '非...不可 (fēi... bùkě)' is used to stress that something must be done or has to happen. It is an idiomatic way of expressing a compelling need or obligation to perform a certain action or event. It exemplifies the importance of the action, indicating that it cannot be avoided or ignored.",
    "formation": "非 + Action/Object + 不可",
    "examples": [
      {
        "cn": "我非到中国去学习中文不可，这对我来说是个非常重要的决定。",
        "pinyin": "Wǒ fēi dào Zhōngguó qù xuéxí Zhōngwén bùkě, zhè duì wǒ lái shuō shì gè fēicháng zhòngyào de juédìng.",
        "en": "I must go to China to study Chinese, this is a very important decision for me.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_我非到中国去学习中文不可这对我来说是个非常重要的决定.mp3"
      },
      {
        "cn": "为了保护我们的地球，实现可持续发展，我们非节约资源不可。",
        "pinyin": "Wèi le bǎohù wǒmen de dìqiú, shíxiàn kěchíxù fāzhǎn, wǒmen fēi jiéyuē zīyuán bùkě.",
        "en": "In order to protect our planet and achieve sustainable development, we must conserve resources.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_为了保护我们的地球实现可持续发展我们非节约资源不可.mp3"
      },
      {
        "cn": "他在公司做了一件大错，非向经理道歉不可。",
        "pinyin": "Tā zài gōngsī zuòle yījiàn dà cuò, fēi xiàng jīnglǐ dàoqiàn bùkě.",
        "en": "He made a big mistake at the company, he must apologize to the manager.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_他在公司做了一件大错非向经理道歉不可.mp3"
      },
      {
        "cn": "你非吃早餐不可，这对你的健康非常重要。",
        "pinyin": "Nǐ fēi chī zǎocān bùkě, zhè duì nǐ de jiànkāng fēicháng zhòngyào.",
        "en": "You must eat breakfast, it is very important for your health.",
        "grammar_audio": "/audio/mandarin/grammar/s_非不可_fēi_bùkě_-_Must_have_to_20231230_你非吃早餐不可这对你的健康非常重要.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "与其...不如... (yǔqí... bùrú...) - Rather than... it's better to...",
    "short_explanation": "Used to express a preference for one action over another.",
    "long_explanation": "The Mandarin Chinese phrase '与其...不如...' (yǔqí... bùrú...) is used to indicate a preference for one action or situation over another. It is often used when giving advice or suggesting a preferable alternative. The two events, actions or situations are placed within the structure, similar to the English phrase 'rather than... it's better to...'. ",
    "formation": "与其 + Action/Situation A, 不如 + Action/Situation B",
    "examples": [
      {
        "cn": "与其在家里浪费时间，不如去图书馆学习。",
        "pinyin": "Yǔqí zài jiālǐ làngfèi shíjiān, bùrú qù túshūguǎn xuéxí.",
        "en": "Rather than wasting time at home, it's better to go to the library to study.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其在家里浪费时间不如去图书馆学习.mp3"
      },
      {
        "cn": "与其花大钱买新衣服，不如把钱存起来。",
        "pinyin": "Yǔqí huā dà qián mǎi xīn yīfu, bùrú bǎ qián cún qǐlái.",
        "en": "Rather than spending a lot of money on new clothes, it's better to save the money.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其花大钱买新衣服不如把钱存起来.mp3"
      },
      {
        "cn": "与其天天吃外卖，不如自己煮饭吃。",
        "pinyin": "Yǔqí tiāntiān chī wàimài, bùrú zìjǐ zhǔ fàn chī.",
        "en": "Rather than eating take-out every day, it's better to cook for yourself.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其天天吃外卖不如自己煮饭吃.mp3"
      },
      {
        "cn": "与其抱怨工作，不如寻找自己喜欢的工作。",
        "pinyin": "Yǔqí bàoyuàn gōngzuò, bùrú xúnzhǎo zìjǐ xǐhuan de gōngzuò.",
        "en": "Rather than complaining about your job, it's better to look for a job you like.",
        "grammar_audio": "/audio/mandarin/grammar/s_与其不如_yǔqí_bùrú_-_Rather_than_its_better_to_20231230_与其抱怨工作不如寻找自己喜欢的工作.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "不是...而是... (bùshì... érshì...) - It's not... but...",
    "short_explanation": "Used to refute one thing and affirm another. It is equivalent to the English expression 'It's not... but...'.",
    "long_explanation": "The phrase '不是…而是…' is used in Mandarin Chinese to negate one thing and affirm another. It's a way to correct a mistaken assumption or to emphasize the true nature of a situation over a possible misleading appearance. This structure gives equal attention to the negative and the positive parts, and it is similar to saying 'It's not... but...' in English.",
    "formation": "Subject + 不是 + Misunderstood idea + 而是 + Correct idea",
    "examples": [
      {
        "cn": "他不是因为懒惰而是因为病了所以没去上班。",
        "pinyin": "Tā bùshì yīnwèi lǎnduò érshì yīnwèi bìng le suǒyǐ méi qù shàngbān.",
        "en": "He didn't go to work not because he was lazy, but because he was sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_他不是因为懒惰而是因为病了所以没去上班.mp3"
      },
      {
        "cn": "我去中国不是为了旅游，而是为了学习华语。",
        "pinyin": "Wǒ qù Zhōngguó bùshì wèile lǚyóu, érshì wèile xuéxí Huáyǔ.",
        "en": "I'm going to China not for tourism, but to learn Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_我去中国不是为了旅游而是为了学习华语.mp3"
      },
      {
        "cn": "她看起来可能很开心，但实际上不是快乐，而是紧张。",
        "pinyin": "Tā kàn qǐlái kěnéng hěn kāixīn, dàn shíjì shàng bùshì kuàilè, érshì jǐnzhāng.",
        "en": "She might look very happy, but in fact, it's not happiness, but nervousness.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_她看起来可能很开心但实际上不是快乐而是紧张.mp3"
      },
      {
        "cn": "这个决定不是我一个人的，而是我们全家的。",
        "pinyin": "Zhège juédìng bùshì wǒ yīgè rén de, érshì wǒmen quánjiā de.",
        "en": "This decision is not just mine, but our entire family's.",
        "grammar_audio": "/audio/mandarin/grammar/s_不是而是_bùshì_érshì_-_Its_not_but_20231230_这个决定不是我一个人的而是我们全家的.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "除非...否则... (chúfēi... fǒuzé...) - Unless... otherwise...",
    "short_explanation": "Used to express 'unless... otherwise...'.",
    "long_explanation": "'除非...否则...' is a Chinese compound conjunction used to express 'unless... otherwise...'. It is used to indicate that a certain condition must be met before a result can occur. '除非' stands for 'unless', '否则' stands for 'otherwise'. This pattern is used when the speaker believes the condition (stated after '除非') is unlikely to be met.",
    "formation": "'除非' + Condition + '否则' + Result.",
    "examples": [
      {
        "cn": "除非你按时完成作业，否则你不能去玩。",
        "pinyin": "Chúfēi nǐ ànshí wánchéng zuòyè, fǒuzé nǐ bùnéng qù wán.",
        "en": "Unless you finish your homework on time, otherwise you can't go play.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你按时完成作业否则你不能去玩.mp3"
      },
      {
        "cn": "除非你节约用水，否则我们的水资源将会枯竭。",
        "pinyin": "Chúfēi nǐ jiéyuē yòngshuǐ, fǒuzé wǒmen de shuǐ zīyuán jiāng huì kūjié.",
        "en": "Unless you save water, otherwise our water resources will dry up.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你节约用水否则我们的水资源将会枯竭.mp3"
      },
      {
        "cn": "除非你提前预定，否则你可能找不到酒店的空房间。",
        "pinyin": "Chúfēi nǐ tíqián yùdìng, fǒuzé nǐ kěnéng zhǎo bùdào jiǔdiàn de kōng fángjiān.",
        "en": "Unless you reserve in advance, otherwise you might not find an available room in the hotel.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非你提前预定否则你可能找不到酒店的空房间.mp3"
      },
      {
        "cn": "除非我们改变消费习惯，否则地球的资源将会耗尽。",
        "pinyin": "Chúfēi wǒmen gǎibiàn xiāofèi xíguàn, fǒuzé dìqiú de zīyuán jiāng huì hàojìn.",
        "en": "Unless we change our consumption habits, otherwise the earth's resources will be exhausted.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēi_fǒuzé_-_Unless_otherwise_20231230_除非我们改变消费习惯否则地球的资源将会耗尽.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "以至于 (yǐzhìyú) - So that, to the extent that",
    "short_explanation": "Used to express the result or consequence of a certain condition or circumstance.",
    "long_explanation": "The Mandarin Chinese phrase '以至于 (yǐzhìyú)' is used to show the result or effect brought by a certain condition or situation to the extent that it draws attention. In English, this could be translated as 'so that', 'to the extent that', 'to the point that', or 'so...that'. It emphasizes the intensity or severity of a result or consequence.",
    "formation": "Situation + 以至于 + Result",
    "examples": [
      {
        "cn": "他工作太忙，以至于没有时间和家人在一起。",
        "pinyin": "Tā gōngzuò tài máng, yǐzhìyú méiyǒu shíjiān hé jiārén zài yīqǐ.",
        "en": "He is so busy with work that he has no time to be with his family.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_to_the_extent_that_20231230_他工作太忙以至于没有时间和家人在一起.mp3"
      },
      {
        "cn": "她很注意饮食，以至于身材非常好。",
        "pinyin": "Tā hěn zhùyì yǐnshí, yǐzhìyú shēncái fēicháng hǎo.",
        "en": "She pays so much attention to her diet, to the extent that her figure is very good.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_to_the_extent_that_20231230_她很注意饮食以至于身材非常好.mp3"
      },
      {
        "cn": "我们公司发展的很快，以至于需要更多的员工。",
        "pinyin": "Wǒmen gōngsī fāzhǎn de hěn kuài, yǐzhìyú xūyào gèng duō de yuángōng.",
        "en": "Our company is developing so quickly, to the extent that we need more employees.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_to_the_extent_that_20231230_我们公司发展的很快以至于需要更多的员工.mp3"
      },
      {
        "cn": "这部电影太吸引人，以至于我一口气看了两遍。",
        "pinyin": "Zhè bù diànyǐng tài xīyǐn rén, yǐzhìyú wǒ yīkǒuqì kànle liǎng biàn.",
        "en": "This movie is so attractive, to the point that I watched it twice in one go.",
        "grammar_audio": "/audio/mandarin/grammar/s_以至于_yǐzhìyú_-_So_that_to_the_extent_that_20231230_这部电影太吸引人以至于我一口气看了两遍.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "一旦...就... (yīdàn... jiù...) - Once... then...",
    "short_explanation": "Used to express that once a certain condition is met, another event will happen immediately.",
    "long_explanation": "The Mandarin Chinese phrase '一旦...就...' (yīdàn... jiù...) is used to express that once a certain condition is met, an event will take place immediately thereafter. It signifies a cause and effect relationship, and the 'once' clause specifies a condition, while the 'then' clause describes the resultant action or consequence.",
    "formation": "一旦 + Condition + 就 + Result",
    "examples": [
      {
        "cn": "一旦你决定好了，就告诉我。",
        "pinyin": "Yīdàn nǐ juédìng hǎo le, jiù gàosù wǒ.",
        "en": "Once you've made your decision, then tell me.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦你决定好了就告诉我.mp3"
      },
      {
        "cn": "一旦开始下雨，我们就得回家。",
        "pinyin": "Yīdàn kāishǐ xià yǔ, wǒmen jiù děi huí jiā.",
        "en": "Once it starts to rain, we'll have to go home.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦开始下雨我们就得回家.mp3"
      },
      {
        "cn": "一旦你完成这个项目，就可以去休假了。",
        "pinyin": "Yīdàn nǐ wánchéng zhège xiàngmù, jiù kěyǐ qù xiūjià le.",
        "en": "Once you complete this project, you can go on vacation.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦你完成这个项目就可以去休假了.mp3"
      },
      {
        "cn": "一旦我收到他的邮件，我就会回复他。",
        "pinyin": "Yīdàn wǒ shōudào tā de yóujiàn, wǒ jiù huì huífù tā.",
        "en": "Once I receive his email, I'll reply to him.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦我收到他的邮件我就会回复他.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "鉴于 (jiànyú) - In view of, considering",
    "short_explanation": "Used to express considering certain facts or situations when making a decision.",
    "long_explanation": "The Mandarin Chinese phrase '鉴于 (jiànyú)' is a conjunction used to express the idea of considering certain factors, elements or situations when making a decision or judgement. This phrase is equivalent to the English phrases 'in view of', 'considering' or 'given that'. It often precedes important, determining elements or reasons in the sentence.",
    "formation": "鉴于 + Reason/Fact, + Main Sentence",
    "examples": [
      {
        "cn": "鉴于他长期的良好表现，我们决定提升他为部门经理。",
        "pinyin": "Jiànyú tā chángqī de liánghǎo biǎoxiàn, wǒmen juédìng tíshēng tā wéi bùmén jīnglǐ.",
        "en": "Considering his long-term good performance, we decided to promote him to department manager.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于他长期的良好表现我们决定提升他为部门经理.mp3"
      },
      {
        "cn": "鉴于近期的疫情，我们的店铺只能提供外卖服务。",
        "pinyin": "Jiànyú jìnqī de yìqíng, wǒmen de diànpù zhǐ néng tígōng wàimài fúwù.",
        "en": "In view of the recent epidemic, our shop can only provide take-out service.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于近期的疫情我们的店铺只能提供外卖服务.mp3"
      },
      {
        "cn": "鉴于你对此项目的重要贡献，公司决定给你发放额外的奖金。",
        "pinyin": "Jiànyú nǐ duì cǐ xiàngmù de zhòngyào gòngxiàn, gōngsī juédìng gěi nǐ fāfàng éwài de jiǎngjīn.",
        "en": "Considering your important contribution to this project, the company decided to give you an extra bonus.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于你对此项目的重要贡献公司决定给你发放额外的奖金.mp3"
      },
      {
        "cn": "鉴于考试成绩，他被选为年度最佳学生。",
        "pinyin": "Jiànyú kǎoshì chéngjī, tā bèi xuǎn wéi niándù zuìjiā xuéshēng.",
        "en": "Considering the examination results, he was chosen as the best student of the year.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于考试成绩他被选为年度最佳学生.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "就算...也... (jiùsuàn... yě...) - Even if... still...",
    "short_explanation": "This structure expresses the idea 'Even if... still...' with a strong determination or assertion.",
    "long_explanation": "The Mandarin Chinese phrase '就算...也...' (jiùsuàn... yě...) is used to indicate that despite the situation implied in the first clause, the outcome or result described in the second clause will not change. It's a structure to argue that no matter what happens in a certain premise, one point remains unmovable.",
    "formation": "就算 + Situation / Hypothetical condition + 也 + Action / Result",
    "examples": [
      {
        "cn": "就算下雨，我也会去看足球比赛。",
        "pinyin": "Jiùsuàn xiàyǔ, wǒ yě huì qù kàn zúqiú bǐsài.",
        "en": "Even if it rains, I will still go to watch the football match.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算下雨我也会去看足球比赛.mp3"
      },
      {
        "cn": "就算你不高兴，我们还是要讨论这个问题。",
        "pinyin": "Jiùsuàn nǐ bù gāoxìng, wǒmen háishì yào tǎolùn zhège wèntí.",
        "en": "Even if you are not happy, we still have to discuss this issue.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算你不高兴我们还是要讨论这个问题.mp3"
      },
      {
        "cn": "就算我错过了最后一班地铁，我也会选择走路回家。",
        "pinyin": "Jiùsuàn wǒ cuòguòle zuìhòu yī bān dìtiě, wǒ yě huì xuǎnzé zǒulù huí jiā.",
        "en": "Even if I missed the last subway, I would still choose to walk home.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算我错过了最后一班地铁我也会选择走路回家.mp3"
      },
      {
        "cn": "就算他命令我做，我也不会背叛我的朋友。",
        "pinyin": "Jiùsuàn tā mìnglìng wǒ zuò, wǒ yě bù huì bèipàn wǒ de péngyǒu.",
        "en": "Even if he ordered me, I would not betray my friends.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算他命令我做我也不会背叛我的朋友.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "要么...要么... (yàome... yàome...) - Either... or...",
    "short_explanation": "Used to present two or more options or alternatives.",
    "long_explanation": "The Mandarin Chinese phrase '要么...要么...' (yàome... yàome...) is used to present two alternatives or options, similar to 'either... or...' in English. It helps to establish a scenario where one has to make a choice between the stated alternatives.",
    "formation": "Subject + 要么 + Option 1 + 要么 + Option 2",
    "examples": [
      {
        "cn": "你要么去游泳，要么去跑步。",
        "pinyin": "Nǐ yàome qù yóuyǒng, yàome qù pǎobù.",
        "en": "Either you go swimming, or you go running.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么去游泳要么去跑步.mp3"
      },
      {
        "cn": "我们要么吃中餐，要么吃西餐。",
        "pinyin": "Wǒmen yàome chī Zhōngcān, yàome chī Xīcān.",
        "en": "We either eat Chinese food, or we eat Western food.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_我们要么吃中餐要么吃西餐.mp3"
      },
      {
        "cn": "他要么睡觉，要么看电视。",
        "pinyin": "Tā yàome shuìjiào, yàome kàn diànshì.",
        "en": "He either sleeps, or he watches TV.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_他要么睡觉要么看电视.mp3"
      },
      {
        "cn": "你要么接受这个工作，要么继续找其他的工作。",
        "pinyin": "Nǐ yàome jiēshòu zhège gōngzuò, yàome jìxù zhǎo qítā de gōngzuò.",
        "en": "Either you accept this job, or you continue to look for other jobs.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么接受这个工作要么继续找其他的工作.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "不禁 (bùjīn) - Can't help but, can't refrain from",
    "short_explanation": "Used to represent some kind of uncontrollable feeling or action.",
    "long_explanation": "The Mandarin Chinese phrase '不禁 (bùjīn)' translates into English as 'can't help but' or 'can't refrain from'. It is used to express some kind of feeling or action that is difficult to control, something one can't help but do, or a reaction or emotion that is involuntary or hard to suppress. This term is often used to show a strong, overpowering emotion or response.",
    "formation": "Subject + 不禁 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "当他看到这个消息的时候，他不禁露出了笑容。",
        "pinyin": "Dāng tā kàn dào zhège xiāoxi de shíhòu, tā bùjīn lù chūle xiàoróng.",
        "en": "When he saw the message, he couldn't help but smile.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_but_cant_refrain_from_20231230_当他看到这个消息的时候他不禁露出了笑容.mp3"
      },
      {
        "cn": "听到这个好消息，我不禁激动地跳起来。",
        "pinyin": "Tīng dào zhège hǎo xiāoxi, wǒ bùjīn jīdòng de tiào qǐlái.",
        "en": "Upon hearing the good news, I couldn't help jumping excitedly.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_but_cant_refrain_from_20231230_听到这个好消息我不禁激动地跳起来.mp3"
      },
      {
        "cn": "看到她那么努力工作，我不禁感到敬佩。",
        "pinyin": "Kàn dào tā nàme nǔlì gōngzuò, wǒ bùjīn gǎndào jìngpèi.",
        "en": "Seeing her work so hard, I can't help but feel admiration.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_but_cant_refrain_from_20231230_看到她那么努力工作我不禁感到敬佩.mp3"
      },
      {
        "cn": "当我看到这部电影的结尾，我不禁哭了起来。",
        "pinyin": "Dāng wǒ kàn dào zhè bù diànyǐng de jiéwěi, wǒ bùjīn kūleqǐlái.",
        "en": "When I saw the end of this movie, I couldn't help but cry.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_but_cant_refrain_from_20231230_当我看到这部电影的结尾我不禁哭了起来.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "虽然...但是... (suīrán... dànshì...) - Although... but...",
    "short_explanation": "Used to express contrast between two statements.",
    "long_explanation": "The formation '虽然...但是...' in Mandarin Chinese is used to show a contrast between two contradictory statements. '虽然' means 'although' and is followed by the first statement, and '但是' means 'but' and is followed by the second statement. This grammar structure is similar to the 'although... but...' formation in English and helps express moderate or nuanced contrast between two situations or facts.",
    "formation": "虽然 + Statement 1 + 但是 + Statement 2",
    "examples": [
      {
        "cn": "虽然他很聪明，但是他不喜欢读书。",
        "pinyin": "Suīrán tā hěn cōngmíng, dànshì tā bù xǐhuān dúshū.",
        "en": "Although he is very smart, he does not like reading books.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他很聪明但是他不喜欢读书.mp3"
      },
      {
        "cn": "虽然这个手机很贵，但是它的质量很好。",
        "pinyin": "Suīrán zhège shǒujī hěn guì, dànshì tā de zhìliàng hěn hǎo.",
        "en": "Although this mobile phone is expensive, its quality is very good.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然这个手机很贵但是它的质量很好.mp3"
      },
      {
        "cn": "虽然我很累，但是我还是要完成我的作业。",
        "pinyin": "Suīrán wǒ hěn lèi, dànshì wǒ háishì yào wánchéng wǒ de zuòyè.",
        "en": "Although I'm very tired, I still have to complete my homework.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然我很累但是我还是要完成我的作业.mp3"
      },
      {
        "cn": "虽然天气冷，但是我还是喜欢在外面跑步。",
        "pinyin": "Suīrán tiānqì lěng, dànshì wǒ háishì xǐhuān zài wàimiàn pǎobù.",
        "en": "Though the weather is cold, I still like running outside.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然天气冷但是我还是喜欢在外面跑步.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "不论...都... (bùlùn... dōu...) - Regardless of... all...",
    "short_explanation": "This structure is used to express the meaning of 'regardless of' or 'no matter what'. ",
    "long_explanation": "The Mandarin Chinese '不论...都...' (bùlùn... dōu...) is a structure used to emphasize that no matter what the condition or situation is, the outcome will remain the same. It's equivalent to 'regardless of' or 'no matter what' in English. This pattern is often use to emphasize an unchangeable outcome or action.",
    "formation": "不论 + Condition + 都 + Outcome",
    "examples": [
      {
        "cn": "不论我多么努力工作，我都无法完成这个项目。",
        "pinyin": "Bùlùn wǒ duōme nǔlì gōngzuò, wǒ dōu wúfǎ wánchéng zhège xiàngmù.",
        "en": "No matter how hard I work, I can't finish this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_不论都_bùlùn_dōu_-_Regardless_of_all_20231230_不论我多么努力工作我都无法完成这个项目.mp3"
      },
      {
        "cn": "不论你说什么，我都会支持你的决定。",
        "pinyin": "Bùlùn nǐ shuō shénme, wǒ dōu huì zhīchí nǐ de juédìng.",
        "en": "Regardless of what you say, I will support your decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不论都_bùlùn_dōu_-_Regardless_of_all_20231230_不论你说什么我都会支持你的决定.mp3"
      },
      {
        "cn": "不论天气多么糟糕，他都每天都去公园跑步。",
        "pinyin": "Bùlùn tiānqì duōme zāogāo, tā dōu měitiān dōu qù gōngyuán pǎobù.",
        "en": "No matter how bad the weather is, he goes running in the park every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_不论都_bùlùn_dōu_-_Regardless_of_all_20231230_不论天气多么糟糕他都每天都去公园跑步.mp3"
      },
      {
        "cn": "不论考试结果如何，你都已尽全力。",
        "pinyin": "Bùlùn kǎoshì jiéguǒ rúhé, nǐ dōu yǐ jìn quánlì.",
        "en": "Regardless of the exam results, you have done your best.",
        "grammar_audio": "/audio/mandarin/grammar/s_不论都_bùlùn_dōu_-_Regardless_of_all_20231230_不论考试结果如何你都已尽全力.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "为何 (wèihé) - Why, how come",
    "short_explanation": "Used to ask for the cause or reason of a certain situation in a more formal tone.",
    "long_explanation": "The Mandarin Chinese phrase '为何 (wèihé)' is a question word that is used to inquire about the cause or reason of a particular event or circumstance. It serves a similar function to '为什么 (wèishénme)', but is generally more formal and often used in written Chinese, or in a formal context in spoken Chinese.",
    "formation": "Subject + 为何 + Verb/Adjective + Rest of the sentence?",
    "examples": [
      {
        "cn": "你为何选择了这个专业？因为我对这个领域非常感兴趣。",
        "pinyin": "Nǐ wèihé xuǎnzéle zhège zhuānyè? Yīnwèi wǒ duì zhège lǐngyù fēicháng gǎn xìngqù.",
        "en": "Why did you choose this major? Because I am very interested in this field.",
        "grammar_audio": "/audio/mandarin/grammar/s_为何_wèihé_-_Why_how_come_20231230_你为何选择了这个专业因为我对这个领域非常感兴趣.mp3"
      },
      {
        "cn": "他为何没有参加我们的聚会？因为他有其他的安排。",
        "pinyin": "Tā wèihé méiyǒu cānjiā wǒmen de jùhuì? Yīnwèi tā yǒu qítā de ānpái.",
        "en": "Why didn't he join our gathering? Because he had other arrangements.",
        "grammar_audio": "/audio/mandarin/grammar/s_为何_wèihé_-_Why_how_come_20231230_他为何没有参加我们的聚会因为他有其他的安排.mp3"
      },
      {
        "cn": "李老师为何今天没有来上课？他今天不舒服。",
        "pinyin": "Lǐ lǎoshī wèihé jīntiān méiyǒu lái shàngkè? Tā jīntiān bù shūfu.",
        "en": "Why didn't Teacher Li come to class today? He was not feeling well today.",
        "grammar_audio": "/audio/mandarin/grammar/s_为何_wèihé_-_Why_how_come_20231230_李老师为何今天没有来上课他今天不舒服.mp3"
      },
      {
        "cn": "为何你不喜欢看恐怖电影？因为那会让我很害怕。",
        "pinyin": "Wèihé nǐ bù xǐhuān kàn kǒngbù diànyǐng? Yīnwèi nà huì ràng wǒ hěn hàipà.",
        "en": "Why don't you like to watch horror movies? Because they scare me.",
        "grammar_audio": "/audio/mandarin/grammar/s_为何_wèihé_-_Why_how_come_20231230_为何你不喜欢看恐怖电影因为那会让我很害怕.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "根据 (gēnjù) - According to, based on",
    "short_explanation": "Used to indicate the source of information or the basis of an action.",
    "long_explanation": "The Mandarin Chinese word '根据 (gēnjù)' is used to indicate that a statement or action is sourced from, based on, or influenced by a particular piece of information. It can represent understanding as per certain conditions or rules defined by an event, data, evidence, documents, or any other source of information. It is equivalent to 'according to' or 'based on' in English.",
    "formation": "Subject + 根据 + Source of information + Verb/Adjective + Object.",
    "examples": [
      {
        "cn": "根据天气预报，明天将会下雨。",
        "pinyin": "Gēnjù tiānqì yùbào, míngtiān jiāng huì xiàyǔ.",
        "en": "According to the weather forecast, it will rain tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据天气预报明天将会下雨.mp3"
      },
      {
        "cn": "根据李教授的建议，我们决定改变研究方法。",
        "pinyin": "Gēnjù Lǐ jiàoshòu de jiànyì, wǒmen juédìng gǎibiàn yánjiū fāngfǎ.",
        "en": "Based on Professor Li's suggestion, we decided to change our research method.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据李教授的建议我们决定改变研究方法.mp3"
      },
      {
        "cn": "根据这份报告，公司的销售额有所下降。",
        "pinyin": "Gēnjù zhè fèn bàogào, gōngsī de xiāoshòu é yǒusuǒ xiàjiàng.",
        "en": "According to this report, the company's sales have decreased.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据这份报告公司的销售额有所下降.mp3"
      },
      {
        "cn": "根据他的表现，他看起来并不喜欢这个提议。",
        "pinyin": "Gēnjù tā de biǎoxiàn, tā kàn qǐlái bìng bù xǐhuan zhège tíyì.",
        "en": "Based on his behavior, he doesn't seem to like this proposal.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_based_on_20231230_根据他的表现他看起来并不喜欢这个提议.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "以便 (yǐbiàn) - In order to, so that",
    "short_explanation": "This is used to express a purpose or an intended result.",
    "long_explanation": "'以便 (yǐbiàn)' is a conjunction in Mandarin Chinese that is often used in sentences to indicate an intention or to set up a condition for a certain result to be realized. In English this can be translated as 'in order to' or 'so that'. It is used to create a relationship of cause and effect between two different clauses in a sentence.",
    "formation": "Subject + Verb/Phrase + 以便 + Result",
    "examples": [
      {
        "cn": "我提前做好了计划，以便我们可以有效地利用时间。",
        "pinyin": "Wǒ tíqián zuò hǎo le jìhuà, yǐbiàn wǒmen kěyǐ yǒuxiào de lìyòng shíjiān.",
        "en": "I have made plans in advance so that we can use time effectively.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_In_order_to_so_that_20231230_我提前做好了计划以便我们可以有效地利用时间.mp3"
      },
      {
        "cn": "他早早起床，以便赶上第一班地铁。",
        "pinyin": "Tā zǎo zǎo qǐchuáng, yǐbiàn gǎnshàng dì yī bān dìtiě.",
        "en": "He got up early in order to catch the first subway.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_In_order_to_so_that_20231230_他早早起床以便赶上第一班地铁.mp3"
      },
      {
        "cn": "我今天要早点睡，以便明天有足够的精力参加考试。",
        "pinyin": "Wǒ jīntiān yào zǎodiǎn shuì, yǐbiàn míngtiān yǒu zúgòu de jīnglì cānjiā kǎoshì.",
        "en": "I have to sleep early today so that I will have enough energy to take the test tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_In_order_to_so_that_20231230_我今天要早点睡以便明天有足够的精力参加考试.mp3"
      },
      {
        "cn": "你应该带一些现金，以便万一信用卡不能用。",
        "pinyin": "Nǐ yīnggāi dài yíxiē xiànjīn, yǐbiàn wànyī xìnyòngkǎ bùnéng yòng.",
        "en": "You should bring some cash in case the credit card doesn't work.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_In_order_to_so_that_20231230_你应该带一些现金以便万一信用卡不能用.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "因而 (yīn'ér) - Therefore, as a result",
    "short_explanation": "Used to indicate a result or consequence.",
    "long_explanation": "The Mandarin Chinese phrase '因而 (yīn'ér)' functions as a conjunction and it's used to indicate a result or consequence of something that was previously mentioned. It can be understood as 'therefore' or 'as a result'. This word is often used when you want to explain the effect or outcome based on a certain situation or condition.",
    "formation": "Clause 1 + 因而 + Clause 2.",
    "examples": [
      {
        "cn": "他没有完成作业，因而被老师责备了。",
        "pinyin": "Tā méiyǒu wánchéng zuòyè, yīn'ér bèi lǎoshī zébèi le.",
        "en": "He didn't finish the homework, therefore he was reproached by the teacher.",
        "grammar_audio": "/audio/mandarin/grammar/s_因而_yīnér_-_Therefore_as_a_result_20231230_他没有完成作业因而被老师责备了.mp3"
      },
      {
        "cn": "他每天都练习弹钢琴，因而技艺日益精进。",
        "pinyin": "Tā měitiān dōu liànxí dàn gāngqín, yīn'ér jìyì rìyì jīngjìn.",
        "en": "He practices the piano every day, and as a result, his skills are increasingly refined.",
        "grammar_audio": "/audio/mandarin/grammar/s_因而_yīnér_-_Therefore_as_a_result_20231230_他每天都练习弹钢琴因而技艺日益精进.mp3"
      },
      {
        "cn": "这个城市的交通非常拥挤，因而经常发生交通事故。",
        "pinyin": "Zhège chéngshì de jiāotōng fēicháng yōngjǐ, yīn'ér jīngcháng fāshēng jiāotōng shìgù.",
        "en": "The traffic in this city is very congested, therefore, traffic accidents often occur.",
        "grammar_audio": "/audio/mandarin/grammar/s_因而_yīnér_-_Therefore_as_a_result_20231230_这个城市的交通非常拥挤因而经常发生交通事故.mp3"
      },
      {
        "cn": "我昨天晚上没有睡好，因而今天感觉很疲劳。",
        "pinyin": "Wǒ zuótiān wǎnshàng méiyǒu shuì hǎo, yīn'ér jīntiān gǎnjué hěn píláo.",
        "en": "I didn't sleep well last night, therefore I feel very tired today.",
        "grammar_audio": "/audio/mandarin/grammar/s_因而_yīnér_-_Therefore_as_a_result_20231230_我昨天晚上没有睡好因而今天感觉很疲劳.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "若是 (ruòshì) - If, in case",
    "short_explanation": "Used to express hypothetical situations or conditions.",
    "long_explanation": "The Mandarin Chinese phrase '若是 (ruòshì)' functions similarly to 'if' in English, introducing a conditional clause. It is used to explore hypothetical scenarios, conditions, or possible outcomes. The sentence structure following 'ruòshì' will often present an outcome that would emerge if the condition stated after 'ruòshì' is met.",
    "formation": "若是 + Condition, Outcome",
    "examples": [
      {
        "cn": "若是明天下雪，我们就不去公园了。",
        "pinyin": "Ruòshì míngtiān xià xuě, wǒmen jiù bù qù gōngyuán le.",
        "en": "If it snows tomorrow, we won't go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是明天下雪我们就不去公园了.mp3"
      },
      {
        "cn": "若是他来参加我们的活动，会更有意思。",
        "pinyin": "Ruòshì tā lái cānjiā wǒmen de huódòng, huì gèng yǒu yìsi.",
        "en": "If he comes to our activity, it would be more interesting.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是他来参加我们的活动会更有意思.mp3"
      },
      {
        "cn": "若是你不舒服，应该去看医生。",
        "pinyin": "Ruòshì nǐ bù shūfú, yīnggāi qù kàn yīshēng.",
        "en": "If you're not feeling well, you should see a doctor.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是你不舒服应该去看医生.mp3"
      },
      {
        "cn": "若是她明天时间允许，她会来这里和我们一起吃午餐。",
        "pinyin": "Ruòshì tā míngtiān shíjiān yǔnxǔ, tā huì lái zhèlǐ hé wǒmen yīqǐ chī wǔcān.",
        "en": "If she has time tomorrow, she will come here and have lunch with us.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_in_case_20231230_若是她明天时间允许她会来这里和我们一起吃午餐.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "尽量 (jǐnliàng) - As much as possible",
    "short_explanation": "尽量 (jǐnliàng) is used to indicate the maximization of an effort or action.",
    "long_explanation": "尽量 (jǐnliàng) is a Mandarin Chinese word that implies putting forth the maximum effort or taking action to the furthest extent possible. Similar in meaning to 'as far as possible' or 'as much as one can' in English, it indicates a person's intention to do their utmost or best in carrying out an activity, pursuing a goal or fulfilling an expectation.",
    "formation": "尽量 + Verb + Object",
    "examples": [
      {
        "cn": "你尽量避免跟他发生冲突，我们不希望情况变得更糟糕。",
        "pinyin": "Nǐ jǐnliàng bìmiǎn gēn tā fāshēng chōngtú, wǒmen bù xīwàng qíngkuàng biàn de gèng zāogāo.",
        "en": "Try to avoid conflict with him as much as possible, we don't want the situation to get worse.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_20231230_你尽量避免跟他发生冲突我们不希望情况变得更糟糕.mp3"
      },
      {
        "cn": "我们必须尽量减少塑料废物的使用，为了保护环境。",
        "pinyin": "Wǒmen bìxū jǐnliàng jiǎnshǎo sùliào fèiwù de shǐyòng, wèile bǎohù huánjìng.",
        "en": "We must reduce the use of plastic waste as much as possible in order to protect the environment.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_20231230_我们必须尽量减少塑料废物的使用为了保护环境.mp3"
      },
      {
        "cn": "你尽量赶在七点之前回来，我会为你准备晚餐。",
        "pinyin": "Nǐ jǐnliàng gǎn zài qī diǎn zhīqián huílái, wǒ huì wèi nǐ zhǔnbèi wǎncān.",
        "en": "Try to come back before seven o'clock as much as possible, I will prepare dinner for you.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_20231230_你尽量赶在七点之前回来我会为你准备晚餐.mp3"
      },
      {
        "cn": "我会尽量把所有的任务都完成，不让你失望。",
        "pinyin": "Wǒ huì jǐnliàng bǎ suǒyǒu de rènwù dōu wánchéng, bù ràng nǐ shīwàng.",
        "en": "I will try my best to complete all the tasks to not disappoint you.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_20231230_我会尽量把所有的任务都完成不让你失望.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "要不然 (yào bùrán) - Otherwise, or else",
    "short_explanation": "Used to present an alternative situation or action that will take place if the previous condition is not met.",
    "long_explanation": "The Mandarin Chinese phrase '要不然 (yào bùrán)' is used to express two contrasting situations: the one that was originally presented, and one that would occur instead if the original situation doesn't happen. It's similar to 'otherwise' or 'or else' in English.",
    "formation": "Condition A, 要不然 + Condition B",
    "examples": [
      {
        "cn": "我们必须尽快走，要不然就会迟到。",
        "pinyin": "Wǒmen bìxū jǐnkuài zǒu, yào bùrán jiù huì chídào.",
        "en": "We must leave soon, otherwise we will be late.",
        "grammar_audio": "/audio/mandarin/grammar/s_要不然_yào_bùrán_-_Otherwise_or_else_20231230_我们必须尽快走要不然就会迟到.mp3"
      },
      {
        "cn": "你应该多喝水，要不然你的头可能会痛。",
        "pinyin": "Nǐ yīnggāi duō hē shuǐ, yào bùrán nǐ de tóu kěnéng huì tòng.",
        "en": "You should drink more water, otherwise your head might hurt.",
        "grammar_audio": "/audio/mandarin/grammar/s_要不然_yào_bùrán_-_Otherwise_or_else_20231230_你应该多喝水要不然你的头可能会痛.mp3"
      },
      {
        "cn": "如果你不做作业，要不然你将不会通过最后的考试。",
        "pinyin": "Rúguǒ nǐ bù zuò zuòyè, yào bùrán nǐ jiāng bù huì tōngguò zuìhòu de kǎoshì.",
        "en": "If you don’t do your homework, or else you won’t pass the final exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_要不然_yào_bùrán_-_Otherwise_or_else_20231230_如果你不做作业要不然你将不会通过最后的考试.mp3"
      },
      {
        "cn": "吃完饭就刷牙，要不然牙齿会变黄。",
        "pinyin": "Chī wán fàn jiù shuā yá, yào bùrán yá chǐ huì biàn huáng.",
        "en": "Brush your teeth after eating, otherwise your teeth will turn yellow.",
        "grammar_audio": "/audio/mandarin/grammar/s_要不然_yào_bùrán_-_Otherwise_or_else_20231230_吃完饭就刷牙要不然牙齿会变黄.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "替代 (tìdài) - Replace; On behalf of",
    "short_explanation": "Used to indicate the act of substituting something or someone; or acting or speaking on behalf of someone.",
    "long_explanation": "The Mandarin phrase '替代 (tìdài)' is used to indicate the substitution of one person or thing in place of another or the act of representing someone, thereby taking their place. This can refer to physical replacements, such as swapping objects, or abstract ones, like taking up someone's responsibility.",
    "formation": "Subject + 替代 + Object",
    "examples": [
      {
        "cn": "这个新的药品可以替代那个过时的老配方。",
        "pinyin": "Zhège xīn de yàopǐn kěyǐ tìdài nàgè guòshí de lǎo pèifāng.",
        "en": "This new drug can replace that outdated old recipe.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_On_behalf_of_20231230_这个新的药品可以替代那个过时的老配方.mp3"
      },
      {
        "cn": "我们找了一位新的教师替代病了的玛丽。",
        "pinyin": "Wǒmen zhǎole yī wèi xīn de jiàoshī tìdài bìngle de Mǎlì.",
        "en": "We found a new teacher to replace Mary who is sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_On_behalf_of_20231230_我们找了一位新的教师替代病了的玛丽.mp3"
      },
      {
        "cn": "他的儿子对他的公司来说是不可替代的。",
        "pinyin": "Tā de érzi duì tā de gōngsī lái shuō shì bùkě tìdài de.",
        "en": "His son is irreplaceable for his company.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_On_behalf_of_20231230_他的儿子对他的公司来说是不可替代的.mp3"
      },
      {
        "cn": "在员工大会上，我替代我的经理发言。",
        "pinyin": "Zài yuángōng dàhuì shàng, wǒ tìdài wǒ de jīnglǐ fāyán.",
        "en": "At the staff meeting, I spoke on behalf of my manager.",
        "grammar_audio": "/audio/mandarin/grammar/s_替代_tìdài_-_Replace_On_behalf_of_20231230_在员工大会上我替代我的经理发言.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "尤其是 (yóuqíshì) - Especially, particularly",
    "short_explanation": "Used to emphasize on a particular point or aspect in a context.",
    "long_explanation": "The phrase '尤其是 (yóuqíshì)' in Mandarin Chinese is used to put specific emphasis on a certain point or aspect within a context. This typically highlights a special case or example from a general situation. It is equivalent to 'especially' or 'particularly' in English. This phrase helps to bring attention to the root or salient point.",
    "formation": "General statement + 尤其是 + Particular point",
    "examples": [
      {
        "cn": "我喜欢许多不同类型的音乐，尤其是摇滚音乐。",
        "pinyin": "Wǒ xǐhuān xǔduō bùtóng lèixíng de yīnyuè, yóuqíshì yáogǔn yīnyuè.",
        "en": "I like many different types of music, especially rock music.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其是_yóuqíshì_-_Especially_particularly_20231230_我喜欢许多不同类型的音乐尤其是摇滚音乐.mp3"
      },
      {
        "cn": "我们班的同学都很聪明，尤其是李华。",
        "pinyin": "Wǒmen bān de tóngxué dōu hěn cōngmíng, yóuqíshì Lǐ Huá.",
        "en": "All the students in our class are smart, especially Li Hua.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其是_yóuqíshì_-_Especially_particularly_20231230_我们班的同学都很聪明尤其是李华.mp3"
      },
      {
        "cn": "我喜欢吃各种各样的蔬果，尤其是苹果。",
        "pinyin": "Wǒ xǐ huan chī gè zhǒng gè yàng de shūguǒ, yóuqíshì píngguǒ.",
        "en": "I like eating all kinds of fruits and vegetables, especially apples.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其是_yóuqíshì_-_Especially_particularly_20231230_我喜欢吃各种各样的蔬果尤其是苹果.mp3"
      },
      {
        "cn": "我喜欢所有的季节，尤其是春天。",
        "pinyin": "Wǒ xǐhuan suǒyǒu de jìjié, yóuqíshì chūntiān.",
        "en": "I like all the seasons, especially spring.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其是_yóuqíshì_-_Especially_particularly_20231230_我喜欢所有的季节尤其是春天.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "由此可见 (yóu cǐ kě jiàn) - From this, it can be seen...",
    "short_explanation": "Used to draw a conclusion or judgment based on previous statement.",
    "long_explanation": "The Mandarin Chinese phrase '由此可见 (yóu cǐ kě jiàn)' is used to deduce a conclusion or make an inference from a certain fact or situation that has been mentioned before. It roughly translates to 'from this, it can be seen...' in English, and it often shows up in discussion or debate to underscore a certain viewpoint or perspective.",
    "formation": "Fact or situation + 由此可见 + Conclusion/Judgment",
    "examples": [
      {
        "cn": "他的作业总是按时完成，由此可见，他是一个很认真的学生。",
        "pinyin": "Tā de zuòyè zǒng shì ànshí wánchéng, yóu cǐ kě jiàn, tā shì yīgè hěn rènzhēn de xuéshēng.",
        "en": "His homework is always completed on time, from this, it can be seen that he is a very serious student.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóu_cǐ_kě_jiàn_-_From_this_it_can_be_seen_20231230_他的作业总是按时完成由此可见他是一个很认真的学生.mp3"
      },
      {
        "cn": "他失去了所有的朋友，由此可见，人的性格才是最重要的。",
        "pinyin": "Tā shīqùle suǒyǒu de péngyǒu, yóu cǐ kě jiàn, rén de xìnggé cái shì zuì zhòngyào de.",
        "en": "He has lost all his friends, from this, it can be seen that character is the most important thing.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóu_cǐ_kě_jiàn_-_From_this_it_can_be_seen_20231230_他失去了所有的朋友由此可见人的性格才是最重要的.mp3"
      },
      {
        "cn": "这个城市的经济发展很快，由此可见，政府的政策起了很大作用。",
        "pinyin": "Zhège chéngshì de jīngjì fāzhǎn hěn kuài, yóu cǐ kě jiàn, zhèngfǔ de zhèngcè qǐle hěn dà zuòyòng.",
        "en": "The economy of this city has developed very quickly, from this, it can be seen that the government's policy has played a great role.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóu_cǐ_kě_jiàn_-_From_this_it_can_be_seen_20231230_这个城市的经济发展很快由此可见政府的政策起了很大作用.mp3"
      },
      {
        "cn": "污染水源会导致动植物死亡，由此可见，环保工作的重要性。",
        "pinyin": "Wūrǎn shuǐyuán huì dǎozhì dòngzhíwù sǐwáng, yóu cǐ kě jiàn, huánbǎo gōngzuò de zhòngyàoxìng.",
        "en": "Pollution of water sources will lead to the death of animals and plants, from this, it can be seen the importance of environmental protection work.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此可见_yóu_cǐ_kě_jiàn_-_From_this_it_can_be_seen_20231230_污染水源会导致动植物死亡由此可见环保工作的重要性.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "更不用说 (gèng bùyòng shuō) - Not to mention, let alone",
    "short_explanation": "Used to introduce an even stronger or more obvious point related to a situation or condition.",
    "long_explanation": "The Mandarin Chinese phrase '更不用说 (gèng bùyòng shuō)' is used to introduce a statement that strengthens or emphasizes the main clause of the sentence. It translates to 'not to mention' or 'let alone' in English, indicating a more extreme or significant point than the preceding information. It is often used in comparison or contrasting situations.",
    "formation": "Main Clause + 更不用说 + Stronger/More extreme point.",
    "examples": [
      {
        "cn": "我连那个小问题都没解决，更不用说这个大问题了。",
        "pinyin": "Wǒ lián nàgè xiǎo wèntí dōu méi jiějué, gèng bùyòng shuō zhège dà wèntí le.",
        "en": "I can't even solve that small problem, let alone this big one.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_我连那个小问题都没解决更不用说这个大问题了.mp3"
      },
      {
        "cn": "老师忙得连午饭都没时间吃，更不用说休息了。",
        "pinyin": "Lǎoshī máng de lián wǔfàn dōu méi shíjiān chī, gèng bùyòng shuō xiūxi le.",
        "en": "The teacher is so busy that she doesn't even have time to eat lunch, let alone rest.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_老师忙得连午饭都没时间吃更不用说休息了.mp3"
      },
      {
        "cn": "我还没去过北京，更不用说上海了。",
        "pinyin": "Wǒ hái méi qùguò Běijīng, gèng bùyòng shuō Shànghǎi le.",
        "en": "I haven't even been to Beijing, let alone Shanghai.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_我还没去过北京更不用说上海了.mp3"
      },
      {
        "cn": "他连话都说不清楚，更不用说写文章了。",
        "pinyin": "Tā lián huà dōu shuō bù qīngchu, gèng bùyòng shuō xiě wénzhāng le.",
        "en": "He can't even speak clearly, not to mention writing an article.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_他连话都说不清楚更不用说写文章了.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "何况 (hékuàng) - Let alone, much less",
    "short_explanation": "'何况' is used to mention something more extreme or unlikely after stating a lesser fact or condition.",
    "long_explanation": "The Mandarin Chinese phrase '何况 (hékuàng)' functions as a conjunction similar to 'let alone' or 'much less' in English. It is used when you want to express that if a simple or lesser thing is not or can't be done, then it's even more unlikely that a more extreme or greater thing can be done. It typically follows a statement about a lesser action or condition, then introduces a statement about a more extreme or less likely action or condition.",
    "formation": "Lesser Condition + 何况 + More Extreme or Unlikely Condition",
    "examples": [
      {
        "cn": "他连最基础的问题都回答不出来，何况更复杂的问题。",
        "pinyin": "Tā lián zuì jīchǔ de wèntí dōu huídá bù chūlái, hékuàng gèng fùzá de wèntí.",
        "en": "He can't even answer the most basic questions, let alone more complex ones.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_much_less_20231230_他连最基础的问题都回答不出来何况更复杂的问题.mp3"
      },
      {
        "cn": "我不会说法语，何况写法语。",
        "pinyin": "Wǒ bù huì shuō Fǎyǔ, hékuàng xiě Fǎyǔ.",
        "en": "I can't speak French, much less write it.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_much_less_20231230_我不会说法语何况写法语.mp3"
      },
      {
        "cn": "他甚至没时间看电视，何况看一本长篇小说。",
        "pinyin": "Tā shènzhì méi shíjiān kàn diànshì, hékuàng kàn yī běn chángpiān xiǎoshuō.",
        "en": "He doesn't even have time to watch TV, let alone read a long novel.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_much_less_20231230_他甚至没时间看电视何况看一本长篇小说.mp3"
      },
      {
        "cn": "我连煎蛋都不会，何况煮一顿大餐。",
        "pinyin": "Wǒ lián jiān dàn dōu bù huì, hékuàng zhǔ yī dùn dàcān.",
        "en": "I can't even fry an egg, much less cook a full meal.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_much_less_20231230_我连煎蛋都不会何况煮一顿大餐.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "125"
  },
  {
    "title": "倒不如 (dào bù rú) - Might as well...",
    "short_explanation": "This expression is used to make a comparison and suggest that one choice is superior to another.",
    "long_explanation": "The Mandarin phrase '倒不如 (dào bù rú)' is used to draw a comparison between two options, and suggest that one might be a better or the preferable choice over the other. It is commonly used to express a sense of concession or preference. It translates as 'might as well' or 'better off'. It suggests a comparison where the second option is preferable.",
    "formation": "Situation A + 倒不如 + Situation B",
    "examples": [
      {
        "cn": "你在这里等我两个小时，倒不如回家做你的作业。",
        "pinyin": "Nǐ zài zhèlǐ děng wǒ liǎng gè xiǎoshí, dào bù rú huí jiā zuò nǐ de zuòyè.",
        "en": "You might as well go home and do your homework instead of waiting for me here for two hours.",
        "grammar_audio": "/audio/mandarin/grammar/s_倒不如_dào_bù_rú_-_Might_as_well_20231230_你在这里等我两个小时倒不如回家做你的作业.mp3"
      },
      {
        "cn": "我花这么多钱买这个手机，倒不如买一个新的电脑。",
        "pinyin": "Wǒ huā zhème duō qián mǎi zhège shǒujī, dào bù rú mǎi yīgè xīn de diànnǎo.",
        "en": "I might as well buy a new laptop instead of spending so much money on this phone.",
        "grammar_audio": "/audio/mandarin/grammar/s_倒不如_dào_bù_rú_-_Might_as_well_20231230_我花这么多钱买这个手机倒不如买一个新的电脑.mp3"
      },
      {
        "cn": "你做这么多不喜欢的工作，倒不如找一份你真心喜欢的。",
        "pinyin": "Nǐ zuò zhème duō bù xǐhuan de gōngzuò, dào bù rú zhǎo yīfèn nǐ zhēnxīn xǐhuan de.",
        "en": "You might as well look for a job you really like instead of doing so many jobs you dislike.",
        "grammar_audio": "/audio/mandarin/grammar/s_倒不如_dào_bù_rú_-_Might_as_well_20231230_你做这么多不喜欢的工作倒不如找一份你真心喜欢的.mp3"
      },
      {
        "cn": "你早起赶火车，倒不如今晚就住在火车站附近。",
        "pinyin": "Nǐ zǎo qǐ gǎn huǒchē, dào bù rú jīnwǎn jiù zhù zài huǒchē zhàn fùjìn.",
        "en": "You might as well stay near the train station tonight instead of getting up early to catch the train.",
        "grammar_audio": "/audio/mandarin/grammar/s_倒不如_dào_bù_rú_-_Might_as_well_20231230_你早起赶火车倒不如今晚就住在火车站附近.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "不妨 (bùfáng) - Might as well...",
    "short_explanation": "Used to suggest or propose a course of action that could be beneficial or won't cause harm.",
    "long_explanation": "The Mandarin Chinese phrase '不妨 (bùfáng)' is a modal verb suggesting an action that could be taken without potential harm, or might even bring some benefits. It translates as 'might as well...' in English. It carries a sense of casual suggestion, so it's commonly used among friends, family, or co-workers when discussing various options for action.",
    "formation": "Subject + 不妨 + Verb Phrase",
    "examples": [
      {
        "cn": "你不妨试试这个新的手机应用，它可能会对你有帮助。",
        "pinyin": "Nǐ bùfáng shìshì zhège xīn de shǒujī yìngyòng, tā kěnéng huì duì nǐ yǒu bāngzhù.",
        "en": "You might as well try this new mobile app, it might be helpful to you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不妨_bùfáng_-_Might_as_well_20231230_你不妨试试这个新的手机应用它可能会对你有帮助.mp3"
      },
      {
        "cn": "既然你有时间，不妨去图书馆看看那本书。",
        "pinyin": "Jìrán nǐ yǒu shíjiān, bùfáng qù túshūguǎn kàn kàn nà běn shū.",
        "en": "Since you have time, you might as well go to the library and look at that book.",
        "grammar_audio": "/audio/mandarin/grammar/s_不妨_bùfáng_-_Might_as_well_20231230_既然你有时间不妨去图书馆看看那本书.mp3"
      },
      {
        "cn": "她不妨考虑明年出国深造，在外国的经历对她的发展肯定有利。",
        "pinyin": "Tā bùfáng kǎolǜ míngnián chūguó shēnzào, zài wàiguó de jīnglì duì tā de fāzhǎn kěndìng yǒulì.",
        "en": "She might as well consider going abroad to further her studies next year. The experience of being in a foreign country will certainly be beneficial to her development.",
        "grammar_audio": "/audio/mandarin/grammar/s_不妨_bùfáng_-_Might_as_well_20231230_她不妨考虑明年出国深造在外国的经历对她的发展肯定有利.mp3"
      },
      {
        "cn": "我们不妨晚点再离开，现在高峰期车太多。",
        "pinyin": "Wǒmen bùfáng wǎndiǎn zài líkāi, xiànzài gāofēng qī chē tài duō.",
        "en": "We might as well leave later, there are too many cars during peak hours now.",
        "grammar_audio": "/audio/mandarin/grammar/s_不妨_bùfáng_-_Might_as_well_20231230_我们不妨晚点再离开现在高峰期车太多.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "既然...就... (jìrán... jiù...) - Since... then...",
    "short_explanation": "The construction '既然...就...' expresses that Since A is true, then B should logically follow.",
    "long_explanation": "The phrase '既然...就...' is a standard Chinese grammatical structure used to express digital causation. It is equivalent to the English phrase 'since...then...'. The cause or premise mentioned after '既然' leads to the result or conclusion that follows '就'. The usage of this structure usually implies that the fact expressed after '既然' is an acknowledged or indisputable fact.",
    "formation": "既然 + Statement A (Fact), 就 + Statement B (Result or Conclusion)",
    "examples": [
      {
        "cn": "既然你已经决定去了，我就不劝你留下来了。",
        "pinyin": "Jìrán nǐ yǐjīng juédìng qùle, wǒ jiù bù quàn nǐ liú xiàlái le.",
        "en": "Since you have already decided to go, I won't persuade you to stay.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然就_jìrán_jiù_-_Since_then_20231230_既然你已经决定去了我就不劝你留下来了.mp3"
      },
      {
        "cn": "既然她不喜欢这件衣服，就不要买了。",
        "pinyin": "Jìrán tā bù xǐhuān zhè jiàn yīfu, jiù bù yào mǎi le.",
        "en": "Since she doesn't like this dress, don't buy it.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然就_jìrán_jiù_-_Since_then_20231230_既然她不喜欢这件衣服就不要买了.mp3"
      },
      {
        "cn": "既然你不懂这个问题，我们就重新解释一遍。",
        "pinyin": "Jìrán nǐ bù dǒng zhè gè wèntí, wǒmen jiù chóngxīn jiěshì yībiàn.",
        "en": "Since you don't understand this problem, we will explain it again.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然就_jìrán_jiù_-_Since_then_20231230_既然你不懂这个问题我们就重新解释一遍.mp3"
      },
      {
        "cn": "既然走了这么远，我们就坚持到底吧。",
        "pinyin": "Jìrán zǒu le zhème yuǎn, wǒmen jiù jiānchí dàodǐ ba.",
        "en": "Since we have come so far, let's persist to the end.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然就_jìrán_jiù_-_Since_then_20231230_既然走了这么远我们就坚持到底吧.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "在...方面 (zài... fāngmiàn) - In terms of...",
    "short_explanation": "Used to specify or focus on a particular aspect or field in a statement.",
    "long_explanation": "The Mandarin Chinese phrase '在...方面 (zài... fāngmiàn)' is used to emphasize or specify a particular aspect, field, or domain in a given conversation, statement, or situation. It is similar to saying 'in terms of' or 'with regards to' in English. This phrase allows for specific and detailed communication when discussing different aspects or facets of a concept or topic.",
    "formation": "Subject + 在 + Aspect/Field + 方面 + Verb + Object",
    "examples": [
      {
        "cn": "在音乐方面，他的技艺无人能及。",
        "pinyin": "Zài yīnyuè fāngmiàn, tā de jìyì wúrén néng jí.",
        "en": "In terms of music, his skills are unmatched.",
        "grammar_audio": "/audio/mandarin/grammar/s_在方面_zài_fāngmiàn_-_In_terms_of_20231230_在音乐方面他的技艺无人能及.mp3"
      },
      {
        "cn": "我们在环保方面做得还不够。",
        "pinyin": "Wǒmen zài huánbǎo fāngmiàn zuò dé hái bùgòu.",
        "en": "We are not doing enough in terms of environmental protection.",
        "grammar_audio": "/audio/mandarin/grammar/s_在方面_zài_fāngmiàn_-_In_terms_of_20231230_我们在环保方面做得还不够.mp3"
      },
      {
        "cn": "在学习语言方面，持续练习是关键。",
        "pinyin": "Zài xuéxí yǔyán fāngmiàn, chíxù liànxí shì guānjiàn.",
        "en": "In terms of learning languages, continuous practice is the key.",
        "grammar_audio": "/audio/mandarin/grammar/s_在方面_zài_fāngmiàn_-_In_terms_of_20231230_在学习语言方面持续练习是关键.mp3"
      },
      {
        "cn": "在计划方面，我们应遵循灵活与创新的原则。",
        "pinyin": "Zài jìhuà fāngmiàn, wǒmen yīng zūnshǒu líng huó yǔ chuàngxīn de yuánzé.",
        "en": "In terms of planning, we should adhere to the principles of flexibility and innovation.",
        "grammar_audio": "/audio/mandarin/grammar/s_在方面_zài_fāngmiàn_-_In_terms_of_20231230_在计划方面我们应遵循灵活与创新的原则.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "不如 (bùrú) - Not as good as, inferior to",
    "short_explanation": "Used to make comparisons indicating that something or someone is not as good as something or someone else.",
    "long_explanation": "The Mandarin Chinese term '不如 (bùrú)' is used to make comparisons, indicating that one thing or person is not as good as another. The term '不如' literally translates to 'not as good as', but can also be understood as 'inferior to'. This phrase is often used to compare qualities or states, suggesting a certain deficiency or insufficiency on the part of the person or thing being discussed.",
    "formation": "Subject + 不如 + Comparison Object + Comment",
    "examples": [
      {
        "cn": "这部电影不如他的上一部电影那么吸引人。",
        "pinyin": "Zhè bù diànyǐng bùrú tā de shàng yī bù diànyǐng nàme xīyǐn rén.",
        "en": "This movie is not as attractive as his previous one.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_这部电影不如他的上一部电影那么吸引人.mp3"
      },
      {
        "cn": "在我看来，他不如他的哥哥那么聪明。",
        "pinyin": "Zài wǒ kànlái, tā bùrú tā de gēgē nàme cōngmíng.",
        "en": "In my opinion, he's not as smart as his brother.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_在我看来他不如他的哥哥那么聪明.mp3"
      },
      {
        "cn": "现在的生活不如以前简单。",
        "pinyin": "Xiànzài de shēnghuó bùrú yǐqián jiǎndān.",
        "en": "Life now is not as simple as before.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_现在的生活不如以前简单.mp3"
      },
      {
        "cn": "我喜欢猫，但我不如你那么喜欢狗。",
        "pinyin": "Wǒ xǐhuān māo, dàn wǒ bùrú nǐ nàme xǐhuān gǒu.",
        "en": "I like cats, but I don't like dogs as much as you do.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_我喜欢猫但我不如你那么喜欢狗.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "日益 (rìyì) - Increasingly, more and more",
    "short_explanation": "Used to express that something is increasing or growing over time.",
    "long_explanation": "The Mandarin Chinese phrase '日益 (rìyì)' is a compound adverb used to describe an increasing or growing trend over time. It means something along the lines of 'increasingly', 'more and more' or 'day by day' in English.",
    "formation": "Subject + 日益 + Adjective/Verb",
    "examples": [
      {
        "cn": "随着科技的发展，人们的生活日益便利。",
        "pinyin": "Suízhe kējì de fāzhǎn, rénmen de shēnghuó rìyì biànlì.",
        "en": "With the development of technology, people's lives are becoming increasingly convenient.",
        "grammar_audio": "/audio/mandarin/grammar/s_日益_rìyì_-_Increasingly_more_and_more_20231230_随着科技的发展人们的生活日益便利.mp3"
      },
      {
        "cn": "由于全球变暖，极地冰山的融化速度日益加快。",
        "pinyin": "Yóuyú quánqiú biàn nuǎn, jí dì bīngshān de rónghuà sùdù rìyì jiākuài.",
        "en": "Due to global warming, the melting speed of the polar ice is increasingly accelerating.",
        "grammar_audio": "/audio/mandarin/grammar/s_日益_rìyì_-_Increasingly_more_and_more_20231230_由于全球变暖极地冰山的融化速度日益加快.mp3"
      },
      {
        "cn": "他的中文水平日益提高。",
        "pinyin": "Tā de Zhōngwén shuǐpíng rìyì tígāo.",
        "en": "His Chinese level is improving day by day.",
        "grammar_audio": "/audio/mandarin/grammar/s_日益_rìyì_-_Increasingly_more_and_more_20231230_他的中文水平日益提高.mp3"
      },
      {
        "cn": "随着经济的快速发展，人们对健康生活的关注度日益加深。",
        "pinyin": "Suízhe jīngjì de kuàisù fāzhǎn, rénmen duì jiànkāng shēnghuó de guānzhù dù rìyì jiāshēn.",
        "en": "With rapid economic development, people's attention to a healthy life is deepening more and more.",
        "grammar_audio": "/audio/mandarin/grammar/s_日益_rìyì_-_Increasingly_more_and_more_20231230_随着经济的快速发展人们对健康生活的关注度日益加深.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "怎么办 (zěnme bàn) - What to do?",
    "short_explanation": "Used to express uncertainty about what course of action to take.",
    "long_explanation": "The Mandarin Chinese phrase '怎么办 (zěnme bàn)' is a common expression used to ask for advice or to express uncertainty about what to do in a certain situation. In English, it is equivalent to asking 'what to do?'. This phrase is often utilized when someone is in a dilemma or a confusing situation and needs guidance or suggestions.",
    "formation": "Subject + 怎么办 + Rest of the sentence?",
    "examples": [
      {
        "cn": "我丢失了我的护照，我该怎么办？",
        "pinyin": "Wǒ diūshī le wǒ de hùzhào, wǒ gāi zěnme bàn?",
        "en": "I lost my passport, what should I do?",
        "grammar_audio": "/audio/mandarin/grammar/s_怎么办_zěnme_bàn_-_What_to_do_20231230_我丢失了我的护照我该怎么办.mp3"
      },
      {
        "cn": "电脑突然停止工作了，我怎么办？",
        "pinyin": "Diànnǎo tūrán tíngzhǐ gōngzuò le, wǒ zěnme bàn?",
        "en": "The computer suddenly stopped working, what to do?",
        "grammar_audio": "/audio/mandarin/grammar/s_怎么办_zěnme_bàn_-_What_to_do_20231230_电脑突然停止工作了我怎么办.mp3"
      },
      {
        "cn": "我不懂这个数学问题，怎么办？",
        "pinyin": "Wǒ bù dǒng zhège shùxué wèntí, zěnme bàn?",
        "en": "I don't understand this math problem, what should I do?",
        "grammar_audio": "/audio/mandarin/grammar/s_怎么办_zěnme_bàn_-_What_to_do_20231230_我不懂这个数学问题怎么办.mp3"
      },
      {
        "cn": "我迷路了，我该怎么办？",
        "pinyin": "Wǒ mílù le, wǒ gāi zěnme bàn?",
        "en": "I'm lost, what should I do?",
        "grammar_audio": "/audio/mandarin/grammar/s_怎么办_zěnme_bàn_-_What_to_do_20231230_我迷路了我该怎么办.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "无论如何 (wúlùn rúhé) - Anyway, anyhow, no matter what",
    "short_explanation": "Used to imply that regardless of the circumstances, the action or event will proceed.",
    "long_explanation": "The Mandarin Chinese phrase '无论如何 (wúlùn rúhé)' is used to express that no matter what the situation or circumstance is, the action or event will proceed. It conveys an intention or determination to do something, regardless of obstacles or difficulties. The phrase can be translated to English as 'anyway', 'anyhow' or 'no matter what'.",
    "formation": "无论如何，+ Sentence",
    "examples": [
      {
        "cn": "无论如何，我都会参加你的婚礼。",
        "pinyin": "Wúlùn rúhé, wǒ dōu huì cānjiā nǐ de hūnlǐ.",
        "en": "Anyway, I will attend your wedding.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyway_anyhow_no_matter_what_20231230_无论如何我都会参加你的婚礼.mp3"
      },
      {
        "cn": "无论如何，我们都必须完成这项任务。",
        "pinyin": "Wúlùn rúhé, wǒmen dōu bìxū wánchéng zhè xiàng rènwù.",
        "en": "No matter what, we must complete this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyway_anyhow_no_matter_what_20231230_无论如何我们都必须完成这项任务.mp3"
      },
      {
        "cn": "无论如何，你都应该尊重他人。",
        "pinyin": "Wúlùn rúhé, nǐ dōu yīnggāi zūnzhòng tārén.",
        "en": "Anyway, you should respect others.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyway_anyhow_no_matter_what_20231230_无论如何你都应该尊重他人.mp3"
      },
      {
        "cn": "无论如何，我都会支持你的决定。",
        "pinyin": "Wúlùn rúhé, wǒ dōu huì zhīchí nǐ de juédìng.",
        "en": "Anyway, I will support your decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论如何_wúlùn_rúhé_-_Anyway_anyhow_no_matter_what_20231230_无论如何我都会支持你的决定.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "只要...就... (zhǐyào... jiù...) - As long as... then...",
    "short_explanation": "Used to express a condition and its result.",
    "long_explanation": "The Mandarin Chinese grammar pattern '只要...就...' (zhǐyào... jiù...) is used to express a condition and its result. It's equivalent to 'as long as... then...' in English. This pattern usually indicates that the condition in the '只要' part is easy to satisfy, and once it is met, the result in the '就' part will happen.",
    "formation": "只要 + Condition, 就 + Result",
    "examples": [
      {
        "cn": "只要你努力学习，就会成功。",
        "pinyin": "Zhǐyào nǐ nǔlì xuéxí, jiù huì chénggōng.",
        "en": "As long as you study hard, you will succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你努力学习就会成功.mp3"
      },
      {
        "cn": "只要天气好，我们就去公园散步。",
        "pinyin": "Zhǐyào tiānqì hǎo, wǒmen jiù qù gōngyuán sànbù.",
        "en": "As long as the weather is good, we will go for a walk in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要天气好我们就去公园散步.mp3"
      },
      {
        "cn": "只要你保持健康，就可以长寿。",
        "pinyin": "Zhǐyào nǐ bǎochí jiànkāng, jiù kěyǐ chángshòu.",
        "en": "As long as you stay healthy, you can live a long life.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你保持健康就可以长寿.mp3"
      },
      {
        "cn": "只要有良好的心态，就能应对生活中的困难。",
        "pinyin": "Zhǐyào yǒu liánghǎo de xīntài, jiù néng yìngduì shēnghuó zhōng de kùnnan.",
        "en": "As long as you have a good mentality, you can deal with difficulties in life.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要有良好的心态就能应对生活中的困难.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "任何 (rènhé) - Any, Whichever",
    "short_explanation": "Used to state that it doesn't matter who or what is being talked about.",
    "long_explanation": "The Mandarin Chinese phrase '任何 (rènhé)' is a determiner used to refer to an indefinite quantity or number. It is equivalent to 'any' or 'whichever' in English. This phrase can be used irrespective of the nature, type, or quantity of the subject under discussion.",
    "formation": "'任何' + Noun + Rest of the sentence",
    "examples": [
      {
        "cn": "这家商店接受任何信用卡支付。",
        "pinyin": "Zhè jiā shāngdiàn jiēshòu rènhé xìnyòngkǎ zhīfù.",
        "en": "This shop accepts any credit card for payment.",
        "grammar_audio": "/audio/mandarin/grammar/s_任何_rènhé_-_Any_Whichever_20231230_这家商店接受任何信用卡支付.mp3"
      },
      {
        "cn": "你可以在任何时间来参观我们的展览。",
        "pinyin": "Nǐ kěyǐ zài rènhé shíjiān lái cānguān wǒmen de zhǎnlǚn.",
        "en": "You can visit our exhibition at any time.",
        "grammar_audio": "/audio/mandarin/grammar/s_任何_rènhé_-_Any_Whichever_20231230_你可以在任何时间来参观我们的展览.mp3"
      },
      {
        "cn": "在任何情况下，你都不能告诉他这个秘密。",
        "pinyin": "Zài rènhé qíngkuàng xià, nǐ dōu bùnéng gàosù tā zhège mìmì.",
        "en": "Under any circumstances, you cannot tell him this secret.",
        "grammar_audio": "/audio/mandarin/grammar/s_任何_rènhé_-_Any_Whichever_20231230_在任何情况下你都不能告诉他这个秘密.mp3"
      },
      {
        "cn": "如果你有任何疑问，请随时提出。",
        "pinyin": "Rúguǒ nǐ yǒu rènhé yíwèn, qǐng suíshí tíchū.",
        "en": "If you have any questions, please feel free to ask.",
        "grammar_audio": "/audio/mandarin/grammar/s_任何_rènhé_-_Any_Whichever_20231230_如果你有任何疑问请随时提出.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "无非 (wúfēi) - Nothing but, nothing more than",
    "short_explanation": "Used to indicate something is simply the way it is described, often downplaying its significance.",
    "long_explanation": "The Mandarin Chinese term '无非 (wúfēi)' is commonly used in conversation to express that something is solely or just as explained, often diminishing its importance or impact. It is equivalent to saying 'nothing but' or 'nothing more than' in English. This term is usually employed when one is trying to emphasize that there isn't much depth or complexity to the point being discussed.",
    "formation": "Subject + 无非 + Verb/Adjective + Rest of sentence",
    "examples": [
      {
        "cn": "他无非是想你更好地理解他的立场而已。",
        "pinyin": "Tā wú fēi shì xiǎng nǐ gèng hǎo dì lǐ jiě tā de lì chǎng ér yǐ.",
        "en": "He simply wants you to better understand his position.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_nothing_more_than_20231230_他无非是想你更好地理解他的立场而已.mp3"
      },
      {
        "cn": "这无非是一次普通的商业交易。",
        "pinyin": "Zhè wúfēi shì yīcì pǔtōng de shāngyè jiāoyì.",
        "en": "This is nothing more than a regular business transaction.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_nothing_more_than_20231230_这无非是一次普通的商业交易.mp3"
      },
      {
        "cn": "他的建议无非想让我们更努力一点。",
        "pinyin": "Tā de jiànyì wúfēi xiǎng ràng wǒmen gèng nǔlì yīdiǎn.",
        "en": "His suggestion is nothing but a push for us to work harder.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_nothing_more_than_20231230_他的建议无非想让我们更努力一点.mp3"
      },
      {
        "cn": "这个游戏无非是关于合作和团队精神的。",
        "pinyin": "Zhège yóuxì wúfēi shì guānyú hézuò hé tuánduì jīngshén de.",
        "en": "This game is nothing more than about collaboration and team spirit.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_nothing_more_than_20231230_这个游戏无非是关于合作和团队精神的.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "即便 (jíbiàn) - Even if, Even though",
    "short_explanation": "Used to express a hypothetical condition, usually indicating a conceding circumstance or exception.",
    "long_explanation": "The Mandarin Chinese term '即便 (jíbiàn)' is a conjunction that is equivalent to 'even if' or 'even though' in English. It is used to introduce a hypothetical condition or exception, often implying a resolution or persistence in spite of possible adversity or unfavourable conditions.",
    "formation": "即便 + Hypothetical Condition/Situation, + Main Clause",
    "examples": [
      {
        "cn": "即便天气很冷，我也会去跑步。",
        "pinyin": "Jíbiàn tiānqì hěn lěng, wǒ yě huì qù pǎobù.",
        "en": "Even if the weather is very cold, I will go running.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_Even_though_20231230_即便天气很冷我也会去跑步.mp3"
      },
      {
        "cn": "即便他不会来, 我们还是要等他。",
        "pinyin": "Jíbiàn tā bú huì lái, wǒmen háishi yào děng tā.",
        "en": "Even if he won't come, we still have to wait for him.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_Even_though_20231230_即便他不会来_我们还是要等他.mp3"
      },
      {
        "cn": "他很聪明，即便任务很难，他也能完成。",
        "pinyin": "Tā hěn cōngmíng, jíbiàn rènwù hěn nán, tā yě néng wánchéng.",
        "en": "He is very smart, even if the task is difficult, he can still complete it.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_Even_though_20231230_他很聪明即便任务很难他也能完成.mp3"
      },
      {
        "cn": "即便有工作，我也会抽时间去参观展览。",
        "pinyin": "Jíbiàn yǒu gōngzuò, wǒ yě huì chōu shíjiān qù cānguān zhǎnlǎn.",
        "en": "Even if I have work, I will make time to visit the exhibition.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_Even_though_20231230_即便有工作我也会抽时间去参观展览.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "按照 (ànzhào) - According to",
    "short_explanation": "Used to indicate doing something according to a certain method, rule, or standard.",
    "long_explanation": "The Mandarin Chinese phrase '按照 (ànzhào)' is used to show that someone is doing something based on a certain method, guideline, standard, or rule. It can be literally translated to English as 'according to', 'in accordance with', or 'based on'. You can use it when you want to express that something is being done according to a certain principle, norm, or basis.",
    "formation": "Subject + 按照 + Method / Rule / Standard + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "按照老师的建议，我决定每天学习一小时中文。",
        "pinyin": "Ànzhào lǎoshī de jiànyì, wǒ juédìng měitiān xuéxí yī xiǎoshí Zhōngwén.",
        "en": "According to the teacher's advice, I decided to study Chinese for one hour every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_按照_ànzhào_-_According_to_20231230_按照老师的建议我决定每天学习一小时中文.mp3"
      },
      {
        "cn": "按照这个配方做饭，你会得到一道美味的菜。",
        "pinyin": "Ànzhào zhège pèifǎng zuòfàn, nǐ huì dédào yīdào měiwèi de cài.",
        "en": "If you cook according to this recipe, you will get a delicious dish.",
        "grammar_audio": "/audio/mandarin/grammar/s_按照_ànzhào_-_According_to_20231230_按照这个配方做饭你会得到一道美味的菜.mp3"
      },
      {
        "cn": "按照地图，我们应该在这个十字路口右转。",
        "pinyin": "Ànzhào dìtú, wǒmen yīnggāi zài zhège shízì lùkǒu yòu zhuǎn.",
        "en": "According to the map, we should turn right at this intersection.",
        "grammar_audio": "/audio/mandarin/grammar/s_按照_ànzhào_-_According_to_20231230_按照地图我们应该在这个十字路口右转.mp3"
      },
      {
        "cn": "按照他的计划，我们晚餐后立即去电影院。",
        "pinyin": "Ànzhào tā de jìhuà, wǒmen wǎncān hòu lìjí qù diànyǐngyuàn.",
        "en": "According to his plan, we will go to the cinema immediately after dinner.",
        "grammar_audio": "/audio/mandarin/grammar/s_按照_ànzhào_-_According_to_20231230_按照他的计划我们晚餐后立即去电影院.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  },
  {
    "title": "一...就... (yī... jiù...) - As soon as...",
    "short_explanation": "Used to indicate that the second action happens immediately after the first action.",
    "long_explanation": "The Mandarin Chinese pattern '一...就...' (yī... jiù...) translates to 'as soon as...'. It communicates the idea that a second action or situation occurs immediately or shortly after the first one. The pattern is often used to emphasise the shortness of the time interval between the two actions.",
    "formation": "一 + [Action 1] + 就 + [Action 2]",
    "examples": [
      {
        "cn": "一放学，他就回家做作业。",
        "pinyin": "Yī fàngxué, tā jiù huí jiā zuò zuòyè.",
        "en": "As soon as he finishes school, he goes home to do his homework.",
        "grammar_audio": "/audio/mandarin/grammar/s_一就_yī_jiù_-_As_soon_as_20231230_一放学他就回家做作业.mp3"
      },
      {
        "cn": "一到北京，我们就去参观长城。",
        "pinyin": "Yī dào Běijīng, wǒmen jiù qù cānguān Chángchéng.",
        "en": "As soon as we arrive in Beijing, we go to visit the Great Wall.",
        "grammar_audio": "/audio/mandarin/grammar/s_一就_yī_jiù_-_As_soon_as_20231230_一到北京我们就去参观长城.mp3"
      },
      {
        "cn": "一下雨就变冷。",
        "pinyin": "Yī xiàyǔ jiù biàn lěng.",
        "en": "As soon as it rains, it gets cold.",
        "grammar_audio": "/audio/mandarin/grammar/s_一就_yī_jiù_-_As_soon_as_20231230_一下雨就变冷.mp3"
      },
      {
        "cn": "一看到那个景色，他就高兴起来。",
        "pinyin": "Yī kàndào nàgè jǐngsè, tā jiù gāoxìng qǐlái.",
        "en": "As soon as he sees that scenery, he becomes happy.",
        "grammar_audio": "/audio/mandarin/grammar/s_一就_yī_jiù_-_As_soon_as_20231230_一看到那个景色他就高兴起来.mp3"
      }
    ],
    "p_tag": "HSK_6",
    "s_tag": "150"
  }
]