[
  {
    "title": "ขึ้นอยู่กับ (khʉ̂n yùu gàp) - Depends on",
    "short_explanation": "Expresses dependence on another factor; to imply that something 'depends on'.",
    "long_explanation": "The phrase 'ขึ้นอยู่กับ (khʉ̂n yùu gàp)' is frequently employed in Thai language to denote reliance or dependence on another factor. In English, it is roughly translated as 'depending on,' 'up to,' or 'it depends on.' Usually, this phrase introduces the condition or influence helping make the final decision. It can be used in many contexts and with a variety of sentence structures to articulate a situation or action being contingent on another event or circumstance.",
    "formation": "Statement + ขึ้นอยู่กับ + Influencing factor",
    "examples": [
      {
        "th": "การ ที่ ฉัน จะ สามารถ เรียน ต่อ ต่าง ประเทศ หรือ ไม่ ขึ้น อยู่ กับ ผล การ เรียน ของ ฉัน",
        "romaji": "Kan thi chan ja sa-mart riian tor dtang prathet reu mai khun yu kap phol kan riian kong chan",
        "en": "Whether I can study abroad or not depends on my academic performance.",
        "grammar_audio": "/audio/thai/grammar/s_ขึ้นอยู่กับ_khʉ̂n_yùu_gàp_-_Depends_on_20231230_การ_ที่_ฉัน_จะ_สามารถ_เรียน_ต่อ_ต่าง_ประเทศ_หรือ_ไม่_ขึ้น_อยู่_กับ_ผล_การ_เรียน_ของ_ฉัน.mp3"
      },
      {
        "th": "ว่า เรา จะ ไป ปิคนิค หรือ ไม่ ขึ้น อยู่ กับ อากาศ วัน นี้",
        "romaji": "Wa rao ja pai piknik reu mai khun yu kap a-gat wan ni",
        "en": "Whether we go for a picnic or not, depends on today's weather.",
        "grammar_audio": "/audio/thai/grammar/s_ขึ้นอยู่กับ_khʉ̂n_yùu_gàp_-_Depends_on_20231230_ว่า_เรา_จะ_ไป_ปิคนิค_หรือ_ไม่_ขึ้น_อยู่_กับ_อากาศ_วัน_นี้.mp3"
      },
      {
        "th": "ทุกวัน เรา ทำอะไร ขึ้น อยู่ กับ แผน กิจกรรม ที่ เรา วาง ไว้",
        "romaji": "Thuk wan rao tham a-rai khun yu kap phean kit-ka-rom thi rao wang wai",
        "en": "What we do every day depends on the activity plan we have laid out.",
        "grammar_audio": "/audio/thai/grammar/s_ขึ้นอยู่กับ_khʉ̂n_yùu_gàp_-_Depends_on_20231230_ทุกวัน_เรา_ทำอะไร_ขึ้น_อยู่_กับ_แผน_กิจกรรม_ที่_เรา_วาง_ไว้.mp3"
      },
      {
        "th": "ผลลัพธ์ ของ การ แข่งขัน นั้น ขึ้น อยู่ กับ การ ปฏิบัติ ของ ทีม เรา",
        "romaji": "Phon-lap-tho kong kan khaeng-kan nan khun yu kap kan pa-tip-bat kong team rao",
        "en": "The result of the competition depends on our team's performance.",
        "grammar_audio": "/audio/thai/grammar/s_ขึ้นอยู่กับ_khʉ̂n_yùu_gàp_-_Depends_on_20231230_ผลลัพธ์_ของ_การ_แข่งขัน_นั้น_ขึ้น_อยู่_กับ_การ_ปฏิบัติ_ของ_ทีม_เรา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "อนึ่ง (anʉ̀ng) - Namely, that is to say",
    "short_explanation": "Used to introduce more detailed information, or to specify something in particular; equivalent to 'namely' or 'that is to say'.",
    "long_explanation": "The term 'อนึ่ง (anʉ̀ng)' is used in Thai language to provide further details or to pinpoint something specifically. It functions similarly to 'namely' or 'that is to say' in English. It is often seen in formal or academic writing and can be placed either at the beginning or middle of the sentence.",
    "formation": "Statement + อนึ่ง",
    "examples": [
      {
        "th": "ฉัน ต้อง ปรับ เปลี่ยน แผน การ ท่องเที่ยว บาง ส่วน อนึ่ง หลังจาก ที่ รับ ข้อมูล ว่า มี การ ปิด เพื่อ การ ซ่อมบำรุง",
        "romaji": "Chan tong prap plian plaen kan thong thiao bang suan anʉ̀ng lang jak thi rap khaw mull wa mee kan pit phuea kan som bum rung",
        "en": "I have to change some of my travel plans, namely after receiving information about the closure for maintenance.",
        "grammar_audio": "/audio/thai/grammar/s_อนึ่ง_anʉ̀ng_-_Namely_that_is_to_say_20231230_ฉัน_ต้อง_ปรับ_เปลี่ยน_แผน_การ_ท่องเที่ยว_บาง_ส่วน_อนึ่ง_หลังจาก_ที่_รับ_ข้อมูล_ว่า_มี_การ_ปิด_เพื่อ_การ_ซ่อมบำรุง.mp3"
      },
      {
        "th": "ร้าน ของ เรา มี หลากหลาย รสชาติ ให้ เลือก อนึ่ง สตรอเบอรี วานิลลา และ ช็อกโกแลต",
        "romaji": "Ran kong rao mee lahk lai rot chat hai leuak anʉ̀ng sa traw be ri wa ni lla lae chok ko lat",
        "en": "Our shop offers a variety of flavors to choose from, namely strawberry, vanilla, and chocolate.",
        "grammar_audio": "/audio/thai/grammar/s_อนึ่ง_anʉ̀ng_-_Namely_that_is_to_say_20231230_ร้าน_ของ_เรา_มี_หลากหลาย_รสชาติ_ให้_เลือก_อนึ่ง_สตรอเบอรี_วานิลลา_และ_ช็อกโกแลต.mp3"
      },
      {
        "th": "มี สัตว์ ที่ ฉัน กลัว มาก ที่สุด อยู่ สาม ชนิด อนึ่ง งู แมงมุม และ คางคก",
        "romaji": "Mee sat thi chan glua mak thi sut yu sam chnid anʉ̀ng ngu maeng mum lae kang kok",
        "en": "There are three types of animals that I am most afraid of, namely snakes, spiders, and lizards.",
        "grammar_audio": "/audio/thai/grammar/s_อนึ่ง_anʉ̀ng_-_Namely_that_is_to_say_20231230_มี_สัตว์_ที่_ฉัน_กลัว_มาก_ที่สุด_อยู่_สาม_ชนิด_อนึ่ง_งู_แมงมุม_และ_คางคก.mp3"
      },
      {
        "th": "ฉัน มี หนังสือ ที่ ฉัน ชอบ อยู่ สาม เล่ม อนึ่ง ฮาร์รี่ พอตเตอร์ เกม ออฟ โทรน และ ลอร์ด ออฟ เดอะ ริงส์",
        "romaji": "Chan mee nang sue thi chan chorp yu sam lem anʉ̀ng haa ri pot tor kem of thon lae lord of the rings",
        "en": "I have three favorite books, namely Harry Potter, Game of Thrones, and Lord of the Rings.",
        "grammar_audio": "/audio/thai/grammar/s_อนึ่ง_anʉ̀ng_-_Namely_that_is_to_say_20231230_ฉัน_มี_หนังสือ_ที่_ฉัน_ชอบ_อยู่_สาม_เล่ม_อนึ่ง_ฮาร์รี่_พอตเตอร์_เกม_ออฟ_โทรน_และ_ลอร์ด_ออฟ_เดอะ_ริงส์.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ถึงแม้ว่า (thʉ̌ng mâe wâa) - Even if, although",
    "short_explanation": "Used to introduce a condition or circumstance that one could imagine happening, or something that might be true",
    "long_explanation": "In Thai, 'ถึงแม้ว่า (thʉ̌ng mâe wâa)' is often used to introduce a condition or circumstance that one could imagine happening, similar to the English 'even if', or 'although'. It is typically found at the beginning of the sentence or clause that expresses a hypothetical situation or a contrary fact. It is often used to indicate that the situation in the main clause exists or will happen despite the situation in the clause that follows 'ถึงแม้ว่า'.",
    "formation": "ถึงแม้ว่า + Statement",
    "examples": [
      {
        "th": "ถึงแม้ว่า ฉัน จะ ยากไร้ แต่ ฉัน ยัง มี ความสุข",
        "romaji": "thʉ̌ng mâe wâa chan ja yak rai tae chan yang mee khwam-sook",
        "en": "Even though I am poor, I am still happy.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_mâe_wâa_-_Even_if_although_20231230_ถึงแม้ว่า_ฉัน_จะ_ยากไร้_แต่_ฉัน_ยัง_มี_ความสุข.mp3"
      },
      {
        "th": "ถึงแม้ว่า ภาษาไทย จะ ยาก แต่ ฉัน ยังอยาก เรียน",
        "romaji": "thʉ̌ng mâe wâa phaasaa Thai ja yak, tae chan yang yak rien",
        "en": "Even if Thai language is difficult, I still want to learn.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_mâe_wâa_-_Even_if_although_20231230_ถึงแม้ว่า_ภาษาไทย_จะ_ยาก_แต่_ฉัน_ยังอยาก_เรียน.mp3"
      },
      {
        "th": "ถึงแม้ว่า วันนี้ ฝน ตก แต่ ฉัน ยัง ต้องการ ออกไป ข้าง นอก",
        "romaji": "thʉ̌ng mâe wâa wanni fon tok, tae chan yang tong gaan awk pai khang nork",
        "en": "Even though it's raining today, I still want to go outside.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_mâe_wâa_-_Even_if_although_20231230_ถึงแม้ว่า_วันนี้_ฝน_ตก_แต่_ฉัน_ยัง_ต้องการ_ออกไป_ข้าง_นอก.mp3"
      },
      {
        "th": "ถึงแม้ว่า ยานพาหนะ จะ คุ้มคาย แต่ เรา สามารถ เดินทาง ไป ทุก ที่",
        "romaji": "thʉ̌ng mâe wâa yaan pa hna ja khoom khai, tae rao sa maat deern thaang pai thook thee",
        "en": "Even if the transportation is expensive, we can travel to everywhere.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_mâe_wâa_-_Even_if_although_20231230_ถึงแม้ว่า_ยานพาหนะ_จะ_คุ้มคาย_แต่_เรา_สามารถ_เดินทาง_ไป_ทุก_ที่.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "จะ...ก็... (jà... gɔ̂...) - Whether... or...",
    "short_explanation": "Used to express 'Whether... or...' in different situations or conditions.",
    "long_explanation": "The 'จะ...ก็...' structure in Thai is used to express the phrases 'Whether... or...' in English. It is often used to indicate different situations or conditions that do not affect the outcome. The clause after 'ก็' is not affected by the various conditions or situations ahead of it. This structure is versatile and can be used with various types of verbs and phrases to express indifference, inevitability, or certainty.",
    "formation": "จะ + Condition 1 + ก็ + Condition 2",
    "examples": [
      {
        "th": "จะ ฝน ตก หรือ ฝน ไม่ ตก ฉัน ก็ จะ ไป ขาย ของ ที่ ตลาด",
        "romaji": "Ja fon tok reu fon mai tok, chan gɔ̂ jà pai kai kong thi talat",
        "en": "Whether it rains or not, I will go to the market to sell things.",
        "grammar_audio": "/audio/thai/grammar/s_จะก็_jà_gɔ̂_-_Whether_or_20231230_จะ_ฝน_ตก_หรือ_ฝน_ไม่_ตก_ฉัน_ก็_จะ_ไป_ขาย_ของ_ที่_ตลาด.mp3"
      },
      {
        "th": "จะ วัน หยุด หรือ วัน ทำงาน ฉัน ก็ ต้อง อ่าน หนังสือ เพื่อ การ สอบ",
        "romaji": "Ja wan yut reu wan tham ngan, chan gɔ̂ tong aan nang sue pheua kan sɔ̂p",
        "en": "Whether it's a day off or a work day, I have to read books for the exam.",
        "grammar_audio": "/audio/thai/grammar/s_จะก็_jà_gɔ̂_-_Whether_or_20231230_จะ_วัน_หยุด_หรือ_วัน_ทำงาน_ฉัน_ก็_ต้อง_อ่าน_หนังสือ_เพื่อ_การ_สอบ.mp3"
      },
      {
        "th": "จะ ทำ อย่างไร ก็ตาม ผม ก็ ยัง รัก เธอ",
        "romaji": "Ja tam yang rai gɔ̂ tam, phom gɔ̂ yang rak thoe",
        "en": "No matter what I do, I still love you.",
        "grammar_audio": "/audio/thai/grammar/s_จะก็_jà_gɔ̂_-_Whether_or_20231230_จะ_ทำ_อย่างไร_ก็ตาม_ผม_ก็_ยัง_รัก_เธอ.mp3"
      },
      {
        "th": "จะ เป็น เช้า หรือ เย็น ฉัน ก็ ยัง คิดถึง เธอ",
        "romaji": "Ja pen chao reu yen, chan gɔ̂ yang khit thung thoe",
        "en": "Whether it's morning or evening, I still miss you.",
        "grammar_audio": "/audio/thai/grammar/s_จะก็_jà_gɔ̂_-_Whether_or_20231230_จะ_เป็น_เช้า_หรือ_เย็น_ฉัน_ก็_ยัง_คิดถึง_เธอ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เพื่อที่จะ (phʉ̂ʉ thîi jà) - In order to, so as to",
    "short_explanation": "Used to express purpose or intention, equivalent to 'in order to' or 'so as to' in English.",
    "long_explanation": "The phrase 'เพื่อที่จะ (phʉ̂ʉ thîi jà)' is used in Thai grammar to express the motive or purpose of an action, similar to 'in order to' or 'so as to' in English. It is typically placed at the beginning of a sentence or clause to denote the intended outcome or objective of an action that follows.",
    "formation": "เพื่อที่จะ + Verb/Objective.",
    "examples": [
      {
        "th": "เขา ศึกษา อย่าง หนัก เพื่อที่จะ ผ่าน การ สอบ ด้วย ผล ที่ ดี",
        "romaji": "Khao sueksa yang nak phʉ̂ʉ thîi jà phan kan sop duai phon thi di",
        "en": "He studies hard in order to pass the exam with good results.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อที่จะ_phʉ̂ʉ_thîi_jà_-_In_order_to_so_as_to_20231230_เขา_ศึกษา_อย่าง_หนัก_เพื่อที่จะ_ผ่าน_การ_สอบ_ด้วย_ผล_ที่_ดี.mp3"
      },
      {
        "th": "ผู้ ร่วม ทีม ทุกคน ทำงาน อย่างมาก ร่วมกัน เพื่อที่จะ บรรลุ เป้าหมาย ใน การ แข่งขัน",
        "romaji": "Phu ruam team thuk khon tham ngan yang maak ruam kan phʉ̂ʉ thîi jà banlu pao mai nai kan khaeng kan",
        "en": "Every team member is working very hard together in order to achieve the goals in the competition.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อที่จะ_phʉ̂ʉ_thîi_jà_-_In_order_to_so_as_to_20231230_ผู้_ร่วม_ทีม_ทุกคน_ทำงาน_อย่างมาก_ร่วมกัน_เพื่อที่จะ_บรรลุ_เป้าหมาย_ใน_การ_แข่งขัน.mp3"
      },
      {
        "th": "ฉัน ออกกำลังกาย สม่ำเสมอ เพื่อที่จะ มี สุขภาพ ที่ ดี",
        "romaji": "Chan ok kam lang gai sa mam sa muay phʉ̂ʉ thîi jà mee suk khap ha phap thi di",
        "en": "I exercise regularly in order to have good health.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อที่จะ_phʉ̂ʉ_thîi_jà_-_In_order_to_so_as_to_20231230_ฉัน_ออกกำลังกาย_สม่ำเสมอ_เพื่อที่จะ_มี_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "เธอ ประหยัด เงิน เพื่อที่จะ ซื้อ บ้าน",
        "romaji": "Thoe pra yat ngern phʉ̂ʉ thîi jà seu baan",
        "en": "She saves money in order to buy a house.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อที่จะ_phʉ̂ʉ_thîi_jà_-_In_order_to_so_as_to_20231230_เธอ_ประหยัด_เงิน_เพื่อที่จะ_ซื้อ_บ้าน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เสมือนว่า (sà-mʉan wâa) - As if, as though",
    "short_explanation": "Indicates a hypothetical or unreal situation; 'as if' or 'as though'.",
    "long_explanation": "The term 'เสมือนว่า (sà-mʉan wâa)' is used in Thai to set up a hypothetical or unreal condition, similar to 'as if' or 'as though' in English. It is situated before the hypothetical action or description and is used often with verbs, adjectives or even idiomatic expressions to convey a resemblance, comparison or imagined scenario.",
    "formation": "เสมือนว่า + Hypothetical statement",
    "examples": [
      {
        "th": "เธอ ยิ้ม เสมือนว่า ไม่มี อะไร เกิด ขึ้น",
        "romaji": "Thoe yim sà-mʉan wâa mai mee a-rai koet kheun",
        "en": "She smiled as if nothing happened.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือนว่า_sà-mʉan_wâa_-_As_if_as_though_20231230_เธอ_ยิ้ม_เสมือนว่า_ไม่มี_อะไร_เกิด_ขึ้น.mp3"
      },
      {
        "th": "สิ่งแวดล้อม ดู เสมือนว่า หยุด นิ่ง เมื่อ เธอ ร้องเพลง",
        "romaji": "Sing waet leum du sà-mʉan wâa yut ning meua thoe raong plaeng",
        "en": "The surroundings seemed as though they froze when she sang.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือนว่า_sà-mʉan_wâa_-_As_if_as_though_20231230_สิ่งแวดล้อม_ดู_เสมือนว่า_หยุด_นิ่ง_เมื่อ_เธอ_ร้องเพลง.mp3"
      },
      {
        "th": "เขา ทำงาน อย่าง เสมือนว่า ไม่มี วัน พรุ่งนี้",
        "romaji": "Khao tham ngan yang sà-mʉan wâa mai mee wan phrung nee",
        "en": "He works as though there is no tomorrow.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือนว่า_sà-mʉan_wâa_-_As_if_as_though_20231230_เขา_ทำงาน_อย่าง_เสมือนว่า_ไม่มี_วัน_พรุ่งนี้.mp3"
      },
      {
        "th": "เธอ มอง เขา เสมือนว่า เขา คือ สิ่ง ที่ สำคัญ ที่สุด ใน โลก",
        "romaji": "Thoe mong khao sà-mʉan wâa khao kheu sing thi sam-khan thi sut nai loke",
        "en": "She looks at him as though he is the most important thing in the world.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือนว่า_sà-mʉan_wâa_-_As_if_as_though_20231230_เธอ_มอง_เขา_เสมือนว่า_เขา_คือ_สิ่ง_ที่_สำคัญ_ที่สุด_ใน_โลก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ตามที่ (dtaam thîi) - According to, as per",
    "short_explanation": "This phrase is used to indicate 'as per, in accordance with, or according to'.",
    "long_explanation": "In the Thai language, the term 'ตามที่ (dtaam thîi)' is used to indicate actions or conditions following or according to something that has been previously mentioned or understood. Usually used at the beginning of the sentence, it introduces a statement that corresponds to, reflects, or is based on a fact, advice, or recommendation. The following clause generally contains the information or criteria that the action of the first clause follows or adheres to.",
    "formation": "ตามที่ + Statement",
    "examples": [
      {
        "th": "ตามที่ เรา ได้ คุยกัน ไป ก่อนหน้านี้ ว่า ยินดี ที่ จะ ช่วย เธอ ทำ งาน",
        "romaji": "Dtaam thîi rao dai khui gan pai kòn naen níi wâa yin dee thîi jà chuay thoe tham ngan",
        "en": "As per our previous discussion, I am happy to help you with your work.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่_dtaam_thîi_-_According_to_as_per_20231230_ตามที่_เรา_ได้_คุยกัน_ไป_ก่อนหน้านี้_ว่า_ยินดี_ที่_จะ_ช่วย_เธอ_ทำ_งาน.mp3"
      },
      {
        "th": "ตามที่ หมอ แนะนำ ผม จึง ลด การ รับประทาน อาหาร ที่ มี ความอ้วน",
        "romaji": "Dtaam thîi mǒr nae nam, phǒm jeung lóht gaan ráp pràthaan aa hăan thîi mee khwaam ooan",
        "en": "As per the doctor's advice, I cut down on eating fatty foods.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่_dtaam_thîi_-_According_to_as_per_20231230_ตามที่_หมอ_แนะนำ_ผม_จึง_ลด_การ_รับประทาน_อาหาร_ที่_มี_ความอ้วน.mp3"
      },
      {
        "th": "ตามที่ กฎหมาย กำหนด ฉัน จะ ต้อง ปฏิบัติตาม คำสั่ง นี้",
        "romaji": "Dtaam thîi gòt maai gamnòht, chăn jà dtông bpà-dtì-bàt-dtam kam sòng níi",
        "en": "According to the law, I will have to comply with this order.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่_dtaam_thîi_-_According_to_as_per_20231230_ตามที่_กฎหมาย_กำหนด_ฉัน_จะ_ต้อง_ปฏิบัติตาม_คำสั่ง_นี้.mp3"
      },
      {
        "th": "ตามที่ มี ข่าว มา ว่า การ ทำงาน จะ เริ่ม ถึง ชั่วโมง นี้",
        "romaji": "Dtaam thîi mee kàao maa wâa gaan tham ngan jà rûem teung chûa mong níi",
        "en": "As per the news, the work will begin this hour.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่_dtaam_thîi_-_According_to_as_per_20231230_ตามที่_มี_ข่าว_มา_ว่า_การ_ทำงาน_จะ_เริ่ม_ถึง_ชั่วโมง_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เกินไป (goen bpai) - Too much, excessively",
    "short_explanation": "Indicates that something is 'too much' or 'excessive'.",
    "long_explanation": "The term 'เกินไป (goen bpai)' is used in Thai to denote something being 'too much' or 'excessive'. It is generally placed after the adjective or verb in a sentence to express an excess or overpowering nature of something. This term emphasizes the extremity of the amount or action described.",
    "formation": "Adjective/Verb + เกินไป",
    "examples": [
      {
        "th": "อากาศ ร้อน เกินไป ฉัน อยาก อาบ น้ำ",
        "romaji": "Aagat rawn goen bpai, chan yàk àap náam",
        "en": "The weather is too hot, I want to take a shower.",
        "grammar_audio": "/audio/thai/grammar/s_เกินไป_goen_bpai_-_Too_much_excessively_20231230_อากาศ_ร้อน_เกินไป_ฉัน_อยาก_อาบ_น้ำ.mp3"
      },
      {
        "th": "ฉัน เหนื่อย เกินไป จาก การ ทำงาน",
        "romaji": "Chan nùeai goen bpai jaak gaan tham-ngan",
        "en": "I am too tired from working.",
        "grammar_audio": "/audio/thai/grammar/s_เกินไป_goen_bpai_-_Too_much_excessively_20231230_ฉัน_เหนื่อย_เกินไป_จาก_การ_ทำงาน.mp3"
      },
      {
        "th": "รถ ติดขัด มาก เกินไป ทำให้ ฉัน มา สาย",
        "romaji": "Rot dtìd-kàt mâak goen bpai, tham-hâi chán maa saai",
        "en": "The traffic is too much, making me late.",
        "grammar_audio": "/audio/thai/grammar/s_เกินไป_goen_bpai_-_Too_much_excessively_20231230_รถ_ติดขัด_มาก_เกินไป_ทำให้_ฉัน_มา_สาย.mp3"
      },
      {
        "th": "การบ้าน ของ ฉัน มาก เกินไป ฉัน ต้อง อ่าน หนังสือ ทั้ง คืน",
        "romaji": "Kaanbaan kong chan mâak goen bpai, chan dtông àan năng-seu tháng keun",
        "en": "My homework is too much, I have to read books all night.",
        "grammar_audio": "/audio/thai/grammar/s_เกินไป_goen_bpai_-_Too_much_excessively_20231230_การบ้าน_ของ_ฉัน_มาก_เกินไป_ฉัน_ต้อง_อ่าน_หนังสือ_ทั้ง_คืน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ในที่สุด (nai thîi sùt) - Ultimately, in the end",
    "short_explanation": "Used to express the final result or outcome after a series of events or steps; 'ultimately' or 'in the end'.",
    "long_explanation": "The phrase 'ในที่สุด (nai thîi sùt)' translates to 'ultimately' or 'in the end' in English. It is often used at the beginning of a sentence or clause to indicate the final outcome or result after a series of events, steps, or changes. It can be used in a variety of contexts, ranging from storytelling to describing a sequence of events in detail.",
    "formation": "ในที่สุด + Statement",
    "examples": [
      {
        "th": "ในที่สุด ฉัน ก็ สำเร็จ ใน การ ทำ โปรเจค ที่ ยาก ยิ่งนัก นี้",
        "romaji": "Nai thîi sùt, chan gor samret nai kan tam project thi yak ying nak ni",
        "en": "Ultimately, I succeeded in completing this extremely difficult project.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Ultimately_in_the_end_20231230_ในที่สุด_ฉัน_ก็_สำเร็จ_ใน_การ_ทำ_โปรเจค_ที่_ยาก_ยิ่งนัก_นี้.mp3"
      },
      {
        "th": "ในที่สุด เขา ตัดสินใจ ซื้อ บ้าน ใน กรุงเทพฯ แทน ที่ จะ อยู่ ใน ภูเก็ต",
        "romaji": "Nai thîi sùt, khao tad sin jai seu baan nai Krung Thep thae thi ja yu nai Phuket",
        "en": "In the end, he decided to buy a house in Bangkok instead of living in Phuket.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Ultimately_in_the_end_20231230_ในที่สุด_เขา_ตัดสินใจ_ซื้อ_บ้าน_ใน_กรุงเทพฯ_แทน_ที่_จะ_อยู่_ใน_ภูเก็ต.mp3"
      },
      {
        "th": "ในที่สุด เธอ ก็ ปฏิเสธ ไม่ รับ งาน ที่ แถม มา กับ โปรโมชัน",
        "romaji": "Nai thîi sùt, thoe gor pa-ti-set mai rap ngan thi thaem ma kap promotion",
        "en": "Ultimately, she refused to accept the job that came with the promotion.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Ultimately_in_the_end_20231230_ในที่สุด_เธอ_ก็_ปฏิเสธ_ไม่_รับ_งาน_ที่_แถม_มา_กับ_โปรโมชัน.mp3"
      },
      {
        "th": "ในที่สุด เรา ต้อง ยอมรับ ว่า มนุษย์ ไม่สามารถ ทำลาย ธรรมชาติ ได้ โดย ไม่ รับผล ที่ แย่ ลง",
        "romaji": "Nai thîi sùt, rao tong yom rap wa manut mai sa maart tam lai tham chat dai doy mai rap phon thi yae long",
        "en": "In the end, we have to accept that humans cannot destroy nature without facing worse consequences.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่สุด_nai_thîi_sùt_-_Ultimately_in_the_end_20231230_ในที่สุด_เรา_ต้อง_ยอมรับ_ว่า_มนุษย์_ไม่สามารถ_ทำลาย_ธรรมชาติ_ได้_โดย_ไม่_รับผล_ที่_แย่_ลง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "อย่างไรก็ตาม (yâang rai gɔ̂ dtaam) - However, nonetheless",
    "short_explanation": "Indicates a contrast or contradiction; 'however' or 'nonetheless'.",
    "long_explanation": "The phrase 'อย่างไรก็ตาม (yâang rai gɔ̂ dtaam)' in Thai language signifies a contrast or a contradiction, similar to the English words 'however' or 'nonetheless'. It is often placed at the beginning of a sentence to introduce an opposing or contrasting thought, especially after stating a condition or a fact. It can be used to link contrasting narratives, statements or ideas in a single sentence or between sentences.",
    "formation": "'อย่างไรก็ตาม' + Contrasting Statement",
    "examples": [
      {
        "th": "อย่างไรก็ตาม ฉัน ยังคง รัก เธอ",
        "romaji": "yâang rai gɔ̂ dtaam, chan yang kong rak thoe",
        "en": "However, I still love you.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_ฉัน_ยังคง_รัก_เธอ.mp3"
      },
      {
        "th": "มัน เป็น งาน ที่ ยาก อย่างไรก็ตาม ฉัน ต้อง ทำ",
        "romaji": "man pen ngan thi yâak, yâang rai gɔ̂ dtaam, chan dtông tam",
        "en": "However difficult the job is, I have to do it.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_มัน_เป็น_งาน_ที่_ยาก_อย่างไรก็ตาม_ฉัน_ต้อง_ทำ.mp3"
      },
      {
        "th": "อย่างไรก็ตาม จริง ๆ แล้ว ฉัน มี ความสุข",
        "romaji": "yâang rai gɔ̂ dtaam, jing jing laew, chan mee khwam suk",
        "en": "However, truth be told, I am happy.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_จริง_ๆ_แล้ว_ฉัน_มี_ความสุข.mp3"
      },
      {
        "th": "อย่างไรก็ตาม ฉัน จะ ไม่ ยอมแพ้",
        "romaji": "yâang rai gɔ̂ dtaam, chan ja mai yom phae",
        "en": "However, I will not give up.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_ฉัน_จะ_ไม่_ยอมแพ้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เพียงเพราะ (phiang phráw) - Merely because, just because",
    "short_explanation": "This phrase implies the simple reason behind an outcome or decision.",
    "long_explanation": "The term 'เพียงเพราะ (phiang phráw)' is used in Thai to show a straightforward reason or cause for an outcome, similar to the English phrases 'merely because' or 'just because'. It is widely used in situations where the speaker wants to emphasize a simple, perhaps inadequate or unexpected, reason for something happening. It's often placed at the beginning of the phrase that indicates the reason.",
    "formation": "เพียงเพราะ + Reason/cause",
    "examples": [
      {
        "th": "เพียงเพราะ ท่าน กล่าว เพียง คำ เดียว ให้ ฉัน ได้ ยิน แล้ว ฉัน ก็ เข้าใจ",
        "romaji": "Phiang phráw than glào phiang kam diao hai chan dai yin laeo, chan kô khâo jai",
        "en": "Merely because he spoke a single word to me, I understood.",
        "grammar_audio": "/audio/thai/grammar/s_เพียงเพราะ_phiang_phráw_-_Merely_because_just_because_20231230_เพียงเพราะ_ท่าน_กล่าว_เพียง_คำ_เดียว_ให้_ฉัน_ได้_ยิน_แล้ว_ฉัน_ก็_เข้าใจ.mp3"
      },
      {
        "th": "เขา อย่างน้อย ไม่ ควร ถูก ลงโทษ เพียงเพราะ ทำ ความผิด บาง อย่าง ที่ ไม่ใช่ เรื่อง ใหญ่",
        "romaji": "Khao yang noi mai khuan thuuk long thôt phiang phráw tham khwam phìt baang yang thi mai chai rêuang yai",
        "en": "He at least should not be punished merely because he made some small mistakes.",
        "grammar_audio": "/audio/thai/grammar/s_เพียงเพราะ_phiang_phráw_-_Merely_because_just_because_20231230_เขา_อย่างน้อย_ไม่_ควร_ถูก_ลงโทษ_เพียงเพราะ_ทำ_ความผิด_บาง_อย่าง_ที่_ไม่ใช่_เรื่อง_ใหญ่.mp3"
      },
      {
        "th": "เพียงเพราะ เธอ รู้สึก ว่า งานนี้ เข้าประกบ แล้ว เธอ ก็ ต้อง ทำ งานนี้",
        "romaji": "Phiang phráw thoe ruu súek wa ngan nîi khâo pra kob laeo, thoe kô tông tham ngan nîi",
        "en": "Just because you feel this job suits you, you must do it.",
        "grammar_audio": "/audio/thai/grammar/s_เพียงเพราะ_phiang_phráw_-_Merely_because_just_because_20231230_เพียงเพราะ_เธอ_รู้สึก_ว่า_งานนี้_เข้าประกบ_แล้ว_เธอ_ก็_ต้อง_ทำ_งานนี้.mp3"
      },
      {
        "th": "เพียงเพราะ ฉัน ชอบ ศิลปะ แล้ว ทำไม ฉัน ต้อง อธิบาย เหตุผล ให้ ทุกคน",
        "romaji": "Phiang phráw chan chôp sinlapa laeo, tham-mai chan tông a-thi-baai hèt-phon hai thúk-khon",
        "en": "Just because I like art, why should I have to explain the reasons to everyone?",
        "grammar_audio": "/audio/thai/grammar/s_เพียงเพราะ_phiang_phráw_-_Merely_because_just_because_20231230_เพียงเพราะ_ฉัน_ชอบ_ศิลปะ_แล้ว_ทำไม_ฉัน_ต้อง_อธิบาย_เหตุผล_ให้_ทุกคน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ทั้งๆ ที่ (tháng tháng thîi) - Even though, despite the fact that",
    "short_explanation": "Used to create contrast between two conditions or situations, similar to the English 'even though', or 'despite the fact that'.",
    "long_explanation": "In the Thai language, 'ทั้งๆ ที่ (tháng tháng thîi)' is a conjunction used to express contrast or contradiction between two situations. It precedes a statement that sets up an expectation which is contradicted or contrasted by a following statement. It is often used to express a situation where something happens or is the case, even though a different outcome might be expected based on the initial condition.",
    "formation": "ทั้งๆ ที่ + Contrasting statement / situation",
    "examples": [
      {
        "th": "ทั้งๆ ที่ มี สมุนไพร หลากหลาย ใน สวน แต่ เขา ยัง ไม่ เคย มี โอกาส ลอง ทำ อาหาร จาก สมุนไพร เหล่า นั้น",
        "romaji": "Tháng tháng thîi mee sa-moon-pri laak laai nai suan, tae khao yang mai keoi mee oh-kaat long tham aahaan jaak sa-moon-pri lo larn",
        "en": "Even though there are various herbs in the garden, he has never had the opportunity to try cooking with those herbs.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งๆ_ที่_tháng_tháng_thîi_-_Even_though_despite_the_fact_that_20231230_ทั้งๆ_ที่_มี_สมุนไพร_หลากหลาย_ใน_สวน_แต่_เขา_ยัง_ไม่_เคย_มี_โอกาส_ลอง_ทำ_อาหาร_จาก_สมุนไพร_เหล่า_นั้น.mp3"
      },
      {
        "th": "ทั้งๆ ที่ เธอ เป็น คน ที่ ผอม แต่ เธอ กิน อาหาร ได้ มาก",
        "romaji": "Tháng tháng thîi thoe pen khon thi phom, tae thoe gin aahaan dai maak",
        "en": "Even though she is thin, she eats a lot of food.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งๆ_ที่_tháng_tháng_thîi_-_Even_though_despite_the_fact_that_20231230_ทั้งๆ_ที่_เธอ_เป็น_คน_ที่_ผอม_แต่_เธอ_กิน_อาหาร_ได้_มาก.mp3"
      },
      {
        "th": "ทั้งๆ ที่ เขารัก เที่ยว ทะเล แต่ เขา กลัว น้ำ",
        "romaji": "Tháng tháng thîi khao rak thiao tha le, tae khao glua nam",
        "en": "Even though he loves beach vacations, he is afraid of water.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งๆ_ที่_tháng_tháng_thîi_-_Even_though_despite_the_fact_that_20231230_ทั้งๆ_ที่_เขารัก_เที่ยว_ทะเล_แต่_เขา_กลัว_น้ำ.mp3"
      },
      {
        "th": "ทั้งๆ ที่ ฉัน แพ้ แดด แต่ ฉัน ก็ ยัง ชอบ ไป ที่ ชาย หาด",
        "romaji": "Tháng tháng thîi chan phae daet, tae chan gor yang chop pai thi chai hat",
        "en": "Even though I'm sensitive to the sun, I still like going to the beach.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งๆ_ที่_tháng_tháng_thîi_-_Even_though_despite_the_fact_that_20231230_ทั้งๆ_ที่_ฉัน_แพ้_แดด_แต่_ฉัน_ก็_ยัง_ชอบ_ไป_ที่_ชาย_หาด.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ถ้าหาก (thâa hàak) - In case, if at all",
    "short_explanation": "Used to express hypothetical situations or conditions; 'in case' or 'if at all'.",
    "long_explanation": "The term 'ถ้าหาก (thâa hàak)' is typically used in Thai to denote hypothetical scenarios, similar to 'in case' or 'if at all' in English. This conjunction is often used as a more formal version of 'ถ้า (thâa)' or 'if' in Thai, and it usually precedes the condition in the sentence. In English equivalent grammar, it is frequently seen at the beginning of conditional sentences, particularly in type 1 and 2 conditional statements.",
    "formation": "ถ้าหาก + Condition + Statement",
    "examples": [
      {
        "th": "ถ้าหาก ฉัน ได้ ลอตเตอรี ฉัน จะ ซื้อ บ้าน ใหม่",
        "romaji": "thâa hàak chan dai lotteri, chan ja seu baan mai",
        "en": "If at all I won the lottery, I would buy a new house.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าหาก_thâa_hàak_-_In_case_if_at_all_20231230_ถ้าหาก_ฉัน_ได้_ลอตเตอรี_ฉัน_จะ_ซื้อ_บ้าน_ใหม่.mp3"
      },
      {
        "th": "ถ้าหาก เธอ ไม่สบาย ควร พักผ่อน",
        "romaji": "thâa hàak thoe mai sabai, khuan pak pohn",
        "en": "In case you are not feeling well, you should rest.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าหาก_thâa_hàak_-_In_case_if_at_all_20231230_ถ้าหาก_เธอ_ไม่สบาย_ควร_พักผ่อน.mp3"
      },
      {
        "th": "ถ้าหาก ฝน ตก ฉัน จะ ไม่ ไป เดินเล่น ใน สวน",
        "romaji": "thâa hàak fohn tok, chan ja mai pai deon len nai suan",
        "en": "If it rains, I won’t go walking in the park.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าหาก_thâa_hàak_-_In_case_if_at_all_20231230_ถ้าหาก_ฝน_ตก_ฉัน_จะ_ไม่_ไป_เดินเล่น_ใน_สวน.mp3"
      },
      {
        "th": "ถ้าหาก เธอ มา ดึก กว่า นี้ ฉัน จะ มีความกังวล",
        "romaji": "thâa hàak thoe ma duek gwàa ni, chan ja mee khwam khang wol",
        "en": "In case you come later than this, I will be worried.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าหาก_thâa_hàak_-_In_case_if_at_all_20231230_ถ้าหาก_เธอ_มา_ดึก_กว่า_นี้_ฉัน_จะ_มีความกังวล.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ล้วนแล้วร้อย (lúan láew rói) - Purely, solely, completely",
    "short_explanation": "Indicates something is 'purely', 'solely', or 'completely' the case.",
    "long_explanation": "The phrase 'ล้วนแล้วร้อย (lúan láew rói)' in Thai is used to emphasize entirety or completeness of something, translating to 'purely', 'solely', 'completely' or 'all' in English. It is used to express an extreme condition, absolute state, or focusing on one particular aspect exclusively. Commonly placed at the beginning or middle of the sentence.",
    "formation": "ล้วนแล้วร้อย + Statement",
    "examples": [
      {
        "th": "เขา ล้วนแล้วร้อย ทำ งาน เพื่อ ความร่ำรวย",
        "romaji": "Khao lúan láew rói tham ngan phuea khwam rumruay",
        "en": "He purely works for wealth.",
        "grammar_audio": "/audio/thai/grammar/s_ล้วนแล้วร้อย_lúan_láew_rói_-_Purely_solely_completely_20231230_เขา_ล้วนแล้วร้อย_ทำ_งาน_เพื่อ_ความร่ำรวย.mp3"
      },
      {
        "th": "ของ เล่น ที่ อยู่ ใน ห้อง นี้ ล้วนแล้วร้อย ของ เด็ก หญิง",
        "romaji": "Khong len thi yu nai hong ni lúan láew rói khong dek ying",
        "en": "The toys in this room are solely for girls.",
        "grammar_audio": "/audio/thai/grammar/s_ล้วนแล้วร้อย_lúan_láew_rói_-_Purely_solely_completely_20231230_ของ_เล่น_ที่_อยู่_ใน_ห้อง_นี้_ล้วนแล้วร้อย_ของ_เด็ก_หญิง.mp3"
      },
      {
        "th": "ผลงาน ที่ ทำ ออก มา ล้วนแล้วร้อย เป็น การ สะท้อน ใจความรู้สึก ของ เขา",
        "romaji": "Phalngan thi tham auk ma lúan láew rói pen kan satoan jai khwam ruesuk khong khao",
        "en": "His work is completely a reflection of his emotions.",
        "grammar_audio": "/audio/thai/grammar/s_ล้วนแล้วร้อย_lúan_láew_rói_-_Purely_solely_completely_20231230_ผลงาน_ที่_ทำ_ออก_มา_ล้วนแล้วร้อย_เป็น_การ_สะท้อน_ใจความรู้สึก_ของ_เขา.mp3"
      },
      {
        "th": "การ ตรวจสอบ ข้อมูล นี้ ล้วนแล้วร้อย ขั้นตอน ที่ เรียบง่าย แต่ จำเป็น",
        "romaji": "Kan truat sob khomun ni lúan láew rói kan dtuan thi riybai ngaai tae jam pen",
        "en": "Checking this information is an entirely simple but necessary step.",
        "grammar_audio": "/audio/thai/grammar/s_ล้วนแล้วร้อย_lúan_láew_rói_-_Purely_solely_completely_20231230_การ_ตรวจสอบ_ข้อมูล_นี้_ล้วนแล้วร้อย_ขั้นตอน_ที่_เรียบง่าย_แต่_จำเป็น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "โดยเฉพาะ (dooy châ-phâw) - Particularly, especially",
    "short_explanation": "Utilized to show an emphasis or a particular interest in a topic or situation; 'particularly' or 'especially'.",
    "long_explanation": "The phrase 'โดยเฉพาะ (dooy châ-phâw)' is a commonly used term in Thai that denotes a special emphasis or particular interest. It is comparable to the English phrases 'particularly' or 'especially'. It is normally used after the verb or the sentence to underline the importance or the special interest of the preceding statement.",
    "formation": "Statement + โดยเฉพาะ",
    "examples": [
      {
        "th": "ฉัน ชอบ การ เดินทาง และ ต้องการ กลับ ไป เที่ยว ที่ ประเทศไทย อีก ครั้ง โดยเฉพาะ ที่ เกาะ ภูเก็ต",
        "romaji": "Chan chop kan deonthang lae tongkan glap pai thiao thi prateth Thai eek krang dooy châ-phâw thi ko Phuket",
        "en": "I like travelling and want to visit Thailand again, particularly Phuket.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooy_châ-phâw_-_Particularly_especially_20231230_ฉัน_ชอบ_การ_เดินทาง_และ_ต้องการ_กลับ_ไป_เที่ยว_ที่_ประเทศไทย_อีก_ครั้ง_โดยเฉพาะ_ที่_เกาะ_ภูเก็ต.mp3"
      },
      {
        "th": "ผม ชอบ คน ที่ สร้างสรรค์ และ คิดอย่าง มี สติ โดยเฉพาะ ที่ ต้องการ เรียนรู้ สิ่ง ใหม่ ๆ",
        "romaji": "Phom chop kon thi sangsan lae khit yang mee sati dooy châ-phâw thi tong gan rian ru sing mai mai",
        "en": "I appreciate people who are creative and sensible, especially those who want to learn new things.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooy_châ-phâw_-_Particularly_especially_20231230_ผม_ชอบ_คน_ที่_สร้างสรรค์_และ_คิดอย่าง_มี_สติ_โดยเฉพาะ_ที่_ต้องการ_เรียนรู้_สิ่ง_ใหม่_ๆ.mp3"
      },
      {
        "th": "เขา ชื่นชอบ การ เล่น กีฬา ต่าง ๆ โดยเฉพาะ ฟุตบอล",
        "romaji": "Khao chuen chob kan len kil-la tang tang dooy châ-phâw fut-bon",
        "en": "He loves playing various sports, particularly football.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooy_châ-phâw_-_Particularly_especially_20231230_เขา_ชื่นชอบ_การ_เล่น_กีฬา_ต่าง_ๆ_โดยเฉพาะ_ฟุตบอล.mp3"
      },
      {
        "th": "ฉัน ชอบ อ่าน หนังสือ ใน วัน หยุด โดยเฉพาะ หนังสือ วรรณกรรม",
        "romaji": "Chan chop an nung-sue nai wan yut dooy châ-phâw nung-sue wan-nakon",
        "en": "I love reading books on my days off, especially literature.",
        "grammar_audio": "/audio/thai/grammar/s_โดยเฉพาะ_dooy_châ-phâw_-_Particularly_especially_20231230_ฉัน_ชอบ_อ่าน_หนังสือ_ใน_วัน_หยุด_โดยเฉพาะ_หนังสือ_วรรณกรรม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ยิ่งขึ้น (yîng khʉ̂n) - Increasingly, more and more",
    "short_explanation": "Indicates the increase in frequency, intensity or quantity; 'increasingly', 'more and more'",
    "long_explanation": "The phrase 'ยิ่งขึ้น (yîng khʉ̂n)' is used in Thai language to express the gradual increase in intensity, quantity or frequency, similar to the English phrases 'increasingly' or 'more and more'. It can be used to describe growing trends or escalating situations. This phrase is typically placed before the verb or adjective it modifies.",
    "formation": "ยิ่งขึ้น + Verb/Adjective",
    "examples": [
      {
        "th": "เมื่อ ทุกวัน ผ่าน ไป การงาน ของ ฉัน ก็ ยิ่งขึ้น",
        "romaji": "Meua thuk wan phan pai, gan ngan kong chan kô yîng khʉ̂n",
        "en": "As each day passes, my work load becomes increasingly heavier.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งขึ้น_yîng_khʉ̂n_-_Increasingly_more_and_more_20231230_เมื่อ_ทุกวัน_ผ่าน_ไป_การงาน_ของ_ฉัน_ก็_ยิ่งขึ้น.mp3"
      },
      {
        "th": "ด้วย การ ผ่าน ไป ของ เวลา ฉัน รู้สึก ความ รัก ผม ต่อ เธอ ยิ่งขึ้น",
        "romaji": "Duan gan phan pai kong welaa, chan ru suke kwam rak phom dto thoe yîng khʉ̂n",
        "en": "With passage of time, I feel my love for you growing more and more.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งขึ้น_yîng_khʉ̂n_-_Increasingly_more_and_more_20231230_ด้วย_การ_ผ่าน_ไป_ของ_เวลา_ฉัน_รู้สึก_ความ_รัก_ผม_ต่อ_เธอ_ยิ่งขึ้น.mp3"
      },
      {
        "th": "การ เศรษฐกิจ ของ ประเทศ นี้ กำลัง พัฒนา ยิ่งขึ้น",
        "romaji": "Gan sae-tha-git kong pra-thet ni kam lang pathana yîng khʉ̂n",
        "en": "The economy of this country is developing increasingly.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งขึ้น_yîng_khʉ̂n_-_Increasingly_more_and_more_20231230_การ_เศรษฐกิจ_ของ_ประเทศ_นี้_กำลัง_พัฒนา_ยิ่งขึ้น.mp3"
      },
      {
        "th": "เมื่อ ฉัน ได้รับ การ เรียนรู้ มากขึ้น ฉัน รู้สึก ว่า ฉัน ต้องการ รู้ จะ มากยิ่งขึ้น",
        "romaji": "Meua chan dai rap gan riian ruu maak khʉ̂n, chan ru seuk wa chan tong gan ru ja maak yîng khʉ̂n",
        "en": "As I gain more knowledge, I feel the need to know more and more.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งขึ้น_yîng_khʉ̂n_-_Increasingly_more_and_more_20231230_เมื่อ_ฉัน_ได้รับ_การ_เรียนรู้_มากขึ้น_ฉัน_รู้สึก_ว่า_ฉัน_ต้องการ_รู้_จะ_มากยิ่งขึ้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ทั้งนี้เพราะว่า (tháng níi phráw wâa) - This is because",
    "short_explanation": "Used to indicate the reason or cause for a certain situation or event.",
    "long_explanation": "The phrase 'ทั้งนี้เพราะว่า (tháng níi phráw wâa)' is used in Thai to introduce the cause or reason for a certain situation or event, equivalent to the English phrase 'This is because'. Normally, it is used at the beginning of a sentence to give explanation or justification to a situation that has previously been stated or understood.",
    "formation": "ทั้งนี้เพราะว่า + Reason / Cause",
    "examples": [
      {
        "th": "ทั้งนี้เพราะว่า ฉัน ต้องการ ที่จะ แบ่งปัน ความสุข ที่ ฉัน มี กับ ทุก คน",
        "romaji": "Tháng níi phráw wâa chan dtông gaan thîi jà bàeng pan khwaam sùk thîi chan mii gàp thúk kon",
        "en": "This is because I want to share the happiness I have with everyone.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้เพราะว่า_tháng_níi_phráw_wâa_-_This_is_because_20231230_ทั้งนี้เพราะว่า_ฉัน_ต้องการ_ที่จะ_แบ่งปัน_ความสุข_ที่_ฉัน_มี_กับ_ทุก_คน.mp3"
      },
      {
        "th": "ทั้งนี้เพราะว่า เขา ทำงาน เกิน ความสามารถ ของ เขา เอง",
        "romaji": "Tháng níi phráw wâa kháo tham-ngaan gooen khwaam-săa-mâat kŏng kháo eng",
        "en": "This is because he works beyond his capacity.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้เพราะว่า_tháng_níi_phráw_wâa_-_This_is_because_20231230_ทั้งนี้เพราะว่า_เขา_ทำงาน_เกิน_ความสามารถ_ของ_เขา_เอง.mp3"
      },
      {
        "th": "ทั้งนี้เพราะว่า เรา ต้อง อยู่ ใน สภาพ ที่ ไม่แน่นอน ใน ระยะ ยาว",
        "romaji": "Tháng níi phráw wâa rao dtông yùu nai sà-pâap thîi mâi-nâe-non nai rá-yá yaao",
        "en": "This is because we have to be in an uncertain state for a long time.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้เพราะว่า_tháng_níi_phráw_wâa_-_This_is_because_20231230_ทั้งนี้เพราะว่า_เรา_ต้อง_อยู่_ใน_สภาพ_ที่_ไม่แน่นอน_ใน_ระยะ_ยาว.mp3"
      },
      {
        "th": "ทั้งนี้เพราะว่า ฉัน รู้สึก ว่า ฉัน มี ความสามารถ ใน การ ทำงาน นี้",
        "romaji": "Tháng níi phráw wâa chan rúu-sùek wâa chan mii khwaam-săa-mâat nai gaan tham-ngaan níi",
        "en": "This is because I feel that I have the capability in doing this job.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้เพราะว่า_tháng_níi_phráw_wâa_-_This_is_because_20231230_ทั้งนี้เพราะว่า_ฉัน_รู้สึก_ว่า_ฉัน_มี_ความสามารถ_ใน_การ_ทำงาน_นี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "จนถึงขณะนี้ (jon thʉ̌ng khànà níi) - Up until now, hitherto",
    "short_explanation": "Indicates the continuity of a state or an action from a past point up until the present time; 'up until now' or 'hitherto'.",
    "long_explanation": "The term 'จนถึงขณะนี้ (jon thʉ̌ng khànà níi)' is used in Thai to express the continuity of a state or an action from a past point upto the present time. This phrase is similar to 'up until now' or 'hitherto' in English. It emphasizes the duration or persistence of an action or a state up to the present moment. It is placed after the subject and before the verb or other parts of the sentence, which expresses the ongoing action or state.",
    "formation": "Subject + จนถึงขณะนี้ + Verb/Adjective/Phrase",
    "examples": [
      {
        "th": "ฉัน ได้ ทำงาน อย่าง หนัก จนถึงขณะนี้",
        "romaji": "Chan dai tham ngan yang nak jon thʉ̌ng khànà níi",
        "en": "I have been working hard up until now.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงขณะนี้_jon_thʉ̌ng_khànà_níi_-_Up_until_now_hitherto_20231230_ฉัน_ได้_ทำงาน_อย่าง_หนัก_จนถึงขณะนี้.mp3"
      },
      {
        "th": "เขา ได้ อยู่ คนเดียว จนถึงขณะนี้",
        "romaji": "Khao dai yuu khon dieo jon thʉ̌ng khànà níi",
        "en": "He has been living alone up until now.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงขณะนี้_jon_thʉ̌ng_khànà_níi_-_Up_until_now_hitherto_20231230_เขา_ได้_อยู่_คนเดียว_จนถึงขณะนี้.mp3"
      },
      {
        "th": "เธอ ทำ การบ้าน ของ เธอ ทุกวัน จนถึงขณะนี้",
        "romaji": "Thoe tham gan baan kong thoe thuk wan jon thʉ̌ng khànà níi",
        "en": "She has been doing her homework every day up until now.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงขณะนี้_jon_thʉ̌ng_khànà_níi_-_Up_until_now_hitherto_20231230_เธอ_ทำ_การบ้าน_ของ_เธอ_ทุกวัน_จนถึงขณะนี้.mp3"
      },
      {
        "th": "พวกเรา ยังคง ศึกษา ภาษาไทย จนถึงขณะนี้",
        "romaji": "Phuak rao yang kong seuk sa pha sa thai jon thʉ̌ng khànà níi",
        "en": "We have continued studying Thai up until now.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงขณะนี้_jon_thʉ̌ng_khànà_níi_-_Up_until_now_hitherto_20231230_พวกเรา_ยังคง_ศึกษา_ภาษาไทย_จนถึงขณะนี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เพราะเหตุนี้ (phráw hèt níi) - For this reason, thus",
    "short_explanation": "Indicates the cause that led to the result; 'for this reason' or 'thus'.",
    "long_explanation": "The Thai phrase 'เพราะเหตุนี้ (phráw hèt níi)' is used to describe the reason or the cause that led to a particular result, similar to the English 'for this reason' or 'thus'. It is generally placed at the beginning of a sentence or clause to link it with a preceding statement, highlighting the cause and effect relationship.",
    "formation": "เพราะเหตุนี้ + Statement",
    "examples": [
      {
        "th": "เพราะเหตุนี้ ผม ตัดสินใจ ที่ จะ ย้าย ไป อยู่ กับ ป้า ที่ กรุงเทพฯ",
        "romaji": "Phráw hèt níi, phom tat sin jai thi ja yay pai yu gap pa thi Krung Thep",
        "en": "For this reason, I decided to move to live with my aunt in Bangkok.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเหตุนี้_phráw_hèt_níi_-_For_this_reason_thus_20231230_เพราะเหตุนี้_ผม_ตัดสินใจ_ที่_จะ_ย้าย_ไป_อยู่_กับ_ป้า_ที่_กรุงเทพฯ.mp3"
      },
      {
        "th": "เพราะเหตุนี้ ฉัน ได้ เป็น เด็กที่น่ารัก และ มีสุข ที่สุด ใน โลก",
        "romaji": "Phráw hèt níi, chan dai pen dek thi na rak, lae mee suk thi sut nai lok",
        "en": "For this reason, I am the happiest and most beloved child in the world.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเหตุนี้_phráw_hèt_níi_-_For_this_reason_thus_20231230_เพราะเหตุนี้_ฉัน_ได้_เป็น_เด็กที่น่ารัก_และ_มีสุข_ที่สุด_ใน_โลก.mp3"
      },
      {
        "th": "เพราะเหตุนี้ เรา ต้อง ระมัดระวัง เมื่อ ใช้ ความรุนแรง ใน การ แก้ปัญหา",
        "romaji": "Phráw hèt níi, rao tong ra-mat-rang meu chai kwam run raeng nai kan gae pan ha",
        "en": "Thus, we must be careful when using violence to solve problems.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเหตุนี้_phráw_hèt_níi_-_For_this_reason_thus_20231230_เพราะเหตุนี้_เรา_ต้อง_ระมัดระวัง_เมื่อ_ใช้_ความรุนแรง_ใน_การ_แก้ปัญหา.mp3"
      },
      {
        "th": "เพราะเหตุนี้ ฉัน ต้อง อยู่ ต่อ เพื่อ ดูแล ครอบครัว ของ ฉัน",
        "romaji": "Phráw hèt níi, chan tong yu tor phuea du lae khrop khrua kong chan",
        "en": "Thus, I must stay on to take care of my famil.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเหตุนี้_phráw_hèt_níi_-_For_this_reason_thus_20231230_เพราะเหตุนี้_ฉัน_ต้อง_อยู่_ต่อ_เพื่อ_ดูแล_ครอบครัว_ของ_ฉัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "นอกเหนือจาก...ก็ยัง... (nâawk nǔea jàak... gɔ̂ yang...) - Apart from... also...",
    "short_explanation": "This expression is used to mention an additional fact or action along with something else which is considered more important.",
    "long_explanation": "In Thai language, นอกเหนือจาก...ก็ยัง... (nâawk nǔea jàak... gɔ̂ yang...) is a common expression used to add more information in the form of actions or facts to one which is considered more significant. It is typically used to express the ideas 'apart from... also...' or 'in addition to... also...'. The statement or information after นอกเหนือจาก (nâawk nǔea jàak) is generally considered more important while the second part starting from ก็ยัง (gɔ̂ yang) is the added information.",
    "formation": "นอกเหนือจาก Statement 1 + ก็ยัง Statement 2",
    "examples": [
      {
        "th": "นอกเหนือจาก เขา แข็งแรง ทาง ร่างกาย แล้ว เขา ก็ยัง มี จิตใจ ที่ แข็งแรง ด้วย",
        "romaji": "Nâawk nǔea jàak khao khaeng raeng thang rang gai laew, khao gɔ̂ yang mee jit jai thi khaeng raeng duay",
        "en": "Apart from being physically strong, he is also mentally strong.",
        "grammar_audio": "/audio/thai/grammar/s_นอกเหนือจากก็ยัง_nâawk_nǔea_jàak_gɔ̂_yang_-_Apart_from_also_20231230_นอกเหนือจาก_เขา_แข็งแรง_ทาง_ร่างกาย_แล้ว_เขา_ก็ยัง_มี_จิตใจ_ที่_แข็งแรง_ด้วย.mp3"
      },
      {
        "th": "นอกเหนือจาก เป็น นักเรียน ที่ ฉลาด แล้ว เธอ ก็ยัง เป็น นักกีฬา ที่ ดี ด้วย",
        "romaji": "Nâawk nǔea jàak pen nak rian thi chalat laew, thoe gɔ̂ yang pen nak ki la thi di duay",
        "en": "Apart from being a smart student, she is also a good athlete.",
        "grammar_audio": "/audio/thai/grammar/s_นอกเหนือจากก็ยัง_nâawk_nǔea_jàak_gɔ̂_yang_-_Apart_from_also_20231230_นอกเหนือจาก_เป็น_นักเรียน_ที่_ฉลาด_แล้ว_เธอ_ก็ยัง_เป็น_นักกีฬา_ที่_ดี_ด้วย.mp3"
      },
      {
        "th": "นอกเหนือจาก ทำงาน ใน บริษัท แล้ว ผม ก็ยัง ทำ งานเล็กๆน้อยๆ ที่ บ้าน ด้วย",
        "romaji": "Nâawk nǔea jàak tham ngan nai borisat laew, phom gɔ̂ yang tham ngan lek lek noi noi thi ban duay",
        "en": "Apart from working in the company, I also do small jobs at home.",
        "grammar_audio": "/audio/thai/grammar/s_นอกเหนือจากก็ยัง_nâawk_nǔea_jàak_gɔ̂_yang_-_Apart_from_also_20231230_นอกเหนือจาก_ทำงาน_ใน_บริษัท_แล้ว_ผม_ก็ยัง_ทำ_งานเล็กๆน้อยๆ_ที่_บ้าน_ด้วย.mp3"
      },
      {
        "th": "นอกเหนือจาก เรียน ยากยาก ด้าน วิทยาศาสตร์ แล้ว ผม ก็ยัง ชอบ วาดรูป ด้วย",
        "romaji": "Nâawk nǔea jàak rian yak yak dan wit tha ya sart laew, phom gɔ̂ yang chop wat rup duay",
        "en": "Apart from studying hard in science, I also like to draw.",
        "grammar_audio": "/audio/thai/grammar/s_นอกเหนือจากก็ยัง_nâawk_nǔea_jàak_gɔ̂_yang_-_Apart_from_also_20231230_นอกเหนือจาก_เรียน_ยากยาก_ด้าน_วิทยาศาสตร์_แล้ว_ผม_ก็ยัง_ชอบ_วาดรูป_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ในแง่ที่ (nai ngâe thîi) - In terms of, in the aspect of",
    "short_explanation": "This phrase is used to introduce a particular perspective or dimension along which something is being considered or evaluated.",
    "long_explanation": "The phrase 'ในแง่ที่ (nai ngâe thîi)' is used to indicate the perspective or direction from which something is being considered, similar to the English phrases 'in terms of' or 'from the aspect of'. It allows the speaker to specify the dimension along which they are viewing a situation or evaluating a subject. The phrase can be used before an adjective or noun phrase to provide context or scope for a statement or observation.",
    "formation": "ในแง่ที่ + Perspective/Directive",
    "examples": [
      {
        "th": "ในแง่ที่ ของ การ เรียน ความ รู้ เขา สู้ ฉัน ไม่ ได้ เพราะ ว่า เขา ไม่ ค่อย เอา เรื่อง การ เรียน ความ รู้ ส seriously",
        "romaji": "Nai ngâe thîi kong kan riian khwam ru kâo sûu chăn mâi dâi pròr wâa kâo mâi khawy ao rûeang kan riian khwam ru seriously",
        "en": "In terms of knowledge learning, he can't compete with me because he doesn't take learning seriously.",
        "grammar_audio": "/audio/thai/grammar/s_ในแง่ที่_nai_ngâe_thîi_-_In_terms_of_in_the_aspect_of_20231230_ในแง่ที่_ของ_การ_เรียน_ความ_รู้_เขา_สู้_ฉัน_ไม่_ได้_เพราะ_ว่า_เขา_ไม่_ค่อย_เอา_เรื่อง_การ_เรียน_ความ_รู้_ส_seriously.mp3"
      },
      {
        "th": "ในแง่ที่ ของ การ บริหาร ทรัพยากร นายพาณิชย์ ดี กว่า ฉัน ใน จุด นั้น",
        "romaji": "Nai ngâe thîi kong kan boriharn sapayaakorn nai paanich dee gwâa chăn nai jùt nân",
        "en": "In terms of resource management, the businessman is better than me at that point.",
        "grammar_audio": "/audio/thai/grammar/s_ในแง่ที่_nai_ngâe_thîi_-_In_terms_of_in_the_aspect_of_20231230_ในแง่ที่_ของ_การ_บริหาร_ทรัพยากร_นายพาณิชย์_ดี_กว่า_ฉัน_ใน_จุด_นั้น.mp3"
      },
      {
        "th": "ในแง่ที่ ของ การ ทำ งาน ตาม แผน ผม เผชิญ กับ ความ ยาก ลำบาก มาก",
        "romaji": "Nai ngâe thîi kong kan tham ngan dtam phean, phǒm phechǐn gàp khwaam yaak lambâak mâak",
        "en": "In the aspect of working according to plan, I face lots of difficulties.",
        "grammar_audio": "/audio/thai/grammar/s_ในแง่ที่_nai_ngâe_thîi_-_In_terms_of_in_the_aspect_of_20231230_ในแง่ที่_ของ_การ_ทำ_งาน_ตาม_แผน_ผม_เผชิญ_กับ_ความ_ยาก_ลำบาก_มาก.mp3"
      },
      {
        "th": "ในแง่ที่ ของ การ ทำกิจกรรม ร่วม กัน เรา ควร ปรับปรุง ใน ส่วน นั้น ด้วย",
        "romaji": "Nai ngâe thîi kong kan tham git kan rooam gan, rao kuan prap prung nai suan nun duay",
        "en": "In terms of doing activities together, we should also improve that aspect.",
        "grammar_audio": "/audio/thai/grammar/s_ในแง่ที่_nai_ngâe_thîi_-_In_terms_of_in_the_aspect_of_20231230_ในแง่ที่_ของ_การ_ทำกิจกรรม_ร่วม_กัน_เรา_ควร_ปรับปรุง_ใน_ส่วน_นั้น_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "เพื่อว่า (phʉ̂ʉ wâa) - So that, in order that",
    "short_explanation": "Expresses purpose or reason, similar to 'so that' or 'in order that' in English.",
    "long_explanation": "The term 'เพื่อว่า (phʉ̂ʉ wâa)' is used in Thai to express a purpose or reasoning behind any action, comparable to the terms 'so that' or 'in order that' in English. It is often used in the sentence before the action or result that is expected to occur as the outcome of another action, with the expected action or result following 'เพื่อว่า (phʉ̂ʉ wâa)'.",
    "formation": "เพื่อว่า + Expected outcome/result",
    "examples": [
      {
        "th": "เขา อ่าน หนังสือ เพื่อว่า จะ ผ่าน สอบ",
        "romaji": "Khao aan nang-sue phʉ̂ʉ wâa ja phan sǒp",
        "en": "He reads books so that he can pass the exam.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อว่า_phʉ̂ʉ_wâa_-_So_that_in_order_that_20231230_เขา_อ่าน_หนังสือ_เพื่อว่า_จะ_ผ่าน_สอบ.mp3"
      },
      {
        "th": "ฉัน ออกกำลังกาย ทุก วัน เพื่อว่า จะ มี สุขภาพ ที่ ดี",
        "romaji": "Chan auk gam lang gai thuk wan phʉ̂ʉ wâa ja me suk-kha-phaap thi dee",
        "en": "I exercise every day in order that I can have good health.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อว่า_phʉ̂ʉ_wâa_-_So_that_in_order_that_20231230_ฉัน_ออกกำลังกาย_ทุก_วัน_เพื่อว่า_จะ_มี_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "เรา ต้อง ทำงาน เพื่อว่า จะ มี เงิน ใช้ ใน ชีวิต ประจำวัน",
        "romaji": "Rao thong tham-ngan phʉ̂ʉ wâa ja mee ngern chai nai chee-wit pra-jum-wan",
        "en": "We have to work in order to have money to use in everyday life.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อว่า_phʉ̂ʉ_wâa_-_So_that_in_order_that_20231230_เรา_ต้อง_ทำงาน_เพื่อว่า_จะ_มี_เงิน_ใช้_ใน_ชีวิต_ประจำวัน.mp3"
      },
      {
        "th": "ผม ทำ การบ้าน เพื่อว่า จะ ได้ คะแนน เต็ม ใน วิชานี้ ",
        "romaji": "phom tham gan-baan phʉ̂ʉ wâa ja dai kha-naen tem nai wi-chaa-nee",
        "en": "I do my homework so that I can get full marks in this subject.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อว่า_phʉ̂ʉ_wâa_-_So_that_in_order_that_20231230_ผม_ทำ_การบ้าน_เพื่อว่า_จะ_ได้_คะแนน_เต็ม_ใน_วิชานี้_.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ขณะเดียวกัน (khànà dîaw gan) - At the same time, simultaneously",
    "short_explanation": "Indicates that two or more actions or events happen at the same time.",
    "long_explanation": "The phrase 'ขณะเดียวกัน (khànà dîaw gan)' is used in Thai to describe simultaneous events or actions, equivalent to the English 'at the same time' or 'simultaneously'. It can be used to join two clauses representing two simultaneous happenings. Generally, it is placed between the two clauses it is linking, but can also appear at the end of the sentence.",
    "formation": "Action 1 + ขณะเดียวกัน + Action 2",
    "examples": [
      {
        "th": "แม่ ทำ อาหาร ขณะเดียวกัน ที่ พ่อ ซักผ้า",
        "romaji": "mae tham aa-haan khànà dîaw gan thi paw sak-phâa",
        "en": "Mom is cooking while at the same time dad is doing the laundry.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะเดียวกัน_khànà_dîaw_gan_-_At_the_same_time_simultaneously_20231230_แม่_ทำ_อาหาร_ขณะเดียวกัน_ที่_พ่อ_ซักผ้า.mp3"
      },
      {
        "th": "ใน ขณะ ที่ เธอ กำลัง ร้องเพลง ขณะเดียวกัน ที่ฉัน กำลัง เล่น กีตาร์",
        "romaji": "nai khana thi thoe kam lang rong pleng khànà dîaw gan thi chan kam lang len guitar",
        "en": "She is singing while at the same time I am playing the guitar.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะเดียวกัน_khànà_dîaw_gan_-_At_the_same_time_simultaneously_20231230_ใน_ขณะ_ที่_เธอ_กำลัง_ร้องเพลง_ขณะเดียวกัน_ที่ฉัน_กำลัง_เล่น_กีตาร์.mp3"
      },
      {
        "th": "ขณะเดียวกัน ที่ เธอ ชอบ ฉัน ฉัน ก็ ชอบ เธอ",
        "romaji": "khànà dîaw gan thi thoe chop chan, chan gor chop thoe",
        "en": "At the same time as you like me, I also like you.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะเดียวกัน_khànà_dîaw_gan_-_At_the_same_time_simultaneously_20231230_ขณะเดียวกัน_ที่_เธอ_ชอบ_ฉัน_ฉัน_ก็_ชอบ_เธอ.mp3"
      },
      {
        "th": "เขา สาน หัว ขณะเดียวกัน ที่ เขา ก็ ดู หนัง",
        "romaji": "khao san hua khànà dîaw gan thi khao gor du nang",
        "en": "He is weaving at the same time as he is watching a movie.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะเดียวกัน_khànà_dîaw_gan_-_At_the_same_time_simultaneously_20231230_เขา_สาน_หัว_ขณะเดียวกัน_ที่_เขา_ก็_ดู_หนัง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ถ้าเท่าไหร่ (thâa thâo rài) - As much as, depending on how much",
    "short_explanation": "Expresses proportion or correlation; 'as much as', 'depending on how much'.",
    "long_explanation": "The term 'ถ้าเท่าไหร่ (thâa thâo rài)' is a common construction in Thai language that is used to express proportion or correlation, which could be translated into English as 'as much as' or 'depending on how much'. It is generally situated at the beginning of the sentence, followed by an action or condition, then the result or consequence.",
    "formation": "ถ้าเท่าไหร่ + Action/Condition + Result/Consequence",
    "examples": [
      {
        "th": "ถ้าเท่าไหร่ ที่ คุณ ช่วย เรา พยายาม คืน ความดี ให้ คุณ เท่านั้น",
        "romaji": "Thâa thâo rài thi khun chuay rao pha-yam khuen khwam di hai khun thao nan",
        "en": "As much as you help us, we try to return the favor.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าเท่าไหร่_thâa_thâo_rài_-_As_much_as_depending_on_how_much_20231230_ถ้าเท่าไหร่_ที่_คุณ_ช่วย_เรา_พยายาม_คืน_ความดี_ให้_คุณ_เท่านั้น.mp3"
      },
      {
        "th": "ถ้าเท่าไหร่ ที่ คุณ รัก ดอกไม้ นั้น เท่านั้น ที่ ดอกไม้ นั้น ก็ จะ รัก คุณ ซึ่ง มัน ไม่ จริง",
        "romaji": "Thâa thâo rài thi khun rak dork mai nan, thao nan thi dork mai nan gor ja rak khun seung man mai jing",
        "en": "As much as you love that flower, that's how much the flower will love you back, which isn't true.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าเท่าไหร่_thâa_thâo_rài_-_As_much_as_depending_on_how_much_20231230_ถ้าเท่าไหร่_ที่_คุณ_รัก_ดอกไม้_นั้น_เท่านั้น_ที่_ดอกไม้_นั้น_ก็_จะ_รัก_คุณ_ซึ่ง_มัน_ไม่_จริง.mp3"
      },
      {
        "th": "ถ้าเท่าไหร่ ที่ คุณ ทำ งาน อย่าง หนัก เท่านั้น ที่ คุณ ก็ จะ ได้รับ ผลตอบแทน",
        "romaji": "Thâa thâo rài thi khun tham ngan yang nak, thao nan thi khun gor ja dai-rub phol-top-thaen",
        "en": "As much as you work hard, that's how much you will receive rewards.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าเท่าไหร่_thâa_thâo_rài_-_As_much_as_depending_on_how_much_20231230_ถ้าเท่าไหร่_ที่_คุณ_ทำ_งาน_อย่าง_หนัก_เท่านั้น_ที่_คุณ_ก็_จะ_ได้รับ_ผลตอบแทน.mp3"
      },
      {
        "th": "ถ้าเท่าไหร่ ที่ คุณ ใส่ใจ ใน การเรียน คุณ ก็ จะ ได้ คะแนน สูง เท่านั้น",
        "romaji": "Thâa thâo rài thi khun sai jai nai gan-riean, khun gor ja dai ka-naen sung thao nan",
        "en": "As much as you pay attention to your studies, that's how much high scores you will get.",
        "grammar_audio": "/audio/thai/grammar/s_ถ้าเท่าไหร่_thâa_thâo_rài_-_As_much_as_depending_on_how_much_20231230_ถ้าเท่าไหร่_ที่_คุณ_ใส่ใจ_ใน_การเรียน_คุณ_ก็_จะ_ได้_คะแนน_สูง_เท่านั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "ด้วยกัน (dûay gan) - Together",
    "short_explanation": "Used to indicate joint action or shared state; 'together' or 'along with'.",
    "long_explanation": "The term 'ด้วยกัน (dûay gan)' is used in Thai to indicate a joint action or shared state, corresponding to the English concept of 'together' or 'along with'. This word can be placed after the verb or at the end of the sentence to denote the participation or involvement of multiple parties in a shared activity or state. It's a useful term for expressing cooperation, collaboration, and combined efforts or experiences.",
    "formation": "Statement + ด้วยกัน",
    "examples": [
      {
        "th": "เรา ควร ทำ งาน วิจัย ด้วยกัน เพื่อ ที่ จะ ทำให้ เกิด นวัตกรรม ที่ดี",
        "romaji": "Rao khuan tham ngan wi-chai dûay gan phuea thi ja tam hai koet na-wat-ta-karn thi di",
        "en": "We should do research together in order to create good innovation.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_20231230_เรา_ควร_ทำ_งาน_วิจัย_ด้วยกัน_เพื่อ_ที่_จะ_ทำให้_เกิด_นวัตกรรม_ที่ดี.mp3"
      },
      {
        "th": "เขา และ ฉัน ไป ชนะ การแข่งขัน ด้วยกัน",
        "romaji": "Khao lae chan pai chana kan kaeng kan dûay gan",
        "en": "He and I won the competition together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_20231230_เขา_และ_ฉัน_ไป_ชนะ_การแข่งขัน_ด้วยกัน.mp3"
      },
      {
        "th": "เรา ต้อง ปรับปรุง สภาพแวดล้อม ให้ ดี ขึ้น ด้วยกัน",
        "romaji": "Rao tong prab-prung sa-phaap waeat la-om hai di kheun dûay gan",
        "en": "We have to improve the environment together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_20231230_เรา_ต้อง_ปรับปรุง_สภาพแวดล้อม_ให้_ดี_ขึ้น_ด้วยกัน.mp3"
      },
      {
        "th": "ช่วง กิจกรรม นี้ เรา ทุก คน จะ ไป ทริป ท่องเที่ยว ด้วยกัน",
        "romaji": "Chuang ki-jit-karn ni, rao thuk khon ja pai trip thong thiao dûay gan",
        "en": "During this activity, all of us will go on a trip together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_20231230_ช่วง_กิจกรรม_นี้_เรา_ทุก_คน_จะ_ไป_ทริป_ท่องเที่ยว_ด้วยกัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "25"
  },
  {
    "title": "โดยส่วนใหญ่ (dooy sùan yài) - Mostly, generally",
    "short_explanation": "This phrase is used to indicate a general condition or situation, equivalent to 'mostly' or 'generally' in English.",
    "long_explanation": "The phrase 'โดยส่วนใหญ่ (dooy sùan yài)' is widely used in Thai to show a trend or a general condition or situation. It means 'mostly' or 'generally' in English. It can be placed at the beginning or in the middle of a sentence. You can use it with various types of verbs and adjectives to express the majority of a certain situation or condition.",
    "formation": "โดยส่วนใหญ่ + Statement",
    "examples": [
      {
        "th": "โดยส่วนใหญ่ ฉัน แต่งกาย ใส่ เสื้อผ้า สี เขียว",
        "romaji": "Dooy sùan yài, chan taeng gai sai seu pha see khiao",
        "en": "Mostly, I wear green clothes.",
        "grammar_audio": "/audio/thai/grammar/s_โดยส่วนใหญ่_dooy_sùan_yài_-_Mostly_generally_20231230_โดยส่วนใหญ่_ฉัน_แต่งกาย_ใส่_เสื้อผ้า_สี_เขียว.mp3"
      },
      {
        "th": "นักเรียน โดยส่วนใหญ่ ชอบ เรียนรู้ วิชา ทาง ศิลปะ",
        "romaji": "Nakrian dooy sùan yài, chop rian rua wi-cha thang sin-lap",
        "en": "Generally, students like learning arts subjects.",
        "grammar_audio": "/audio/thai/grammar/s_โดยส่วนใหญ่_dooy_sùan_yài_-_Mostly_generally_20231230_นักเรียน_โดยส่วนใหญ่_ชอบ_เรียนรู้_วิชา_ทาง_ศิลปะ.mp3"
      },
      {
        "th": "การเดินทาง ไป ที่ นี้ โดยส่วนใหญ่ มัน เป็นไป ได้ ง่าย",
        "romaji": "Gan dern thang pai thi ni dooy sùan yài, man pen pai dai ngai",
        "en": "Generally, it's easy to travel to this place.",
        "grammar_audio": "/audio/thai/grammar/s_โดยส่วนใหญ่_dooy_sùan_yài_-_Mostly_generally_20231230_การเดินทาง_ไป_ที่_นี้_โดยส่วนใหญ่_มัน_เป็นไป_ได้_ง่าย.mp3"
      },
      {
        "th": "โดยส่วนใหญ่ เขา กิน อาหาร ที่ มี รสชาติ หวาน",
        "romaji": "Dooy sùan yài, khao gin a-haan thi mee rot cha-ti waan",
        "en": "He generally eats food that is sweet in taste.",
        "grammar_audio": "/audio/thai/grammar/s_โดยส่วนใหญ่_dooy_sùan_yài_-_Mostly_generally_20231230_โดยส่วนใหญ่_เขา_กิน_อาหาร_ที่_มี_รสชาติ_หวาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "แต่เพียง (dtàe phiang) - Only, merely, just",
    "short_explanation": "Indicates a focus on a single or specific element, like 'only' or 'merely' in English.",
    "long_explanation": "The Thai phrase 'แต่เพียง (dtàe phiang)' translates to 'only', 'merely', or 'just' in English and is used to highlight or single out a specific element, item, or situation, often to point out a limitation or to mark exclusivity. It typically comes after the subject and before the verb in a sentence.",
    "formation": "Subject + แต่เพียง + verb",
    "examples": [
      {
        "th": "ฉัน แต่เพียง ต้องการ พักผ่อน หนึ่ง วัน",
        "romaji": "Chan dtàe phiang tong gaan pak pon neung wan",
        "en": "I just want to rest for a day.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_just_20231230_ฉัน_แต่เพียง_ต้องการ_พักผ่อน_หนึ่ง_วัน.mp3"
      },
      {
        "th": "เธอ แต่เพียง รู้ทัน ว่า ฉัน รัก เธอ",
        "romaji": "Thoe dtàe phiang ru than wa chan rak thoe",
        "en": "She merely realized that I love her.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_just_20231230_เธอ_แต่เพียง_รู้ทัน_ว่า_ฉัน_รัก_เธอ.mp3"
      },
      {
        "th": "เขา แต่เพียง ลอง ดู แต่ ปรากฎ ว่า เขา มี ความสามารถ",
        "romaji": "Khao dtàe phiang long du dtàe prakod wa khao mee khwam samat",
        "en": "He only tried, but it turned out that he has talent.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_just_20231230_เขา_แต่เพียง_ลอง_ดู_แต่_ปรากฎ_ว่า_เขา_มี_ความสามารถ.mp3"
      },
      {
        "th": "ฉัน แต่เพียง ต้องการ ให้ เธอ มีความสุข",
        "romaji": "Chan dtàe phiang tong gaan hai thoe mee khwam suk",
        "en": "I merely want you to be happy.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_just_20231230_ฉัน_แต่เพียง_ต้องการ_ให้_เธอ_มีความสุข.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "แม้กระทั่ง (mâe grà thǔng) - Even, to the extent that",
    "short_explanation": "Indicates a situation that includes even the most extreme example or possibility, similar to 'even' in English.",
    "long_explanation": "The term 'แม้กระทั่ง (mâe grà thǔng)' in Thai indicates a situation that includes even the most extreme example or possibility. It is similar to 'even' in English, and it is used in situations where an example or possibility that normally would not be included is added to emphasize the extent or reaching of a general statement. Generally, it is used to illustrate an exception or a condition that emphasizes a point to its farthest degree.",
    "formation": "แม้กระทั่ง + Statement",
    "examples": [
      {
        "th": "แม้กระทั่ง ฉัน สูญเสีย ทุกสิ่งที่ ฉัน มี ฉัน ยังคง มี ความหวัง อยู่",
        "romaji": "Mâe grà thǔng chan suai sia thuk sing thi chan mee, chan yang kong mee khwam wang yuu",
        "en": "Even if I lose everything I have, I still have hope.",
        "grammar_audio": "/audio/thai/grammar/s_แม้กระทั่ง_mâe_grà_thǔng_-_Even_to_the_extent_that_20231230_แม้กระทั่ง_ฉัน_สูญเสีย_ทุกสิ่งที่_ฉัน_มี_ฉัน_ยังคง_มี_ความหวัง_อยู่.mp3"
      },
      {
        "th": "แม้กระทั่ง เงิน ทอง แสน ฉัน ก็ ยัง รู้สึก ว่า จะ เป็น ความ สุข อย่าง แท้จริง",
        "romaji": "Mâe grà thǔng ngern thong saen, chan gor yang rue suek wa ja pen khwam suk yang thae jing",
        "en": "Even if I had a lot of money and gold, I would still feel that it would not truly bring happiness.",
        "grammar_audio": "/audio/thai/grammar/s_แม้กระทั่ง_mâe_grà_thǔng_-_Even_to_the_extent_that_20231230_แม้กระทั่ง_เงิน_ทอง_แสน_ฉัน_ก็_ยัง_รู้สึก_ว่า_จะ_เป็น_ความ_สุข_อย่าง_แท้จริง.mp3"
      },
      {
        "th": "แม้กระทั่ง ยาม ที่ ฉัน แย่ ที่สุด ฉัน ก็ ยัง คงัก ว่า ฉัน สามารถ ผ่าน ไป",
        "romaji": "Mâe grà thǔng yahm thi chan yae thi sut, chan gor yang kong khut wa chan sa ma rad phan pai",
        "en": "Even at my worst, I still firmly believe that I can get through it.",
        "grammar_audio": "/audio/thai/grammar/s_แม้กระทั่ง_mâe_grà_thǔng_-_Even_to_the_extent_that_20231230_แม้กระทั่ง_ยาม_ที่_ฉัน_แย่_ที่สุด_ฉัน_ก็_ยัง_คงัก_ว่า_ฉัน_สามารถ_ผ่าน_ไป.mp3"
      },
      {
        "th": "แม้กระทั่ง เขา ไม่ได้ ทำ อะไร ให้ ฉัน เลย แต่ ฉัน ยังคง รัก เขา เหมือน เดิม",
        "romaji": "Mâe grà thǔng khao mai dai tham a-rai hai chan loei, tae chan yang kong rak khao muean derm",
        "en": "Even though he doesn't do anything for me, I still love him the same.",
        "grammar_audio": "/audio/thai/grammar/s_แม้กระทั่ง_mâe_grà_thǔng_-_Even_to_the_extent_that_20231230_แม้กระทั่ง_เขา_ไม่ได้_ทำ_อะไร_ให้_ฉัน_เลย_แต่_ฉัน_ยังคง_รัก_เขา_เหมือน_เดิม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ครั้งไหน (kráng rài) - Whenever, every time",
    "short_explanation": "Used to refer to any instance in time when a particular situation or event occurs.",
    "long_explanation": "The term 'ครั้งไหน (kráng rài)' in Thai language is used to refer to any instance or each occasion in which a particular situation or event occurs. It is equivalent to the English terms 'whenever' or 'every time'. It is typically used at the start of sentences to introduce the triggering event or happening.",
    "formation": "ครั้งไหน + Action",
    "examples": [
      {
        "th": "ครั้งไหน ที่ เขา ได้ยิน เพลง นี้ เขา จะ นึกถึง วันเดือนปี ใน อดีต",
        "romaji": "Krang rai thi khao dai yin pleung nee, khao ja neuk thung wan duean pii nai a-deet",
        "en": "Whenever he hears this song, he thinks of the dates in the past.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งไหน_kráng_rài_-_Whenever_every_time_20231230_ครั้งไหน_ที่_เขา_ได้ยิน_เพลง_นี้_เขา_จะ_นึกถึง_วันเดือนปี_ใน_อดีต.mp3"
      },
      {
        "th": "ครั้งไหน ที่ เรา ไป ทะเล เรา จะ สร้างปราสาททราย เสมอ",
        "romaji": "Krang rai thi rao pai thale, rao ja s-rang prasat sai sà-mǒer",
        "en": "Every time we go to the sea, we always build sandcastles.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งไหน_kráng_rài_-_Whenever_every_time_20231230_ครั้งไหน_ที่_เรา_ไป_ทะเล_เรา_จะ_สร้างปราสาททราย_เสมอ.mp3"
      },
      {
        "th": "ครั้งไหน ที่ ฉัน เจอ เธอ ฉัน จะ รู้สึก ดี",
        "romaji": "Krang rai thi chan jer thoe, chan ja roo seuk di",
        "en": "Whenever I meet you, I feel good.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งไหน_kráng_rài_-_Whenever_every_time_20231230_ครั้งไหน_ที่_ฉัน_เจอ_เธอ_ฉัน_จะ_รู้สึก_ดี.mp3"
      },
      {
        "th": "ครั้งไหน ที่ ได้ รับ ภาระ ที่ หนัก ฉัน จะ บอก ตัวเอง ที่ ต้อง แข็งแรง",
        "romaji": "Krang rai thi dai rap phara thi nak, chan ja bok tua eng thi tong kaeng raeng",
        "en": "Every time I receive a heavy burden, I tell myself to be strong.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งไหน_kráng_rài_-_Whenever_every_time_20231230_ครั้งไหน_ที่_ได้_รับ_ภาระ_ที่_หนัก_ฉัน_จะ_บอก_ตัวเอง_ที่_ต้อง_แข็งแรง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ในทางตรงกันข้าม (nai thaang dtrong gan khâam) - On the contrary, oppositely",
    "short_explanation": "This is a phrase that signifies contradiction or opposition to a previous statement, idea or situation.",
    "long_explanation": "The phrase 'ในทางตรงกันข้าม (nai thaang dtrong gan khâam)' which loosely translates to 'On the contrary' or 'oppositely' in English, is a way to present contrasting ideas or statements in Thai language. It is predominantly utilized to introduce an opinion, fact or statement that contradicts or opposes what was initially presented, thus adding complexity and depth to the conversation or narrative.",
    "formation": "Previous statement + ในทางตรงกันข้าม + New statement",
    "examples": [
      {
        "th": "ฉัน เข้าใจ ว่า คุณ ไม่ชอบ กิน ผัก ในทางตรงกันข้าม คุณ ชอบ กิน ผลไม้ มาก กว่า",
        "romaji": "Chan khao jai wa khun mai chob gin phak, nai thaang dtrong gan khâam, khun chob gin pholamai maak kwa",
        "en": "I understand that you don't like to eat vegetables, on the contrary, you like to eat fruits more.",
        "grammar_audio": "/audio/thai/grammar/s_ในทางตรงกันข้าม_nai_thaang_dtrong_gan_khâam_-_On_the_contrary_oppositely_20231230_ฉัน_เข้าใจ_ว่า_คุณ_ไม่ชอบ_กิน_ผัก_ในทางตรงกันข้าม_คุณ_ชอบ_กิน_ผลไม้_มาก_กว่า.mp3"
      },
      {
        "th": "เขา ไม่ เป็น คน ที่ ขี้เกียจ ในทางตรงกันข้าม เขา ชอบ การ เรียนรู้ สิ่ง ใหม่ ๆ",
        "romaji": "Khao mai pen khon thi kee giatch, nai thaang dtrong gan khâam, khao chob kan rianroo sing mai mai",
        "en": "He is not a lazy person, on the contrary, he loves learning new things.",
        "grammar_audio": "/audio/thai/grammar/s_ในทางตรงกันข้าม_nai_thaang_dtrong_gan_khâam_-_On_the_contrary_oppositely_20231230_เขา_ไม่_เป็น_คน_ที่_ขี้เกียจ_ในทางตรงกันข้าม_เขา_ชอบ_การ_เรียนรู้_สิ่ง_ใหม่_ๆ.mp3"
      },
      {
        "th": "ฉัน ไม่ เห็นด้วย กับ การ ทำ งาน แบบ นี้ ในทางตรงกันข้าม ฉัน คิด ว่า เรา ควร ทำ แบบ นั้น",
        "romaji": "Chan mai hen dauy gap kan tam ngaan baep nee, nai thaang dtrong gan khâam, chan khit wa rao kuan tam baep nan",
        "en": "I don't agree with working this way, on the contrary, I think we should do it that way.",
        "grammar_audio": "/audio/thai/grammar/s_ในทางตรงกันข้าม_nai_thaang_dtrong_gan_khâam_-_On_the_contrary_oppositely_20231230_ฉัน_ไม่_เห็นด้วย_กับ_การ_ทำ_งาน_แบบ_นี้_ในทางตรงกันข้าม_ฉัน_คิด_ว่า_เรา_ควร_ทำ_แบบ_นั้น.mp3"
      },
      {
        "th": "เขา ไม่ ชอบ เที่ยว ทะเล ในทางตรงกันข้าม เขา ชอบ การ เล่น สกี ที่ ภูเขา",
        "romaji": "Khao mai chob thiao thale, nai thaang dtrong gan khâam, khao chob kan len ski thi phu khao",
        "en": "He doesn't like travelling to the sea, on the contrary, he enjoys skiing in the mountains.",
        "grammar_audio": "/audio/thai/grammar/s_ในทางตรงกันข้าม_nai_thaang_dtrong_gan_khâam_-_On_the_contrary_oppositely_20231230_เขา_ไม่_ชอบ_เที่ยว_ทะเล_ในทางตรงกันข้าม_เขา_ชอบ_การ_เล่น_สกี_ที่_ภูเขา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "อย่างไรเสีย (yâang rai sǐa) - Anyhow, anyway",
    "short_explanation": "Expresses doing something anyhow or anyway, regardless of circumstances.",
    "long_explanation": "The term 'อย่างไรเสีย (yâang rai sǐa)' is used in Thai language to indicate doing something anyhow or anyway, regardless of the circumstances or consequences. It is usually placed at the beginning or in the middle of the sentence, often used in situations where something needs to be done, no matter what.",
    "formation": "อย่างไรเสีย + Statement",
    "examples": [
      {
        "th": "อย่างไรเสีย ก็ตาม ต้อง เสร็จสิ้น งาน นี้ ภายใน วัน นี้",
        "romaji": "yâang rai sǐa got tam, dtong set sin ngan nee pai nai wan nee",
        "en": "Anyway, we have to finish this work within today.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรเสีย_yâang_rai_sǐa_-_Anyhow_anyway_20231230_อย่างไรเสีย_ก็ตาม_ต้อง_เสร็จสิ้น_งาน_นี้_ภายใน_วัน_นี้.mp3"
      },
      {
        "th": "อย่างไรเสีย ทาง ไหน เรา ก็ ต้อง คืนถิ่น ฐาน ก่อน เที่ยงคืน",
        "romaji": "yâang rai sǐa tang nai rao got dtong kheun thin than gaun thiang kheun",
        "en": "Anyway, however way, we have to return to base before midnight.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรเสีย_yâang_rai_sǐa_-_Anyhow_anyway_20231230_อย่างไรเสีย_ทาง_ไหน_เรา_ก็_ต้อง_คืนถิ่น_ฐาน_ก่อน_เที่ยงคืน.mp3"
      },
      {
        "th": "เธอ ควร อย่างไรเสีย บอก ฉัน ว่า คุณ ไม่ สามารถ มา ได้",
        "romaji": "thoe kuan yâang rai sǐa bawk chan wa khun mai sa maat ma dai",
        "en": "You should have at least told me that you couldn't come.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรเสีย_yâang_rai_sǐa_-_Anyhow_anyway_20231230_เธอ_ควร_อย่างไรเสีย_บอก_ฉัน_ว่า_คุณ_ไม่_สามารถ_มา_ได้.mp3"
      },
      {
        "th": "อย่างไรเสีย นักเรียน ควร ทำ การบ้าน ให้ เสร็จ ก่อน ไป เล่น",
        "romaji": "yâang rai sǐa nak-rian kuan tham gan baan hai set gaun pai len",
        "en": "Anyway, students should finish their homework before playing.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรเสีย_yâang_rai_sǐa_-_Anyhow_anyway_20231230_อย่างไรเสีย_นักเรียน_ควร_ทำ_การบ้าน_ให้_เสร็จ_ก่อน_ไป_เล่น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ดังกับ (dang gàp) - As if, like, as though",
    "short_explanation": "Used to make comparisons, equivalent to 'as if', 'like', or 'as though' in English.",
    "long_explanation": "The term 'ดังกับ (dang gàp)' is frequently used in Thai language to draw a comparison, similar to the English expressions 'as if', 'like', or 'as though'. This term is used to compare a situation, behavior or feeling to something else in a vividly metaphorical way, making the sentence more expressive and illustrative. It is typically slotted after the subject and verb, and before the descriptive phrase.",
    "formation": "Subject + Verb + ดังกับ + Descriptive Phrase",
    "examples": [
      {
        "th": "เธอ ยิ้ม ดังกับ ดอกไม้ ที่ เพิ่ง ผ่าน พายุ แล้ว ผืน โชติช่วง ดวงอาทิตย์",
        "romaji": "Thoe yim dang gàp dok mai thi peng phan pa-yu laeo pheun choti chuang duang a-thit",
        "en": "She smiles as if she is a flower that has just weathered a storm and is basking in the sun.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เธอ_ยิ้ม_ดังกับ_ดอกไม้_ที่_เพิ่ง_ผ่าน_พายุ_แล้ว_ผืน_โชติช่วง_ดวงอาทิตย์.mp3"
      },
      {
        "th": "เขา ร้องไห้ ดังกับ ฝน ที่ ตก หนัก มาก",
        "romaji": "Khao rong hai dang gàp fon thi tok nak mak",
        "en": "He cries as if he is heavy rain falling.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เขา_ร้องไห้_ดังกับ_ฝน_ที่_ตก_หนัก_มาก.mp3"
      },
      {
        "th": "ฉัน รู้สึก ดังกับ ตก ลง ไป ใน บ่อน้ำ ที่ ลึก",
        "romaji": "Chan roo seuk dang gàp tok long pai nai bo nam thi leuk",
        "en": "I feel as though I've fallen into a deep pool of water.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_ฉัน_รู้สึก_ดังกับ_ตก_ลง_ไป_ใน_บ่อน้ำ_ที่_ลึก.mp3"
      },
      {
        "th": "เทศกาลนี้ มีความสุข ดังกับ อยู่ ใน ฝัน",
        "romaji": "Thetsakan ni mee khwam suk dang gàp yu nai fan",
        "en": "This festival is joyful as if it's a dream.",
        "grammar_audio": "/audio/thai/grammar/s_ดังกับ_dang_gàp_-_As_if_like_as_though_20231230_เทศกาลนี้_มีความสุข_ดังกับ_อยู่_ใน_ฝัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "แต่ละ (dtàe lá) - Each, Every",
    "short_explanation": "This is used to represent 'each' or 'every' in a given set.",
    "long_explanation": "The term 'แต่ละ (dtàe lá)' is used in Thai to denote 'each' or 'every'. When making statements concerning every item/member of a group or collection, it follows the noun it modifies. Thus, you may use 'แต่ละ' to express 'each' or 'every' in a variety of contexts and scenarios.",
    "formation": "Noun + แต่ละ",
    "examples": [
      {
        "th": "แต่ละ คน ใน ครอบครัว นี้ มี หน้าที่ และ ความรับผิดชอบ ที่ แตกต่าง กัน",
        "romaji": "Dtàe lá kon nai khrop khrua ni mee na thath lae khwam rap pid chorp thi taek tang gan",
        "en": "Each person in this family has different duties and responsibilities.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_Every_20231230_แต่ละ_คน_ใน_ครอบครัว_นี้_มี_หน้าที่_และ_ความรับผิดชอบ_ที่_แตกต่าง_กัน.mp3"
      },
      {
        "th": "เธอ ซื้อ อาหาร ไทย มา ทาน แต่ละ วัน",
        "romaji": "Thoe suea ahaan Thai ma than dtàe lá wan",
        "en": "She buys Thai food to eat every day.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_Every_20231230_เธอ_ซื้อ_อาหาร_ไทย_มา_ทาน_แต่ละ_วัน.mp3"
      },
      {
        "th": "แต่ละ วัน ใน ชีวิต ของ เรา คือ โอกาส ที่ ใหญ่ ใน การ ทำ ความดี",
        "romaji": "Dtàe lá wan nai chiwit kong rao kheu okat thi yai nai kan tham khwam di",
        "en": "Each day in our life is a great opportunity to do good.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_Every_20231230_แต่ละ_วัน_ใน_ชีวิต_ของ_เรา_คือ_โอกาส_ที่_ใหญ่_ใน_การ_ทำ_ความดี.mp3"
      },
      {
        "th": "เขา เดินทาง ไป ที่ แต่ละ ชาติ ใน ทวีป ยุโรป",
        "romaji": "Khao doin thang pai thi dtàe lá chat nai thaweep yurop",
        "en": "He traveled to each country in Europe.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ละ_dtàe_lá_-_Each_Every_20231230_เขา_เดินทาง_ไป_ที่_แต่ละ_ชาติ_ใน_ทวีป_ยุโรป.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ถึงขั้น (thʉ̌ng khân) - To the extent that, so much so that",
    "short_explanation": "This phrase is used to connect a cause and an extreme result; 'to the extent that', 'so much so that'.",
    "long_explanation": "The phrase 'ถึงขั้น (thʉ̌ng khân)' is often used in Thai to emphasize the extremity of a result caused by a particular action or situation. It is used to connect a cause and an extreme effect or result. This phrase is equivalent to expressions like 'to the extent that' or 'so much so that' in English. It can be used with a wide variety of verbs and adjectives to express severe conditions or outcomes.",
    "formation": "Cause + ถึงขั้น + Extreme result",
    "examples": [
      {
        "th": "หนักภาระ วิชาการ เยอะ จนถึงขั้น ไม่ มี เวลา พักผ่อน",
        "romaji": "Nak-pha-ra wi-cha-kan yoe jonn thʉ̌ng khân mai mee we-laa phak-phon",
        "en": "The academic burden is so heavy to the extent that there is no time to rest.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงขั้น_thʉ̌ng_khân_-_To_the_extent_that_so_much_so_that_20231230_หนักภาระ_วิชาการ_เยอะ_จนถึงขั้น_ไม่_มี_เวลา_พักผ่อน.mp3"
      },
      {
        "th": "เขา มีความ สุข จนถึงขั้น ลืม ปัญหา ทั้งหมด ที่ มี",
        "romaji": "Khao mee khwaam sook jonn thʉ̌ng khân leum pan-haa thang mot thi mee",
        "en": "He is so happy to the extent that he forgets all the problems he has.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงขั้น_thʉ̌ng_khân_-_To_the_extent_that_so_much_so_that_20231230_เขา_มีความ_สุข_จนถึงขั้น_ลืม_ปัญหา_ทั้งหมด_ที่_มี.mp3"
      },
      {
        "th": "เขา รัก เธอ ถึงขั้น พร้อม ที่จะ ให้ ทุกอย่าง เพื่อ เธอ",
        "romaji": "Khao rak thoe thʉ̌ng khân phrôm thi ja hai thuk yâang phuea thoe",
        "en": "He loves her so much so that he is ready to give everything for her.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงขั้น_thʉ̌ng_khân_-_To_the_extent_that_so_much_so_that_20231230_เขา_รัก_เธอ_ถึงขั้น_พร้อม_ที่จะ_ให้_ทุกอย่าง_เพื่อ_เธอ.mp3"
      },
      {
        "th": "การทำงาน ของเขา หนัก จนถึงขั้น ไม่ มี ช่วงเวลา ว่าง",
        "romaji": "Kan tham-ngan khong khao nak jonn thʉ̌ng khân mai mee chueng we-laa waang",
        "en": "His work is so demanding to the extent that he doesn't have any free time.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงขั้น_thʉ̌ng_khân_-_To_the_extent_that_so_much_so_that_20231230_การทำงาน_ของเขา_หนัก_จนถึงขั้น_ไม่_มี_ช่วงเวลา_ว่าง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "แต่ทว่า (dtàe thwâa) - However, but, yet",
    "short_explanation": "Used as a conjunction to introduce a phrase or clause contrasting with what has already been mentioned.",
    "long_explanation": "The Thai conjunction 'แต่ทว่า (dtàe thwâa)', very much like the English 'however', 'but', or 'yet', is utilized to introduce a contrast or contradiction with a statement or proposition that precedes it. It aids in providing different perspectives or contrasting ideas in the same discussion which can enrich narrative, argumentative, or explanatory discourses.",
    "formation": "Statement + แต่ทว่า + Contrasting Statement",
    "examples": [
      {
        "th": "ฉัน ชอบ ไป ชายหาด แต่ทว่า ฉัน กลัว น้ำ",
        "romaji": "Chan chorp pai chai hat, dtàe thwâa chan glua nam",
        "en": "I like to go to the beach, however, I am afraid of water.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ทว่า_dtàe_thwâa_-_However_but_yet_20231230_ฉัน_ชอบ_ไป_ชายหาด_แต่ทว่า_ฉัน_กลัว_น้ำ.mp3"
      },
      {
        "th": "เรา วางแผน ที่จะ ไป ปิคนิค วันนี้ แต่ทว่า มัน มี ฝน ตก",
        "romaji": "Rao wang phaen thi ja pai picnic wan ni, dtàe thwâa man mee fon tok",
        "en": "We planned to go for a picnic today, but it's raining.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ทว่า_dtàe_thwâa_-_However_but_yet_20231230_เรา_วางแผน_ที่จะ_ไป_ปิคนิค_วันนี้_แต่ทว่า_มัน_มี_ฝน_ตก.mp3"
      },
      {
        "th": "ฉัน รู้สึก ว่า ฉัน พร้อม สำหรับ สอบ แต่ทว่า ฉัน ยัง รู้สึก ว่า ฉัน ต้อง ทบทวน อีก ครั้ง",
        "romaji": "Chan ru seuk wah chan prom sam rap sorp, dtàe thwâa chan yang ru seuk wah chan tong thop thwon eik krang",
        "en": "I feel like I am ready for the exam, yet, I still feel that I should review once more.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ทว่า_dtàe_thwâa_-_However_but_yet_20231230_ฉัน_รู้สึก_ว่า_ฉัน_พร้อม_สำหรับ_สอบ_แต่ทว่า_ฉัน_ยัง_รู้สึก_ว่า_ฉัน_ต้อง_ทบทวน_อีก_ครั้ง.mp3"
      },
      {
        "th": "เขา มี มากมาย ของ เงิน แต่ทว่า เขา ไม่ มี เวลา",
        "romaji": "Khao mee maak mai kong ngern, dtàe thwâa khao mai mee we-laa",
        "en": "He has a lot of money, but he does not have time.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ทว่า_dtàe_thwâa_-_However_but_yet_20231230_เขา_มี_มากมาย_ของ_เงิน_แต่ทว่า_เขา_ไม่_มี_เวลา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "พอ...ก็... (phɔɔ... gɔ̂...) - As soon as... then...",
    "short_explanation": "Used to indicate consecutive actions; 'as soon as... then...'.",
    "long_explanation": "The phrase 'พอ...ก็... (phɔɔ... gɔ̂...)' is frequently utilized in Thai language to illustrate that one action takes place right after another, mirroring the English 'as soon as... then...'. In this pattern, 'พอ (phɔɔ)' is used before the first action and 'ก็ (gɔ̂)' is used before the second action. This expression is often employed when the second action is a direct consequence of the first.",
    "formation": "พอ (first action) ก็ (second action)",
    "examples": [
      {
        "th": "พอ ฉัน เปิด ประตู ก็ มี แมว เดิน เข้า มา",
        "romaji": "Phɔɔ chan pœ̂d pratuu gɔ̂ mee maeo deōn khâo maa",
        "en": "As soon as I opened the door, a cat walked in.",
        "grammar_audio": "/audio/thai/grammar/s_พอก็_phɔɔ_gɔ̂_-_As_soon_as_then_20231230_พอ_ฉัน_เปิด_ประตู_ก็_มี_แมว_เดิน_เข้า_มา.mp3"
      },
      {
        "th": "พอ หนัง จบ ก็ ทุกคน รีบ ขึ้น รถ กลับ บ้าน",
        "romaji": "Phɔɔ nang jòp gɔ̂ thook khon reep khuen roht glàp baan",
        "en": "As soon as the movie ended, everyone rushed to get in the car to go home.",
        "grammar_audio": "/audio/thai/grammar/s_พอก็_phɔɔ_gɔ̂_-_As_soon_as_then_20231230_พอ_หนัง_จบ_ก็_ทุกคน_รีบ_ขึ้น_รถ_กลับ_บ้าน.mp3"
      },
      {
        "th": "พอ ฝน หยุด ตก ก็ เด็ก ๆ ออก ไป เล่น นอก บ้าน",
        "romaji": "Phɔɔ fon yùt dop gɔ̂ dek dek àwk pai leên nâwk baan",
        "en": "As soon as the rain stopped, the children went out to play outside.",
        "grammar_audio": "/audio/thai/grammar/s_พอก็_phɔɔ_gɔ̂_-_As_soon_as_then_20231230_พอ_ฝน_หยุด_ตก_ก็_เด็ก_ๆ_ออก_ไป_เล่น_นอก_บ้าน.mp3"
      },
      {
        "th": "พอ เธอ มาถึง ก็ ทุกคน กรีดร้อง ด้วย ความ กระตือรือร้น",
        "romaji": "Phɔ́ɔ thoe mâ thǔeng gɔ̂ thúk khon greet róng dûay khwaam grà-tʉa-rʉʉ-rʉ̂n",
        "en": "As soon as she arrived, everyone screamed in excitement.",
        "grammar_audio": "/audio/thai/grammar/s_พอก็_phɔɔ_gɔ̂_-_As_soon_as_then_20231230_พอ_เธอ_มาถึง_ก็_ทุกคน_กรีดร้อง_ด้วย_ความ_กระตือรือร้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "เช่นกัน (chèn gan) - Similarly, likewise",
    "short_explanation": "Indicates similarity or equal response; 'similarly' or 'likewise'.",
    "long_explanation": "The term 'เช่นกัน (chèn gan)' is commonly used in Thai to convey similarity or an equal response, equivalent to English 'similarly' or 'likewise'. It is normally used at the end of sentences to emphasize a shared characteristic, condition, or circumstance between subjects. The term can be used in conjunction with a variety of verbs and expressions.",
    "formation": "Statement + เช่นกัน",
    "examples": [
      {
        "th": "เธอ ชอบ การ อ่านหนังสือ ฉัน ก็ เช่นกัน",
        "romaji": "Thoe chop kan aan nang sue, chan gor chen gan",
        "en": "You like reading books, I do likewise.",
        "grammar_audio": "/audio/thai/grammar/s_เช่นกัน_chèn_gan_-_Similarly_likewise_20231230_เธอ_ชอบ_การ_อ่านหนังสือ_ฉัน_ก็_เช่นกัน.mp3"
      },
      {
        "th": "ฉัน รู้สึก ว่า นี่ คือ สถานที่ ที่ ฉัน อยู่ อย่าง สุขสันต์ เขา คง เป็น อย่าง ที่ เช่นกัน",
        "romaji": "Chan rue suk wa ni keu sathan thi thi chan yu yang suk san, khao kong pen yang thi chen gan",
        "en": "I feel this is where I blissfully belong, he must feel similarly.",
        "grammar_audio": "/audio/thai/grammar/s_เช่นกัน_chèn_gan_-_Similarly_likewise_20231230_ฉัน_รู้สึก_ว่า_นี่_คือ_สถานที่_ที่_ฉัน_อยู่_อย่าง_สุขสันต์_เขา_คง_เป็น_อย่าง_ที่_เช่นกัน.mp3"
      },
      {
        "th": "ไม่ว่า คน ที่ เรา คบ จะ ผู้ดีหรือผู้ร้าย แต่ เรา ต้อง รักษา ตัวเอง เช่นกัน",
        "romaji": "Mai wa kon thi rao khop ja pu di rue pu rai, tae rao tong raksa dua eng chen gan",
        "en": "Whether the person we associate with is good or bad, we must take care of ourselves likewise.",
        "grammar_audio": "/audio/thai/grammar/s_เช่นกัน_chèn_gan_-_Similarly_likewise_20231230_ไม่ว่า_คน_ที่_เรา_คบ_จะ_ผู้ดีหรือผู้ร้าย_แต่_เรา_ต้อง_รักษา_ตัวเอง_เช่นกัน.mp3"
      },
      {
        "th": "เขา มี ส่วนร่วม ใน การ ทำ งาน ระดับ สูง ฉัน ก็ หวัง จะ เป็น อย่าง ที่ เช่นกัน",
        "romaji": "Khao mee suan ruam nai kan tham ngan radap sung, chan gor wang ja pen yang thi chen gan",
        "en": "He has a role in high-level work, I hope to be the same likewise.",
        "grammar_audio": "/audio/thai/grammar/s_เช่นกัน_chèn_gan_-_Similarly_likewise_20231230_เขา_มี_ส่วนร่วม_ใน_การ_ทำ_งาน_ระดับ_สูง_ฉัน_ก็_หวัง_จะ_เป็น_อย่าง_ที่_เช่นกัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "เสียด้วย (sǐa dûay) - Unfortunately, sadly",
    "short_explanation": "Used to express regret, disappointment, or sorrow.",
    "long_explanation": "The term 'เสียด้วย (sǐa dûay)' is used in Thai to express feelings of regret, disappointment, or sorrow, similar to the English phrases 'unfortunately' or 'sadly'. It is often used at the beginning or end of a sentence to add a tone of lament or regret to a statement. It can be used with a wide range of verbs, adjectives, and phrases to express various types of unfortunate situations or negative emotions.",
    "formation": "เสียด้วย + Statement or Statement + เสียด้วย",
    "examples": [
      {
        "th": "เสียด้วย ที่ ฉัน ไม่ สามารถ คุย ด้วยภาษา ไทย ได้ ดี",
        "romaji": "sǐa dûay thi chan mai sa-mart kuy duay pha-sa Thai dai dee",
        "en": "Unfortunately, I cannot speak Thai well.",
        "grammar_audio": "/audio/thai/grammar/s_เสียด้วย_sǐa_dûay_-_Unfortunately_sadly_20231230_เสียด้วย_ที่_ฉัน_ไม่_สามารถ_คุย_ด้วยภาษา_ไทย_ได้_ดี.mp3"
      },
      {
        "th": "ฉัน คิดถึง บ้าน ใน ประเทศ ไทย ของ ฉัน เสียด้วย",
        "romaji": "Chan khid thung baan nai pra-thet Thai kong chan sǐa dûay",
        "en": "Sadly, I miss my home in Thailand.",
        "grammar_audio": "/audio/thai/grammar/s_เสียด้วย_sǐa_dûay_-_Unfortunately_sadly_20231230_ฉัน_คิดถึง_บ้าน_ใน_ประเทศ_ไทย_ของ_ฉัน_เสียด้วย.mp3"
      },
      {
        "th": "ฉัน ต้องการ ไป ดู ภาพยนตร์ แต่ ฉัน ไม่ มี เวลา เสียด้วย",
        "romaji": "Chan tong gaan pai du phap-ya-natrae tae chan mai mee we-la sǐa dûay",
        "en": "I want to go to the movies but unfortunately, I don't have time.",
        "grammar_audio": "/audio/thai/grammar/s_เสียด้วย_sǐa_dûay_-_Unfortunately_sadly_20231230_ฉัน_ต้องการ_ไป_ดู_ภาพยนตร์_แต่_ฉัน_ไม่_มี_เวลา_เสียด้วย.mp3"
      },
      {
        "th": "ฉัน รู้สึก เหนื่อย หลังจาก วัน ที่ ยาวนาน และ ยุ่งเหยิง เสียด้วย",
        "romaji": "Chan ruu-suek nua laeng jaak wan thi yao nan lae yung-ying sǐa dûay",
        "en": "Sadly, I feel tired after a long and busy day.",
        "grammar_audio": "/audio/thai/grammar/s_เสียด้วย_sǐa_dûay_-_Unfortunately_sadly_20231230_ฉัน_รู้สึก_เหนื่อย_หลังจาก_วัน_ที่_ยาวนาน_และ_ยุ่งเหยิง_เสียด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ตามที่...ได้ (dtaam thîi... dâai) - As... can be",
    "short_explanation": "Expresses the meaning of 'as... as one can'. Used to indicate the maximum degree or extent of an action.",
    "long_explanation": "In Thai, ตามที่...ได้ (dtaam thîi... dâai) is used to indicate doing something to the maximum degree or extent that one can. It is similar to the English expression 'as much as possible' or 'as... as one can'. This structure often appears in sentences that talk about someone trying to do something to the fullest extent of their ability or resources.",
    "formation": "Subject + Verb + ตามที่ + Subject + Verb + ได้",
    "examples": [
      {
        "th": "เขา กิน ข้าว ตามที่ เขา กิน ได้ เพราะ เขา หิว มาก",
        "romaji": "Khao gin khao dtaam thîi khao gin dâai prôr khao hĭu mâak",
        "en": "He eats as much as he can because he is very hungry.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่ได้_dtaam_thîi_dâai_-_As_can_be_20231230_เขา_กิน_ข้าว_ตามที่_เขา_กิน_ได้_เพราะ_เขา_หิว_มาก.mp3"
      },
      {
        "th": "ผม จะ ทำ งาน ตามที่ ผม ทำ ได้ เพื่อ ช่วย เพื่อน ของ ผม",
        "romaji": "Phǒm jà tham ngaan dtaam thîi phǒm tham dâai phɯ̂ɯ̂a chûay phɯ̂ɯ̂an khǒng phǒm",
        "en": "I will work as hard as I can to help my friend.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่ได้_dtaam_thîi_dâai_-_As_can_be_20231230_ผม_จะ_ทำ_งาน_ตามที่_ผม_ทำ_ได้_เพื่อ_ช่วย_เพื่อน_ของ_ผม.mp3"
      },
      {
        "th": "นักเรียน ควร จะ อ่าน หนังสือ ตามที่ เธอ อ่าน ได้ เพื่อ การ ทบทวน",
        "romaji": "Nák-riian khûan jà àan năng-sʉʉ dtaam thîi thoe àan dâai phɯ̂ɯ̂a gaan thop-thuan",
        "en": "The student should read as much as she can for review.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่ได้_dtaam_thîi_dâai_-_As_can_be_20231230_นักเรียน_ควร_จะ_อ่าน_หนังสือ_ตามที่_เธอ_อ่าน_ได้_เพื่อ_การ_ทบทวน.mp3"
      },
      {
        "th": "คุณ ควร ทำ การบ้าน ตามที่ คุณ ทำ ได้ ไม่ ต้อง รีบ",
        "romaji": "Khun khûan tham gaan-bâan dtaam thîi khun tham dâai mâi dtông rîip",
        "en": "You should do your homework as much as you can, you don't need to rush.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่ได้_dtaam_thîi_dâai_-_As_can_be_20231230_คุณ_ควร_ทำ_การบ้าน_ตามที่_คุณ_ทำ_ได้_ไม่_ต้อง_รีบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "เพราะเป็น (phráw pen) - Because it is",
    "short_explanation": "Expresses the reason or cause related to a fact or existing situation; 'because it is' or 'being that'.",
    "long_explanation": "In Thai, the phrase 'เพราะเป็น (phráw pen)' or 'because it is' is used to explain the cause or reason behind something that is present or already known. It gives context by detailing the factual or habitual causes of the state of things. Usually placed at the beginning of a sentence it is often followed by a sentence that further describes the outcome or effect that the reason has resulted in.",
    "formation": "เพราะเป็น + Reason, Outcome",
    "examples": [
      {
        "th": "เพราะ เป็น คน ผู้ ใหญ่ ของ ครอบครัว พ่อ ต้อง รับผิดชอบ หน้าที่ ใน การ เลี้ยงดู ทุก คน",
        "romaji": "Phráw pen kon phûu yài kong khrôb-khrua, phɔ̌ɔ tɔ̂ng ráp-phìt-chɔ̌p nâa-thîi nai gaan lîaang-duu thúk kon",
        "en": "Because he is the head of the family, father has to take responsibility for looking after everyone.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเป็น_phráw_pen_-_Because_it_is_20231230_เพราะ_เป็น_คน_ผู้_ใหญ่_ของ_ครอบครัว_พ่อ_ต้อง_รับผิดชอบ_หน้าที่_ใน_การ_เลี้ยงดู_ทุก_คน.mp3"
      },
      {
        "th": "เพราะ เป็น เด็ก ที่ ดื้อ จึง ยาก ที่ จะ ควบคุม",
        "romaji": "Phráw pen dek thi duu, jeung yaak thi ja kwab-khum",
        "en": "It's hard to control her because she is a stubborn child.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเป็น_phráw_pen_-_Because_it_is_20231230_เพราะ_เป็น_เด็ก_ที่_ดื้อ_จึง_ยาก_ที่_จะ_ควบคุม.mp3"
      },
      {
        "th": "เพราะ เป็น ไอ ศกรรณ์ จึง ต้อง ระวัง การ หายใจ",
        "romaji": "Phráw pen ai sà-gà-ran, jeung tɔ̂ng ra-wăng gaan hǎai-jai",
        "en": "Because it is smog, care must be given to breathing.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเป็น_phráw_pen_-_Because_it_is_20231230_เพราะ_เป็น_ไอ_ศกรรณ์_จึง_ต้อง_ระวัง_การ_หายใจ.mp3"
      },
      {
        "th": "เพราะ เป็น หมอ ที่ ทำงาน ยาก คุณ จึง ต้อง หายใจ อย่าง ระมัดระวัง",
        "romaji": "Phráw pen mɔ̌ɔ thi tham-ngaan yaak, khun jeung tɔ̂ng hǎai-jai yàang ra-mát-ra-wăng",
        "en": "Because you are a doctor who works hard, you should breathe carefully.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะเป็น_phráw_pen_-_Because_it_is_20231230_เพราะ_เป็น_หมอ_ที่_ทำงาน_ยาก_คุณ_จึง_ต้อง_หายใจ_อย่าง_ระมัดระวัง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ยิ่ง...ยิ่ง... (yîng... yîng...) - The more... the more...",
    "short_explanation": "Used to describe that one action or situation influences another; 'the more... the more...'.",
    "long_explanation": "The 'ยิ่ง...ยิ่ง... (yîng... yîng...)' structure in Thai is used to describe the correlation between two actions or situations. This structure is similar to 'the more... the more...' in English. In such a structure, the progression or increase in the first situation influences the second situation to progress or increase as well.",
    "formation": "ยิ่ง + Situation 1 + ยิ่ง + Situation 2",
    "examples": [
      {
        "th": "ฉัน ยิ่ง สมหวัง ใน ชีวิต ของ ตัวเอง ฉัน ยิ่ง รู้สึก มี ความสุข",
        "romaji": "Chan yîng som wang nai chee-wit kong tua eng, chan yîng roo-suek mee khwam-suk",
        "en": "The more I fulfill my life, the more I feel happy.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งยิ่ง_yîng_yîng_-_The_more_the_more_20231230_ฉัน_ยิ่ง_สมหวัง_ใน_ชีวิต_ของ_ตัวเอง_ฉัน_ยิ่ง_รู้สึก_มี_ความสุข.mp3"
      },
      {
        "th": "เธอ ยิ่ง ฝึกฝน ให้ เก่ง เท่า ไหร่ เธอ ยิ่ง สำเร็จ ใน การสอบ เท่า นั้น",
        "romaji": "Thoe yîng fuen fon hai geng tao rai, thoe yîng samret nai kan sob tao nun",
        "en": "The more you practice, the more successful you are in exams.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งยิ่ง_yîng_yîng_-_The_more_the_more_20231230_เธอ_ยิ่ง_ฝึกฝน_ให้_เก่ง_เท่า_ไหร่_เธอ_ยิ่ง_สำเร็จ_ใน_การสอบ_เท่า_นั้น.mp3"
      },
      {
        "th": "ยิ่ง ผ่าน ประสบการณ์ อัน ยาก ลำบาก มา เยอะ ๆ คุณ ยิ่ง มี ความ รู้ และ กล้า ทำ",
        "romaji": "Yîng phan prasopkan an yak lampaak ma yoe yoe khoon yîng mee khwam roo lae gla tam",
        "en": "The more difficult experiences you go through, the more knowledge and courage you gain.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งยิ่ง_yîng_yîng_-_The_more_the_more_20231230_ยิ่ง_ผ่าน_ประสบการณ์_อัน_ยาก_ลำบาก_มา_เยอะ_ๆ_คุณ_ยิ่ง_มี_ความ_รู้_และ_กล้า_ทำ.mp3"
      },
      {
        "th": "ยิ่ง ฉัน รัก เธอ เท่า ไหร่ ฉัน ยิ่ง หวัง ที่ จะ ให้ เธอ มี ความ สุข",
        "romaji": "Yîng chan rak thoe tao rai, chan yîng wang thi ja hai thoe mee khwam suk",
        "en": "The more I love you, the more I want you to be happy.",
        "grammar_audio": "/audio/thai/grammar/s_ยิ่งยิ่ง_yîng_yîng_-_The_more_the_more_20231230_ยิ่ง_ฉัน_รัก_เธอ_เท่า_ไหร่_ฉัน_ยิ่ง_หวัง_ที่_จะ_ให้_เธอ_มี_ความ_สุข.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ทั้งหมด (tháng mòt) - In total, all",
    "short_explanation": "'ทั้งหมด (tháng mòt)' is used to express the total amount or entirety of something.",
    "long_explanation": "The term 'ทั้งหมด (tháng mòt)' translates to 'in total' or 'all' in English. It is typically used when you want to refer to the total sum or full amount of something, whether it's a quantity or a period of time. In Thai sentences, 'ทั้งหมด' often comes after the noun it refers to, but it can also be found at the end of sentences.",
    "formation": "Noun + ทั้งหมด",
    "examples": [
      {
        "th": "ฉัน เรียน ภาษา ไทย ทั้งหมด สอง ปี แล้ว",
        "romaji": "Chan rian phasa thai thang mot song pee laew",
        "en": "I have been studying Thai for two years in total.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งหมด_tháng_mòt_-_In_total_all_20231230_ฉัน_เรียน_ภาษา_ไทย_ทั้งหมด_สอง_ปี_แล้ว.mp3"
      },
      {
        "th": "เขา มี เพื่อน ทั้งหมด เจ็ด คน",
        "romaji": "Khao mee pheuan thang mot jet kon",
        "en": "He has seven friends in total.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งหมด_tháng_mòt_-_In_total_all_20231230_เขา_มี_เพื่อน_ทั้งหมด_เจ็ด_คน.mp3"
      },
      {
        "th": "ผม เดินทาง ไป ทั้งหมด กี่ ชั่วโมง ก็ ไม่ รู้",
        "romaji": "Phom doen thang pai thang mot gee chua mong gor mai roo",
        "en": "I don't know how many hours in total I traveled.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งหมด_tháng_mòt_-_In_total_all_20231230_ผม_เดินทาง_ไป_ทั้งหมด_กี่_ชั่วโมง_ก็_ไม่_รู้.mp3"
      },
      {
        "th": "มี นักเรียน ใน ห้องเรียน ทั้งหมด กี่ คน ?",
        "romaji": "Mee nakrian nai hong rian thang mot gee kon ?",
        "en": "How many students are there in total in the classroom?",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งหมด_tháng_mòt_-_In_total_all_20231230_มี_นักเรียน_ใน_ห้องเรียน_ทั้งหมด_กี่_คน_.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "หากว่า (hàak wâa) - If, in case that",
    "short_explanation": "This term is used in Thai to express a hypothetical or conditional situation; similar to the English 'if' or 'in case that'.",
    "long_explanation": "The term 'หากว่า (hàak wâa)' is used in Thai language to express a hypothetical or conditional situation. It can be translated into English as 'if', 'in case that', 'suppose that', or 'assuming that'. หากว่า (hàak wâa) is often used at the beginning of a sentence to set up a condition",
    "formation": "หากว่า + Hypothetical Situation + Outcome",
    "examples": [
      {
        "th": "หากว่า ฉัน ชนะ ใน ครั้ง นี้ ฉัน จะ พา ทุกคน ไป เที่ยว เล่น",
        "romaji": "Hàak wâa chan cha-na nai krang ni, chan ja pha thuk khon pai thiao len",
        "en": "If I win this time, I will take everyone to play.",
        "grammar_audio": "/audio/thai/grammar/s_หากว่า_hàak_wâa_-_If_in_case_that_20231230_หากว่า_ฉัน_ชนะ_ใน_ครั้ง_นี้_ฉัน_จะ_พา_ทุกคน_ไป_เที่ยว_เล่น.mp3"
      },
      {
        "th": "หากว่า เธอ ไม่ สบาย ฉัน จะ ไป เยี่ยม เธอ ที่ บ้าน",
        "romaji": "Hàak wâa ther mai sa-baai, chan ja pai yi-yom ther thi baan",
        "en": "If you are not feeling well, I will visit you at your house.",
        "grammar_audio": "/audio/thai/grammar/s_หากว่า_hàak_wâa_-_If_in_case_that_20231230_หากว่า_เธอ_ไม่_สบาย_ฉัน_จะ_ไป_เยี่ยม_เธอ_ที่_บ้าน.mp3"
      },
      {
        "th": "หากว่า คุณ ต้องการ เรียน ที่ ที่ น่าสนใจ คุณ ควร ลอง มา ที่ มหาวิทยาลัย ของ ฉัน",
        "romaji": "Hàak wâa khun tong-kan rian thi ti na-san-jai, khun khuan long ma thi mahawitthayalai kong chan",
        "en": "If you want to study in an interesting place, you should try my university.",
        "grammar_audio": "/audio/thai/grammar/s_หากว่า_hàak_wâa_-_If_in_case_that_20231230_หากว่า_คุณ_ต้องการ_เรียน_ที่_ที่_น่าสนใจ_คุณ_ควร_ลอง_มา_ที่_มหาวิทยาลัย_ของ_ฉัน.mp3"
      },
      {
        "th": "หากว่า พวกเรา เตรียมตัว อย่าง เต็มที่ ความสำเร็จ จะ ตาม มา",
        "romaji": "Hàak wâa phuak-rao triam-tua yang tem thi, khwam-samret ja tam ma",
        "en": "If we prepare ourselves to the fullest, success will follow.",
        "grammar_audio": "/audio/thai/grammar/s_หากว่า_hàak_wâa_-_If_in_case_that_20231230_หากว่า_พวกเรา_เตรียมตัว_อย่าง_เต็มที่_ความสำเร็จ_จะ_ตาม_มา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ไม่ว่า...ก็... (mâi wâa... gɔ̂...) - No matter... always...",
    "short_explanation": "This is used to express that 'no matter what' a certain situation is, the action 'always' takes place.",
    "long_explanation": "The pattern 'ไม่ว่า...ก็... (mâi wâa... gɔ̂...)' is used in Thai to mean 'no matter what'... 'always'. It is usually used to express something that always happens regardless of the circumstances. The phrase 'ไม่ว่า (mâi wâa)' is used to introduce the situation and 'ก็ (gɔ̂) is used before the action that always happens as a result.",
    "formation": "ไม่ว่า + Situation + ก็ + Action/Fact",
    "examples": [
      {
        "th": "ไม่ว่า วัน นี้ จะ ร้อน หรือ หนาว เขา ก็ ไป วิ่ง ทุก วัน",
        "romaji": "Mâi wâa wan níi ja ráwn rǔe nǎao, khao gɔ̂ pai wîng thúk wan",
        "en": "No matter whether it is hot or cold today, he always goes running every day.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าก็_mâi_wâa_gɔ̂_-_No_matter_always_20231230_ไม่ว่า_วัน_นี้_จะ_ร้อน_หรือ_หนาว_เขา_ก็_ไป_วิ่ง_ทุก_วัน.mp3"
      },
      {
        "th": "ไม่ว่า การ ทำงาน จะ ยาก ขนาด ไหน ฉัน ก็ ไม่ ยอม แพ้",
        "romaji": "Mâi wâa kan tham-ngan ja yâak kanâat nǎi, chǎn gɔ̂ mâi yǒm pháe",
        "en": "No matter how hard the work is, I never give up.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าก็_mâi_wâa_gɔ̂_-_No_matter_always_20231230_ไม่ว่า_การ_ทำงาน_จะ_ยาก_ขนาด_ไหน_ฉัน_ก็_ไม่_ยอม_แพ้.mp3"
      },
      {
        "th": "ไม่ว่า เธอ จะ อยู่ ที่ ไหน ฉัน ก็ จะ คิดถึง เธอ เสมอ",
        "romaji": "Mâi wâa thoe ja yùu thi nǎi, chǎn gɔ̂ ja khít thǔeng thoe sà-mǒer",
        "en": "No matter where you are, I always miss you.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าก็_mâi_wâa_gɔ̂_-_No_matter_always_20231230_ไม่ว่า_เธอ_จะ_อยู่_ที่_ไหน_ฉัน_ก็_จะ_คิดถึง_เธอ_เสมอ.mp3"
      },
      {
        "th": "ไม่ว่า จะ เกิด สถานการณ์ ใด ๆ ขึ้น ก็ตาม คุณ ก็ ควร จะ รักษา ความ สงบ เสมอ",
        "romaji": "Mâi wâa ja gèrt sà-thaa-na-gaan dai dai kǔen gɔ-dtaam, khun gɔ̂ khuuan ja rák-sǎa khwaam sǒng-b sà-mǒer",
        "en": "No matter what situation arises, you should always maintain your calm.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าก็_mâi_wâa_gɔ̂_-_No_matter_always_20231230_ไม่ว่า_จะ_เกิด_สถานการณ์_ใด_ๆ_ขึ้น_ก็ตาม_คุณ_ก็_ควร_จะ_รักษา_ความ_สงบ_เสมอ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "อาจจะ (âat jà) - Might, possibly",
    "short_explanation": "Use to express the possibility, chance or likelihood of an action or situation similar to the English 'might' or 'possibly'.",
    "long_explanation": "The term 'อาจจะ (âat jà)' in Thai is used to express potentiality or the likelihood of an action or event occurring. It is similar to the English translation of 'might' or 'possibly'. It usually precedes a verb, adjective, or phrase to convey uncertainty or possibility. It can denote doubt, risk, and probability.",
    "formation": "อาจจะ + Verb/Adjective",
    "examples": [
      {
        "th": "วัน นี้ ฉัน อาจจะ มี ความ สุข กว่า เมื่อ วานนี้",
        "romaji": "Wan níi, chan âat jà mee khwaam sùk gwàa mûea waan níi",
        "en": "I might be happier today than yesterday.",
        "grammar_audio": "/audio/thai/grammar/s_อาจจะ_âat_jà_-_Might_possibly_20231230_วัน_นี้_ฉัน_อาจจะ_มี_ความ_สุข_กว่า_เมื่อ_วานนี้.mp3"
      },
      {
        "th": "ถ้า ฉัน ไม่ ต้อง ทำงาน พนักงาน อาจจะ มี เวลา ที่จะ ดู หนัง อีก ครั้ง หนึ่ง",
        "romaji": "Thâa chan mâi dtông tham-ngaan, phŏ-nák-ngaan âat jà mee we-laa thîi jà duu năng ìik khráng nùeng",
        "en": "If I don't have to work, I might have time to watch a movie again.",
        "grammar_audio": "/audio/thai/grammar/s_อาจจะ_âat_jà_-_Might_possibly_20231230_ถ้า_ฉัน_ไม่_ต้อง_ทำงาน_พนักงาน_อาจจะ_มี_เวลา_ที่จะ_ดู_หนัง_อีก_ครั้ง_หนึ่ง.mp3"
      },
      {
        "th": "ถ้า คุณ อ่าน หนังสือ นี้ คุณ อาจจะ เข้าใจ ผม มาก ขึ้น",
        "romaji": "Thâa khun àan năng-sĕu níi, khun âat jà khâo-jai phŏm mâak khûen",
        "en": "If you read this book, you might understand me more.",
        "grammar_audio": "/audio/thai/grammar/s_อาจจะ_âat_jà_-_Might_possibly_20231230_ถ้า_คุณ_อ่าน_หนังสือ_นี้_คุณ_อาจจะ_เข้าใจ_ผม_มาก_ขึ้น.mp3"
      },
      {
        "th": "เธอ อาจจะ ช่วย ฉัน ได้ ถ้า ฉัน อธิบาย ว่าต้องการ อะไร",
        "romaji": "Thoe âat jà chûay chan dâi thâa chan à-thí-baai wâa dtông-gaan à-rai",
        "en": "You might be able to help me if I explain what I need.",
        "grammar_audio": "/audio/thai/grammar/s_อาจจะ_âat_jà_-_Might_possibly_20231230_เธอ_อาจจะ_ช่วย_ฉัน_ได้_ถ้า_ฉัน_อธิบาย_ว่าต้องการ_อะไร.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ซึ่งกันและกัน (sʉ̂ng gan láe gan) - Each other, mutually",
    "short_explanation": "Used to express reciprocal or mutual actions or relations.",
    "long_explanation": "In Thai grammar, 'ซึ่งกันและกัน (sʉ̂ng gan láe gan)' is used to describe mutual or reciprocal actions or relations between two or more entities. It is equivalent to the English phrases 'each other' or 'mutually', in phrases where shared actions, feelings, or behaviors are exhibited by all parties involved. It can be used with a variety of verbs to express shared actions or states. It is typically positioned at the end of the sentence.",
    "formation": "Subject + Verb + ซึ่งกันและกัน",
    "examples": [
      {
        "th": "พวกเรา พูดคุย ด้วยกัน ซึ่งกันและกัน มาก ขึ้น ทุกวัน",
        "romaji": "Phuak rao phut kui duay gan sʉ̂ng gan láe gan maak kheun took wan",
        "en": "We talk to each other more every day.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Each_other_mutually_20231230_พวกเรา_พูดคุย_ด้วยกัน_ซึ่งกันและกัน_มาก_ขึ้น_ทุกวัน.mp3"
      },
      {
        "th": "วันนี้ เรา ได้ เรียนรู้ เกี่ยวกับ และ เข้าใจ กัน ซึ่งกันและกัน เพิ่มเติม",
        "romaji": "Wan nii rao dai rian ru giao gap lae khao jai gan sʉ̂ng gan láe gan pheum toem",
        "en": "Today we learned about and understood each other more.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Each_other_mutually_20231230_วันนี้_เรา_ได้_เรียนรู้_เกี่ยวกับ_และ_เข้าใจ_กัน_ซึ่งกันและกัน_เพิ่มเติม.mp3"
      },
      {
        "th": "เขา และ ฉัน ช่วย ให้ กับ ซึ่งกันและกัน ทุกเวลา ที่ ต้องการ ความช่วยเหลือ",
        "romaji": "Khao lae chan chuai hai gap sʉ̂ng gan láe gan took welaa thi tong kan kwaam chuai leua",
        "en": "He and I help each other whenever we need assistance.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Each_other_mutually_20231230_เขา_และ_ฉัน_ช่วย_ให้_กับ_ซึ่งกันและกัน_ทุกเวลา_ที่_ต้องการ_ความช่วยเหลือ.mp3"
      },
      {
        "th": "เรา นั่ง ทำงาน ร่วมกัน ซึ่งกันและกัน ที่ ออฟฟิศ ทุกวัน",
        "romaji": "Rao nang tham ngan ruam gan sʉ̂ng gan láe gan thi office took wan",
        "en": "We sit and work together at the office every day.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Each_other_mutually_20231230_เรา_นั่ง_ทำงาน_ร่วมกัน_ซึ่งกันและกัน_ที่_ออฟฟิศ_ทุกวัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "แทนที่จะ (thæn thîi jà) - Instead of",
    "short_explanation": "Used to present an alternative action or state to the one mentioned before; 'instead of'.",
    "long_explanation": "In Thai, the term 'แทนที่จะ (thæn thîi jà)' is used to introduce a substitute or alternate action or situation, much like the English phrase 'instead of'. It is commonly used at the start of a sentence or clause to contrast two ideas or actions, typically corresponding to 'instead of X, one should/could Y'.",
    "formation": "แทนที่จะ+ Verb Phrase 1 + Verb Phrase 2",
    "examples": [
      {
        "th": "แทนที่จะ ให้ ความสำคัญ กับ สิ่ง ที่ สูญเสีย ไป ลอง สร้าง สรรค์ สิ่ง ใหม่ ๆ ขึ้น มา ดู สิ",
        "romaji": "Thæn thîi jà hai khwam samkhan gab sing thi sūn siā pai, long sāng-sān sing mài mài khuen mā du sì",
        "en": "Instead of dwelling on what's lost, try creating something new.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่จะ_thæn_thîi_jà_-_Instead_of_20231230_แทนที่จะ_ให้_ความสำคัญ_กับ_สิ่ง_ที่_สูญเสีย_ไป_ลอง_สร้าง_สรรค์_สิ่ง_ใหม่_ๆ_ขึ้น_มา_ดู_สิ.mp3"
      },
      {
        "th": "แทนที่จะ กังวล เกี่ยวกับ ปัญหา ที่ กำลัง มา ช่วย ตัวเอง เพื่อ ทำ ทุก อย่าง ให้ ดีที่สุด",
        "romaji": "Thæn thîi jà kāng-won gìawgàp panhā thîl gam lang mā, chuāi tua-eng phêūa tham thūk yāng hai dīthīsòt",
        "en": "Instead of worrying about the problem that's coming, help yourself to do the best you can.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่จะ_thæn_thîi_jà_-_Instead_of_20231230_แทนที่จะ_กังวล_เกี่ยวกับ_ปัญหา_ที่_กำลัง_มา_ช่วย_ตัวเอง_เพื่อ_ทำ_ทุก_อย่าง_ให้_ดีที่สุด.mp3"
      },
      {
        "th": "แทนที่จะ ตกใจ กับ สิ่ง ที่ ยังไม่ เกิด ขึ้น ควร จะ มอง ดู สิ่ง ที่ มี อยู่ อย่าง มี ความ สุข",
        "romaji": "Thæn thîi jà tòk-jai gàp sìng thîl yang-mai gèrt khūen, khūan jà mawng du sìng thi mii yū yāng mii khwām sūk",
        "en": "Instead of fearing things that haven't happened yet, we should appreciate what we have with happiness.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่จะ_thæn_thîi_jà_-_Instead_of_20231230_แทนที่จะ_ตกใจ_กับ_สิ่ง_ที่_ยังไม่_เกิด_ขึ้น_ควร_จะ_มอง_ดู_สิ่ง_ที่_มี_อยู่_อย่าง_มี_ความ_สุข.mp3"
      },
      {
        "th": "แทนที่จะ ด่า ตัวเอง เรา ควร จะ ให้ คำ ขอบคุณ แก่ ตัวเอง ที่ สามารถ ทนทุกข์ ได้",
        "romaji": "Thæn thîi jà dàa tua-eng rao khūan jà hai kham khɔ̄b-khun gè tua-eng thîi sămārt thon-thúk-dai",
        "en": "Instead of blaming ourselves, we should thank ourselves for being able to endure hardship.",
        "grammar_audio": "/audio/thai/grammar/s_แทนที่จะ_thæn_thîi_jà_-_Instead_of_20231230_แทนที่จะ_ด่า_ตัวเอง_เรา_ควร_จะ_ให้_คำ_ขอบคุณ_แก่_ตัวเอง_ที่_สามารถ_ทนทุกข์_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ซึ่ง...เป็น... (sʉ̂ng... pen...) - Which is...",
    "short_explanation": "This phrase is used to express qualities or characteristics of something or someone; 'which is ...'.",
    "long_explanation": "In the Thai language, 'ซึ่ง...เป็น...(sʉ̂ng... pen...)' is used to indicate characteristics or qualities in a manner similar to 'which is...' in English. This structure often appears in sentences that provide more detailed information about a person, object, or idea that was previously mentioned. It can be used with a variety of adjectives or descriptions to specify or clarify traits.",
    "formation": "Noun + ซึ่ง + Description + เป็น + Specification",
    "examples": [
      {
        "th": "ข้าวสวย ซึ่ง เป็น อาหาร พื้นฐาน ของ คนไทย มี ผัก และ เนื้อสัตว์ เป็น วัตถุดิบ หลัก",
        "romaji": "Khao suay sʉ̂ng pen a-han pheun than kong khon Thai mee phak lae nuae sat pen watthu-dip lak",
        "en": "Steamed rice, which is the basic food of Thai people, has vegetables and meat as the main ingredients.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเป็น_sʉ̂ng_pen_-_Which_is_20231230_ข้าวสวย_ซึ่ง_เป็น_อาหาร_พื้นฐาน_ของ_คนไทย_มี_ผัก_และ_เนื้อสัตว์_เป็น_วัตถุดิบ_หลัก.mp3"
      },
      {
        "th": "วัดพระศรีรัตนศาสดาราม ซึ่ง เป็น วัด ที่ สำคัญ ที่สุด ใน ประเทศไทย ตั้ง อยู่ ที่ กรุงเทพมหานคร",
        "romaji": "Wat phra sri rattana satsadaram sʉ̂ng pen wat thi samkhan thi sut nai prathet Thai tang yu thi krung thep maha nakorn",
        "en": "Wat Phra Sri Rattana Satsadaram, which is the most important temple in Thailand, is located in Bangkok.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเป็น_sʉ̂ng_pen_-_Which_is_20231230_วัดพระศรีรัตนศาสดาราม_ซึ่ง_เป็น_วัด_ที่_สำคัญ_ที่สุด_ใน_ประเทศไทย_ตั้ง_อยู่_ที่_กรุงเทพมหานคร.mp3"
      },
      {
        "th": "ผม ชอบ เล่น เกม บน โทรศัพท์ ซึ่ง เป็น การ เผชิญหน้า กับ ปัญหา และ ความ ท้าทาย ใหม่ๆ",
        "romaji": "Phom chop len game bon torasap sʉ̂ng pen kan phe-chi-na kap pan-ha lae khwam tha-thai mai mai",
        "en": "I like to play games on the phone, which is a way to confront new problems and challenges.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเป็น_sʉ̂ng_pen_-_Which_is_20231230_ผม_ชอบ_เล่น_เกม_บน_โทรศัพท์_ซึ่ง_เป็น_การ_เผชิญหน้า_กับ_ปัญหา_และ_ความ_ท้าทาย_ใหม่ๆ.mp3"
      },
      {
        "th": "ฉัน อยู่ กับ แม่ ซึ่ง เป็น ผู้หญิง ที่ มีความ อดทน และ แข็งแรง ที่สุด ที่ ฉัน รู้จัก",
        "romaji": "Chan yu kap mae sʉ̂ng pen phu ying thi mee khwam ot thon lae khaeng raeng thi sut thi chan ru jak",
        "en": "I live with my mother, who is the most patient and strong woman I know.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเป็น_sʉ̂ng_pen_-_Which_is_20231230_ฉัน_อยู่_กับ_แม่_ซึ่ง_เป็น_ผู้หญิง_ที่_มีความ_อดทน_และ_แข็งแรง_ที่สุด_ที่_ฉัน_รู้จัก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ในขณะที่ (nai khànà thîi) - While, whereas",
    "short_explanation": "Used to indicate simultaneous actions or actions happening at the same time; 'while' or 'whereas'.",
    "long_explanation": "The term 'ในขณะที่ (nai khànà thîi)' in Thai is used to show simultaneous actions or actions happening at the same time. This can refer to the concurrent actions of a single subject or different actions of different subjects. This term is similar to 'while' or 'whereas' in English. It is placed at the start of the sentence or clause it pertains to.",
    "formation": "ในขณะที่ + Simultaneous action",
    "examples": [
      {
        "th": "ในขณะที่ เธอ กำลัง ดื่ม กาแฟ ฉัน กำลัง เดิน มา หา เธอ",
        "romaji": "Nai khànà thîi thoe kamlang deum gaa-fea, chan kamlang dern ma haa thoe",
        "en": "While you were drinking coffee, I was coming to see you.",
        "grammar_audio": "/audio/thai/grammar/s_ในขณะที่_nai_khànà_thîi_-_While_whereas_20231230_ในขณะที่_เธอ_กำลัง_ดื่ม_กาแฟ_ฉัน_กำลัง_เดิน_มา_หา_เธอ.mp3"
      },
      {
        "th": "ในขณะที่ ชาย นั้น ทำงาน อย่าง หนัก นางสาว นั้น กลับ มา เล่น กีฬา",
        "romaji": "Nai khànà thîi chai nan tham-ngan yang nak, nang-sao nan glap ma len ki-la",
        "en": "While that man was working hard, that young woman was back playing sports.",
        "grammar_audio": "/audio/thai/grammar/s_ในขณะที่_nai_khànà_thîi_-_While_whereas_20231230_ในขณะที่_ชาย_นั้น_ทำงาน_อย่าง_หนัก_นางสาว_นั้น_กลับ_มา_เล่น_กีฬา.mp3"
      },
      {
        "th": "ในขณะที่ เรา พยายาม อยู่ๆ ลูกสาว ของ เรา กลับ คิด ทำ สิ่งดี ๆ",
        "romaji": "Nai khànà thîi rao pha ya yam yùù lûuk-sǎao kǒong rao glap khit tham sǐng dii dii",
        "en": "While we were struggling, our daughter was thinking about doing good things.",
        "grammar_audio": "/audio/thai/grammar/s_ในขณะที่_nai_khànà_thîi_-_While_whereas_20231230_ในขณะที่_เรา_พยายาม_อยู่ๆ_ลูกสาว_ของ_เรา_กลับ_คิด_ทำ_สิ่งดี_ๆ.mp3"
      },
      {
        "th": "ในขณะที่ คุณ รอคอย เขา คุณ พี่ชาย กลับ มา อยู่ บ้าน",
        "romaji": "Nai khànà thîi khun ror-khoi khao, khun pîi-chaai glap ma yùù bâan",
        "en": "While you were waiting for him, your older brother came back home.",
        "grammar_audio": "/audio/thai/grammar/s_ในขณะที่_nai_khànà_thîi_-_While_whereas_20231230_ในขณะที่_คุณ_รอคอย_เขา_คุณ_พี่ชาย_กลับ_มา_อยู่_บ้าน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "ด้วยเหตุนี้ (dûay hèt níi) - Therefore, for this reason",
    "short_explanation": "This phrase is used to show cause and effect; 'therefore' or 'for this reason'.",
    "long_explanation": "In Thai, 'ด้วยเหตุนี้ (dûay hèt níi)' is a conjunction frequently used to express cause and effect or the reasoning behind an action or decision, in a similar way to 'therefore' or 'for this reason' in English. This phrase is typically placed at the start of a sentence, establishing a link between the stated cause in the preceding sentence and the effect in the following sentence. ",
    "formation": "ด้วยเหตุนี้ + Statement ",
    "examples": [
      {
        "th": "ด้วยเหตุนี้ ผม ต้อง ปฏิเสธ ข้อเสนอ นี้ เพราะ มัน ไม่ ตรง กับ ความต้องการ ของ ฉัน",
        "romaji": "Dûay hèt níi, phom tong pà-tì-sèt, khôr sà-nòr níi, pròr man mâi dtrong gàp khwaam dtong gaan kong chǎn",
        "en": "For this reason, I have to refuse this offer because it does not meet my needs.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยเหตุนี้_dûay_hèt_níi_-_Therefore_for_this_reason_20231230_ด้วยเหตุนี้_ผม_ต้อง_ปฏิเสธ_ข้อเสนอ_นี้_เพราะ_มัน_ไม่_ตรง_กับ_ความต้องการ_ของ_ฉัน.mp3"
      },
      {
        "th": "ด้วยเหตุนี้ ฉัน จึง ตัดสินใจ ที่จะ กลับ ไป ที่ หมู่บ้าน ของ ฉัน เพื่อ ฟื้นฟู ชีวิต ใหม่",
        "romaji": "Dûay hèt níi, chan jeung dtàt-sǐn-jai thîi jà glàp pai thîi mûu-bâan kong chan pheua feun-foo chee-wít mài",
        "en": "Therefore, I decided to return to my village in order to start a new life.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยเหตุนี้_dûay_hèt_níi_-_Therefore_for_this_reason_20231230_ด้วยเหตุนี้_ฉัน_จึง_ตัดสินใจ_ที่จะ_กลับ_ไป_ที่_หมู่บ้าน_ของ_ฉัน_เพื่อ_ฟื้นฟู_ชีวิต_ใหม่.mp3"
      },
      {
        "th": "ด้วยเหตุนี้ ทาง โรงเรียน ต้อง ยกเลิก กิจกรรม นั้น เพื่อ ความ ปลอดภัย ของ นักเรียน",
        "romaji": "Dûay hèt níi, thaang rong-rian tong yók-lêk git-ka-rôm nán pheûa khwaam bplòt-phaai kong nák-rian",
        "en": "For this reason, the school had to cancel that activity for the safety of the students.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยเหตุนี้_dûay_hèt_níi_-_Therefore_for_this_reason_20231230_ด้วยเหตุนี้_ทาง_โรงเรียน_ต้อง_ยกเลิก_กิจกรรม_นั้น_เพื่อ_ความ_ปลอดภัย_ของ_นักเรียน.mp3"
      },
      {
        "th": "ด้วยเหตุนี้ เรา ควร ปรับปรุง ระบบ นี้ ให้ ดียิ่งขึ้น เพื่อ ความสะดวกสบาย ใน การ ใช้งาน",
        "romaji": "Dûay hèt níi, rao khuan pràp-prung ra-bòp níi hâi dii yĭng-khuen pheûa khwaam-sà-dwòk-sà-baai nai gaan chái-ngaan",
        "en": "Therefore, we should improve this system for easier usage.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยเหตุนี้_dûay_hèt_níi_-_Therefore_for_this_reason_20231230_ด้วยเหตุนี้_เรา_ควร_ปรับปรุง_ระบบ_นี้_ให้_ดียิ่งขึ้น_เพื่อ_ความสะดวกสบาย_ใน_การ_ใช้งาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "50"
  },
  {
    "title": "เป็นต้นไป (pen tôn bpai) - And so on, etc.",
    "short_explanation": "This phrase is used as a continuation indicator, similar to 'and so on', 'etc.' in English.",
    "long_explanation": "In Thai, the term 'เป็นต้นไป (pen tôn bpai)' is often used as a way of saying 'and so forth' or 'and so on'. It is typically used to suggest that there are other items, steps, or elements that follow the same pattern or trend, but are not specifically mentioned for brevity or simplicity. This phrase is commonly put at the end of a list or series, indicating the continuation of similar items or actions.",
    "formation": "Statement + เป็นต้นไป",
    "examples": [
      {
        "th": "วัน จันทร์ , อังคาร , พุธ , เป็นต้นไป",
        "romaji": "Wan jan , ang kan , phut , pen tôn bpai",
        "en": "Monday, Tuesday, Wednesday, and so forth.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_tôn_bpai_-_And_so_on_etc_20231230_วัน_จันทร์__อังคาร__พุธ__เป็นต้นไป.mp3"
      },
      {
        "th": "เขา ชอบ กิน ผลไม้ มาก ๆ อย่าง องุ่น , ส้ม , แอปเปิ้ล , เป็นต้นไป",
        "romaji": "Khao chop gin polamai mak mak yang angun , som , apple , pen tôn bpai",
        "en": "He likes to eat a lot of fruits, like grapes, oranges, apples, and so on.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_tôn_bpai_-_And_so_on_etc_20231230_เขา_ชอบ_กิน_ผลไม้_มาก_ๆ_อย่าง_องุ่น__ส้ม__แอปเปิ้ล__เป็นต้นไป.mp3"
      },
      {
        "th": "การ พัฒนา การใช้ พลังงาน ทดแทน อย่าง พลังงานแสงอาทิตย์ , พลังงานลม , พลังงานน้ำ , เป็นต้นไป นั้น สำคัญ มาก",
        "romaji": "Kan pat-tha-na kan-chai plaang-ngaan tod-than yang plaang-ngaan-saeng-aathit , plaang-ngaan-lom , plaang-ngaan-nam , pen tôn bpai nan sam-kan mak",
        "en": "The development of alternative energy sources like solar power, wind power, hydropower, and so forth, is very important.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_tôn_bpai_-_And_so_on_etc_20231230_การ_พัฒนา_การใช้_พลังงาน_ทดแทน_อย่าง_พลังงานแสงอาทิตย์__พลังงานลม__พลังงานน้ำ__เป็นต้นไป_นั้น_สำคัญ_มาก.mp3"
      },
      {
        "th": "ใน ห้อง สมุด มี หนังสือ หลากหลาย ประเภท เช่น นวนิยาย , การ์ตูน , หนังสือ ท่องเที่ยว , เป็นต้นไป",
        "romaji": "Nai hong sumud mee nang-sue laak-laai pra-phert chen nu-niyaay , gaan-toon , nang-sue thong-thiao , pen tôn bpai",
        "en": "The library has a variety of types of books, such as novels, comics, travel books, and so on.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_tôn_bpai_-_And_so_on_etc_20231230_ใน_ห้อง_สมุด_มี_หนังสือ_หลากหลาย_ประเภท_เช่น_นวนิยาย__การ์ตูน__หนังสือ_ท่องเที่ยว__เป็นต้นไป.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "แต่งานจริง (dtàe ngaan jing) - In reality, actually",
    "short_explanation": "Used to make a contrast between what is expected or believed to be true and what is actually the case.",
    "long_explanation": "In Thai language, the phrase 'แต่งานจริง (dtàe ngaan jing)' is used to oppose what is expected or presumed to be true with the real situation, similar to the English 'in reality' or 'actually'. It mostly placed at the beginning of a sentence, followed by the fact that contradicts the prior belief or expectation. The phrase can be utilized in different contexts and with various types of sentences, enabling a speaker to express a surprising fact or surprising turn of events.",
    "formation": "แต่งานจริง + Statement",
    "examples": [
      {
        "th": "แต่งานจริง ฉัน ไม่ อาจ แนะนำ เธอ ได้ เนื่องจาก ไม่รู้ จัก เธอ ดี พอ",
        "romaji": "Dtae ngaan jing, chan mai ot nae nam thoe dai neuang jak mai roo jak thoe di por",
        "en": "But in reality, I cannot recommend you because I do not know you well enough.",
        "grammar_audio": "/audio/thai/grammar/s_แต่งานจริง_dtàe_ngaan_jing_-_In_reality_actually_20231230_แต่งานจริง_ฉัน_ไม่_อาจ_แนะนำ_เธอ_ได้_เนื่องจาก_ไม่รู้_จัก_เธอ_ดี_พอ.mp3"
      },
      {
        "th": "แต่งานจริง เขา ไม่ อ่าน หนังสือ เลย แต่ ปลอม ว่า อ่าน แล้ว",
        "romaji": "Dtae ngaan jing, khao mai aan nang su leoi, dtae plom wa aan laeo",
        "en": "But in reality, he hasn’t read the book at all, but he pretended to have read it.",
        "grammar_audio": "/audio/thai/grammar/s_แต่งานจริง_dtàe_ngaan_jing_-_In_reality_actually_20231230_แต่งานจริง_เขา_ไม่_อ่าน_หนังสือ_เลย_แต่_ปลอม_ว่า_อ่าน_แล้ว.mp3"
      },
      {
        "th": "แต่งานจริง หลายคน คิด ว่า เขา เป็น คน ดี แต่ เป็น คน ชอบ หลอกลวง",
        "romaji": "Dtae ngaan jing, lai khon khit wa khao pen khon di dtae pen khon chop lok luang",
        "en": "But in reality, many people think he is a good person, but he is a person who likes to deceive.",
        "grammar_audio": "/audio/thai/grammar/s_แต่งานจริง_dtàe_ngaan_jing_-_In_reality_actually_20231230_แต่งานจริง_หลายคน_คิด_ว่า_เขา_เป็น_คน_ดี_แต่_เป็น_คน_ชอบ_หลอกลวง.mp3"
      },
      {
        "th": "แต่งานจริง คุณ สามารถ ทำ อะไร ได้ บางสิ่ง แต่ ทุกสิ่ง ไม่ จำเป็นต้อง ทำ ด้วย",
        "romaji": "Dtae ngaan jing, khun sa maat tam a-rai dai baang sing dtae thook sing mai jam pen dtong tam duai",
        "en": "But in reality, there are some things you can do, but you don’t have to do everything.",
        "grammar_audio": "/audio/thai/grammar/s_แต่งานจริง_dtàe_ngaan_jing_-_In_reality_actually_20231230_แต่งานจริง_คุณ_สามารถ_ทำ_อะไร_ได้_บางสิ่ง_แต่_ทุกสิ่ง_ไม่_จำเป็นต้อง_ทำ_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เสียจนถึง (sǐa jon thʉ̌ng) - Until, up to",
    "short_explanation": "Used to indicate 'until' or 'up to' a certain point in time or place.",
    "long_explanation": "The term 'เสียจนถึง (sǐa jon thʉ̌ng)' in Thai is used to describe the idea of something continuing until a certain moment or place, comparable to the English 'until' or 'up to'. This phrase can be applied with various verbs and sentences to specify the continuity or extent of a situation.",
    "formation": "Sentence + เสียจนถึง + time/place",
    "examples": [
      {
        "th": "เขา ทำงาน เสียจนถึง ดึก ก่อน ที่ จะ มา นั่ง อ่าน หนังสือ",
        "romaji": "Khao tham-ngan sǐa jon thʉ̌ng deuk kon thee ja ma nâng àan nang-sʉ̂ʉ",
        "en": "He works until late before he comes to read a book.",
        "grammar_audio": "/audio/thai/grammar/s_เสียจนถึง_sǐa_jon_thʉ̌ng_-_Until_up_to_20231230_เขา_ทำงาน_เสียจนถึง_ดึก_ก่อน_ที่_จะ_มา_นั่ง_อ่าน_หนังสือ.mp3"
      },
      {
        "th": "ฉัน เดินทาง เสียจนถึง กรุงเทพฯ ก่อน ที่ จะ รีบ กลับ มา ที่บ้าน",
        "romaji": "Chan doin-thaang sǐa jon thʉ̌ng Krung Thep kon thee ja reep glàp maa thee-bâan",
        "en": "I traveled up to Bangkok before I hurried back home.",
        "grammar_audio": "/audio/thai/grammar/s_เสียจนถึง_sǐa_jon_thʉ̌ng_-_Until_up_to_20231230_ฉัน_เดินทาง_เสียจนถึง_กรุงเทพฯ_ก่อน_ที่_จะ_รีบ_กลับ_มา_ที่บ้าน.mp3"
      },
      {
        "th": "เรา จะ ต้อง รอ เสียจนถึง วัน พรุ่งนี้ ก่อน ที่ เขา จะ กลับ มา",
        "romaji": "Rao ja dtâwng ro sǐa jon thʉ̌ng wan prûng-née kon thee khao ja glàp maa",
        "en": "We will have to wait until tomorrow before he returns.",
        "grammar_audio": "/audio/thai/grammar/s_เสียจนถึง_sǐa_jon_thʉ̌ng_-_Until_up_to_20231230_เรา_จะ_ต้อง_รอ_เสียจนถึง_วัน_พรุ่งนี้_ก่อน_ที่_เขา_จะ_กลับ_มา.mp3"
      },
      {
        "th": "เธอ สอน ภาษาไทย เสียจนถึง เวลา 12 ทุ่ม ก่อน ที่ จะ ไป นอน",
        "romaji": "Thoe son phaa-sǎa Thai sǐa jon thʉ̌ng wee-laa 12 thum kon thee ja bpai non",
        "en": "She teaches Thai until 12 midnight before she goes to sleep.",
        "grammar_audio": "/audio/thai/grammar/s_เสียจนถึง_sǐa_jon_thʉ̌ng_-_Until_up_to_20231230_เธอ_สอน_ภาษาไทย_เสียจนถึง_เวลา_12_ทุ่ม_ก่อน_ที่_จะ_ไป_นอน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เฉยๆ (chǒey chǒey) - Just like that, simply",
    "short_explanation": "Expresses the idea of 'just like that', 'simply', 'in a plain way', or 'without any particular effort or change'.",
    "long_explanation": "The phrase 'เฉยๆ (chǒey chǒey)' in Thai language is used to describe an action or state which is performed or exists just like that, in a simple or straightforward manner, or without any special effort or change. It is generally used at the end of a sentence, though it can also follow the primary verb or action phrase of the sentence.",
    "formation": "Statement + เฉยๆ",
    "examples": [
      {
        "th": "เขา ทำงาน ควบคู่ กับ การ อ่านหนังสือ เฉยๆ ไม่ ว่าจะ ทำ อะไร ก็ตาม",
        "romaji": "Khao tham-ngan khwab khoo kab kan aan nang-sue chǒey chǒey, mai wa ja tam a-rai gor tam",
        "en": "He works and studies just like that, no matter what he does.",
        "grammar_audio": "/audio/thai/grammar/s_เฉยๆ_chǒey_chǒey_-_Just_like_that_simply_20231230_เขา_ทำงาน_ควบคู่_กับ_การ_อ่านหนังสือ_เฉยๆ_ไม่_ว่าจะ_ทำ_อะไร_ก็ตาม.mp3"
      },
      {
        "th": "ฉัน วาด รูป เฉยๆ ไม่ ได้ คิด มากมาย",
        "romaji": "Chan wat roop chǒey chǒey, mai dai kit mak-mai",
        "en": "I draw pictures just like that, without thinking too much.",
        "grammar_audio": "/audio/thai/grammar/s_เฉยๆ_chǒey_chǒey_-_Just_like_that_simply_20231230_ฉัน_วาด_รูป_เฉยๆ_ไม่_ได้_คิด_มากมาย.mp3"
      },
      {
        "th": "เธอ เดิน ไป เฉยๆ แม้ จะ ไม่ มี ที่หมาย",
        "romaji": "Thur dern pai chǒey chǒey, mae ja mai mee tee-mai",
        "en": "She walks simply, even if there's no particular destination.",
        "grammar_audio": "/audio/thai/grammar/s_เฉยๆ_chǒey_chǒey_-_Just_like_that_simply_20231230_เธอ_เดิน_ไป_เฉยๆ_แม้_จะ_ไม่_มี_ที่หมาย.mp3"
      },
      {
        "th": "เขา เล่นกีฬา เฉยๆ แต่ ยังคง มี สุขภาพ ที่ ดี",
        "romaji": "Khao len-kee-la chǒey chǒey, tae yang-kong mee suk-kha-phap thee di",
        "en": "He exercises just like that, but still maintains good health.",
        "grammar_audio": "/audio/thai/grammar/s_เฉยๆ_chǒey_chǒey_-_Just_like_that_simply_20231230_เขา_เล่นกีฬา_เฉยๆ_แต่_ยังคง_มี_สุขภาพ_ที่_ดี.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ครั้งหลัง (kráng làng) - Next time, in the future",
    "short_explanation": "Refers to a future occurrence or the 'next time'.",
    "long_explanation": "The term 'ครั้งหลัง (kráng làng)' is often used in Thai language to refer to an occurrence that will happen in the future or the 'next time'. It is most commonly used at the end of sentences or phrases to indicate a future occasion when an action is repeated or an event will happen again. This term can be utilized in a versatile way with various verbs, nouns, and phrases to express a future repetition or occurrence of an event or action.",
    "formation": "Statement + ครั้งหลัง",
    "examples": [
      {
        "th": "ครั้งหลัง ที่ ฉัน ไป ที่ บางกอก ฉัน ต้องการ ที่ จะ ไป สวน สัตว์",
        "romaji": "Krang lang thi chan pai thi Bangkok, chan dtongkan thi ja pai suan sàt",
        "en": "The next time I go to Bangkok, I want to go to the zoo.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งหลัง_kráng_làng_-_Next_time_in_the_future_20231230_ครั้งหลัง_ที่_ฉัน_ไป_ที่_บางกอก_ฉัน_ต้องการ_ที่_จะ_ไป_สวน_สัตว์.mp3"
      },
      {
        "th": "ถ้า ฉัน ได้ รับ เงิน สละ ใน ครั้งหลัง ฉัน จะ ซื้อ มือถือ ใหม่",
        "romaji": "Tha chan dai rap ngern sla nai krang lang, chan ja seu mue theu mai",
        "en": "If I get a bonus next time, I will buy a new mobile phone.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งหลัง_kráng_làng_-_Next_time_in_the_future_20231230_ถ้า_ฉัน_ได้_รับ_เงิน_สละ_ใน_ครั้งหลัง_ฉัน_จะ_ซื้อ_มือถือ_ใหม่.mp3"
      },
      {
        "th": "เขา บอก ฉัน ว่า ถ้า เขา มี เวลา ใน ครั้งหลัง เขา จะ พา ฉัน ไป เที่ยว",
        "romaji": "Khao bok chan wa tha khao mee welah nai krang lang, khao ja pa chan pai thiaw",
        "en": "He told me that if he has time in the future, he will take me out.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งหลัง_kráng_làng_-_Next_time_in_the_future_20231230_เขา_บอก_ฉัน_ว่า_ถ้า_เขา_มี_เวลา_ใน_ครั้งหลัง_เขา_จะ_พา_ฉัน_ไป_เที่ยว.mp3"
      },
      {
        "th": "นักเรียน ที่ ไม่ ได้ มา ครั้ง นี้ จะ ต้อง มา ใน ครั้งหลัง",
        "romaji": "Nak rian thi mai dai ma krang ni ja dtong ma nai krang lang",
        "en": "Students who did not come this time must come next time.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งหลัง_kráng_làng_-_Next_time_in_the_future_20231230_นักเรียน_ที่_ไม่_ได้_มา_ครั้ง_นี้_จะ_ต้อง_มา_ใน_ครั้งหลัง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ครั้งก่อน (kráng g̀̀xn) - Before, previously",
    "short_explanation": "Used to refer past events or circumstances; 'before' or 'previously'.",
    "long_explanation": "The term 'ครั้งก่อน (kráng g̀̀xn)' is used in Thai to refer to past events or circumstances, similar to the English terms 'before' or 'previously'. It can be used at the beginning or end of statements, or even in the middle, to denote an event, action, or state that has occurred in the past. It is versatile and can be used with a wide variety of verbs, adjectives, and phrases to express different temporal contexts.",
    "formation": "ครั้งก่อน + Statement / Statement + ครั้งก่อน",
    "examples": [
      {
        "th": "ครั้งก่อน ฉัน ไป ช็อปปิ้ง ทุกวัน กันทั้งวัน",
        "romaji": "Krang gon chan pai shopping took wan gan thung wan",
        "en": "Before, I used to go shopping all day every day.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งก่อน_kráng_g̀̀xn_-_Before_previously_20231230_ครั้งก่อน_ฉัน_ไป_ช็อปปิ้ง_ทุกวัน_กันทั้งวัน.mp3"
      },
      {
        "th": "ฉัน ไป เยี่ยม เพื่อน ที่ โรงพยาบาล ครั้งก่อน",
        "romaji": "Chan pai yiim phuean thi roong pha-ya-baan krang gon",
        "en": "I visited a friend at the hospital before.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งก่อน_kráng_g̀̀xn_-_Before_previously_20231230_ฉัน_ไป_เยี่ยม_เพื่อน_ที่_โรงพยาบาล_ครั้งก่อน.mp3"
      },
      {
        "th": "ครั้งก่อน เขา ใช้ใจ ใน การ เรียน มากกว่า นี้",
        "romaji": "Krang gon khao chai jai nai kaan riian maak gwaa nee",
        "en": "He used to be more dedicated to his studies than this before.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งก่อน_kráng_g̀̀xn_-_Before_previously_20231230_ครั้งก่อน_เขา_ใช้ใจ_ใน_การ_เรียน_มากกว่า_นี้.mp3"
      },
      {
        "th": "เขา เคย เดินทาง ไป ททคค ครั้งก่อน",
        "romaji": "Khao koey doin thaang pai Thonglor krang gon",
        "en": "He has travelled to Thonglor before.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งก่อน_kráng_g̀̀xn_-_Before_previously_20231230_เขา_เคย_เดินทาง_ไป_ททคค_ครั้งก่อน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เสียแล้ว (sǐa láew) - Unfortunately, regretfully",
    "short_explanation": "Expresses regret, loss or missed opportunity; 'unfortunately', 'regretfully'.",
    "long_explanation": "The phrase 'เสียแล้ว (sǐa láew)' is used in Thai to express a sense of regret or a loss, akin to the English phrases 'unfortunately' or 'regretfully'. The usage pertains to an unfortunate event having already transpired, or a missed opportunity. It often precedes the main clause of a sentence to set the tone of regret.",
    "formation": "เสียแล้ว + Rest of the sentence",
    "examples": [
      {
        "th": "เสียแล้ว ฉัน ไม่ สามารถ เข้าร่วม ปาร์ตี้ วันเกิด ของ คุณ ได้",
        "romaji": "Sǐa láew, chan mai samart khao ruam party wan gert kong khun dai",
        "en": "Unfortunately, I can't attend your birthday party.",
        "grammar_audio": "/audio/thai/grammar/s_เสียแล้ว_sǐa_láew_-_Unfortunately_regretfully_20231230_เสียแล้ว_ฉัน_ไม่_สามารถ_เข้าร่วม_ปาร์ตี้_วันเกิด_ของ_คุณ_ได้.mp3"
      },
      {
        "th": "เสียแล้ว ฉัน ลืม หยิบ กระเป๋า ของ ฉัน มา จาก บ้าน",
        "romaji": "Sǐa láew, chan leum yib grapao kong chan ma jak baan",
        "en": "Regrettably, I forgot to bring my bag from home.",
        "grammar_audio": "/audio/thai/grammar/s_เสียแล้ว_sǐa_láew_-_Unfortunately_regretfully_20231230_เสียแล้ว_ฉัน_ลืม_หยิบ_กระเป๋า_ของ_ฉัน_มา_จาก_บ้าน.mp3"
      },
      {
        "th": "เสียแล้ว คุณ พลาด โอกาส ที่ ดี เพื่อ ที่ จะ ได้ พบ กับ ผู้ บริหาร ของ บริษัท",
        "romaji": "Sǐa láew, khun plaad okat thi di phuea thi ja dai pop kab phu borihat kong borisat",
        "en": "Unfortunately, you missed a good opportunity to meet with the company's executives.",
        "grammar_audio": "/audio/thai/grammar/s_เสียแล้ว_sǐa_láew_-_Unfortunately_regretfully_20231230_เสียแล้ว_คุณ_พลาด_โอกาส_ที่_ดี_เพื่อ_ที่_จะ_ได้_พบ_กับ_ผู้_บริหาร_ของ_บริษัท.mp3"
      },
      {
        "th": "เสียแล้ว ฉัน หมด พลังงาน ใน การ ทำงาน เกิน เวลา แล้ว",
        "romaji": "Sǐa láew, chan mot palang ngan nai kan tham ngan gaan welah laew",
        "en": "Regrettably, I have exhausted my energy in working overtime.",
        "grammar_audio": "/audio/thai/grammar/s_เสียแล้ว_sǐa_láew_-_Unfortunately_regretfully_20231230_เสียแล้ว_ฉัน_หมด_พลังงาน_ใน_การ_ทำงาน_เกิน_เวลา_แล้ว.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ตั้งแต่...จน (dtâng dtàe...jon) - From... until...",
    "short_explanation": "Used to indicate duration in time or space, similar to the English 'from... until...'.",
    "long_explanation": "The term 'ตั้งแต่...จน (dtâng dtàe...jon)' is widely used in Thai to indicate the start and end of a period in time or space, much like the English phrase 'from... until...'. It is typically placed at the beginning and middle of sentences, respectively, to denote the beginning and end of a period or location. The term 'ตั้งแต่' precedes the time or position indicating the starting point and 'จน' is followed with the time or position representing the endpoint.",
    "formation": "ตั้งแต่ + Statement1 + จน + Statement2",
    "examples": [
      {
        "th": "เขา งาน ตั้งแต่ บ่าย สอง จน ตี หนึ่ง",
        "romaji": "Khao ngan dtâng dtàe bai song jon dtii neung",
        "en": "He works from two in the afternoon until one in the morning.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่จน_dtâng_dtàejon_-_From_until_20231230_เขา_งาน_ตั้งแต่_บ่าย_สอง_จน_ตี_หนึ่ง.mp3"
      },
      {
        "th": "ข้าว ที่ ข้าพเจ้า ทาน มา ตั้งแต่ เด็ก จนตุก สำหรับ บ้าน ของ เรา",
        "romaji": "Khao thi khap jao than ma dtâng dtàe dek jon dtug samrap ban kong rao",
        "en": "The rice that I've been eating from childhood until now is for our home.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่จน_dtâng_dtàejon_-_From_until_20231230_ข้าว_ที่_ข้าพเจ้า_ทาน_มา_ตั้งแต่_เด็ก_จนตุก_สำหรับ_บ้าน_ของ_เรา.mp3"
      },
      {
        "th": "เธอ เดินทาง ไป ภูเก็ต ตั้งแต่ วัน อาทิตย์ จน วัน พุธ",
        "romaji": "Thoe deinthang pai Phuket dtâng dtàe wan a-thit jon wan phut",
        "en": "She travelled to Phuket from Sunday until Wednesday.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่จน_dtâng_dtàejon_-_From_until_20231230_เธอ_เดินทาง_ไป_ภูเก็ต_ตั้งแต่_วัน_อาทิตย์_จน_วัน_พุธ.mp3"
      },
      {
        "th": "ผม มี การ ศึกษา อยู่ ที่ เมือง ไทย ตั้งแต่ เดือน มกราคม จน เดือน ธันวาคม",
        "romaji": "Phom mee kan sueksa yu thi mueang thai dtâng dtàe duean makaracom jon duean thanwaakhom",
        "en": "I have been studying in Thailand from January until December.",
        "grammar_audio": "/audio/thai/grammar/s_ตั้งแต่จน_dtâng_dtàejon_-_From_until_20231230_ผม_มี_การ_ศึกษา_อยู่_ที่_เมือง_ไทย_ตั้งแต่_เดือน_มกราคม_จน_เดือน_ธันวาคม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "มิฉะนั้น (mí chá nán) - Otherwise, or else",
    "short_explanation": "Used to introduce the undesirable consequences that might result if the action in the main clause is not carried out; 'otherwise' or 'or else'.",
    "long_explanation": "The term 'มิฉะนั้น (mí chá nán)' in Thai language is utilized as a conjunction to introduce an outcome that is likely to occur if the action or condition stated in the preceding clause does not happen. It parallels the English usage of 'otherwise' or 'or else'. It indicates a contrast or alternative, suggesting a negative or undesirable result if a certain action or condition is not satisfied.",
    "formation": "Condition/Action + มิฉะนั้น + Consequence",
    "examples": [
      {
        "th": "คุณ ต้อง ลงเรือนจำ ถ้า คุณ ไม่ จ่าย ค่าปรับ มิฉะนั้น",
        "romaji": "Khun tong long ruean jam thaa khun mai chai kha prap mí chá nán",
        "en": "You have to go to jail if you don't pay the fine, otherwise.",
        "grammar_audio": "/audio/thai/grammar/s_มิฉะนั้น_mí_chá_nán_-_Otherwise_or_else_20231230_คุณ_ต้อง_ลงเรือนจำ_ถ้า_คุณ_ไม่_จ่าย_ค่าปรับ_มิฉะนั้น.mp3"
      },
      {
        "th": "เรา ต้อง มา เรียน ทุก วัน มิฉะนั้น คุณ จะ การันตี ว่า เรา จะ ผ่าน การ สอบ",
        "romaji": "Rao tong ma rian thuk wan mí chá nán khun ja garantee wa rao ja paan kaan sǒp",
        "en": "We need to study every day, otherwise, you can guarantee that we will pass the exam.",
        "grammar_audio": "/audio/thai/grammar/s_มิฉะนั้น_mí_chá_nán_-_Otherwise_or_else_20231230_เรา_ต้อง_มา_เรียน_ทุก_วัน_มิฉะนั้น_คุณ_จะ_การันตี_ว่า_เรา_จะ_ผ่าน_การ_สอบ.mp3"
      },
      {
        "th": "คุณ ต้อง เก็บขยะ ทุก วัน มิฉะนั้น บ้าน ของ คุณ จะ กลิ่น เหม็น",
        "romaji": "Khun tong gep kha ya thuk wan mí chá nán baan kong khun ja glin men",
        "en": "You need to take out the trash every day, otherwise, your house will smell.",
        "grammar_audio": "/audio/thai/grammar/s_มิฉะนั้น_mí_chá_nán_-_Otherwise_or_else_20231230_คุณ_ต้อง_เก็บขยะ_ทุก_วัน_มิฉะนั้น_บ้าน_ของ_คุณ_จะ_กลิ่น_เหม็น.mp3"
      },
      {
        "th": "คุณ ต้อง ฝึกฝน ทุก วัน มิฉะนั้น คุณ จะ ไม่ มี การ เพิ่มประสิทธิภาพ",
        "romaji": "Khun tong fuek fon thuk wan mí chá nán khun ja mai mee kaan pheum pra sit thap",
        "en": "You need to practice every day, otherwise, you won't improve.",
        "grammar_audio": "/audio/thai/grammar/s_มิฉะนั้น_mí_chá_nán_-_Otherwise_or_else_20231230_คุณ_ต้อง_ฝึกฝน_ทุก_วัน_มิฉะนั้น_คุณ_จะ_ไม่_มี_การ_เพิ่มประสิทธิภาพ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ในที่ (nai thîi) - In which, where",
    "short_explanation": "A location marker or connector similar to 'in which' or 'where' in English.",
    "long_explanation": "The phrase 'ในที่ (nai thîi)' in Thai is usually used to refer to a specific location or to connect two clauses in a sentence. It can denote a physical place or a metaphorical space, similar to the English phrases 'in which' or 'where'. It can be used in spatial, abstract, or metaphorical contexts and provides a bridge between the details of an action or situation and its setting or broader context.",
    "formation": "Statement + ในที่",
    "examples": [
      {
        "th": "ห้อง ที่ เธอ อยู่ ในที่นั้น เป็น ห้อง ที่ มี หนังสือ มากมาย",
        "romaji": "Hong thi thoe yu nai thi nan pen hong thi mee nang sue mak mai",
        "en": "The room where you stay is the room that has many books.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่_nai_thîi_-_In_which_where_20231230_ห้อง_ที่_เธอ_อยู่_ในที่นั้น_เป็น_ห้อง_ที่_มี_หนังสือ_มากมาย.mp3"
      },
      {
        "th": "ทุกวัน เขา ช่วย เอา ขยะ ออก จาก บ้าน แล้ว เอาไป ทิ้ง ในที่ ที่ กำหนด ไว้",
        "romaji": "Thuk wan khao chuay ao khaya ok jaak baan laeo ao pai thing nai thi thi kamnot wai",
        "en": "Every day, he helps to take out the garbage from home and throws it in the designated place.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่_nai_thîi_-_In_which_where_20231230_ทุกวัน_เขา_ช่วย_เอา_ขยะ_ออก_จาก_บ้าน_แล้ว_เอาไป_ทิ้ง_ในที่_ที่_กำหนด_ไว้.mp3"
      },
      {
        "th": "ฉัน ออกมา ในที่รถถัง แล้ว ดู รอบ ๆ แต่ ไม่ เห็น เธอ อยู่ ที่ไหน",
        "romaji": "Chan ok ma nai thi rot thang laeo du rob rob tae mai hen thoe yu thi nai",
        "en": "I came out at the car and looked around but couldn't see where you were.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่_nai_thîi_-_In_which_where_20231230_ฉัน_ออกมา_ในที่รถถัง_แล้ว_ดู_รอบ_ๆ_แต่_ไม่_เห็น_เธอ_อยู่_ที่ไหน.mp3"
      },
      {
        "th": "ฉัน ต้องการ แบบ ไม่ ต้อง ออกจาก บ้าน แต่ สามารถ ทำงาน ได้ ในที่ ที่ ฉัน สบาย",
        "romaji": "Chan tongkan baep mai tong ok jaak baan tae samart tham ngan dai nai thi thi chan sabai",
        "en": "I want a way not to have to leave home but be able to work where I feel comfortable.",
        "grammar_audio": "/audio/thai/grammar/s_ในที่_nai_thîi_-_In_which_where_20231230_ฉัน_ต้องการ_แบบ_ไม่_ต้อง_ออกจาก_บ้าน_แต่_สามารถ_ทำงาน_ได้_ในที่_ที่_ฉัน_สบาย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เมื่อไร (mʉ̂a rai) - Whenever, any time",
    "short_explanation": "Indicates a non-specific time or upon occurrence of an event; 'whenever' or 'any time'.",
    "long_explanation": "The term 'เมื่อไร (mʉ̂a rai)' is used in Thai to denote non-specific time, similar to the English 'whenever' or 'any time'. It is basically used to indicate that something happens each time a particular situation occurs, no matter how often that is. It can be placed before or after the verb or full verb phrase depending on the context.",
    "formation": "เมื่อไร Verb/Full verb phrase",
    "examples": [
      {
        "th": "เมื่อไร ที่ เขา มี เวลา ว่าง เขา จะ มา หา ฉัน",
        "romaji": "Mʉ̂a rai thi khao mee wa-la waang, khao ja ma ha chan",
        "en": "Whenever he has free time, he comes to see me.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mʉ̂a_rai_-_Whenever_any_time_20231230_เมื่อไร_ที่_เขา_มี_เวลา_ว่าง_เขา_จะ_มา_หา_ฉัน.mp3"
      },
      {
        "th": "ฉัน พร้อม ที่ จะ ไป ท่องเที่ยว เมื่อไร ที่ เธอ อยาก ไป",
        "romaji": "Chan phrom thi ja pai thong thiao mʉ̂a rai thi thoe yak pai",
        "en": "I am ready to travel whenever you want to go.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mʉ̂a_rai_-_Whenever_any_time_20231230_ฉัน_พร้อม_ที่_จะ_ไป_ท่องเที่ยว_เมื่อไร_ที่_เธอ_อยาก_ไป.mp3"
      },
      {
        "th": "เมื่อไร ที่ ฉัน รู้สึก หิว ฉัน จะ ทาน ขนม",
        "romaji": "Mʉ̂a rai thi chan ru-suek hiw, chan ja tan kanom",
        "en": "Whenever I feel hungry, I eat snacks.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mʉ̂a_rai_-_Whenever_any_time_20231230_เมื่อไร_ที่_ฉัน_รู้สึก_หิว_ฉัน_จะ_ทาน_ขนม.mp3"
      },
      {
        "th": "เมื่อไร ที่ ฉัน มอง ดู ภาพถ่าย นี้ ฉัน จะ รู้สึก ผ่อนคลาย",
        "romaji": "Mʉ̂a rai thi chan mong du phap-thai nee, chan ja ru-suek phon klai",
        "en": "Whenever I look at this picture, I feel relaxed.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไร_mʉ̂a_rai_-_Whenever_any_time_20231230_เมื่อไร_ที่_ฉัน_มอง_ดู_ภาพถ่าย_นี้_ฉัน_จะ_รู้สึก_ผ่อนคลาย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เรื่องของ (rʉ̂ang khɔ̌ng) - About, Regarding",
    "short_explanation": "Used to indicate what the topic, content, or subject of an action, event, or discussion is.",
    "long_explanation": "The construction 'เรื่องของ (rʉ̂ang khɔ̌ng)' is commonly used in Thai to indicate what something is about, or the topic of a conversation or discussion. The term 'เรื่อง (rʉ̂ang)' means 'matter' or 'issue', while 'ของ (khɔ̌ng)' is a possesive word, similar to the English 'of'. The construction can be used with a wide range of verbs to refer to the subject, content, or topic of an action or event.",
    "formation": "เรื่องของ + Subject/Topic",
    "examples": [
      {
        "th": "เรื่องของ การ ทำ งาน นั้น หนึ่ง ให้ กับ ผม ส่วน ใหญ่ คือ การ จัดการ เรื่อง ข้อมูล",
        "romaji": "Rʉ̂ang khɔ̌ng kan tham ngan nan nʉ̀ng hai kap phom suan yai kʉʉ kan jatgan rʉ̂ang khɔ̌ mʉul",
        "en": "The work given to me mostly involves managing data.",
        "grammar_audio": "/audio/thai/grammar/s_เรื่องของ_rʉ̂ang_khɔ̌ng_-_About_Regarding_20231230_เรื่องของ_การ_ทำ_งาน_นั้น_หนึ่ง_ให้_กับ_ผม_ส่วน_ใหญ่_คือ_การ_จัดการ_เรื่อง_ข้อมูล.mp3"
      },
      {
        "th": "ผม รู้สึก ว่า เรื่องของ การ คิดค้น สิ่งใหม่ๆ นั้น ทำให้ ผม รู้สึก ตื่นเต้น",
        "romaji": "Phom ruu suk waa rʉ̂ang khɔ̌ng kan khit khon sing mai mai nan tham hai phom ruu suk teun ten",
        "en": "I feel that the topic of inventing new things excites me.",
        "grammar_audio": "/audio/thai/grammar/s_เรื่องของ_rʉ̂ang_khɔ̌ng_-_About_Regarding_20231230_ผม_รู้สึก_ว่า_เรื่องของ_การ_คิดค้น_สิ่งใหม่ๆ_นั้น_ทำให้_ผม_รู้สึก_ตื่นเต้น.mp3"
      },
      {
        "th": "เรื่องของ ความสัมพันธ์ ทางการเงิน ที่ เรา มีกัน เป็น เรื่อง ที่ ต้องการ การ คุยครั้งเดียว",
        "romaji": "Rʉ̂ang khɔ̌ng khwam sam phan thang kan ngin thi rao mee gan pen rʉ̂ang thi tong kan kan kui krang diao",
        "en": "Our financial relationship is a matter that requires a one-time discussion.",
        "grammar_audio": "/audio/thai/grammar/s_เรื่องของ_rʉ̂ang_khɔ̌ng_-_About_Regarding_20231230_เรื่องของ_ความสัมพันธ์_ทางการเงิน_ที่_เรา_มีกัน_เป็น_เรื่อง_ที่_ต้องการ_การ_คุยครั้งเดียว.mp3"
      },
      {
        "th": "การ ทำภารกิจ หลัก ใน เรื่องของ การ ตัดสินใจ ใน งานงาน นี้ ต้อง พิจารณา อย่างรอบคอบ",
        "romaji": "Kan tham pha ran git lak nai rʉ̂ang khɔ̌ng kan tat sin jai nai ngan ngan ni tong pi cha ra na yaang rub khop",
        "en": "The main task of decision-making in this job needs to be considered thoroughly.",
        "grammar_audio": "/audio/thai/grammar/s_เรื่องของ_rʉ̂ang_khɔ̌ng_-_About_Regarding_20231230_การ_ทำภารกิจ_หลัก_ใน_เรื่องของ_การ_ตัดสินใจ_ใน_งานงาน_นี้_ต้อง_พิจารณา_อย่างรอบคอบ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ไม่แค่...แต่ยัง... (mâi khâe... dtàe yang...) - Not only... but also...",
    "short_explanation": "This structure is used to express 'not only... but also...', emphasizing that not only does the first statement hold true, but the second statement is also true.",
    "long_explanation": "The phrase 'ไม่แค่...แต่ยัง... (mâi khâe... dtàe yang...)' is commonly used in Thai to express 'not only... but also...'. This structure helps add depth and emphasis to statements by expressing that not only is the first part of the statement true, but the second part is additionally true, often in a surprising or unexpected manner. It is versatile, and can be used with a variety of verbs, adjectives, and phrases.",
    "formation": "ไม่แค่ (Statement 1)... แต่ยัง (Statement 2)...",
    "examples": [
      {
        "th": "เขา ไม่ แค่ มี ความสามารถ ใน การ เขียน เรื่อง ราว แต่ ยัง สามารถ วาด ภาพ ได้ ดี อีก ด้วย",
        "romaji": "Khao mâi khâe mee khwaam-saam-aht nai gaan khiian ruang-rao dtàe yang saam-aht waat phaap dâi dee eek dûai",
        "en": "Not only is he capable of writing stories, but he can also draw pictures well.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่แค่แต่ยัง_mâi_khâe_dtàe_yang_-_Not_only_but_also_20231230_เขา_ไม่_แค่_มี_ความสามารถ_ใน_การ_เขียน_เรื่อง_ราว_แต่_ยัง_สามารถ_วาด_ภาพ_ได้_ดี_อีก_ด้วย.mp3"
      },
      {
        "th": "ฉัน ไม่ แค่ ต้องการ เป็น มนุษย์ ที่ ดี แต่ ยัง ต้องการ ทำการดี ให้ ชุมชน ด้วย",
        "romaji": "Chan mâi khâe dtông gaan pen manût thîi dee dtàe yang dtông gaan tham- gaan-dee hâi choom-chon dûai",
        "en": "Not only do I want to be a good person, but I also want to do good for the community.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่แค่แต่ยัง_mâi_khâe_dtàe_yang_-_Not_only_but_also_20231230_ฉัน_ไม่_แค่_ต้องการ_เป็น_มนุษย์_ที่_ดี_แต่_ยัง_ต้องการ_ทำการดี_ให้_ชุมชน_ด้วย.mp3"
      },
      {
        "th": "เขา ไม่ แค่ ชวน ฉัน ไป เที่ยว แต่ ยัง ช่วย วางแผน ทั้งหมด ให้ ด้วย",
        "romaji": "Khao mâi khâe chuan chan pai thîiao dtàe yang chûay waang-phan thang-mòt hâi dûai",
        "en": "Not only did he invite me to travel, but he also helped plan everything.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่แค่แต่ยัง_mâi_khâe_dtàe_yang_-_Not_only_but_also_20231230_เขา_ไม่_แค่_ชวน_ฉัน_ไป_เที่ยว_แต่_ยัง_ช่วย_วางแผน_ทั้งหมด_ให้_ด้วย.mp3"
      },
      {
        "th": "ฉัน ไม่ แค่ เข้าใจ ว่า เธอ รู้สึก อย่างไร แต่ ยัง รู้สึก เหมือนกัน ด้วย",
        "romaji": "Chan mâi khâe khâo-jai wâa thoe róo-seuk yàang-rai dtàe yang róo-seuk mêuan-gan dûai",
        "en": "Not only do I understand how you feel, but I also feel the same.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่แค่แต่ยัง_mâi_khâe_dtàe_yang_-_Not_only_but_also_20231230_ฉัน_ไม่_แค่_เข้าใจ_ว่า_เธอ_รู้สึก_อย่างไร_แต่_ยัง_รู้สึก_เหมือนกัน_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ครั้งใด (kráng dai) - Whenever, any occasion",
    "short_explanation": "Used to indicate 'any time' or 'whenever'.",
    "long_explanation": "The term 'ครั้งใด (kráng dai)' is used in Thai to indicate 'any time' or 'whenever'. Similar to the English 'whenever', it points towards any occasion or unspecified time when an action is carried out. It can be used in sentences in various contexts and mostly comes before the main clause.",
    "formation": "ครั้งใด + Statement",
    "examples": [
      {
        "th": "ครั้งใด ที่ ฉัน มี ปัญหา เธอ ก็ อยู่ ข้าง ฉัน",
        "romaji": "Krang dai thi chan mee pan-ha, thoe kor yoo khang chan",
        "en": "Whenever I have a problem, she is there for me.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งใด_kráng_dai_-_Whenever_any_occasion_20231230_ครั้งใด_ที่_ฉัน_มี_ปัญหา_เธอ_ก็_อยู่_ข้าง_ฉัน.mp3"
      },
      {
        "th": "ครั้งใด ที่ ฉัน ไป สวนสาธารณะ ฉัน จะ ใช้ เวลา เล่น เกม",
        "romaji": "Krang dai thi chan pai suan-satharan, chan ja chai we-la len game",
        "en": "Whenever I go to the park, I spend time playing games.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งใด_kráng_dai_-_Whenever_any_occasion_20231230_ครั้งใด_ที่_ฉัน_ไป_สวนสาธารณะ_ฉัน_จะ_ใช้_เวลา_เล่น_เกม.mp3"
      },
      {
        "th": "ครั้งใด ที่ ฉัน มี โอกาส ฉัน จะ ช่วยเหลือ ผู้คน ที่ มี ความ จำเป็น",
        "romaji": "Krang dai thi chan mee o-gat, chan ja chuay-leua poo-kon thi mee khwam jum-pen",
        "en": "Whenever I have the opportunity, I will help people in need.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งใด_kráng_dai_-_Whenever_any_occasion_20231230_ครั้งใด_ที่_ฉัน_มี_โอกาส_ฉัน_จะ_ช่วยเหลือ_ผู้คน_ที่_มี_ความ_จำเป็น.mp3"
      },
      {
        "th": "ครั้งใด ที่ ฉัน ได้ยิน เพลง นั้น ฉัน จะ รู้สึก ดี",
        "romaji": "Krang dai thi chan dai-yin pleung nun, chan ja roo-suek dii",
        "en": "Whenever I hear that song, I feel good.",
        "grammar_audio": "/audio/thai/grammar/s_ครั้งใด_kráng_dai_-_Whenever_any_occasion_20231230_ครั้งใด_ที่_ฉัน_ได้ยิน_เพลง_นั้น_ฉัน_จะ_รู้สึก_ดี.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เท่าที่ (thâo thîi) - As far as, as much as",
    "short_explanation": "Used to indicate the extent or limit of something or to the maximum possible extent; 'as far as', 'as much as'.",
    "long_explanation": "The phrase 'เท่าที่ (thâo thîi)' is widely used in Thai to illustrate the extent or limit to which something extends. It is equivalent to 'as far as' or 'as much as' in English. This term is often accompanied by a verb and then followed by a clause specifying the limit or extent, and it can be used to indicate either physical or metaphorical extents.",
    "formation": "เท่าที่ + Verb or Adjective",
    "examples": [
      {
        "th": "เท่าที่ ผม สามารถ ทำ ได้ ผม จะ ช่วย เธอ",
        "romaji": "Thâo thîi phǒm să-mâat tam dâi, phǒm chà way thǒer",
        "en": "I will help you as much as I can.",
        "grammar_audio": "/audio/thai/grammar/s_เท่าที่_thâo_thîi_-_As_far_as_as_much_as_20231230_เท่าที่_ผม_สามารถ_ทำ_ได้_ผม_จะ_ช่วย_เธอ.mp3"
      },
      {
        "th": "เรา ควร ต้อง รัก ษา สุขภาพ ของ เรา ให้ ดี เท่าที่ สามารถ",
        "romaji": "Rao kuan tong rak-sa sook-khâ-phâap kǒng rao hâi dii thâo thii să-mâat",
        "en": "We should take care of our health as best we can.",
        "grammar_audio": "/audio/thai/grammar/s_เท่าที่_thâo_thîi_-_As_far_as_as_much_as_20231230_เรา_ควร_ต้อง_รัก_ษา_สุขภาพ_ของ_เรา_ให้_ดี_เท่าที่_สามารถ.mp3"
      },
      {
        "th": "ผม ติดตาม ข่าว สาร ทางอินเทอร์เน็ต เท่าที่ ผม สามารถ ทำได้",
        "romaji": "Phǒm tít-tàa-mon kàao saan taang internet thâo thii phǒm să-mâat tam dâi",
        "en": "I follow the news on the internet as much as I can.",
        "grammar_audio": "/audio/thai/grammar/s_เท่าที่_thâo_thîi_-_As_far_as_as_much_as_20231230_ผม_ติดตาม_ข่าว_สาร_ทางอินเทอร์เน็ต_เท่าที่_ผม_สามารถ_ทำได้.mp3"
      },
      {
        "th": "เธอ ทำ ความ สะ อาด บ้าน เท่าที่ ทำได้ แล้ว จะ ไป ทำงาน",
        "romaji": "Thǒer tam kwaam sà-àat bâan thâo thii tam-dâi láew ja pai tam-ngaan",
        "en": "She cleans the house as much as she can before going to work.",
        "grammar_audio": "/audio/thai/grammar/s_เท่าที่_thâo_thîi_-_As_far_as_as_much_as_20231230_เธอ_ทำ_ความ_สะ_อาด_บ้าน_เท่าที่_ทำได้_แล้ว_จะ_ไป_ทำงาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ในระหว่าง (nai rà-wàang) - During, in the midst of",
    "short_explanation": "Indicates the period or interval of time overlapping with an action or event; 'during', 'in the midst of'.",
    "long_explanation": "The term 'ในระหว่าง (nai rà-wàang)' in Thai is used to indicate the duration or time frame in which an action or event takes place, similar to the English 'during' or 'in the midst of'. It is mostly positioned at the beginning of sentences or right before the action or event to specify the particular time period the context takes place in.",
    "formation": "ในระหว่าง + Time period / Event + Statement",
    "examples": [
      {
        "th": "ในระหว่าง ที่ ฉัน กำลัง อ่านหนังสือ เธอ ก็ เข้ามา ห้อง และ ปิด ไฟ",
        "romaji": "Nai rà-wàang thi chan kam lang aan nang sue, thoe ko khao ma hong lae pit fai",
        "en": "During the time I was reading a book, she came into the room and turned off the light.",
        "grammar_audio": "/audio/thai/grammar/s_ในระหว่าง_nai_rà-wàang_-_During_in_the_midst_of_20231230_ในระหว่าง_ที่_ฉัน_กำลัง_อ่านหนังสือ_เธอ_ก็_เข้ามา_ห้อง_และ_ปิด_ไฟ.mp3"
      },
      {
        "th": "ในระหว่าง ที่ เรา ทั้งหมด กำลัง ร่าเริง ร้อง เพลง เขา ก็ อยู่ ห้องนอน ใน เฉียบเ静",
        "romaji": "Nai rà-wàang thi rao thang mot kam lang ra-reng rong pleung, khao ko yu hong non nai chiap ching",
        "en": "During the time we were all joyfully singing, he was in the bedroom in complete silence.",
        "grammar_audio": "/audio/thai/grammar/s_ในระหว่าง_nai_rà-wàang_-_During_in_the_midst_of_20231230_ในระหว่าง_ที่_เรา_ทั้งหมด_กำลัง_ร่าเริง_ร้อง_เพลง_เขา_ก็_อยู่_ห้องนอน_ใน_เฉียบเ静.mp3"
      },
      {
        "th": "ในระหว่าง เทศกาล เพื่อน ของ ฉัน ได้ หยิบ กีตาร์ ขึ้น มา และ เริ่ม พลาด เพลง",
        "romaji": "Nai rà-wàang thet-sa-gan, pheuuan kong chan dai yip guitar kheun ma lae roem plaad pleung",
        "en": "During the festival, my friend picked up a guitar and started to strum a song.",
        "grammar_audio": "/audio/thai/grammar/s_ในระหว่าง_nai_rà-wàang_-_During_in_the_midst_of_20231230_ในระหว่าง_เทศกาล_เพื่อน_ของ_ฉัน_ได้_หยิบ_กีตาร์_ขึ้น_มา_และ_เริ่ม_พลาด_เพลง.mp3"
      },
      {
        "th": "ในระหว่าง ที่ ภรรยา เขา คุก เครื่องปรุง น้ำพริก ที่ คั่ว แคั่น เขา กำลัง เดิน หา ผัก",
        "romaji": "Nai rà-wàang thi phan-ra-ya khao kook kreuang prung nam prik thi khua khaen khao kam lang dern ha pak",
        "en": "During the time his wife was cooking the roasted chili paste, he was walking to get vegetables.",
        "grammar_audio": "/audio/thai/grammar/s_ในระหว่าง_nai_rà-wàang_-_During_in_the_midst_of_20231230_ในระหว่าง_ที่_ภรรยา_เขา_คุก_เครื่องปรุง_น้ำพริก_ที่_คั่ว_แคั่น_เขา_กำลัง_เดิน_หา_ผัก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เสมือน (sà-mʉan) - As if, resembling",
    "short_explanation": "Used to indicate resemblance or comparison to something; 'as if' or 'like'.",
    "long_explanation": "The Thai term 'เสมือน (sà-mʉan)' is typically used to imply a comparison or similarity between things, akin to the English phrase 'as if' or 'like'. It introduces an analogy or similarity, giving a vivid image or impression. It is utilized with a wide array of verbs, adjectives, and phrases to communicate an analogy or comparison.",
    "formation": "[Phrase] + เสมือน + [Phrase]",
    "examples": [
      {
        "th": "เขา พูด คำปราศรัย ด้วย ความ มั่นใจ เสมือน ว่า เขา เป็น นัก การเมือง ที่ มี ประสบการณ์",
        "romaji": "Khao phut kham prasai duay khwam man chai sà-mʉan wa khao pen nak kanmuang thi mee prasopkan",
        "en": "He spoke the speech with confidence as if he was an experienced politician.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_เขา_พูด_คำปราศรัย_ด้วย_ความ_มั่นใจ_เสมือน_ว่า_เขา_เป็น_นัก_การเมือง_ที่_มี_ประสบการณ์.mp3"
      },
      {
        "th": "ฉัน ทำงาน จน ลม จน ท้อง อด ผอม เสมือน ว่า ฉัน ต้อง ทำงาน อย่าง เดี่ยว",
        "romaji": "Chan tham-ngaan jon lom jon thong ot phom sà-mʉan wa chan dtong tham-ngaan yang diao",
        "en": "I worked so hard that I became thin as if I had to do everything myself.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_ฉัน_ทำงาน_จน_ลม_จน_ท้อง_อด_ผอม_เสมือน_ว่า_ฉัน_ต้อง_ทำงาน_อย่าง_เดี่ยว.mp3"
      },
      {
        "th": "อากาศ สดใส โดย ความ ร้อน เริ่ม ส่ง ความร้อน มา ให้ เขา รู้สึก เสมือน ว่า เขา อยู่ ที่ ทะเล",
        "romaji": "A-gaht sot sai doy khwam ron rim song khwam ron ma hai khao rue seuk sà-mʉan wa khao yoo thi thale",
        "en": "The fresh air and the starting heat made him feel as if he were by the sea.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_อากาศ_สดใส_โดย_ความ_ร้อน_เริ่ม_ส่ง_ความร้อน_มา_ให้_เขา_รู้สึก_เสมือน_ว่า_เขา_อยู่_ที่_ทะเล.mp3"
      },
      {
        "th": "เธอ ร้อง เพลง ด้วย สมาธิ และ ความ ตั้งใจ เสมือน ว่า เธอ อยู่ บน เวที ที่ ใหญ่ ที่สุด",
        "romaji": "Thoe rong pleng duay samathi lae khwam tang-jai sà-mʉan wa thoe yoo bon weti thi yai thi sut",
        "en": "She sang with concentration and intention, as if she was on the biggest stage.",
        "grammar_audio": "/audio/thai/grammar/s_เสมือน_sà-mʉan_-_As_if_resembling_20231230_เธอ_ร้อง_เพลง_ด้วย_สมาธิ_และ_ความ_ตั้งใจ_เสมือน_ว่า_เธอ_อยู่_บน_เวที_ที่_ใหญ่_ที่สุด.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เพื่อความ (phʉ̂ʉ khwaam) - For the sake of, for the purpose of",
    "short_explanation": "A preposition to specify purpose or reason; 'for the sake of' or 'for the purpose of'.",
    "long_explanation": "The phrase 'เพื่อความ (phʉ̂ʉ khwaam)' is used in Thai to introduce the purpose or the reason of an action. It is equivalent to 'for the sake of' or 'for the purpose of' in English. This phrase can be used with various nouns to express different purposes. It is often followed by a noun or followed by a verb that acts as a noun by adding 'การ' in front of it.",
    "formation": "เพื่อความ + noun/การ+verb",
    "examples": [
      {
        "th": "เขา ทำงาน เหน็ดเหนื่อย เพื่อความ รวย และ เกียรติยศ",
        "romaji": "Khao tham ngan net neuy phʉ̂ʉ khwaam ruay lae gi-yat-yot",
        "en": "He works tirelessly for the sake of wealth and honor.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อความ_phʉ̂ʉ_khwaam_-_For_the_sake_of_for_the_purpose_of_20231230_เขา_ทำงาน_เหน็ดเหนื่อย_เพื่อความ_รวย_และ_เกียรติยศ.mp3"
      },
      {
        "th": "พวกเรา ควร เรียนรู้ เพื่อความ รู้ใน ตัวเอง ไม่ เพื่อ คะแนน",
        "romaji": "Phuak rao khuan riian ruu phʉ̂ʉ khwaam ruu nai tua eng mai phʉ̂ʉ kha-naen",
        "en": "We should learn for the sake of knowledge itself, not for scores.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อความ_phʉ̂ʉ_khwaam_-_For_the_sake_of_for_the_purpose_of_20231230_พวกเรา_ควร_เรียนรู้_เพื่อความ_รู้ใน_ตัวเอง_ไม่_เพื่อ_คะแนน.mp3"
      },
      {
        "th": "เธอ ยอม รับ ความท้าทาย ทุก อย่าง เพื่อความ สุขของ ครอบครัว",
        "romaji": "Thoe yom rap khwaam tha-thaai thuk yang phʉ̂ʉ khwaam suk khong khrop khrua",
        "en": "She accepts all challenges for the sake of her family's happiness.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อความ_phʉ̂ʉ_khwaam_-_For_the_sake_of_for_the_purpose_of_20231230_เธอ_ยอม_รับ_ความท้าทาย_ทุก_อย่าง_เพื่อความ_สุขของ_ครอบครัว.mp3"
      },
      {
        "th": "เขา อาสา ช่วย เหลือ ผู้ ที่ จนกระทั่ง เพื่อความ ยุติธรรม",
        "romaji": "Khao a-saa chua leua phu thi jon kratang phʉ̂ʉ khwaam yu-ti-tham",
        "en": "He volunteers to help the poor for the sake of justice.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อความ_phʉ̂ʉ_khwaam_-_For_the_sake_of_for_the_purpose_of_20231230_เขา_อาสา_ช่วย_เหลือ_ผู้_ที่_จนกระทั่ง_เพื่อความ_ยุติธรรม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "อย่างเช่น (yâang chèn) - Such as, for example",
    "short_explanation": "Indicates examples or to clarify a category; 'such as' or 'for example'.",
    "long_explanation": "The term 'อย่างเช่น (yâang chèn)' is used to give examples or to clarify a particular category or kind, similar to the English expressions 'such as' or 'for example'. It is typically placed before the specific example(s) to highlight or explain a broader category, group, or type. This expression is practical when introducing or exemplifying something.",
    "formation": " Statement + อย่างเช่น + Example(s)",
    "examples": [
      {
        "th": "ฉัน ชอบ ดนตรี แนว หลากหลาย อย่างเช่น ป็อป ร็อค แจ๊ส และ คลาสสิค",
        "romaji": "Chan chop dontri naeo lak lai yâang chèn pop, rok, jaez, lae klasic",
        "en": "I like a variety of music, such as pop, rock, jazz, and classical.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างเช่น_yâang_chèn_-_Such_as_for_example_20231230_ฉัน_ชอบ_ดนตรี_แนว_หลากหลาย_อย่างเช่น_ป็อป_ร็อค_แจ๊ส_และ_คลาสสิค.mp3"
      },
      {
        "th": "เขา มี ความสุข กับ กิจกรรม หลากหลาย อย่างเช่น การอ่าน การวาดรูป และ การทำอาหาร",
        "romaji": "Khao mee kwam sook kab kit ka rum lak lai yâang chèn kan aan, kan wat roop, lae kan tham ahan",
        "en": "He finds happiness in various activities, such as reading, drawing, and cooking.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างเช่น_yâang_chèn_-_Such_as_for_example_20231230_เขา_มี_ความสุข_กับ_กิจกรรม_หลากหลาย_อย่างเช่น_การอ่าน_การวาดรูป_และ_การทำอาหาร.mp3"
      },
      {
        "th": "ใน ห้องสมุด มี หนังสือ หลาย ประเภท อย่างเช่น วรรณกรรม ประวัติศาสตร์ และ ศาสตร์ ต่าง ๆ",
        "romaji": "Nai hong sumut mee nangsue lai pra thep yâang chèn wannakorn, pra wat sat, lae sat tang tang",
        "en": "In the library, there are various types of books, such as literature, history, and various sciences.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างเช่น_yâang_chèn_-_Such_as_for_example_20231230_ใน_ห้องสมุด_มี_หนังสือ_หลาย_ประเภท_อย่างเช่น_วรรณกรรม_ประวัติศาสตร์_และ_ศาสตร์_ต่าง_ๆ.mp3"
      },
      {
        "th": "สิ่ง ที่ เธอ ชื่นชอบ ทำ ใน วันหยุด อย่างเช่น การเดินทาง ถ่ายรูป และ ทำอาหาร",
        "romaji": "Sing thi thoe chuen chorb tham nai wan yut yâang chèn kan dern thang, tai roop, lae tham ahan",
        "en": "Things she likes to do on her day off, such as traveling, taking pictures, and cooking.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างเช่น_yâang_chèn_-_Such_as_for_example_20231230_สิ่ง_ที่_เธอ_ชื่นชอบ_ทำ_ใน_วันหยุด_อย่างเช่น_การเดินทาง_ถ่ายรูป_และ_ทำอาหาร.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ทุกที่ (thúk thîi) - Everywhere, every place",
    "short_explanation": "It means 'everywhere' or 'in every place'. It is often used to express an action is or has been done in all places considered or spoken about.",
    "long_explanation": "The term 'ทุกที่ (thúk thîi)' is typically used in Thai to describe an action that happens everywhere or in every place. Much like the English term 'everywhere', 'ทุกที่ (thúk thîi)' can be used in various contexts to denote a widespread action, occurrence, presence or find. It is usually placed before or after the verb in a sentence and is predominantly used with actions that can logically be performed in multiple locations.",
    "formation": "ทุกที่ + Verb OR Verb + ทุกที่ ",
    "examples": [
      {
        "th": "เธอ ไป เที่ยว ทุกที่ ใน ประเทศไทย",
        "romaji": "Thoe pai tiaw thúk thîi nai prathet Thai.",
        "en": "She travels everywhere in Thailand.",
        "grammar_audio": "/audio/thai/grammar/s_ทุกที่_thúk_thîi_-_Everywhere_every_place_20231230_เธอ_ไป_เที่ยว_ทุกที่_ใน_ประเทศไทย.mp3"
      },
      {
        "th": "ผม มอง หา เธอ ทุกที่ แต่ ไม่ เจอ",
        "romaji": "Phom mong ha thoe thúk thîi tae mai jea.",
        "en": "I look for her everywhere but can't find her.",
        "grammar_audio": "/audio/thai/grammar/s_ทุกที่_thúk_thîi_-_Everywhere_every_place_20231230_ผม_มอง_หา_เธอ_ทุกที่_แต่_ไม่_เจอ.mp3"
      },
      {
        "th": "เขา ไป ทุกที่ ทำงาน อย่าง หนัก เพื่อ ผลิต เครื่องดื่ม เพื่อ ขาย",
        "romaji": "Khao pai thúk thîi tham-ngan yang nak phuea phlìt khrueang-deum phuea khaay.",
        "en": "He goes everywhere working hard to produce beverages for sale.",
        "grammar_audio": "/audio/thai/grammar/s_ทุกที่_thúk_thîi_-_Everywhere_every_place_20231230_เขา_ไป_ทุกที่_ทำงาน_อย่าง_หนัก_เพื่อ_ผลิต_เครื่องดื่ม_เพื่อ_ขาย.mp3"
      },
      {
        "th": "ฉัน ชอบ ทัศนียภาพ ที่ มี ดอกไม้ ทุกที่",
        "romaji": "Chan chorp thatsaniyaphab thi mee dorkmai thúk thîi.",
        "en": "I like the scenery that has flowers everywhere.",
        "grammar_audio": "/audio/thai/grammar/s_ทุกที่_thúk_thîi_-_Everywhere_every_place_20231230_ฉัน_ชอบ_ทัศนียภาพ_ที่_มี_ดอกไม้_ทุกที่.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "เป็นอันจบ (pen an jòp) - And that's the end, that concludes",
    "short_explanation": "Indicates the action or event has come to a conclusion; 'and that's the end', 'that concludes'.",
    "long_explanation": "The phrase 'เป็นอันจบ (pen an jòp)' in Thai is used to signify the conclusion or end of an action or event, similar to the English 'and that's the end' or 'that concludes'. It is commonly situated at the end of a sentence or a story to express that there is no continuing action or event, marking a clear ending. It can also be used in formal speech or writing contexts after a series of events or actions has been described.",
    "formation": "Statement + เป็นอันจบ",
    "examples": [
      {
        "th": "พวกเขา ทำงาน อย่างหนึ่งใจ สู้ อุปสรรค ทุก อย่าง และ ในที่สุด ปัญหา นั้น จึง เป็นอันจบ",
        "romaji": "Phuak khao tham-ngan yang neung jai soo up-sa-raak thuk yang lae nai thi sut pan-haa nan jeung pen an jòp",
        "en": "They worked together to overcome all obstacles, and finally, the problem was resolved and that was the end.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นอันจบ_pen_an_jòp_-_And_thats_the_end_that_concludes_20231230_พวกเขา_ทำงาน_อย่างหนึ่งใจ_สู้_อุปสรรค_ทุก_อย่าง_และ_ในที่สุด_ปัญหา_นั้น_จึง_เป็นอันจบ.mp3"
      },
      {
        "th": "เรา ได้ เดินทาง ไป เที่ยว หลาย ที่ หลากหลาย และ ใน สุดท้าย การ เดินทาง เป็นอันจบ ที่ ร้านค้า ของ ตัวเอง",
        "romaji": "Rao dai doin thaang pai thiao lai thi laak laai lae nai sut thiaw pen an jòp thi raan khaa kong tua eng",
        "en": "We went on a journey visiting various places, and the journey concluded at our own shop.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นอันจบ_pen_an_jòp_-_And_thats_the_end_that_concludes_20231230_เรา_ได้_เดินทาง_ไป_เที่ยว_หลาย_ที่_หลากหลาย_และ_ใน_สุดท้าย_การ_เดินทาง_เป็นอันจบ_ที่_ร้านค้า_ของ_ตัวเอง.mp3"
      },
      {
        "th": "หลังจาก วิชาการ เต็มที่ จน ถึง วัน ประกาศ ผล สอบ นั้น การ พยายาม ของ ฉัน ก็ เป็นอันจบ",
        "romaji": "Lang jak wi-cha-kaan tem thi jon teung wan pra-gat pon soeb nan kaan pha-ya-yam kong chan gor pen an jòp",
        "en": "After studying hard until the day the exam results were announced, my efforts finally came to an end.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นอันจบ_pen_an_jòp_-_And_thats_the_end_that_concludes_20231230_หลังจาก_วิชาการ_เต็มที่_จน_ถึง_วัน_ประกาศ_ผล_สอบ_นั้น_การ_พยายาม_ของ_ฉัน_ก็_เป็นอันจบ.mp3"
      },
      {
        "th": "ประชุม ที่ ยาวนาน มาก ก็ ได้ เก็บเลือด และ เป็นอันจบ ที่ ทุกคน ได้ ตกลง กัน ใน ทุก ประเด็น",
        "romaji": "Pra-choom thi yao nan maak gor dai kep lueat lae pen an jòp thi thuk khon dai tok long kan nai thuk pra-den",
        "en": "The lengthy meeting finally concluded with everyone agreeing on every point.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นอันจบ_pen_an_jòp_-_And_thats_the_end_that_concludes_20231230_ประชุม_ที่_ยาวนาน_มาก_ก็_ได้_เก็บเลือด_และ_เป็นอันจบ_ที่_ทุกคน_ได้_ตกลง_กัน_ใน_ทุก_ประเด็น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "อย่างน้อย (yâang nɔ́ɔi) - At least, minimally",
    "short_explanation": "The phrase 'อย่างน้อย (yâang nɔ́ɔi)' is used to express minimal threshold or the least amount or degree.",
    "long_explanation": "In Thai grammar, the term 'อย่างน้อย (yâang nɔ́ɔi)' represents the smallest quantity, amount, or degree in a given context. It is equivalent to the English 'at least' or 'minimally'. This phrase can be used with both countable and uncountable nouns to express a minimum or least degree or amount. It's typically used in the beginning or middle of the sentences.",
    "formation": "อย่างน้อย + Verb/Noun/Adjective/Numeral",
    "examples": [
      {
        "th": "ฉัน ต้องการ นอน อย่างน้อย 8 ชั่วโมง ต่อ วัน",
        "romaji": "Chan tong-karn non yâang nɔ́ɔi 8 chua-mong dto wan",
        "en": "I need to sleep for at least 8 hours a day.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างน้อย_yâang_nɔ́ɔi_-_At_least_minimally_20231230_ฉัน_ต้องการ_นอน_อย่างน้อย_8_ชั่วโมง_ต่อ_วัน.mp3"
      },
      {
        "th": "คุณ ควร ดื่ม น้ำ อย่างน้อย 2 ลิตร ต่อ วัน",
        "romaji": "Khun khuan deum nam yâang nɔ́ɔi 2 litr dto wan",
        "en": "You should drink at least 2 liters of water a day.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างน้อย_yâang_nɔ́ɔi_-_At_least_minimally_20231230_คุณ_ควร_ดื่ม_น้ำ_อย่างน้อย_2_ลิตร_ต่อ_วัน.mp3"
      },
      {
        "th": "เรา ควร ออกกำลังกาย อย่างน้อย 3 วัน ต่อ สัปดาห์",
        "romaji": "Rao khuan ok kam lang gai yâang nɔ́ɔi 3 wan dto sap-da-ha",
        "en": "We should exercise at least three days a week.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างน้อย_yâang_nɔ́ɔi_-_At_least_minimally_20231230_เรา_ควร_ออกกำลังกาย_อย่างน้อย_3_วัน_ต่อ_สัปดาห์.mp3"
      },
      {
        "th": "พวกเขา จะ ต้อง ได้รับ การ ฝึกฝน อย่างน้อย 6 เดือน ก่อน ที่ จะ สามารถ แข่งขัน",
        "romaji": "Phuak khao ja tong dai-rap gan feuk-fon yâang nɔ́ɔi 6 duean gon ti ja sa-mart khaeng kan",
        "en": "They must receive at least six months of training before they can compete.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างน้อย_yâang_nɔ́ɔi_-_At_least_minimally_20231230_พวกเขา_จะ_ต้อง_ได้รับ_การ_ฝึกฝน_อย่างน้อย_6_เดือน_ก่อน_ที่_จะ_สามารถ_แข่งขัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "แค่...ก็พอ (khâe... gɔ̂ phɔ̂) - Just... is enough",
    "short_explanation": "This phrase expresses that a certain action or state is sufficient or enough.",
    "long_explanation": "In Thai language, 'แค่...ก็พอ (khâe... gɔ̂ phɔ̂)' is often used to express that something is enough or sufficient. You use 'แค่' at the beginning of the action or state to indicate 'just' or 'only' and 'ก็พอ' at the end to denote 'is enough'. It means that the mentioned action or state alone is adequate, and nothing more is required or desired.",
    "formation": "'แค่' + State or Action + 'ก็พอ'",
    "examples": [
      {
        "th": "แค่ เธอ ยิ้ม ก็พอ ทำให้ ฉัน รู้สึก ดี",
        "romaji": "Khâe thoe yim gɔ̂ phɔ̂ tham hai chan rû-sʉ̀k di",
        "en": "Just your smile is enough to make me feel good.",
        "grammar_audio": "/audio/thai/grammar/s_แค่ก็พอ_khâe_gɔ̂_phɔ̂_-_Just_is_enough_20231230_แค่_เธอ_ยิ้ม_ก็พอ_ทำให้_ฉัน_รู้สึก_ดี.mp3"
      },
      {
        "th": "แค่ มี ครอบครัว ที่ รัก ฉัน ก็พอ สำหรับ ฉัน",
        "romaji": "Khâe mee khròb-khrua thì rák chǎn gɔ̂ phɔ̂ sǎm-ràp chǎn",
        "en": "Just having a family that loves me is enough for me.",
        "grammar_audio": "/audio/thai/grammar/s_แค่ก็พอ_khâe_gɔ̂_phɔ̂_-_Just_is_enough_20231230_แค่_มี_ครอบครัว_ที่_รัก_ฉัน_ก็พอ_สำหรับ_ฉัน.mp3"
      },
      {
        "th": "แค่ ได้ เรียนรู้ สิ่ง ใหม่ ๆ ทุก วัน ก็พอ ให้ ฉัน มี ความสุข",
        "romaji": "Khâe dâi rían-rûu sìng màii màii thook wan gɔ̂ phɔ̂ hâi chǎn mee khwaam-sùk",
        "en": "Just learning new things every day is enough to make me happy.",
        "grammar_audio": "/audio/thai/grammar/s_แค่ก็พอ_khâe_gɔ̂_phɔ̂_-_Just_is_enough_20231230_แค่_ได้_เรียนรู้_สิ่ง_ใหม่_ๆ_ทุก_วัน_ก็พอ_ให้_ฉัน_มี_ความสุข.mp3"
      },
      {
        "th": "แค่ ฉัน มี ความสุข และ สุขภาพ ที่ ดี ก็พอ สำหรับ ฉัน",
        "romaji": "Khâe chǎn mee khwaam-sùk lae sùk-khà-phâap thîi dîi gɔ̂ phɔ̂ sǎm-ràp chǎn",
        "en": "Just having happiness and good health is enough for me.",
        "grammar_audio": "/audio/thai/grammar/s_แค่ก็พอ_khâe_gɔ̂_phɔ̂_-_Just_is_enough_20231230_แค่_ฉัน_มี_ความสุข_และ_สุขภาพ_ที่_ดี_ก็พอ_สำหรับ_ฉัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ทั้งนี้ (tháng níi) - This being the case, thus",
    "short_explanation": "Used to indicate that something is true because of the information that has just been mentioned. It can be translated into English as 'this being the case' or 'thus'.",
    "long_explanation": "The phrase 'ทั้งนี้ (tháng níi)' is used in Thai language to link the previous statement and the upcoming one. It shows the relationship between two pieces of information, where the upcoming idea is based on or a result of the preceding one. One can think of it as a bridge that connects two parts of a narrative, making the flow of thought more logical and smoother. It is usually placed at the beginning of sentences. ",
    "formation": "Statement + ทั้งนี้ + Statement",
    "examples": [
      {
        "th": "เธอ ต้อง ไป เรียน ใน ต่างประเทศ ทั้งนี้ เรา จึง ต้อง อยู่ ห่าง กัน หลาย เดือน",
        "romaji": "Thoe tong pai rian nai tang prathet, tháng níi, rao jeung tong yu hang kan lai duean",
        "en": "She has to study abroad, thus we have to be apart for several months.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_This_being_the_case_thus_20231230_เธอ_ต้อง_ไป_เรียน_ใน_ต่างประเทศ_ทั้งนี้_เรา_จึง_ต้อง_อยู่_ห่าง_กัน_หลาย_เดือน.mp3"
      },
      {
        "th": "พ่อ แม่ ต้อง ทำ งาน อยู่ นอกบ้าน ทั้งนี้ ฉัน จึง เลี้ยง น้องสาว คน น้อย ขึ้น มา เอง",
        "romaji": "Por mae tong tham ngan yu nok baan, tháng níi, chan jeung liang nong sao kon noi kheun ma aeng",
        "en": "My parents had to work outside, so I had to raise my little sister by myself.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_This_being_the_case_thus_20231230_พ่อ_แม่_ต้อง_ทำ_งาน_อยู่_นอกบ้าน_ทั้งนี้_ฉัน_จึง_เลี้ยง_น้องสาว_คน_น้อย_ขึ้น_มา_เอง.mp3"
      },
      {
        "th": "คน ใน หมู่บ้าน ต้อง ย้าย ไป อยู่ ที่ อื่น เนื่องจาก น้ำท่วม ทั้งนี้ เขา ก็ สูญเสีย ที่บ้าน และ ทรัพย์สิน ของ เขา",
        "romaji": "Kon nai moo baan tong yaai pai yu thi eun, nueang jaak nam tuam, tháng níi, khao gor sun sia thi baan lae sap sin kong khao",
        "en": "People in the village had to relocate because of the flood, thus they lost their homes and properties.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_This_being_the_case_thus_20231230_คน_ใน_หมู่บ้าน_ต้อง_ย้าย_ไป_อยู่_ที่_อื่น_เนื่องจาก_น้ำท่วม_ทั้งนี้_เขา_ก็_สูญเสีย_ที่บ้าน_และ_ทรัพย์สิน_ของ_เขา.mp3"
      },
      {
        "th": "ฉัน จบ จาก คณะ วิทยาศาสตร์ ทั้งนี้ ฉัน ต้องการ ทำงาน ใน ที่ ที่ มี ความ ท้าทาย และ สร้างสรรค์",
        "romaji": "Chan jop jak khana wit ya sat, tháng níi, chan tong gaan tham ngan nai thi thi mee kwam ta tai lae sang san",
        "en": "I graduated from the Faculty of Science, thus I want to work in a challenging and creative place.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนี้_tháng_níi_-_This_being_the_case_thus_20231230_ฉัน_จบ_จาก_คณะ_วิทยาศาสตร์_ทั้งนี้_ฉัน_ต้องการ_ทำงาน_ใน_ที่_ที่_มี_ความ_ท้าทาย_และ_สร้างสรรค์.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ตามที่กำหนด (dtaam thîi gam-nòt) - As scheduled, as appointed",
    "short_explanation": "Indicates an action that is carried out as per schedule or appointment.",
    "long_explanation": "The Thai phrase 'ตามที่กำหนด (dtaam thîi gam-nòt)' is used to indicate actions or events that happen according to a schedule or an appointment. It essentially communicates that something is following a pre-set plan or order. The term 'ตามที่กำหนด' is usually placed after an action verb, emphasizing that the said action conforms to a prescribed timeline or process.",
    "formation": "Action + ตามที่กำหนด",
    "examples": [
      {
        "th": "การประชุม จะ ลงเวลา ตามที่กำหนด และ เรา ต้อง ทำการเตรียมตัว อย่าง รวดเร็ว",
        "romaji": "Kan pra-chum ja long-wela dtaam thîi gam-nòt lae rao tong tham kan triam tua yang ruat reo",
        "en": "The meeting will end as scheduled and we must prepare quickly.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่กำหนด_dtaam_thîi_gam-nòt_-_As_scheduled_as_appointed_20231230_การประชุม_จะ_ลงเวลา_ตามที่กำหนด_และ_เรา_ต้อง_ทำการเตรียมตัว_อย่าง_รวดเร็ว.mp3"
      },
      {
        "th": "พรุ่งนี้ เรา ควร ไป ที่ สนามบิน ตามที่กำหนด เพื่อ ไม่ พลาด เที่ยวบิน",
        "romaji": "Prung-nii rao khuan pai thi sa-nam-bin dtaam thîi gam-nòt phuea mai plaat thiao-bin",
        "en": "Tomorrow we should go to the airport as scheduled so we do not miss our flight.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่กำหนด_dtaam_thîi_gam-nòt_-_As_scheduled_as_appointed_20231230_พรุ่งนี้_เรา_ควร_ไป_ที่_สนามบิน_ตามที่กำหนด_เพื่อ_ไม่_พลาด_เที่ยวบิน.mp3"
      },
      {
        "th": "เธอ ควร ทำการบ้าน ที่ ครู มอบหมาย ให้ ตามที่กำหนด อย่าง เคร่งครัด",
        "romaji": "Thoe khuan tham kan baan thi khru mob mai hai dtaam thîi gam-nòt yang khrêng-khrat",
        "en": "You should do the homework assigned by the teacher as scheduled meticulously.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่กำหนด_dtaam_thîi_gam-nòt_-_As_scheduled_as_appointed_20231230_เธอ_ควร_ทำการบ้าน_ที่_ครู_มอบหมาย_ให้_ตามที่กำหนด_อย่าง_เคร่งครัด.mp3"
      },
      {
        "th": "แม้ว่า การทำงาน จะ ยาก แต่ เขา ยัง สามารถ ส่งงาน ตามที่กำหนด ได้ ทุกครั้ง",
        "romaji": "Mae wa kan tham ngan ja yak tae khao yang sa-mart song ngan dtaam thîi gam-nòt dai thuk krang",
        "en": "Although the work is hard, he can always submit it as scheduled.",
        "grammar_audio": "/audio/thai/grammar/s_ตามที่กำหนด_dtaam_thîi_gam-nòt_-_As_scheduled_as_appointed_20231230_แม้ว่า_การทำงาน_จะ_ยาก_แต่_เขา_ยัง_สามารถ_ส่งงาน_ตามที่กำหนด_ได้_ทุกครั้ง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "75"
  },
  {
    "title": "ด้วยว่า (dûay wâa) - Because, since, for the reason that",
    "short_explanation": "Used to introduce the cause, reason or motive; equivalent to 'because', 'since' or 'for the reason that' in English.",
    "long_explanation": "The term 'ด้วยว่า (dûay wâa)' in Thai is commonly used to introduce the cause, reason, or motive in a sentence. It is equivalent to the English 'because', 'since', or 'for the reason that'. Typically, before mentioning the cause or reason, the result or the statement that has been affected is mentioned.",
    "formation": "Statement + ด้วยว่า + Reason/Cause",
    "examples": [
      {
        "th": "ฉัน ไม่ สามารถ ไป ตรง นั้น ด้วยว่า มัน มี เส้นทาง ที่ ลำบาก และ อันตราย",
        "romaji": "Chan mai sa maat pai trong nan dûay wâa man mee sen thang thi lumbak lae an traai",
        "en": "I cannot go there because it has a difficult and dangerous path.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยว่า_dûay_wâa_-_Because_since_for_the_reason_that_20231230_ฉัน_ไม่_สามารถ_ไป_ตรง_นั้น_ด้วยว่า_มัน_มี_เส้นทาง_ที่_ลำบาก_และ_อันตราย.mp3"
      },
      {
        "th": "เขา ต้อง ออกจาก งาน ด้วยว่า เขา มี ปัญหา ด้าน สุขภาพ",
        "romaji": "Khao tong ok jak ngan dûay wâa khao mee pan ha dan suk kha phap",
        "en": "He has to leave the job because he has health problems.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยว่า_dûay_wâa_-_Because_since_for_the_reason_that_20231230_เขา_ต้อง_ออกจาก_งาน_ด้วยว่า_เขา_มี_ปัญหา_ด้าน_สุขภาพ.mp3"
      },
      {
        "th": "เรา ได้ เลือก ที่ นี่ ด้วยว่า มัน มี บรรยากาศ ที่ น่ารัก และ ราคา ที่ ย่อมเยา",
        "romaji": "Rao dai leuak thi ni dûay wâa man mee ban ya gaat thi na rak lae ra kha thi yom yao",
        "en": "We chose this place because it has a cute atmosphere and affordable prices.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยว่า_dûay_wâa_-_Because_since_for_the_reason_that_20231230_เรา_ได้_เลือก_ที่_นี่_ด้วยว่า_มัน_มี_บรรยากาศ_ที่_น่ารัก_และ_ราคา_ที่_ย่อมเยา.mp3"
      },
      {
        "th": "ฉัน ต้อง ขอ ยกเลิก นัด ด้วยว่า ฉัน ต้อง ไป ประชุม ที่ ออฟฟิศ",
        "romaji": "Chan tong kor yok lek nat dûay wâa chan tong pai pra chum thi offis",
        "en": "I have to cancel the appointment because I have to go to a meeting at the office.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยว่า_dûay_wâa_-_Because_since_for_the_reason_that_20231230_ฉัน_ต้อง_ขอ_ยกเลิก_นัด_ด้วยว่า_ฉัน_ต้อง_ไป_ประชุม_ที่_ออฟฟิศ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เพราะว่า (phráw wâa) - Because, Since",
    "short_explanation": "Expresses reason or cause; 'because' or 'since'.",
    "long_explanation": "The term 'เพราะว่า (phráw wâa)' is often used in Thai language to show the cause or reason behind a certain event or condition, similar to the English terms 'because' or 'since'. This conjunction is usually placed at the beginning of a sentence or following a main clause to introduce a cause or reason.",
    "formation": "Statement + เพราะว่า + Reason",
    "examples": [
      {
        "th": "เขา ไม่ มา ทำงาน วันนี้ เพราะว่า เขา ป่วย",
        "romaji": "Khao mai ma tham-ngan wan-ni phráw wâa khao puay",
        "en": "He didn't come to work today because he is sick.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะว่า_phráw_wâa_-_Because_Since_20231230_เขา_ไม่_มา_ทำงาน_วันนี้_เพราะว่า_เขา_ป่วย.mp3"
      },
      {
        "th": "ฉัน ทำ การบ้าน ไม่ ทัน เพราะว่า ฉัน ต้อง ไป งาน วันนี้",
        "romaji": "Chan tham gan-baan mai thun phráw wâa chan dtong pai ngan wan-ni",
        "en": "I didn't finish my homework because I have to go to an event today.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะว่า_phráw_wâa_-_Because_Since_20231230_ฉัน_ทำ_การบ้าน_ไม่_ทัน_เพราะว่า_ฉัน_ต้อง_ไป_งาน_วันนี้.mp3"
      },
      {
        "th": "เรา ต้อง ย้าย ไป อยู่ บ้าน ใหม่ เพราะว่า บ้าน เก่า ท่วม น้ำ",
        "romaji": "Rao dtong yaai pai yuu baan mai phráw wâa baan gao tuam nam",
        "en": "We have to move to a new house because the old house is flooded.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะว่า_phráw_wâa_-_Because_Since_20231230_เรา_ต้อง_ย้าย_ไป_อยู่_บ้าน_ใหม่_เพราะว่า_บ้าน_เก่า_ท่วม_น้ำ.mp3"
      },
      {
        "th": "ฉัน ซื้อ รองเท้า ใหม่ เพราะว่า รองเท้า เก่า ของ ฉัน พัง แล้ว",
        "romaji": "Chan seu rua-thao mai phráw wâa rua-thao gao kong chan pang laew",
        "en": "I bought new shoes because my old ones are broken.",
        "grammar_audio": "/audio/thai/grammar/s_เพราะว่า_phráw_wâa_-_Because_Since_20231230_ฉัน_ซื้อ_รองเท้า_ใหม่_เพราะว่า_รองเท้า_เก่า_ของ_ฉัน_พัง_แล้ว.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "จนกระทั่ง (jon grà thǔng) - Until, up to the point",
    "short_explanation": "Used to express 'until' or 'up to the point that'.",
    "long_explanation": "The term 'จนกระทั่ง (jon grà thǔng)' is used in Thai to convey the concept of 'until' or 'up to the point that'. It reflects a certain time or event that something continues to happen, marking a specific endpoint. You will commonly find it in both positive and negative contexts, and it links two actions where the second action is the result or endpoint of the first.",
    "formation": "First action + จนกระทั่ง + Second action (that marks the endpoint)",
    "examples": [
      {
        "th": "เขา เรียน อย่าง หนัก จนกระทั่ง ได้ ทุนการศึกษา จาก มหาวิทยาลัย ชื่อดัง",
        "romaji": "Khao rian yang nak jon grà thǔng dai thoon ka-seuk-sa jak ma-haa-wit-tha-ya-lai cheu dang",
        "en": "He studied hard until he got a scholarship from a famous university.",
        "grammar_audio": "/audio/thai/grammar/s_จนกระทั่ง_jon_grà_thǔng_-_Until_up_to_the_point_20231230_เขา_เรียน_อย่าง_หนัก_จนกระทั่ง_ได้_ทุนการศึกษา_จาก_มหาวิทยาลัย_ชื่อดัง.mp3"
      },
      {
        "th": "ฉัน อ่าน หนังสือ จนกระทั่ง หมด เล่ม",
        "romaji": "Chan an nang-sue jon grà thǔng mot lem",
        "en": "I read the book until it was finished.",
        "grammar_audio": "/audio/thai/grammar/s_จนกระทั่ง_jon_grà_thǔng_-_Until_up_to_the_point_20231230_ฉัน_อ่าน_หนังสือ_จนกระทั่ง_หมด_เล่ม.mp3"
      },
      {
        "th": "เธอ รอ ให้ เขา โทร กลับ จนกระทั่ง เวลา ผ่าน ไป หลาย ชั่วโมง",
        "romaji": "Thoe ro hai khao thoe glap jon grà thǔng we-la phan pai lai chua-mong",
        "en": "She waited for his call back until many hours had passed.",
        "grammar_audio": "/audio/thai/grammar/s_จนกระทั่ง_jon_grà_thǔng_-_Until_up_to_the_point_20231230_เธอ_รอ_ให้_เขา_โทร_กลับ_จนกระทั่ง_เวลา_ผ่าน_ไป_หลาย_ชั่วโมง.mp3"
      },
      {
        "th": "ฉัน ทำงาน ไม่หยุด จนกระทั่ง งาน ทั้ง สิ้น เสร็จสมบูรณ์",
        "romaji": "Chan tham-ngan mai yut jon grà thǔng ngan thang sin set som-boon",
        "en": "I worked non-stop until all the work was completely finished.",
        "grammar_audio": "/audio/thai/grammar/s_จนกระทั่ง_jon_grà_thǔng_-_Until_up_to_the_point_20231230_ฉัน_ทำงาน_ไม่หยุด_จนกระทั่ง_งาน_ทั้ง_สิ้น_เสร็จสมบูรณ์.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "อย่างใด (yâang dai) - In any way, somehow",
    "short_explanation": "Used to indicate any way or manner; 'in any way, somehow'.",
    "long_explanation": "The term 'อย่างใด (yâang dai)' in Thai is used to refer to any way or manner of doing something, which is translated in English as 'in any way' or 'somehow'. It's usually added after a verb to show that the action can be done in any way or somehow. However, it's also used in questions, especially rhetorical, to underline the ambiguity of the actions.",
    "formation": "Verb + อย่างใด",
    "examples": [
      {
        "th": "ถ้า ฉัน ต้องการ ปรับปรุง ภาษาไทย ของ ฉัน อย่างใด ฉัน ควร ทำอะไร",
        "romaji": "Tha chan tong kan prap rung phasa thai kong chan yâang dai, chan khuan tham arai",
        "en": "If I want to improve my Thai in any way, what should I do?",
        "grammar_audio": "/audio/thai/grammar/s_อย่างใด_yâang_dai_-_In_any_way_somehow_20231230_ถ้า_ฉัน_ต้องการ_ปรับปรุง_ภาษาไทย_ของ_ฉัน_อย่างใด_ฉัน_ควร_ทำอะไร.mp3"
      },
      {
        "th": "เธอ สามารถ ช่วย เขา ใน การ หา งาน อย่างใด",
        "romaji": "Thoe sa maat chuai khao nai kan ha ngan yâang dai",
        "en": "How can she help him in finding a job in any way?",
        "grammar_audio": "/audio/thai/grammar/s_อย่างใด_yâang_dai_-_In_any_way_somehow_20231230_เธอ_สามารถ_ช่วย_เขา_ใน_การ_หา_งาน_อย่างใด.mp3"
      },
      {
        "th": "วิธีการ อย่างใด จะ ทำให้ เรา รู้สึก อบอุ่น ใน วัน หนาวๆ นี้",
        "romaji": "Witi kan yâang dai ja tham hai rao roo suk ob oon nai wan nao nao nee",
        "en": "In what way can make us feel warm on this cold day?",
        "grammar_audio": "/audio/thai/grammar/s_อย่างใด_yâang_dai_-_In_any_way_somehow_20231230_วิธีการ_อย่างใด_จะ_ทำให้_เรา_รู้สึก_อบอุ่น_ใน_วัน_หนาวๆ_นี้.mp3"
      },
      {
        "th": "ฉัน ไม่ ต้องการ ทำร้าย เธอ อย่างใด ทั้งนั้น",
        "romaji": "Chan mai tong kan tham rai thoe yâang dai thang nan",
        "en": "I don't want to harm you in any way at all.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างใด_yâang_dai_-_In_any_way_somehow_20231230_ฉัน_ไม่_ต้องการ_ทำร้าย_เธอ_อย่างใด_ทั้งนั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "หลังจากนั้น (lǎng jàak nán) - After that, subsequently",
    "short_explanation": "Shows the sequential order of an event; 'after that, subsequently'.",
    "long_explanation": "The phrase 'หลังจากนั้น (lǎng jàak nán)' is used in Thai language to sequence two or more events, much like the English phrase 'after that' or the word 'subsequently'. It serves to link actions or situations in a chronological order where one event happens after another. This conjunction is primarily used at the beginning or middle of sentences.",
    "formation": "Event 1 + หลังจากนั้น + Event 2",
    "examples": [
      {
        "th": "เรา ไป ร้านกาแฟ แล้ว หลังจากนั้น ไป ดู ภาพยนตร์",
        "romaji": "Rao pai raan-gaa-fae laeao lǎng jàak nán pai duu phaap ya-nòt",
        "en": "We went to a coffee shop, and after that, we went to see a movie.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจากนั้น_lǎng_jàak_nán_-_After_that_subsequently_20231230_เรา_ไป_ร้านกาแฟ_แล้ว_หลังจากนั้น_ไป_ดู_ภาพยนตร์.mp3"
      },
      {
        "th": "ฉัน จอง ตั๋ว เครื่องบิน แล้ว หลังจากนั้น ค่อย จัดการ เรื่อง ที่พัก",
        "romaji": "Chan jong dtǔa khrūang-bin laeao lǎng jàak nán khǒi jàt-gan rûeang thîi-phak",
        "en": "I booked the flight ticket, and after that, I managed the accommodation.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจากนั้น_lǎng_jàak_nán_-_After_that_subsequently_20231230_ฉัน_จอง_ตั๋ว_เครื่องบิน_แล้ว_หลังจากนั้น_ค่อย_จัดการ_เรื่อง_ที่พัก.mp3"
      },
      {
        "th": "วันนี้ ผม ทำงาน หนัก จน สิ้นวัน หลังจากนั้น ผม ก็ พักผ่อน",
        "romaji": "Wan-níi, phŏm tham-ngaan nàk jon sĭn-wan, lǎng jàak nán phŏm gâw pák-phǒn",
        "en": "Today I worked hard until the end of the day, after that I rested.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจากนั้น_lǎng_jàak_nán_-_After_that_subsequently_20231230_วันนี้_ผม_ทำงาน_หนัก_จน_สิ้นวัน_หลังจากนั้น_ผม_ก็_พักผ่อน.mp3"
      },
      {
        "th": "เขา ไป ซื้อ อาหาร หลังจากนั้น เขา แล้ว กลับบ้าน",
        "romaji": "Khao pai súe aa-haăr lǎng jàak nán khao laeao glàp-bâan",
        "en": "He went to buy food, and after that, he went home.",
        "grammar_audio": "/audio/thai/grammar/s_หลังจากนั้น_lǎng_jàak_nán_-_After_that_subsequently_20231230_เขา_ไป_ซื้อ_อาหาร_หลังจากนั้น_เขา_แล้ว_กลับบ้าน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "แต่เพียง (dtàe phiang) - Only, merely",
    "short_explanation": "Used to express 'only' or 'merely' and emphasize the exclusiveness or limitation.",
    "long_explanation": "The term 'แต่เพียง (dtàe phiang)' is used in the Thai language to denote 'only' or 'merely' and is used to emphasize exclusiveness or limitation. It is typically placed before the specific fact, action, or element to stress its uniqueness, often implying there is nothing more beyond that.",
    "formation": "แต่เพียง + Fact / Action / Element",
    "examples": [
      {
        "th": "เขา ไม่ รู้สึก อะไร แต่เพียง ความ อยากทราบ ว่า พวกเขา หาย ไป ที่ไหน",
        "romaji": "Khao mai ru suek a rai dtàe phiang khwam yak sap wa phuak khao hay pai thi nai",
        "en": "He didn’t feel anything other than a mere curiosity about where they had gone.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_20231230_เขา_ไม่_รู้สึก_อะไร_แต่เพียง_ความ_อยากทราบ_ว่า_พวกเขา_หาย_ไป_ที่ไหน.mp3"
      },
      {
        "th": "การ ทำความ สะอาด บ้าน ของ ฉัน ใช้ เวลา แต่เพียง ชั่วโมง หนึ่ง พอ",
        "romaji": "Kan tham khwam sa aat baan kong chan chai we la dtàe phiang chua mong neung phaw",
        "en": "Cleaning my home takes only about an hour.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_20231230_การ_ทำความ_สะอาด_บ้าน_ของ_ฉัน_ใช้_เวลา_แต่เพียง_ชั่วโมง_หนึ่ง_พอ.mp3"
      },
      {
        "th": "สิ่ง ที่ จำเป็น สำหรับ การ ทำงาน แล้ว เสร็จ คือ ความ มุ่งมั่น และ ความ ตั้งใจ แต่เพียง",
        "romaji": "Sing thi jam pen sam-rap kan tham-ngan laeo set keu khwam mung-man lae khwam dtang jai dtàe phiang",
        "en": "The only things necessary for the completion of the work are determination and intention.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_20231230_สิ่ง_ที่_จำเป็น_สำหรับ_การ_ทำงาน_แล้ว_เสร็จ_คือ_ความ_มุ่งมั่น_และ_ความ_ตั้งใจ_แต่เพียง.mp3"
      },
      {
        "th": "เธอ แต่เพียง ต้องการ ให้ งาน ดี เท่านั้น",
        "romaji": "Thoe dtàe phiang tong kan hai ngan dee tao nan",
        "en": "She merely wants the job to be good.",
        "grammar_audio": "/audio/thai/grammar/s_แต่เพียง_dtàe_phiang_-_Only_merely_20231230_เธอ_แต่เพียง_ต้องการ_ให้_งาน_ดี_เท่านั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ทันที (than thii) - Immediately, at once",
    "short_explanation": "Indicates doing something immediately or at once; 'immediately', 'at once', 'right away'.",
    "long_explanation": "The term 'ทันที (than thii)' is commonly used in Thai to indicate immediate actions, similar to the English 'immediately' or 'right away'. It is typically placed at the end of sentences to denote that an action has to be or has been performed without delay. It works well in both positive and negative contexts, and can be used in various types of sentences.",
    "formation": " Statement + ทันที",
    "examples": [
      {
        "th": "ถ้า มี เรื่อง อะไร ้เกิดขึ้น ต้อง แจ้ง ฉัน ทันที",
        "romaji": "Tha mee rueang a-rai geut kheun, dtong jaeng chan than thii",
        "en": "If anything happens, you must inform me immediately.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_at_once_20231230_ถ้า_มี_เรื่อง_อะไร_้เกิดขึ้น_ต้อง_แจ้ง_ฉัน_ทันที.mp3"
      },
      {
        "th": "เมื่อ วัด อุณหภูมิ แล้ว พบ ว่า มี ไข้ สูง ต้อง ส่ง พยาบาล ทันที",
        "romaji": "Meua wat un-ha-phoom laew, phob wa mee kai soong, dtong song pa-ya-ban than thii",
        "en": "When the temperature was measured and a high fever was found, a nurse had to be called immediately.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_at_once_20231230_เมื่อ_วัด_อุณหภูมิ_แล้ว_พบ_ว่า_มี_ไข้_สูง_ต้อง_ส่ง_พยาบาล_ทันที.mp3"
      },
      {
        "th": "เขา อ่าน จดหมาย แล้ว แล้ว โทรหา ฉัน ทันที",
        "romaji": "Khao aan jot maai laeow, laeow tho raa chan than thii",
        "en": "He read the letter and then called me immediately.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_at_once_20231230_เขา_อ่าน_จดหมาย_แล้ว_แล้ว_โทรหา_ฉัน_ทันที.mp3"
      },
      {
        "th": "ถ้า น้อง ไม่ อยาก กิน ข้าว ให้ บอก ผม ทันที",
        "romaji": "Tha nong mai yaak kin khao, hai bok phom than thii",
        "en": "If you don't want to eat, tell me immediately.",
        "grammar_audio": "/audio/thai/grammar/s_ทันที_than_thii_-_Immediately_at_once_20231230_ถ้า_น้อง_ไม่_อยาก_กิน_ข้าว_ให้_บอก_ผม_ทันที.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เรียกว่า (riiak wâa) - Called, known as",
    "short_explanation": "This term is used to refer to how something or someone is known or called.",
    "long_explanation": "The term 'เรียกว่า (riiak wâa)' is used in Thai to refer to the process of naming or defining something or someone. It can be used in various contexts such as introducing oneself, referring to a place or thing by a specific name, or establishing a feature or characteristic of something. It is typically used after the subject and before the name or definition.",
    "formation": "Subject + เรียกว่า + Name/Definition",
    "examples": [
      {
        "th": "ประเทศ ที่ ตั้งอยู่ ถูกกลาง แผ่นดิน แอฟริกา เรียกว่า ไนจีเรีย",
        "romaji": "Pra-thet thi tang yuu tuk klang phaen din Africa riiak wâa Nigeria",
        "en": "The country located in the middle of the African continent is called Nigeria.",
        "grammar_audio": "/audio/thai/grammar/s_เรียกว่า_riiak_wâa_-_Called_known_as_20231230_ประเทศ_ที่_ตั้งอยู่_ถูกกลาง_แผ่นดิน_แอฟริกา_เรียกว่า_ไนจีเรีย.mp3"
      },
      {
        "th": "ที่สำนักงาน ของ เรา ฉัน เรียกว่า คุณ นาย สมปราถนา",
        "romaji": "Thi sam-nak-ngan kong rao, chan riiak wâa khun nai som-pratan",
        "en": "At our office, I am known as Mr. Somprathan.",
        "grammar_audio": "/audio/thai/grammar/s_เรียกว่า_riiak_wâa_-_Called_known_as_20231230_ที่สำนักงาน_ของ_เรา_ฉัน_เรียกว่า_คุณ_นาย_สมปราถนา.mp3"
      },
      {
        "th": "ผลลัพธ์ ที่ ได้ จาก การ ทดสอบ ความเข้มข้น ของ เบียร์ เรียกว่า วัด ดีกรี",
        "romaji": "Phon lap thê that dai jak gaan tod sop khwam kem khon khong beer riiak wâa wat degree",
        "en": "The result obtained from the test of beer intensity is called Degree Measurement.",
        "grammar_audio": "/audio/thai/grammar/s_เรียกว่า_riiak_wâa_-_Called_known_as_20231230_ผลลัพธ์_ที่_ได้_จาก_การ_ทดสอบ_ความเข้มข้น_ของ_เบียร์_เรียกว่า_วัด_ดีกรี.mp3"
      },
      {
        "th": "คุณ สมชาย เด็ก มือ โปร ผู้ ที่ สนิท ที่สุด กับ ฉัน เรียกว่า เพื่อน สนิท",
        "romaji": "Khun somchai, dek mue pro, pûu thi sà-nìt thi sut, gab chan, riiak wâa pheuan sa nit",
        "en": "Somchai, a pro-hand youngster who is my closest friend, is called a best friend.",
        "grammar_audio": "/audio/thai/grammar/s_เรียกว่า_riiak_wâa_-_Called_known_as_20231230_คุณ_สมชาย_เด็ก_มือ_โปร_ผู้_ที่_สนิท_ที่สุด_กับ_ฉัน_เรียกว่า_เพื่อน_สนิท.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "แล้วแต่ (láew dtàe) - Depending on, it's up to",
    "short_explanation": "Used to convey the meaning of 'depending on' or 'it's up to'.",
    "long_explanation": "The phrase 'แล้วแต่ (láew dtàe)' is versatile and mainly used to express the concept of 'depending on' or 'it's up to' in Thai, it suggests that the outcome or decision depends on certain factors or circumstances. This phrase can be used when the speaker doesn’t want to specify, or it isn’t specified who or what the decision is dependent on. Contrary to 'เสมอ (sà-mǒer)' it allows for variability and changeability.",
    "formation": "Statement + แล้วแต่",
    "examples": [
      {
        "th": "การ ตัดสินใจ จะ เลือก อาหาร อะไร ก็ แล้วแต่ ความ อยาก ใน วัน นั้น",
        "romaji": "Kan tat sin jai ja lueak ahaan a rai gor laew dtae khwam yaak nai wan nan",
        "en": "The decision to choose what food to eat depends on what you want that day.",
        "grammar_audio": "/audio/thai/grammar/s_แล้วแต่_láew_dtàe_-_Depending_on_its_up_to_20231230_การ_ตัดสินใจ_จะ_เลือก_อาหาร_อะไร_ก็_แล้วแต่_ความ_อยาก_ใน_วัน_นั้น.mp3"
      },
      {
        "th": "อนาคต ของ วัน พรุ่ง นี้ ขึ้นอยู่ กับ การ สร้างสรรค์ ของ เรา ใน วันนี้, แล้วแต่ เรา",
        "romaji": "Anakot kong wan phrung ni kuena yu gap kan sang san kong rao nai wannii, laew dtae rao",
        "en": "The future of tomorrow depends on our creativity today, it's up to us.",
        "grammar_audio": "/audio/thai/grammar/s_แล้วแต่_láew_dtàe_-_Depending_on_its_up_to_20231230_อนาคต_ของ_วัน_พรุ่ง_นี้_ขึ้นอยู่_กับ_การ_สร้างสรรค์_ของ_เรา_ใน_วันนี้_แล้วแต่_เรา.mp3"
      },
      {
        "th": "คุณ จะ มา พรุ่ง นี้ หรือ ไม่ ก็ แล้วแต่ คุณ",
        "romaji": "Khun ja ma prung ni rue mai gor laew dtae khun",
        "en": "Whether you come tomorrow or not, it's up to you.",
        "grammar_audio": "/audio/thai/grammar/s_แล้วแต่_láew_dtàe_-_Depending_on_its_up_to_20231230_คุณ_จะ_มา_พรุ่ง_นี้_หรือ_ไม่_ก็_แล้วแต่_คุณ.mp3"
      },
      {
        "th": "ฉัน จะ ไป ที่ ปารีส หรือ โรม ก็ แล้วแต่ ความ ถูกต้อง ของ มูลนิธิ",
        "romaji": "Chan ja pai thi Paris rue Rome gor láew dtàe khwam thuuk tong kong muan-ni-thi",
        "en": "Whether I go to Paris or Rome, it depends on the correctness of the foundation.",
        "grammar_audio": "/audio/thai/grammar/s_แล้วแต่_láew_dtàe_-_Depending_on_its_up_to_20231230_ฉัน_จะ_ไป_ที่_ปารีส_หรือ_โรม_ก็_แล้วแต่_ความ_ถูกต้อง_ของ_มูลนิธิ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "แต่ว่า (dtàe wâa) - But, however",
    "short_explanation": "Transition word that indicates contrast or opposition; 'but' or 'however'.",
    "long_explanation": "The term 'แต่ว่า (dtàe wâa)' is used to indicate contrast or opposition in Thai, similar to 'but' or 'however' in English. It is commonly used to link two ideas or statements that contradict each other or are in opposition. By using 'แต่ว่า', the speaker is able to express differing points of view or contrasting aspects within the same context.",
    "formation": "Statement + แต่ว่า + Statement",
    "examples": [
      {
        "th": "ฉัน อยาก ไป เที่ยว ที่ ทะเล แต่ว่า ฉัน ไม่ มี เวลา",
        "romaji": "Chan yark pai thiao thi ta le, dtàe wâa chan mai mee we la",
        "en": "I want to go to the sea but I don't have time.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ว่า_dtàe_wâa_-_But_however_20231230_ฉัน_อยาก_ไป_เที่ยว_ที่_ทะเล_แต่ว่า_ฉัน_ไม่_มี_เวลา.mp3"
      },
      {
        "th": "ข้าวนี้ หอม และ อร่อย แต่ว่า มัน ร้อน มาก เกินไป",
        "romaji": "Khao nee hom lae aroi, dtàe wâa man ron mak goen pai",
        "en": "This rice is fragrant and delicious, but it's too hot.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ว่า_dtàe_wâa_-_But_however_20231230_ข้าวนี้_หอม_และ_อร่อย_แต่ว่า_มัน_ร้อน_มาก_เกินไป.mp3"
      },
      {
        "th": "การทำงาน ของ ฉัน สบายๆ แต่ว่า ค่าเช่า บ้าน เพิ่ม ขึ้น ทุก วัน",
        "romaji": "Karn tham ngan kong chan sabai sabai, dtàe wâa kha chao ban perm kuen took wan",
        "en": "My work is comfortable, but the rent is increasing every day.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ว่า_dtàe_wâa_-_But_however_20231230_การทำงาน_ของ_ฉัน_สบายๆ_แต่ว่า_ค่าเช่า_บ้าน_เพิ่ม_ขึ้น_ทุก_วัน.mp3"
      },
      {
        "th": "เขา หน้าตา ดี แต่ว่า มี อารมณ์ ที่ แปรปรวน",
        "romaji": "Khao naa taa di, dtàe wâa mee ara mon thi bprae pruan",
        "en": "He looks good, but he has mood swings.",
        "grammar_audio": "/audio/thai/grammar/s_แต่ว่า_dtàe_wâa_-_But_however_20231230_เขา_หน้าตา_ดี_แต่ว่า_มี_อารมณ์_ที่_แปรปรวน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เกือบๆ (gʉ̀ʉb gʉ̀ʉb) - Almost, nearly",
    "short_explanation": "Expresses the idea of 'almost' or 'nearly' before the action or situation.",
    "long_explanation": "The phrase 'เกือบๆ (gʉ̀ʉb gʉ̀ʉb)' is frequently utilized in Thai language to introduce an idea or action that almost happened or was about to happen, but didn't. It conveys the sense of being 'on the verge of' or 'close to' something, but not quite reaching it. It is generally used before the verb to express the extent or degree.",
    "formation": "เกือบๆ + Verb/Adjective",
    "examples": [
      {
        "th": "เขา เกือบๆ ไม่ ทัน รถ ไฟ เพราะ หลับ นอน ลึกไป",
        "romaji": "Khao gʉ̀ʉb gʉ̀ʉb mai than rot fai phraw lap non lek pai",
        "en": "He almost missed the train because he overslept.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบๆ_gʉ̀ʉb_gʉ̀ʉb_-_Almost_nearly_20231230_เขา_เกือบๆ_ไม่_ทัน_รถ_ไฟ_เพราะ_หลับ_นอน_ลึกไป.mp3"
      },
      {
        "th": "ฉัน เกือบๆ ลืม ว่า วันนี้ เป็น วัน เกิด ของ เธอ",
        "romaji": "Chan gʉ̀ʉb gʉ̀ʉb luem wa wan ni pen wan gert kong thoe",
        "en": "I almost forgot that today is her birthday.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบๆ_gʉ̀ʉb_gʉ̀ʉb_-_Almost_nearly_20231230_ฉัน_เกือบๆ_ลืม_ว่า_วันนี้_เป็น_วัน_เกิด_ของ_เธอ.mp3"
      },
      {
        "th": "เธอ เกือบๆ ชน รถ เมื่อ คืน เพราะ มอง ไม่ เห็น",
        "romaji": "Thoe gʉ̀ʉb gʉ̀ʉb chon rot meu keun phraw mong mai hen",
        "en": "She almost hit a car last night because she couldn't see.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบๆ_gʉ̀ʉb_gʉ̀ʉb_-_Almost_nearly_20231230_เธอ_เกือบๆ_ชน_รถ_เมื่อ_คืน_เพราะ_มอง_ไม่_เห็น.mp3"
      },
      {
        "th": "เรา เกือบๆ ชนกับ รถ ที่ รถไฟฟ้า สถานี ต่อไป เพราะ มี คน ผลัก",
        "romaji": "Rao gʉ̀ʉb gʉ̀ʉb chon kap rot thi rot fai faa sa tha ni tor pai phraw mee khon phluk",
        "en": "We almost bumped into the car at the next subway station because someone pushed us.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบๆ_gʉ̀ʉb_gʉ̀ʉb_-_Almost_nearly_20231230_เรา_เกือบๆ_ชนกับ_รถ_ที่_รถไฟฟ้า_สถานี_ต่อไป_เพราะ_มี_คน_ผลัก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "จึงเป็นไปได้ว่า (jeung pen bpai dâai wâa) - Therefore, it can be said that",
    "short_explanation": "This phrase is used to conclude a logical argument, similar to the English phrase 'therefore it can be said that'.",
    "long_explanation": "The phrase 'จึงเป็นไปได้ว่า (jeung pen bpai dâai wâa)' is a heavier version of 'therefore' or 'thus' in English. It is used to conclude or summarize a point that is logically derived from the information previously mentioned. It comes before the inferred conclusion in the sentence.",
    "formation": "Cause + จึงเป็นไปได้ว่า + Result",
    "examples": [
      {
        "th": "ราคา น้ำมัน มี แนวโน้ม เพิ่ม ขึ้น และ ผลิตภัณฑ์ ของ เรา นำ เสนอ ราคา ที่ ถูกกว่า จึงเป็นไปได้ว่า ยอด ขาย ของ เรา ได้ เพิ่มขึ้น",
        "romaji": "Rakha nam man mee naew nohm pheum kuen lae pha-lìt-phán kong rao nam sà-nǒe rakha thì thùuk gwàa jeung pen bpai dâai wâa yôt khaai kong rao dâai pheum kuen",
        "en": "Oil prices are trending upwards and our products offer cheaper prices, therefore it can be said that our sales have increased.",
        "grammar_audio": "/audio/thai/grammar/s_จึงเป็นไปได้ว่า_jeung_pen_bpai_dâai_wâa_-_Therefore_it_can_be_said_that_20231230_ราคา_น้ำมัน_มี_แนวโน้ม_เพิ่ม_ขึ้น_และ_ผลิตภัณฑ์_ของ_เรา_นำ_เสนอ_ราคา_ที่_ถูกกว่า_จึงเป็นไปได้ว่า_ยอด_ขาย_ของ_เรา_ได้_เพิ่มขึ้น.mp3"
      },
      {
        "th": "เขา เป็น คน ที่ ชอบ ออกกำลัง กาย และ รัก สุขภาพ ที่ ดี จึงเป็นไปได้ว่า เขา เป็น คน ที่ มี ร่างกาย ที่ แข็งแรง",
        "romaji": "Khao pen khon thì chawp ao-kam-lang gaai lae rak sùk-kà-phàp thì dii jeung pen bpai dâai wâa khao pen khon thì mee râang-gaai thì khaeng raeng",
        "en": "He loves to exercise and values good health, therefore it can be said that he has a strong body.",
        "grammar_audio": "/audio/thai/grammar/s_จึงเป็นไปได้ว่า_jeung_pen_bpai_dâai_wâa_-_Therefore_it_can_be_said_that_20231230_เขา_เป็น_คน_ที่_ชอบ_ออกกำลัง_กาย_และ_รัก_สุขภาพ_ที่_ดี_จึงเป็นไปได้ว่า_เขา_เป็น_คน_ที่_มี_ร่างกาย_ที่_แข็งแรง.mp3"
      },
      {
        "th": "การ หยุด การเลือกตั้ง นำ มาซึ่ง ความ ไม่ ประสงค์ ใน ความเป็นอยู่ ของ ประชาชน จึงเป็นไปได้ว่า มี ประเด็น ออก ืใหม่ ที่ เกี่ยวกับ ธรรมนูญ",
        "romaji": "Kan yùt kan-leuak-tâng nam ma-seung khwaam mai bprà-song nai khwaam-bpen-yuu kong pra-cha-chán jeung pen bpai dâai wâa mee pra-doen ôk mai thì kào-gwap thamnun",
        "en": "The suspension of elections leads to dissatisfaction among the citizens, therefore it can be said that there are new issues regarding the constitution.",
        "grammar_audio": "/audio/thai/grammar/s_จึงเป็นไปได้ว่า_jeung_pen_bpai_dâai_wâa_-_Therefore_it_can_be_said_that_20231230_การ_หยุด_การเลือกตั้ง_นำ_มาซึ่ง_ความ_ไม่_ประสงค์_ใน_ความเป็นอยู่_ของ_ประชาชน_จึงเป็นไปได้ว่า_มี_ประเด็น_ออก_ืใหม่_ที่_เกี่ยวกับ_ธรรมนูญ.mp3"
      },
      {
        "th": "เขา ลงทุน ใน อสังหาริมทรัพย์ อย่าง ซื่อสัตย์ และ เจตนา ที่ ดี จึงเป็นไปได้ว่า เขา มี รายได้ ที่ น่า ประทับใจ",
        "romaji": "Khao long thun nai à-sǎng-hâ-rím-tháp-yáyt yàang sʉ̀ʉ sàt lae jet naa thì dii jeung pen bpai dâai wâa khao mee rai dai thì nâa bprà-thap jai",
        "en": "He invests in real estate honestly and with good intentions, therefore it can be said that he has impressive income.",
        "grammar_audio": "/audio/thai/grammar/s_จึงเป็นไปได้ว่า_jeung_pen_bpai_dâai_wâa_-_Therefore_it_can_be_said_that_20231230_เขา_ลงทุน_ใน_อสังหาริมทรัพย์_อย่าง_ซื่อสัตย์_และ_เจตนา_ที่_ดี_จึงเป็นไปได้ว่า_เขา_มี_รายได้_ที่_น่า_ประทับใจ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เพื่อน (phʉ̂ʉan) - In Order to, For The Purpose Of",
    "short_explanation": "Used to indicate the objective or the purpose of an action; 'in order to'.",
    "long_explanation": "The term 'เพื่อน (phʉ̂ʉan)' is used in Thai language to state the purpose or the reason for doing something. It is equivalent to the English phrase 'in order to' or 'for the purpose of'. This grammatical structure is useful in expressing what you want to achieve or the reason why you decide to do something.",
    "formation": "Action + เพื่อน + Purpose/Objective",
    "examples": [
      {
        "th": "เขา อ่าน หนังสือ เพื่อน เตรียมตัว สำหรับ การสอบ",
        "romaji": "Khao aan nungsue phʉ̂ʉan triam tua samhrap kan saop",
        "en": "He reads books in order to prepare for the exam.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อน_phʉ̂ʉan_-_In_Order_to_For_The_Purpose_Of_20231230_เขา_อ่าน_หนังสือ_เพื่อน_เตรียมตัว_สำหรับ_การสอบ.mp3"
      },
      {
        "th": "ฉัน กิน เพื่อน สุขภาพ ที่ ดี",
        "romaji": "Chan gin phʉ̂ʉan suk khapath thi di",
        "en": "I eat for the purpose of good health.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อน_phʉ̂ʉan_-_In_Order_to_For_The_Purpose_Of_20231230_ฉัน_กิน_เพื่อน_สุขภาพ_ที่_ดี.mp3"
      },
      {
        "th": "เธอ ออกกำลังกาย เพื่อน ลด น้ำหนัก",
        "romaji": "Thoe ok-kamlang-kaai phʉ̂ʉan lot namnak",
        "en": "She exercises in order to lose weight.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อน_phʉ̂ʉan_-_In_Order_to_For_The_Purpose_Of_20231230_เธอ_ออกกำลังกาย_เพื่อน_ลด_น้ำหนัก.mp3"
      },
      {
        "th": "เขา ทำงาน อย่าง หนัก เพื่อน หารายได้ เพิ่มเติม",
        "romaji": "Khao tham ngan yang nak phʉ̂ʉan ha rai dai pherm term",
        "en": "He works hard in order to earn extra income.",
        "grammar_audio": "/audio/thai/grammar/s_เพื่อน_phʉ̂ʉan_-_In_Order_to_For_The_Purpose_Of_20231230_เขา_ทำงาน_อย่าง_หนัก_เพื่อน_หารายได้_เพิ่มเติม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ต่อมา (dtòr maa) - Then, afterwards",
    "short_explanation": "Used to indicate the following action or event in a series.",
    "long_explanation": "The term 'ต่อมา (dtòr maa)' is used in Thai to denote the subsequent action or event in a sequence, similar to the English 'then' or 'afterwards'. It is used to narrate a series of events in chronological order. It's primarily placed at the beginning of the sentence or clause to show the next action or event after the previous one has taken place.",
    "formation": "ต่อมา + Statement",
    "examples": [
      {
        "th": "วันเมื่อวาน ฉัน ไป เที่ยว ตลาด น้ำ แล้ว ต่อมา ก็ ไป ทาน อาหาร ที่ ร้านอาหาร ริม แม่น้ำ",
        "romaji": "Wan meua wan, chan pai tiao talat nam, laeo dtòr maa gor pai than a-han thi ran a-han rim mae nam",
        "en": "Yesterday, I went to the floating market, then afterwards I went to eat at a restaurant along the river.",
        "grammar_audio": "/audio/thai/grammar/s_ต่อมา_dtòr_maa_-_Then_afterwards_20231230_วันเมื่อวาน_ฉัน_ไป_เที่ยว_ตลาด_น้ำ_แล้ว_ต่อมา_ก็_ไป_ทาน_อาหาร_ที่_ร้านอาหาร_ริม_แม่น้ำ.mp3"
      },
      {
        "th": "เขา อ่าน หนังสือ มา ทั้งวัน แล้ว ต่อมา ได้ พักผ่อน โดย ดู หนัง ที่ บ้าน",
        "romaji": "Khao aan nang sue ma thang wan, laeo dtòr maa dai pak pon doi du nang thi baan",
        "en": "He read a book all day, then afterwards he relaxed by watching a movie at home.",
        "grammar_audio": "/audio/thai/grammar/s_ต่อมา_dtòr_maa_-_Then_afterwards_20231230_เขา_อ่าน_หนังสือ_มา_ทั้งวัน_แล้ว_ต่อมา_ได้_พักผ่อน_โดย_ดู_หนัง_ที่_บ้าน.mp3"
      },
      {
        "th": "ฉัน ผ่าน เข้า มา ทาง ประตู หน้า แล้ว ต่อมา ถึง ห้อง ประชุม",
        "romaji": "Chan phan khao ma thang pratu na, laeo dtòr maa theung hong prachum",
        "en": "I passed through the front door, then afterwards arrived at the conference room.",
        "grammar_audio": "/audio/thai/grammar/s_ต่อมา_dtòr_maa_-_Then_afterwards_20231230_ฉัน_ผ่าน_เข้า_มา_ทาง_ประตู_หน้า_แล้ว_ต่อมา_ถึง_ห้อง_ประชุม.mp3"
      },
      {
        "th": "ของขวัญ ถูก แจก แล้ว ต่อมา ทุกคน ก็ ขอให้ ของ พวก พวกเขา",
        "romaji": "Khong khwan thuuk jae, laeo dtòr maa thuk khon gor kor hai khong phuak khao",
        "en": "The gifts were distributed, then afterwards everyone thanked them.",
        "grammar_audio": "/audio/thai/grammar/s_ต่อมา_dtòr_maa_-_Then_afterwards_20231230_ของขวัญ_ถูก_แจก_แล้ว_ต่อมา_ทุกคน_ก็_ขอให้_ของ_พวก_พวกเขา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ทั้งนั้น (tháng nán) - Yet, however",
    "short_explanation": "Used to contrast two statements or to introduce an opposing idea; 'yet', 'however'.",
    "long_explanation": "The term 'ทั้งนั้น (tháng nán)' is used in Thai language to contrast two statements or to introduce an opposing idea, similar to the English 'yet' or 'however'. It is often placed at the beginning of a sentence or clause to present a contrast or contradiction to a previous statement. It allows for a smooth transition between contrasting points and is widely used in both spoken and written Thai.",
    "formation": "Statement + 'ทั้งนั้น' + Opposing Statement",
    "examples": [
      {
        "th": "ฉัน คิด ว่า ฉัน พร้อม สำหรับ การสอบ แต่ ทั้งนั้น ฉัน รู้สึก กังวล อยู่ ด้วย",
        "romaji": "Chan kit wa chan prom sàm-ràp gaan-sʉ̀ʉb dtàae tháng nán, chan rʉ́ʉ-sʉ̀ʉk gang-won yùu dûai",
        "en": "I think I'm ready for the exam, yet I'm still nervous.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนั้น_tháng_nán_-_Yet_however_20231230_ฉัน_คิด_ว่า_ฉัน_พร้อม_สำหรับ_การสอบ_แต่_ทั้งนั้น_ฉัน_รู้สึก_กังวล_อยู่_ด้วย.mp3"
      },
      {
        "th": "เขา ยิ้ม อย่าง มี ความสุข แต่ ทั้งนั้น ฉัน รู้ ว่า เขา กำลัง รู้สึก ไม่ ดี",
        "romaji": "Khao yím yàang mii khwaam-sùk dtàae tháng nán, chan rúu wâa khao gam-lang rʉ́ʉ-sʉ̀ʉk mâi dii",
        "en": "He smiles as if he's happy, however, I know he's not feeling well.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนั้น_tháng_nán_-_Yet_however_20231230_เขา_ยิ้ม_อย่าง_มี_ความสุข_แต่_ทั้งนั้น_ฉัน_รู้_ว่า_เขา_กำลัง_รู้สึก_ไม่_ดี.mp3"
      },
      {
        "th": "ฉัน ต้องการ ที่จะ ออก ไป เที่ยว คืนนี้ แต่ ทั้งนั้น ฉัน ต้อง เตรียม สำหรับ การ สัมมนา ที่ มี วัน พรุ่งนี้",
        "romaji": "Chan dtông gaan thîi jà òk pai thîao kʉʉn-níi dtàae tháng nán, chan dtông dtriiam sàm-ràp glan sàm-má-naa thîi mii wan phrûngníi",
        "en": "I want to go out tonight, however, I have to prepare for a seminar I have tomorrow.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนั้น_tháng_nán_-_Yet_however_20231230_ฉัน_ต้องการ_ที่จะ_ออก_ไป_เที่ยว_คืนนี้_แต่_ทั้งนั้น_ฉัน_ต้อง_เตรียม_สำหรับ_การ_สัมมนา_ที่_มี_วัน_พรุ่งนี้.mp3"
      },
      {
        "th": "เรา ส่ง งาน ทันที ที่ มัน เสร็จ แต่ ทั้งนั้น ผล ส่ง ออกมา ไม่ ดี ที่ท่าน ต้องการ",
        "romaji": "Rao sòng ngaan thanthii thîi man sèt dtàae tháng nán, phl sòng òk-maa mâi dii thîithâan dtông gaan",
        "en": "We submitted the work as soon as it was completed, yet the results were not as good as you wanted.",
        "grammar_audio": "/audio/thai/grammar/s_ทั้งนั้น_tháng_nán_-_Yet_however_20231230_เรา_ส่ง_งาน_ทันที_ที่_มัน_เสร็จ_แต่_ทั้งนั้น_ผล_ส่ง_ออกมา_ไม่_ดี_ที่ท่าน_ต้องการ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ไม่กี่ (mâi gìi) - A few, not many",
    "short_explanation": "Expresses the meaning of 'a few' or 'not many'.",
    "long_explanation": "The phrase 'ไม่กี่ (mâi gìi)' is used in Thai language to indicate a small number or quantity, which can be understood as 'not many' or 'a few' in English. It is usually used in front of a noun to limit its quantity. The particularity of 'ไม่กี่ (mâi gìi)' is that it is used to refer to a limited specific quantity that is considered to be small relative to the speaker's subjective perception, rather than being an objective small amount.",
    "formation": "'ไม่กี่' + noun",
    "examples": [
      {
        "th": "ผม มี เพื่อน ไม่กี่ คน ที่ สามารถ เชื่อถือ ได้",
        "romaji": "Phom mee pheuan mâi gìi kon thi sa maat cheua thue dai",
        "en": "I have only a few friends that I can trust.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่กี่_mâi_gìi_-_A_few_not_many_20231230_ผม_มี_เพื่อน_ไม่กี่_คน_ที่_สามารถ_เชื่อถือ_ได้.mp3"
      },
      {
        "th": "ฉัน จะ กิน ไอศครีม ไม่กี่ ส scoop ก็ เฟี้ยวฟ้าว ไป ทั้งวัน",
        "romaji": "Chan ja gin ai su khreem mâi gìi sà scoop ga féow fáaw pai thang wan",
        "en": "I'll feel hyper all day from just a few scoops of ice cream.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่กี่_mâi_gìi_-_A_few_not_many_20231230_ฉัน_จะ_กิน_ไอศครีม_ไม่กี่_ส_scoop_ก็_เฟี้ยวฟ้าว_ไป_ทั้งวัน.mp3"
      },
      {
        "th": "นักเรียน ไม่กี่ คน ได้รับ ทุนการศึกษา จาก มหาวิทยาลัย",
        "romaji": "Nak riian mâi gìi kon dai rap thun ka suksa jaak ma-ha-wit-tha-ya-lai",
        "en": "Only a few students received scholarships from the university.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่กี่_mâi_gìi_-_A_few_not_many_20231230_นักเรียน_ไม่กี่_คน_ได้รับ_ทุนการศึกษา_จาก_มหาวิทยาลัย.mp3"
      },
      {
        "th": "เรา มีเงิน ติด ตัว จำนวน ไม่กี่ บาท เท่านั้น",
        "romaji": "Rao mee ngern dtìd dtua jam nuan mâi gìi baht tao naan",
        "en": "We only have a few baht on us.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่กี่_mâi_gìi_-_A_few_not_many_20231230_เรา_มีเงิน_ติด_ตัว_จำนวน_ไม่กี่_บาท_เท่านั้น.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ด้วยกัน (dûay gan) - Together, with each other",
    "short_explanation": "Indicates doing something together or with each other.",
    "long_explanation": "The term 'ด้วยกัน (dûay gan)' is frequently used in Thai to convey the idea of doing an action together or with each other. It emphasises the collective aspect of action and it's often situated at the end of the sentence. It widely used with verbs to indicate actions and states that involve more than one person.",
    "formation": "Statement + ด้วยกัน",
    "examples": [
      {
        "th": "เรา ออกไป เดินเล่น ใน สวน ใหญ่ ด้วยกัน",
        "romaji": "Rao ok pai doen len nai suan yai dûay gan",
        "en": "We are going for a walk in the big park together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_with_each_other_20231230_เรา_ออกไป_เดินเล่น_ใน_สวน_ใหญ่_ด้วยกัน.mp3"
      },
      {
        "th": "พวกเขา กำลัง ทำ การบ้าน ด้วยกัน",
        "romaji": "Phuak khao kam lang tam kan baan dûay gan",
        "en": "They are doing homework together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_with_each_other_20231230_พวกเขา_กำลัง_ทำ_การบ้าน_ด้วยกัน.mp3"
      },
      {
        "th": "ฉัน และ เพื่อน ของ ฉัน มักจะ ซื้อ ของขวัญ วันเกิด ให้ กับ แม่ ด้วยกัน",
        "romaji": "Chan lae pheuan kong chan mak ja sue khong khwan wan gert hai gab mae dûay gan",
        "en": "My friends and I usually buy a birthday gift for my mother together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_with_each_other_20231230_ฉัน_และ_เพื่อน_ของ_ฉัน_มักจะ_ซื้อ_ของขวัญ_วันเกิด_ให้_กับ_แม่_ด้วยกัน.mp3"
      },
      {
        "th": "ทุกคน ใน ครอบครัว รวมทั้ง พ่อ และ แม่ มัก วางแผน การเดินทาง ด้วยกัน",
        "romaji": "Thuk khon nai krop khrua ruam tang por lae mae mak wang phaen kan doen thang dûay gan",
        "en": "Everyone in the family, including Dad and Mom, often plan trips together.",
        "grammar_audio": "/audio/thai/grammar/s_ด้วยกัน_dûay_gan_-_Together_with_each_other_20231230_ทุกคน_ใน_ครอบครัว_รวมทั้ง_พ่อ_และ_แม่_มัก_วางแผน_การเดินทาง_ด้วยกัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ซึ่งไร (sʉ̂ng rai) - Which, whatever",
    "short_explanation": "Used to refer to any one or any part of something or someone, similar to 'which, whatever' in English.",
    "long_explanation": "The term 'ซึ่งไร (sʉ̂ng rai)' is commonly used in Thai to refer to any one or any part of something or someone, similar to 'which' or 'whatever' in English. It can be used in questions and statements as a placeholder for an unknown or unspecified element. You use 'ซึ่งไร (sʉ̂ng rai)' to indicate an open selection among a set of possibilities or options.",
    "formation": "Noun + ซึ่งไร",
    "examples": [
      {
        "th": "ฉัน ไม่ รู้ ว่า ควร เลือก การ ทำงาน แบบ ไหน หรือ แบบ ซึ่งไร",
        "romaji": "Chan mai roo wa khuan leuak kan tham ngan baep nai rue baep sʉ̂ng rai",
        "en": "I don't know what kind of job to choose or which one.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งไร_sʉ̂ng_rai_-_Which_whatever_20231230_ฉัน_ไม่_รู้_ว่า_ควร_เลือก_การ_ทำงาน_แบบ_ไหน_หรือ_แบบ_ซึ่งไร.mp3"
      },
      {
        "th": "การทำงาน ใน ตำแหน่ง ซึ่งไร ย่อม มี ความ ยาก และ ง่าย ใน ทาง เอง",
        "romaji": "Kan thamngan nai tamnaeng sʉ̂ng rai yom mi khwaam yak lae ngai nai thang eng",
        "en": "Any job position has its own difficulties and easiness.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งไร_sʉ̂ng_rai_-_Which_whatever_20231230_การทำงาน_ใน_ตำแหน่ง_ซึ่งไร_ย่อม_มี_ความ_ยาก_และ_ง่าย_ใน_ทาง_เอง.mp3"
      },
      {
        "th": "โรงเรียน ซึ่งไร ที่ เธอ อยาก จะ เรียน อยู่ เนี่ย",
        "romaji": "Rong rian sʉ̂ng rai thi thoe yak ja rian yu nia",
        "en": "Which school do you want to study at?",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งไร_sʉ̂ng_rai_-_Which_whatever_20231230_โรงเรียน_ซึ่งไร_ที่_เธอ_อยาก_จะ_เรียน_อยู่_เนี่ย.mp3"
      },
      {
        "th": "ไม่ว่า เนื้อเพลง ซึ่งไร ที่ เขา ร้อง เธอ ก็ คง ชอบ เสมอ",
        "romaji": "Mai wa nua phleung sʉ̂ng rai thi khao rong thoe kong chop sà-mǒer",
        "en": "No matter which song he sings, she always likes it.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งไร_sʉ̂ng_rai_-_Which_whatever_20231230_ไม่ว่า_เนื้อเพลง_ซึ่งไร_ที่_เขา_ร้อง_เธอ_ก็_คง_ชอบ_เสมอ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "จนถึงเวลา (jon thʉ̌ng welaa) - Until the time, when the time comes",
    "short_explanation": "Expresses the meaning of 'until' in the context of time, similar to 'until the time comes' or 'when the time comes' in English.",
    "long_explanation": "The phrase 'จนถึงเวลา (jon thʉ̌ng welaa)' is used in Thai language to indicate an action or event that will continue up to a certain point in time, or a condition that remains in place until a particular time. It is often used to link two clauses, with the event in the second clause occurring when the time specified in the first clause is reached. The first clause refers to the ongoing action or state, and the second clause refers to the event or action that will take place when the specified time comes.",
    "formation": "Action/State + จนถึงเวลา + Event/Action (at the specified time)",
    "examples": [
      {
        "th": "ผม อ่าน หนังสือ ตลอด คืน จนถึงเวลา แสงแดด ฉาย เข้า หน้าต่าง",
        "romaji": "Phom aan nangsue talot kheun jon thʉ̌ng welaa saeng daet chaai khao naa taang",
        "en": "I read books all night until the sunlight shines through the window.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงเวลา_jon_thʉ̌ng_welaa_-_Until_the_time_when_the_time_comes_20231230_ผม_อ่าน_หนังสือ_ตลอด_คืน_จนถึงเวลา_แสงแดด_ฉาย_เข้า_หน้าต่าง.mp3"
      },
      {
        "th": "เธอ รักษา สุขภาพ ดีๆ จนถึงเวลา เธอ เกิด ใหม่",
        "romaji": "Thoe raksa suk khaphaap dii dii jon thʉ̌ng welaa thoe koet mai",
        "en": "She takes good care of her health until the time she will be reborn.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงเวลา_jon_thʉ̌ng_welaa_-_Until_the_time_when_the_time_comes_20231230_เธอ_รักษา_สุขภาพ_ดีๆ_จนถึงเวลา_เธอ_เกิด_ใหม่.mp3"
      },
      {
        "th": "เขารอ ข่าว จาก หน่วยงาน ต่างๆ จนถึงเวลา เขา นอน",
        "romaji": "Khao ro kaao jak nuay ngan tang tang jon thʉ̌ng welaa khao non",
        "en": "He waits for news from various agencies until the time he goes to sleep.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงเวลา_jon_thʉ̌ng_welaa_-_Until_the_time_when_the_time_comes_20231230_เขารอ_ข่าว_จาก_หน่วยงาน_ต่างๆ_จนถึงเวลา_เขา_นอน.mp3"
      },
      {
        "th": "ผม ทำ งาน เรื่อยๆ จนถึงเวลา ผม เพื่อน มอบ รางวัล ให้ผม",
        "romaji": "Phom tham ngan ruei ruei jon thʉ̌ng welaa phom pheuuan mawb raang wan hai phom",
        "en": "I keep working until the time my friend presents me with a reward.",
        "grammar_audio": "/audio/thai/grammar/s_จนถึงเวลา_jon_thʉ̌ng_welaa_-_Until_the_time_when_the_time_comes_20231230_ผม_ทำ_งาน_เรื่อยๆ_จนถึงเวลา_ผม_เพื่อน_มอบ_รางวัล_ให้ผม.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "อันที่จริง (an thîi jing) - In fact, actually",
    "short_explanation": "Is used to correct a previous statement or to reveal something that is more truthful or accurate.",
    "long_explanation": "'อันที่จริง (an thîi jing)' is a Thai phrase that means 'in fact' or 'actually'. It's often used to correct a previous statement, to introduce a surprising element, or to clarify and reveal truthful or more accurate information. Its positional placement may vary, but it is often seen at the beginning of a sentence or just before the information that is being clarified or corrected.",
    "formation": "Sentence + อันที่จริง or อันที่จริง + Sentence",
    "examples": [
      {
        "th": "ฉัน คิด ว่า เรา จะ ขาด ตัว ดำ เพื่อ เพิ่ม แรง ซึ้ง อันที่จริง ฉัน ต้องการ ทำ น้ำ ส้ม ให้ มัน หวาน ขึ้น",
        "romaji": "Chan khid waa rao ja khaat tua dam phuuea pheum raeng sueng, an thîi jing, chan dtông gaan tham nam som hai man waan kheun",
        "en": "I thought we were out of sugar to increase the intensity, actually, I wanted to make the orange juice sweeter.",
        "grammar_audio": "/audio/thai/grammar/s_อันที่จริง_an_thîi_jing_-_In_fact_actually_20231230_ฉัน_คิด_ว่า_เรา_จะ_ขาด_ตัว_ดำ_เพื่อ_เพิ่ม_แรง_ซึ้ง_อันที่จริง_ฉัน_ต้องการ_ทำ_น้ำ_ส้ม_ให้_มัน_หวาน_ขึ้น.mp3"
      },
      {
        "th": "ทุกคน คิด ว่า วันนี้ การประชุม จะ สิ้นสุด ลง แต่ อันที่จริง ยัง มี อีก หนึ่ง เรื่อง ที่ เรา ต้อง พูดคุย",
        "romaji": "Thuk khon khid waa wannii gan pra chum ja sin sut long, tae an thîi jing, yang mee eek neung reuang thi rao dtông poot kui",
        "en": "Everyone thought today's meeting was over, but actually, there's still one more topic we need to discuss.",
        "grammar_audio": "/audio/thai/grammar/s_อันที่จริง_an_thîi_jing_-_In_fact_actually_20231230_ทุกคน_คิด_ว่า_วันนี้_การประชุม_จะ_สิ้นสุด_ลง_แต่_อันที่จริง_ยัง_มี_อีก_หนึ่ง_เรื่อง_ที่_เรา_ต้อง_พูดคุย.mp3"
      },
      {
        "th": "เธอ สวม แว่น ตา เพราะ ที่ คิด ว่า มัน จะ ทำให้ เธอ ดู ดี ขึ้น แต่ อันที่จริง แว่นตา นั้น ช่วย ให้ เธอ มอง เห็น ชัด ขึ้น",
        "romaji": "Thoe suam waen dtah prôr thi khid waa man ja tham hai thoe doo dii kheun, tae an thîi jing, waen dtah nan chuai hai thoe mong hen chat kheun",
        "en": "She wore glasses thinking it would make her look better, but actually, those glasses help her see better.",
        "grammar_audio": "/audio/thai/grammar/s_อันที่จริง_an_thîi_jing_-_In_fact_actually_20231230_เธอ_สวม_แว่น_ตา_เพราะ_ที่_คิด_ว่า_มัน_จะ_ทำให้_เธอ_ดู_ดี_ขึ้น_แต่_อันที่จริง_แว่นตา_นั้น_ช่วย_ให้_เธอ_มอง_เห็น_ชัด_ขึ้น.mp3"
      },
      {
        "th": "ผม นึก ว่า สวนสนุก นั้น จะ เปิด อยู่ แต่ อันที่จริง แล้ว มัน ปิด แล้ว ตั้งแต่ เช้า",
        "romaji": "Phom neuk waa suan sanuk nan ja bpert yoo tae an thîi jing, laeo man bpit laeo dtang dtae chao",
        "en": "I thought the amusement park was open, but in fact, it has been closed since morning.",
        "grammar_audio": "/audio/thai/grammar/s_อันที่จริง_an_thîi_jing_-_In_fact_actually_20231230_ผม_นึก_ว่า_สวนสนุก_นั้น_จะ_เปิด_อยู่_แต่_อันที่จริง_แล้ว_มัน_ปิด_แล้ว_ตั้งแต่_เช้า.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "อย่างไรก็ตาม (yâang rai gɔ̂ dtaam) - However, nonetheless",
    "short_explanation": "Indicates concession or contrasting information; 'however' or 'nonetheless'.",
    "long_explanation": "The phrase 'อย่างไรก็ตาม (yâang rai gɔ̂ dtaam)' is used in Thai language to introduce a contrasting statement to the previous one, similar to the English 'however' or 'nonetheless'. It is often placed at the beginning of a sentence or clause to indicate a concession or contrastive statement. It is typically used with a variety of sentence structures to express different degrees of contrast or concession.",
    "formation": "อย่างไรก็ตาม + Contrasting statement",
    "examples": [
      {
        "th": "อย่างไรก็ตาม ตอนนี้ เขา กำลัง พยายาม เรียนรู้ จัก กับ วิธี ใช้ การคำนวณ ใหม่",
        "romaji": "Yâang rai gɔ̂ dtaam, dton ni khao kam lang pha-yam riian ru jak gap wi ti chai kan kam nuan mai",
        "en": "However, he is now trying to learn how to use the new calculator.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_ตอนนี้_เขา_กำลัง_พยายาม_เรียนรู้_จัก_กับ_วิธี_ใช้_การคำนวณ_ใหม่.mp3"
      },
      {
        "th": "อย่างไรก็ตาม เรา สามารถ ทำ ได้ ถ้า เรา เรียนรู้ ตลอด เวลา",
        "romaji": "Yâang rai gɔ̂ dtaam, rao saa maat tam dai taa rao riian ru dta lod wa laa",
        "en": "However, we can do it if we keep learning all the time.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_เรา_สามารถ_ทำ_ได้_ถ้า_เรา_เรียนรู้_ตลอด_เวลา.mp3"
      },
      {
        "th": "อย่างไรก็ตาม สัตว์ ป่า ไม่ได้ มี ความรุ้ อย่างที่ เรา คิด",
        "romaji": "Yâang rai gɔ̂ dtaam, sat paa mai dai mee khwam ru yâang thi rao kit",
        "en": "However, wild animals do not have the knowledge we think they do.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_สัตว์_ป่า_ไม่ได้_มี_ความรุ้_อย่างที่_เรา_คิด.mp3"
      },
      {
        "th": "อย่างไรก็ตาม สวนสนุก นั้น ยัง คง รัก และ เที่ยว สนุก",
        "romaji": "Yâang rai gɔ̂ dtaam, suan sanuk nun yang kong rak lae thiao sanuk",
        "en": "However, that amusement park is still loved and fun to visit.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างไรก็ตาม_yâang_rai_gɔ̂_dtaam_-_However_nonetheless_20231230_อย่างไรก็ตาม_สวนสนุก_นั้น_ยัง_คง_รัก_และ_เที่ยว_สนุก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เมื่อไหร่ก็ตาม (mʉ̂a rài gɔ̂ dtaam) - Whenever, at any time",
    "short_explanation": "Indicates an action that occurs 'whenever' or 'at any time'; irrespective of when.",
    "long_explanation": "The phrase 'เมื่อไหร่ก็ตาม (mʉ̂a rài gɔ̂ dtaam)' in Thai is used to denote occurrences that happen 'whenever' or 'at any time'. It suggests an action or event that happens irrespective of when. Typically, it is positioned at the beginning of sentences, before the subject and verb, to set the 'whenever' context.",
    "formation": "เมื่อไหร่ก็ตาม + Subject + Verb",
    "examples": [
      {
        "th": "เมื่อไหร่ก็ตาม ที่ คุณ ต้องการ ความคิดเห็น ฉัน ยินดี ให้ เสมอ",
        "romaji": "mʉ̂a rài gɔ̂ dtaam thi khun tong gaan khwaam khit hen, chan yin dee hai sà-mǒer",
        "en": "Whenever you need an opinion, I am always willing to give it.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไหร่ก็ตาม_mʉ̂a_rài_gɔ̂_dtaam_-_Whenever_at_any_time_20231230_เมื่อไหร่ก็ตาม_ที่_คุณ_ต้องการ_ความคิดเห็น_ฉัน_ยินดี_ให้_เสมอ.mp3"
      },
      {
        "th": "เมื่อไหร่ก็ตาม ที่ ฉัน เห็น คุณ ฉัน จะ รู้สึก ดีใจ",
        "romaji": "mʉ̂a rài gɔ̂ dtaam thi chan hen khun, chan ja roo seuk dee jai",
        "en": "Whenever I see you, I feel happy.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไหร่ก็ตาม_mʉ̂a_rài_gɔ̂_dtaam_-_Whenever_at_any_time_20231230_เมื่อไหร่ก็ตาม_ที่_ฉัน_เห็น_คุณ_ฉัน_จะ_รู้สึก_ดีใจ.mp3"
      },
      {
        "th": "เมื่อไหร่ก็ตาม ที่ เธอ กำลัง ทำงาน ฉัน เข้า ใจ ว่า เธอ ยุ่ง ทุ่มเท",
        "romaji": "mʉ̂a rài gɔ̂ dtaam thi thoe kam lang tham ngan, chan khao jai wa thoe yung thum the",
        "en": "Whenever she is working, I understand that she is busy and devoted.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไหร่ก็ตาม_mʉ̂a_rài_gɔ̂_dtaam_-_Whenever_at_any_time_20231230_เมื่อไหร่ก็ตาม_ที่_เธอ_กำลัง_ทำงาน_ฉัน_เข้า_ใจ_ว่า_เธอ_ยุ่ง_ทุ่มเท.mp3"
      },
      {
        "th": "เมื่อไหร่ก็ตาม ที่ ฉัน ได้ ยิน เพลง นี้ ฉัน จะ นึกถึง คุณ",
        "romaji": "mʉ̂a rài gɔ̂ dtaam thi chan dai yin pleeng nee, chan ja neuk theung khun",
        "en": "Whenever I hear this song, I think of you.",
        "grammar_audio": "/audio/thai/grammar/s_เมื่อไหร่ก็ตาม_mʉ̂a_rài_gɔ̂_dtaam_-_Whenever_at_any_time_20231230_เมื่อไหร่ก็ตาม_ที่_ฉัน_ได้_ยิน_เพลง_นี้_ฉัน_จะ_นึกถึง_คุณ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ไม่เป็นไร (mâi pen rai) - It's okay, no problem",
    "short_explanation": "This phrase is commonly used to convey the meaning of 'it's okay', 'no problem', or 'don't worry' in Thai.",
    "long_explanation": "The expression 'ไม่เป็นไร (mâi pen rai)' is used frequently in Thai language to suggest 'it's okay', 'no problem', or 'not a big deal'. It is often used to assure someone that there is nothing to worry about, and everything is fine. This phrase can also be used in the context of forgiving someone or dismissing a situation. The literal translation is 'it's not a thing', meaning it's not a problem or an issue.  ",
    "formation": "Use 'ไม่เป็นไร (mâi pen rai)' independently as a response or after a situation/statement.",
    "examples": [
      {
        "th": "ไม่เป็นไร ถ้า เธอ ไม่ สามารถ มา ตาม นัด",
        "romaji": "Mâi pen rai thâ tîeu mâi să-mâat maa dtam nát ",
        "en": "It's okay if you can't come as scheduled.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่เป็นไร_mâi_pen_rai_-_Its_okay_no_problem_20231230_ไม่เป็นไร_ถ้า_เธอ_ไม่_สามารถ_มา_ตาม_นัด.mp3"
      },
      {
        "th": "ฉัน หลงทาง แต่ ไม่เป็นไร เพราะ ฉัน มี แผนที่",
        "romaji": "Chăn long thaang dtàe mâi pen rai phrôr chăn mii phăa-năthîi",
        "en": "I got lost, but it's okay because I have a map.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่เป็นไร_mâi_pen_rai_-_Its_okay_no_problem_20231230_ฉัน_หลงทาง_แต่_ไม่เป็นไร_เพราะ_ฉัน_มี_แผนที่.mp3"
      },
      {
        "th": "คุณ ลืม ส่ง งาน ที่ ผม มอบหมาย ให้ คุณ แต่ ไม่เป็นไร คุณ สามารถ ส่ง มัน วัน พรุ่งนี้",
        "romaji": "Khun luuem sòng ngaan thîi phǒm mawb-mǎai hâi khun dtàe mâi pen rai khun să-mâat sòng man wan phrûng-nîi",
        "en": "You forgot to submit the task I assigned to you, but it’s okay, you can submit it tomorrow.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่เป็นไร_mâi_pen_rai_-_Its_okay_no_problem_20231230_คุณ_ลืม_ส่ง_งาน_ที่_ผม_มอบหมาย_ให้_คุณ_แต่_ไม่เป็นไร_คุณ_สามารถ_ส่ง_มัน_วัน_พรุ่งนี้.mp3"
      },
      {
        "th": "ฉัน ขอ โทษ ที่ มา สาย แต่ คุณ บอก ว่า ไม่เป็นไร",
        "romaji": "Chăn kǒr thôht thîi maa săai dtàe khun bòk wâa mâi pen rai",
        "en": "I apologize for being late, but you said it's okay.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่เป็นไร_mâi_pen_rai_-_Its_okay_no_problem_20231230_ฉัน_ขอ_โทษ_ที่_มา_สาย_แต่_คุณ_บอก_ว่า_ไม่เป็นไร.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "เสียก่อน (sǐa g̀̀xn) - First, beforehand",
    "short_explanation": "Used to suggest that something should be done first, or beforehand.",
    "long_explanation": "The term 'เสียก่อน (sǐa g̀̀xn)' is used in Thai language to imply that something should be done first or beforehand. It's typically used among friends and family members to depict a friendly rivalry, or to suggest that someone should get to do something before others. In a polite context, it conveys the urgency to complete an action before doing other activities.",
    "formation": "เสียก่อน + Action",
    "examples": [
      {
        "th": "ฉัน จะ ไป กิน ข้าว เสียก่อน นะ ครับ",
        "romaji": "Chan ja pai kin khao sǐa g̀̀xn na khrub",
        "en": "I will go eat first, okay?",
        "grammar_audio": "/audio/thai/grammar/s_เสียก่อน_sǐa_g̀̀xn_-_First_beforehand_20231230_ฉัน_จะ_ไป_กิน_ข้าว_เสียก่อน_นะ_ครับ.mp3"
      },
      {
        "th": "เขา บอก ว่า จะ ไป เล่น กีฬา เสียก่อน เพราะ ว่า ไม่ อยาก ให้ ผลงาน ของ เขา ล่าช้า",
        "romaji": "Khao bok wa ja pai len kee la sǐa g̀̀xn pror wa mai yark hai pha-ngaan kong khao la chaa",
        "en": "He said he would go play sports first because he didn't want his work to be delayed.",
        "grammar_audio": "/audio/thai/grammar/s_เสียก่อน_sǐa_g̀̀xn_-_First_beforehand_20231230_เขา_บอก_ว่า_จะ_ไป_เล่น_กีฬา_เสียก่อน_เพราะ_ว่า_ไม่_อยาก_ให้_ผลงาน_ของ_เขา_ล่าช้า.mp3"
      },
      {
        "th": "เธอ บอก ว่า จะ ทำการบ้าน เสียก่อน ก่อน ที่ จะ ไป หา ทุกคน",
        "romaji": "Thoe bok wa ja tham-kaan-baan sǐa g̀̀xn gon thi ja pai ha thuk kon",
        "en": "She said she would do the homework first before going to see everyone.",
        "grammar_audio": "/audio/thai/grammar/s_เสียก่อน_sǐa_g̀̀xn_-_First_beforehand_20231230_เธอ_บอก_ว่า_จะ_ทำการบ้าน_เสียก่อน_ก่อน_ที่_จะ_ไป_หา_ทุกคน.mp3"
      },
      {
        "th": "ผม ต้อง ไป จ่าย ค่าน้ำ เสียก่อน ก่อน ที่ จะ เริ่ม เตรียม ตัว ไป ทำงาน",
        "romaji": "Phom tong pai jai ka nam sǐa g̀̀xn gon thi ja roem triam tua pai tham-ngan",
        "en": "I have to go pay the water bill first before I start getting ready to go to work.",
        "grammar_audio": "/audio/thai/grammar/s_เสียก่อน_sǐa_g̀̀xn_-_First_beforehand_20231230_ผม_ต้อง_ไป_จ่าย_ค่าน้ำ_เสียก่อน_ก่อน_ที่_จะ_เริ่ม_เตรียม_ตัว_ไป_ทำงาน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ภายใน (phǎay nai) - Within, Inside",
    "short_explanation": "Indicates a period of time or an area within which something takes place or is planned to take place; 'within', 'inside'.",
    "long_explanation": "The term 'ภายใน (phǎay nai)' is used in Thai to refer to a period of time or an area within which something occurs or is planned to take place, which is similar to the English 'within' or 'inside'. This phrase is often used with time periods or places, and typically found at the beginning of a sentence. It is versatile and can be associated with a wide range of verbs and phrases to express something happening within a specified time period or a specific place.",
    "formation": "ภายใน + time/place + statement",
    "examples": [
      {
        "th": "ภายใน หนึ่ง สัปดาห์ ฉัน อ่าน หนังสือ กว่า สิบ เล่ม",
        "romaji": "Phǎay nai neung sap-da-hǔe, chan an nang-sǔe gwà sìp lem",
        "en": "Within a week, I read more than ten books.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phǎay_nai_-_Within_Inside_20231230_ภายใน_หนึ่ง_สัปดาห์_ฉัน_อ่าน_หนังสือ_กว่า_สิบ_เล่ม.mp3"
      },
      {
        "th": "ภายใน อาคาร นี้ มี ร้านอาหาร มากมาย",
        "romaji": "Phǎay nai a-karn nii, mee raan a-haarn maak-maay",
        "en": "Within this building, there are many restaurants.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phǎay_nai_-_Within_Inside_20231230_ภายใน_อาคาร_นี้_มี_ร้านอาหาร_มากมาย.mp3"
      },
      {
        "th": "ภายใน เวลา ครึ่ง ชั่วโมง ฉัน ต้อง ไป ที่ สถานี รถไฟ",
        "romaji": "Phǎay nai we-la krûeng chua-mong, chan dtông bpai thi sà-thǎa-nii rót-fai",
        "en": "Within half an hour, I have to go to the train station.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phǎay_nai_-_Within_Inside_20231230_ภายใน_เวลา_ครึ่ง_ชั่วโมง_ฉัน_ต้อง_ไป_ที่_สถานี_รถไฟ.mp3"
      },
      {
        "th": "ภายใน ห้อง ครัว ของ เรา มี เครื่องใช้ งาน ครบ ครัน",
        "romaji": "Phǎay nai hôong khrua kǒng rao mee kreua-chai ngan khrop-khran",
        "en": "Within our kitchen, we have all the necessary appliances.",
        "grammar_audio": "/audio/thai/grammar/s_ภายใน_phǎay_nai_-_Within_Inside_20231230_ภายใน_ห้อง_ครัว_ของ_เรา_มี_เครื่องใช้_งาน_ครบ_ครัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "100"
  },
  {
    "title": "ถึงแม้ว่า (thʉ̌ng máew wâa) - Even though",
    "short_explanation": "This conjunction introduces a contrast; 'even though' or 'although'.",
    "long_explanation": "The phrase 'ถึงแม้ว่า (thʉ̌ng máew wâa)' in Thai is used as a conjunction that introduces a contrast, similar to the English equivalent 'even though' or 'although'. It is typically used at the beginning of sentences, followed by a statement that makes a contrary point or introduces a surprising aspect, but does not necessarily negate the previous statement.",
    "formation": "ถึงแม้ว่า + Statement or Phrase",
    "examples": [
      {
        "th": "ถึงแม้ว่า ฉัน กำลัง ไม่สบาย แต่ ฉัน ยัง ไป ทำงาน ต่อ",
        "romaji": "thʉ̌ng máew wâa chan kamlang mai sabay, tae chan yang pai tham ngan tor",
        "en": "Even though I am not feeling well, I still went to work.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_máew_wâa_-_Even_though_20231230_ถึงแม้ว่า_ฉัน_กำลัง_ไม่สบาย_แต่_ฉัน_ยัง_ไป_ทำงาน_ต่อ.mp3"
      },
      {
        "th": "ถึงแม้ว่า เขา ไม่ รู้จัก ฉัน ก็ ยังใจ ดี ช่วยฉัน เสมอ",
        "romaji": "thʉ̌ng máew wâa khao mai ru jak chan, gor yang chai dee chuay chan samoe",
        "en": "Even though he doesn’t know me, he’s always been kind to help me.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_máew_wâa_-_Even_though_20231230_ถึงแม้ว่า_เขา_ไม่_รู้จัก_ฉัน_ก็_ยังใจ_ดี_ช่วยฉัน_เสมอ.mp3"
      },
      {
        "th": "ถึงแม้ว่า การันตี ความน่าเชื่อถือ ของ บริษัท นี้ แต่ ผม ยังคง ไม่เชื่อ",
        "romaji": "thʉ̌ng máew wâa garan tee khwam na cheu theu kong borisat nee, tae phom yang khong mai cheu",
        "en": "Even though this company’s reliability is guaranteed, I still don’t believe it.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_máew_wâa_-_Even_though_20231230_ถึงแม้ว่า_การันตี_ความน่าเชื่อถือ_ของ_บริษัท_นี้_แต่_ผม_ยังคง_ไม่เชื่อ.mp3"
      },
      {
        "th": "ถึงแม้ว่า ฉัน พยายาม ทำ ให้ ดี ที่สุด แต่ ผลลัพธ์ ยัง ไม่ดี เท่าที่ ฉัน คาดหวัง",
        "romaji": "thʉ̌ng máew wâa chan pha-yam tam hai dee thi sut, tae phaen lap the yang mai dee tao thi chan khat wang",
        "en": "Even though I tried my best, the result was not as good as I expected.",
        "grammar_audio": "/audio/thai/grammar/s_ถึงแม้ว่า_thʉ̌ng_máew_wâa_-_Even_though_20231230_ถึงแม้ว่า_ฉัน_พยายาม_ทำ_ให้_ดี_ที่สุด_แต่_ผลลัพธ์_ยัง_ไม่ดี_เท่าที่_ฉัน_คาดหวัง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "เรียบร้อย (riab rɔ́ɔi) - Smoothly, Successfully",
    "short_explanation": "This Thai term is used to achieve the English meaning of 'smoothly' or 'successfully'.",
    "long_explanation": "The word 'เรียบร้อย (riab rɔ́ɔi)' in Thai is often used to describe something that has been done well, without problems; it can also suggest completion. In English, this can be translated to 'smoothly' or 'successfully'. The word can be placed at the end of a sentence to give this meaning of completeness and success.",
    "formation": "Statement + เรียบร้อย",
    "examples": [
      {
        "th": "งาน ประชุม ใหญ่ ใน ตึก สูง ดำๆ ผ่านพ้น ไป เรียบร้อย",
        "romaji": "Ngan prachum yai nai tuek sung damdam phan phon pai riab rɔ́ɔi",
        "en": "The big meeting in the tall, dark building went smoothly.",
        "grammar_audio": "/audio/thai/grammar/s_เรียบร้อย_riab_rɔ́ɔi_-_Smoothly_Successfully_20231230_งาน_ประชุม_ใหญ่_ใน_ตึก_สูง_ดำๆ_ผ่านพ้น_ไป_เรียบร้อย.mp3"
      },
      {
        "th": "การ สอบ ของ ผม ผ่าน ไป เรียบร้อย",
        "romaji": "Kan sob kong phom phan pai riab rɔ́ɔi",
        "en": "My exam went smoothly.",
        "grammar_audio": "/audio/thai/grammar/s_เรียบร้อย_riab_rɔ́ɔi_-_Smoothly_Successfully_20231230_การ_สอบ_ของ_ผม_ผ่าน_ไป_เรียบร้อย.mp3"
      },
      {
        "th": "เธอ ทำ งาน บ้าน ให้ สำเร็จ เรียบร้อย",
        "romaji": "Tho tham ngan baan hai samret riab rɔ́ɔi",
        "en": "She successfully completed the housework.",
        "grammar_audio": "/audio/thai/grammar/s_เรียบร้อย_riab_rɔ́ɔi_-_Smoothly_Successfully_20231230_เธอ_ทำ_งาน_บ้าน_ให้_สำเร็จ_เรียบร้อย.mp3"
      },
      {
        "th": "เขา จัดการ กับ ภาระ งาน ใน ตอนนี้ เรียบร้อย",
        "romaji": "Khao jat kan kap phanra ngan nai ton ni riab rɔ́ɔi",
        "en": "He smoothly handles his current workload.",
        "grammar_audio": "/audio/thai/grammar/s_เรียบร้อย_riab_rɔ́ɔi_-_Smoothly_Successfully_20231230_เขา_จัดการ_กับ_ภาระ_งาน_ใน_ตอนนี้_เรียบร้อย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "พร้อมกับ (phrôom gàp) - Along with, together with",
    "short_explanation": "Used to show the action being done together or simultaneously with another action or person.",
    "long_explanation": "The term 'พร้อมกับ (phrôom gàp)' is frequently used in Thai language to express the idea of doing something together with someone or something else or at the same time as something else is happening. It is equivalent to 'along with' or 'together with' in English. It is often used with verbs to express simultaneous actions or states.",
    "formation": "Subject + Verb + พร้อมกับ + Object",
    "examples": [
      {
        "th": "เขา ไป ซื้อ ของ พร้อมกับ ฉัน",
        "romaji": "Khao pai sue kong phrôom gàp chan",
        "en": "He went shopping along with me.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phrôom_gàp_-_Along_with_together_with_20231230_เขา_ไป_ซื้อ_ของ_พร้อมกับ_ฉัน.mp3"
      },
      {
        "th": "แม่ เข้าครัว เพื่อ ทำ อาหาร พร้อมกับ ดู ข่าว ทาง โทรทัศน์",
        "romaji": "Mae khao khrua pheua tham a-han phrôom gàp du khao thang tho-rat-sa-n",
        "en": "Mom went into the kitchen to cook while watching the news on TV.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phrôom_gàp_-_Along_with_together_with_20231230_แม่_เข้าครัว_เพื่อ_ทำ_อาหาร_พร้อมกับ_ดู_ข่าว_ทาง_โทรทัศน์.mp3"
      },
      {
        "th": "นักเรียน ร้อง เพลง พร้อมกับ เต้น ใน งาน สังคม สร้างสรรค์",
        "romaji": "Nak rian rong pleng phrôom gàp ten nai ngan sang-khom sang-khan",
        "en": "The student sang along with dancing at the creative social event.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phrôom_gàp_-_Along_with_together_with_20231230_นักเรียน_ร้อง_เพลง_พร้อมกับ_เต้น_ใน_งาน_สังคม_สร้างสรรค์.mp3"
      },
      {
        "th": "เรา ควร ทำ งาน ด้วยกัน พร้อมกับ แชร์ ความคิด ใหม่ๆ เพื่อ พัฒนา บริษัท",
        "romaji": "Rao khuan tham ngan duay gan phrôom gàp chae khwam kit mai-mai pheua pat-tha-na borisat",
        "en": "We should work together and share new ideas to develop the company.",
        "grammar_audio": "/audio/thai/grammar/s_พร้อมกับ_phrôom_gàp_-_Along_with_together_with_20231230_เรา_ควร_ทำ_งาน_ด้วยกัน_พร้อมกับ_แชร์_ความคิด_ใหม่ๆ_เพื่อ_พัฒนา_บริษัท.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "นอกจาก...แต่ยัง... (nâwk jàak... dtàe yang...) - Not only... but also...",
    "short_explanation": "Used to express 'Not only..., but also...'. This pattern adds emphasis on additional information about the subject.",
    "long_explanation": "The phrase 'นอกจาก...แต่ยัง...' in Thai is similar to the English structure 'not only...but also...' and is used to incorporate additional information or characteristics about a subject in the sentence. Normally, 'นอกจาก' is followed by an adjective, verb, or phrase, then 'แต่ยัง' introduces the additional information. It's a popular pattern used in Thai language especially when emphasis on additional characteristics or actions is desired.",
    "formation": "นอกจาก + verb/adjective/noun/sentence + แต่ยัง + verb/adjective/noun/sentence",
    "examples": [
      {
        "th": "เขา นอกจาก ฉลาด แล้ว แต่ยัง มี ความ เป็น ผู้นำ",
        "romaji": "Khao nâwk jàak chà-làat láew dtàe yang mee khwaam pen phûu nam",
        "en": "Not only is he smart, but he also has leadership qualities.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจากแต่ยัง_nâwk_jàak_dtàe_yang_-_Not_only_but_also_20231230_เขา_นอกจาก_ฉลาด_แล้ว_แต่ยัง_มี_ความ_เป็น_ผู้นำ.mp3"
      },
      {
        "th": "ฉัน นอกจาก ต้อง เตรียม งาน สำหรับ การ ประชุม แต่ยัง ต้อง ทำ การบ้าน ด้วย",
        "romaji": "Chan nâwk jàak dtông dtriam ngan sǎm-ràp gaan prà-chum dtàe yang dtông tham gaan-bâan dûai",
        "en": "Not only do I have to prepare for the meeting, but I also have to do the homework.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจากแต่ยัง_nâwk_jàak_dtàe_yang_-_Not_only_but_also_20231230_ฉัน_นอกจาก_ต้อง_เตรียม_งาน_สำหรับ_การ_ประชุม_แต่ยัง_ต้อง_ทำ_การบ้าน_ด้วย.mp3"
      },
      {
        "th": "นักเรียน คน นี้ นอกจาก จะ อ่านหนังสือ ดี แต่ยัง ยอม ศึกษา เอง อีก ด้วย",
        "romaji": "Nák riian khon née nâwk jàak jà àan năng-sǔue dee dtàe yang yǒm sěuk sǎa eeng ìik dûai",
        "en": "Not only is this student good at reading, but they are also willing to study by themselves.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจากแต่ยัง_nâwk_jàak_dtàe_yang_-_Not_only_but_also_20231230_นักเรียน_คน_นี้_นอกจาก_จะ_อ่านหนังสือ_ดี_แต่ยัง_ยอม_ศึกษา_เอง_อีก_ด้วย.mp3"
      },
      {
        "th": "นอกจาก จะ เป็น ครู ที่ ดี แต่ยัง เป็น สมาชิก ที่ ใจดี ของ ชุมชน ด้วย",
        "romaji": "Nâwk jàak jà pen khruu thi dii dtàe yang pen sà-màa-chik thi jai dii khǒng chum-chon dûai",
        "en": "Not only is he a good teacher, but he is also a kind member of the community.",
        "grammar_audio": "/audio/thai/grammar/s_นอกจากแต่ยัง_nâwk_jàak_dtàe_yang_-_Not_only_but_also_20231230_นอกจาก_จะ_เป็น_ครู_ที่_ดี_แต่ยัง_เป็น_สมาชิก_ที่_ใจดี_ของ_ชุมชน_ด้วย.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ใครๆ (khrǎi khrǎi) - Anyone, everybody",
    "short_explanation": "Used to refer to anyone, everyone or anybody.",
    "long_explanation": "The phrase 'ใครๆ (khrǎi khrǎi)' is used in Thai to refer to any person or everyone, akin to the English 'anyone' or 'everybody'. It is inserted in the sentence structure where the subject or object is supposed to be when talking about people in a general sense. It communicates the idea that the action or state referred to in the sentence applies to anyone or everyone.",
    "formation": "Subject + Verb + ใครๆ",
    "examples": [
      {
        "th": "ใครๆ ก็ ทราบว่า เขา เป็น คน ดี",
        "romaji": "khrǎi khrǎi gor saab wa khao pen kon di",
        "en": "Everybody knows that he is a good person.",
        "grammar_audio": "/audio/thai/grammar/s_ใครๆ_khrǎi_khrǎi_-_Anyone_everybody_20231230_ใครๆ_ก็_ทราบว่า_เขา_เป็น_คน_ดี.mp3"
      },
      {
        "th": "ไม่ว่า ใครๆ ที่ อ่าน หนังสือ เรื่อง นี้ ก็ มัก จะ ชอบ",
        "romaji": "Mai wa khrǎi khrǎi thi aan nang sue reung nee gor mak ja chob",
        "en": "Anyone who reads this book tends to like it.",
        "grammar_audio": "/audio/thai/grammar/s_ใครๆ_khrǎi_khrǎi_-_Anyone_everybody_20231230_ไม่ว่า_ใครๆ_ที่_อ่าน_หนังสือ_เรื่อง_นี้_ก็_มัก_จะ_ชอบ.mp3"
      },
      {
        "th": "ใครๆ ที่ มา ที่นี่ จะ ต้อง ชอบ สถานที่ นี้",
        "romaji": "Khrǎi khrǎi thi ma thi nii ja tong chob sa tha ni thi nee",
        "en": "Anyone who comes here will love this place.",
        "grammar_audio": "/audio/thai/grammar/s_ใครๆ_khrǎi_khrǎi_-_Anyone_everybody_20231230_ใครๆ_ที่_มา_ที่นี่_จะ_ต้อง_ชอบ_สถานที่_นี้.mp3"
      },
      {
        "th": "หนังสือ เรื่อง นี้ เขียน ให้ ใครๆ อ่าน ได้",
        "romaji": "Nang sue reung nee khiian hai khrǎi khrǎi aan dai",
        "en": "This book is written for anyone to read.",
        "grammar_audio": "/audio/thai/grammar/s_ใครๆ_khrǎi_khrǎi_-_Anyone_everybody_20231230_หนังสือ_เรื่อง_นี้_เขียน_ให้_ใครๆ_อ่าน_ได้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "เกี่ยวข้อง (gìiao khɔ̂ng) - Related to, involved with",
    "short_explanation": "This phrase is used to express the ideas of 'related to' or 'involved with'.",
    "long_explanation": "The term 'เกี่ยวข้อง (gìiao khɔ̂ng)' is commonly used in Thai to express a relation or connection between two things or ideas, similar to the English phrase 'related to' or 'involved with'. Typically, it is used directly after a noun, and before the noun that it has a relation or connection with, to express that the first noun has some involvement or relation to the second noun.",
    "formation": "Noun1 + เกี่ยวข้อง + Noun2",
    "examples": [
      {
        "th": "การ ศึกษา นี้ เกี่ยวข้อง กับ ประวัติศาสตร์ ของ ประเทศ ไทย",
        "romaji": "Kan sueksa ni gìiao khɔ̂ng gab prawatsat khong prathet Thai",
        "en": "This study is related to the history of Thailand.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวข้อง_gìiao_khɔ̂ng_-_Related_to_involved_with_20231230_การ_ศึกษา_นี้_เกี่ยวข้อง_กับ_ประวัติศาสตร์_ของ_ประเทศ_ไทย.mp3"
      },
      {
        "th": "ฉัน ไม่ มี ส่วน เกี่ยวข้อง กับ กระทู้ นี้",
        "romaji": "Chan mai mee suan gìiao khɔ̂ng gab gratu ni",
        "en": "I have nothing to do with this topic.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวข้อง_gìiao_khɔ̂ng_-_Related_to_involved_with_20231230_ฉัน_ไม่_มี_ส่วน_เกี่ยวข้อง_กับ_กระทู้_นี้.mp3"
      },
      {
        "th": "ชาย รวย นี้ เกี่ยวข้อง กับ คดี ฆาตกรรม ที่ กำลัง ไฟไหม้",
        "romaji": "Chai ruay ni gìiao khɔ̂ng gab khadi khatkam thi kamlang fai mai",
        "en": "This rich man is involved in the currently high-profile murder case.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวข้อง_gìiao_khɔ̂ng_-_Related_to_involved_with_20231230_ชาย_รวย_นี้_เกี่ยวข้อง_กับ_คดี_ฆาตกรรม_ที่_กำลัง_ไฟไหม้.mp3"
      },
      {
        "th": "คุณ ต้อง หัก ค่า ใช้จ่าย ที่ เกี่ยวข้อง กับ การ ทำงาน ของ คุณ",
        "romaji": "Khun tong hak kha chai chai thi gìiao khɔ̂ng gab kan thamngan khong khun",
        "en": "You have to deduct the expenses related to your work.",
        "grammar_audio": "/audio/thai/grammar/s_เกี่ยวข้อง_gìiao_khɔ̂ng_-_Related_to_involved_with_20231230_คุณ_ต้อง_หัก_ค่า_ใช้จ่าย_ที่_เกี่ยวข้อง_กับ_การ_ทำงาน_ของ_คุณ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "บ้างครั้ง (bâang kráng) - Sometimes, occasionally",
    "short_explanation": "Used to denote an action or event that occurs sometimes or occasionally.",
    "long_explanation": "The phrase 'บ้างครั้ง (bâang kráng)' is used in Thai to express the occurrence of an action or event at times, or in other words, sometimes or occasionally. It can be used with various verbs and actions, and is typically positioned at the beginning of a sentence.",
    "formation": "บ้างครั้ง + Statement",
    "examples": [
      {
        "th": "บ้างครั้ง ฉัน รู้สึก เหนื่อย และ อยาก หยุด อยู่ หน่อย",
        "romaji": "Bâang kráng, chan ruu seuk neùy lae yàak yùt yùu nòi",
        "en": "Sometimes, I feel tired and want to stop for a moment.",
        "grammar_audio": "/audio/thai/grammar/s_บ้างครั้ง_bâang_kráng_-_Sometimes_occasionally_20231230_บ้างครั้ง_ฉัน_รู้สึก_เหนื่อย_และ_อยาก_หยุด_อยู่_หน่อย.mp3"
      },
      {
        "th": "บ้างครั้ง เขา ชอบ ไป เดินเล่น ที่ สวน ใน ช่วง เย็น",
        "romaji": "Bâang kráng, khao chop pai deon len thi suan nai chuang yen",
        "en": "Sometimes, he likes to stroll in the park in the evening.",
        "grammar_audio": "/audio/thai/grammar/s_บ้างครั้ง_bâang_kráng_-_Sometimes_occasionally_20231230_บ้างครั้ง_เขา_ชอบ_ไป_เดินเล่น_ที่_สวน_ใน_ช่วง_เย็น.mp3"
      },
      {
        "th": "บ้างครั้ง คุณ อาจ พบ เจอ ปัญหา ที่ เกิน ความสามารถ ของ คุณ ในการ แก้ไข",
        "romaji": "Bâang kráng, khun aat pob jer panha thi koen khwam samart kong khun nai gaan gae khai",
        "en": "Sometimes, you may encounter problems that are beyond your abilities to solve.",
        "grammar_audio": "/audio/thai/grammar/s_บ้างครั้ง_bâang_kráng_-_Sometimes_occasionally_20231230_บ้างครั้ง_คุณ_อาจ_พบ_เจอ_ปัญหา_ที่_เกิน_ความสามารถ_ของ_คุณ_ในการ_แก้ไข.mp3"
      },
      {
        "th": "บ้างครั้ง ฉัน ชอบ นั่ง ดู หนัง ใน ช่วง วันหยุด",
        "romaji": "Bâang kráng, chan chop nâng duu nang nai chuang wan yút",
        "en": "Sometimes, I like to watch movies during the holidays.",
        "grammar_audio": "/audio/thai/grammar/s_บ้างครั้ง_bâang_kráng_-_Sometimes_occasionally_20231230_บ้างครั้ง_ฉัน_ชอบ_นั่ง_ดู_หนัง_ใน_ช่วง_วันหยุด.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ตามปกติ (dtaam pkò-dtì) - Normally, Usually",
    "short_explanation": "This is used in Thai to express regular, typical, or usual activities or states; 'normally' or 'usually'.",
    "long_explanation": "The phrase 'ตามปกติ (dtaam pkò-dtì)' in Thai is used to describe actions, behaviors, or states that are normal, standard, or usual, much like the English terms 'usually' or 'normally'. It comes at either the beginning or the end of a sentence, and can be used in a wide variety of contexts.",
    "formation": "ตามปกติ + Statement / Statement + ตามปกติ",
    "examples": [
      {
        "th": "ตามปกติ ฉัน จะ นอน ที่ ทั้ง เก้า ทุ่ม",
        "romaji": "Dtaam pkò-dtì, chan ja non thi tang kao tum",
        "en": "Normally, I sleep at 9 pm.",
        "grammar_audio": "/audio/thai/grammar/s_ตามปกติ_dtaam_pkò-dtì_-_Normally_Usually_20231230_ตามปกติ_ฉัน_จะ_นอน_ที่_ทั้ง_เก้า_ทุ่ม.mp3"
      },
      {
        "th": "เขา ไม่ วิ่ง ไป ทำ งาน ตามปกติ",
        "romaji": "Khao mai wing pai tham ngan dtaam pkò-dtì",
        "en": "He isn't rushing to work as usual.",
        "grammar_audio": "/audio/thai/grammar/s_ตามปกติ_dtaam_pkò-dtì_-_Normally_Usually_20231230_เขา_ไม่_วิ่ง_ไป_ทำ_งาน_ตามปกติ.mp3"
      },
      {
        "th": "ตามปกติ วัน อาทิตย์ ฉัน ชอบ ออก กำลัง กาย ใน ห้อง ออก กำลัง กาย",
        "romaji": "Dtaam pkò-dtì, wan a-thit chan chop ok gam lang gai nai hong ok gam lang gai",
        "en": "Normally on Sundays, I like to work out in the gym.",
        "grammar_audio": "/audio/thai/grammar/s_ตามปกติ_dtaam_pkò-dtì_-_Normally_Usually_20231230_ตามปกติ_วัน_อาทิตย์_ฉัน_ชอบ_ออก_กำลัง_กาย_ใน_ห้อง_ออก_กำลัง_กาย.mp3"
      },
      {
        "th": "อาหาร เช้า วัน นี้ ไม่ อร่อย ตามปกติ",
        "romaji": "A-han chao wan ni mai a-roi dtaam pkò-dtì",
        "en": "Today's breakfast is not as delicious as usual.",
        "grammar_audio": "/audio/thai/grammar/s_ตามปกติ_dtaam_pkò-dtì_-_Normally_Usually_20231230_อาหาร_เช้า_วัน_นี้_ไม่_อร่อย_ตามปกติ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ขณะนั้น (khànà nán) - At that time, then",
    "short_explanation": "Refers to a specific moment or period in the past; 'at that time', 'then'.",
    "long_explanation": "The term 'ขณะนั้น (khànà nán)' is used in Thai to refer to a particular time or period in the past. It is similar to the English phrases 'at that time' or 'then'. It is typically placed at the beginning or middle of a sentence to set the temporal context for the action or state being described. It can be used with a wide range of verbs and phrases to indicate when a past event occurred.",
    "formation": "ขณะนั้น + Statement",
    "examples": [
      {
        "th": "ขณะนั้น เขา กำลัง รอรถ อยู่ ที่ ป้าย รถ ประจำทาง",
        "romaji": "Khànà nán, khao kamlang ror rot yu thi pai rot prajam thang",
        "en": "At that time, he was waiting for the bus at the bus stop.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนั้น_khànà_nán_-_At_that_time_then_20231230_ขณะนั้น_เขา_กำลัง_รอรถ_อยู่_ที่_ป้าย_รถ_ประจำทาง.mp3"
      },
      {
        "th": "ขณะนั้น หน้าที่ประกอบการ ตก อยู่ บน ไหล่ ของ แม่ ฉัน",
        "romaji": "Khànà nán, naa thi prakop kan tok yu bon lai kong mae chan",
        "en": "At that time, the responsibility fell on my mother's shoulders.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนั้น_khànà_nán_-_At_that_time_then_20231230_ขณะนั้น_หน้าที่ประกอบการ_ตก_อยู่_บน_ไหล่_ของ_แม่_ฉัน.mp3"
      },
      {
        "th": "ขณะนั้น ผม ยัง ไม่ รู้ เรื่อง ราบรื่น ว่า เธอ อยู่ ใน ดวงใจ ฉัน",
        "romaji": "Khànà nán, phom yang mai roo reuang rabruen wa thoe yu nai duang jai chan",
        "en": "At that time, I didn't know the delightful fact that she was in my heart.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนั้น_khànà_nán_-_At_that_time_then_20231230_ขณะนั้น_ผม_ยัง_ไม่_รู้_เรื่อง_ราบรื่น_ว่า_เธอ_อยู่_ใน_ดวงใจ_ฉัน.mp3"
      },
      {
        "th": "ขณะนั้น ฉัน กลัว ว่า ฝัน ที่ ดี นั้น จะ ไม่ เป็น ความจริง",
        "romaji": "Khànà nán, chan klua wa fun thi di nan ja mai pen khwam jing",
        "en": "At that time, I was afraid that the good dream would not become reality.",
        "grammar_audio": "/audio/thai/grammar/s_ขณะนั้น_khànà_nán_-_At_that_time_then_20231230_ขณะนั้น_ฉัน_กลัว_ว่า_ฝัน_ที่_ดี_นั้น_จะ_ไม่_เป็น_ความจริง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "เกือบจะ (gʉ̀ʉb jà) - Almost, nearly about to",
    "short_explanation": "Used to express situations where something almost happened or someone was about to do something.",
    "long_explanation": "The structure 'เกือบจะ (gʉ̀ʉb jà)' is often applied in Thai language to express circumstances where something was on the verge of happening or someone was nearing to do an action, closely analogous to the English terms 'almost' or 'nearly about to'. 'เกือบจะ' is generally positioned before the verb that represents the action that was almost completed.",
    "formation": "'เกือบจะ' + verb ",
    "examples": [
      {
        "th": "เขา เกือบจะ ตก เก้าอี้ เมื่อ ได้ยิน เสียง ดัง ของ ประตู ปิด",
        "romaji": "Khao gʉ̀ʉb jà tok gao ee mʉ̂ʉ dai yin siang dang kong pratu pit",
        "en": "He almost fell off the chair when he heard the loud sound of the door closing.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบจะ_gʉ̀ʉb_jà_-_Almost_nearly_about_to_20231230_เขา_เกือบจะ_ตก_เก้าอี้_เมื่อ_ได้ยิน_เสียง_ดัง_ของ_ประตู_ปิด.mp3"
      },
      {
        "th": "ฉัน เกือบจะ ลืม ว่า วันนี้ คือ วัน เกิด ของ เธอ",
        "romaji": "Chan gʉ̀ʉb jà leum wa wan nîi kʉe wan gert kong thoe",
        "en": "I almost forgot that today is her birthday.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบจะ_gʉ̀ʉb_jà_-_Almost_nearly_about_to_20231230_ฉัน_เกือบจะ_ลืม_ว่า_วันนี้_คือ_วัน_เกิด_ของ_เธอ.mp3"
      },
      {
        "th": "เขา เกือบจะ ทำ ลาย เรือนหัว ที่ สวย ของ เพิ่ม เวลา เขา พยายาม นำ เสื้อ ผ่าน หัว",
        "romaji": "Khao gʉ̀ʉb jà tam lai reuan hua thi suay kong phoem wela khao pha-ya-yaam nam seu phaan hua",
        "en": "He almost ruined his beautiful haircut when he tried to pull his shirt over his head.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบจะ_gʉ̀ʉb_jà_-_Almost_nearly_about_to_20231230_เขา_เกือบจะ_ทำ_ลาย_เรือนหัว_ที่_สวย_ของ_เพิ่ม_เวลา_เขา_พยายาม_นำ_เสื้อ_ผ่าน_หัว.mp3"
      },
      {
        "th": "ผม เกือบจะ ชน รถ เวลา ผม ได้ยิน ข่าว ที่ น่า ตกใจ จาก วิทยุ",
        "romaji": "Phom gʉ̀ʉb jà chon rot wela phom dai yin khao thi na tok jai jak witthayu",
        "en": "I almost hit a car when I heard the shocking news on the radio.",
        "grammar_audio": "/audio/thai/grammar/s_เกือบจะ_gʉ̀ʉb_jà_-_Almost_nearly_about_to_20231230_ผม_เกือบจะ_ชน_รถ_เวลา_ผม_ได้ยิน_ข่าว_ที่_น่า_ตกใจ_จาก_วิทยุ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ให้แก่ (hâi gè) - To give to, for the benefit of",
    "short_explanation": "This term is used to indicate the act of giving for the benefit of someone else.",
    "long_explanation": "The term 'ให้แก่ (hâi gè)' is used in Thai language to represent the concept of giving something to someone for their benefit. It could be used while giving a tangible item, like a gift, or an intangible one like advice. The term follows the giver and precedes the receiver in the sentence construction. It's quite useful while talking about acts of kindness, donation, presenting gifts, etc.",
    "formation": "Giver + ให้แก่ + Receiver",
    "examples": [
      {
        "th": "แม่ กำลัง ทำ ข้าว ให้แก่ ลูก อยู่ ใน ครัว",
        "romaji": "Mae kam lang tham khao hâi gè look yoo nai khrua",
        "en": "Mother is cooking rice for the child in the kitchen.",
        "grammar_audio": "/audio/thai/grammar/s_ให้แก่_hâi_gè_-_To_give_to_for_the_benefit_of_20231230_แม่_กำลัง_ทำ_ข้าว_ให้แก่_ลูก_อยู่_ใน_ครัว.mp3"
      },
      {
        "th": "ผม ต้องการ ที่ จะ บริจาค เงิน ให้แก่ คน ต้องการ ความ ช่วยเหลือ",
        "romaji": "Phom tong kan thi ja borijak nguen hâi gè khon tong kan khwam chuai leua",
        "en": "I want to donate money to people who need help.",
        "grammar_audio": "/audio/thai/grammar/s_ให้แก่_hâi_gè_-_To_give_to_for_the_benefit_of_20231230_ผม_ต้องการ_ที่_จะ_บริจาค_เงิน_ให้แก่_คน_ต้องการ_ความ_ช่วยเหลือ.mp3"
      },
      {
        "th": "เขา แบ่งปัน ความมั่งคั่ง ให้แก่ คน อื่น ๆ",
        "romaji": "Khao baeng pun khwam mang kang hâi gè khon eun eun",
        "en": "He shares his wealth with others.",
        "grammar_audio": "/audio/thai/grammar/s_ให้แก่_hâi_gè_-_To_give_to_for_the_benefit_of_20231230_เขา_แบ่งปัน_ความมั่งคั่ง_ให้แก่_คน_อื่น_ๆ.mp3"
      },
      {
        "th": "คุณครู กำลัง แจก แบบฝึกหัด ให้แก่ นักเรียน",
        "romaji": "Khun khru kam lang jek baep feuk had hâi gè nak rian",
        "en": "The teacher is distributing exercises to the students.",
        "grammar_audio": "/audio/thai/grammar/s_ให้แก่_hâi_gè_-_To_give_to_for_the_benefit_of_20231230_คุณครู_กำลัง_แจก_แบบฝึกหัด_ให้แก่_นักเรียน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ซึ่งกันและกัน (sʉ̂ng gan láe gan) - Mutual, with each other",
    "short_explanation": "Used to express reciprocation or mutual action.",
    "long_explanation": "The compound 'ซึ่งกันและกัน (sʉ̂ng gan láe gan)' is used in Thai language to indicate a mutual action, or an action that occurs reciprocally between two parties. It brings a sense of interaction to the sentence and is equivalent to the English phrases 'each other', 'mutually', or 'one another'. It is often placed after the verb or action to signify that the action is mutual or shared.",
    "formation": "Subject + Verb + ซึ่งกันและกัน",
    "examples": [
      {
        "th": "พวก เรา เข้าใจ ความรู้สึก ซึ่งกันและกัน",
        "romaji": "Phuak rao khao-jai khwam-roo-seuk sʉ̂ng gan láe gan",
        "en": "We understand each other's feelings.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Mutual_with_each_other_20231230_พวก_เรา_เข้าใจ_ความรู้สึก_ซึ่งกันและกัน.mp3"
      },
      {
        "th": "เขา อยู่ ด้วยกัน และ รัก ซึ่งกันและกัน",
        "romaji": "Khao yu duai gan lae rak sʉ̂ng gan láe gan",
        "en": "They live together and love each other.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Mutual_with_each_other_20231230_เขา_อยู่_ด้วยกัน_และ_รัก_ซึ่งกันและกัน.mp3"
      },
      {
        "th": "เรา ช่วยเหลือ ซึ่งกันและกัน ใน ครั้ง ที่ ยาก ลำบาก",
        "romaji": "Rao chuay-leua sʉ̂ng gan láe gan nai khrang thi yahk lam-bahk",
        "en": "We help each other in difficult times.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Mutual_with_each_other_20231230_เรา_ช่วยเหลือ_ซึ่งกันและกัน_ใน_ครั้ง_ที่_ยาก_ลำบาก.mp3"
      },
      {
        "th": "พวก เขา สุภาพ ซึ่งกันและกัน ทุกครั้ง ที่ พบ กัน",
        "romaji": "Phuak khao su-phap sʉ̂ng gan láe gan thuk khrang thi phohb gan",
        "en": "They are polite to each other every time they meet.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งกันและกัน_sʉ̂ng_gan_láe_gan_-_Mutual_with_each_other_20231230_พวก_เขา_สุภาพ_ซึ่งกันและกัน_ทุกครั้ง_ที่_พบ_กัน.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "นับจาก (náp jàak) - Counting from, Starting from",
    "short_explanation": "Used to indicate the starting point of a period or sequence. The equivalent of 'counting from' or 'starting from' in English.",
    "long_explanation": "The term 'นับจาก (náp jàak)' is used in Thai to indicate the start of a sequence or period. This is equivalent to the English phrases 'counting from' or 'starting from'. It is commonly used in sentences to denote the beginning of a period or sequence and is followed by time markers or other sequential details.",
    "formation": "นับจาก + Time/Event/Start point",
    "examples": [
      {
        "th": "นับจาก วันนี้ ไป อีก สาม สัปดาห์ คุณ จะ ต้อง ส่ง งาน",
        "romaji": "náp jàak wan ni pai eek saam sap daa khun ja dtong song ngan",
        "en": "Counting from today, you have three weeks to complete the task.",
        "grammar_audio": "/audio/thai/grammar/s_นับจาก_náp_jàak_-_Counting_from_Starting_from_20231230_นับจาก_วันนี้_ไป_อีก_สาม_สัปดาห์_คุณ_จะ_ต้อง_ส่ง_งาน.mp3"
      },
      {
        "th": "นับจาก ปี พ.ศ. 2530 เมื่อ ฉัน ประสบ ความ สำเร็จ ใน งานที่ ทำ",
        "romaji": "náp jàak bpee p.s. 2530 meu chan pra sòp khwaam samret nai ngan thi tam",
        "en": "Counting from the year 2530 B.E. when I achieved success in my work.",
        "grammar_audio": "/audio/thai/grammar/s_นับจาก_náp_jàak_-_Counting_from_Starting_from_20231230_นับจาก_ปี_พศ_2530_เมื่อ_ฉัน_ประสบ_ความ_สำเร็จ_ใน_งานที่_ทำ.mp3"
      },
      {
        "th": "นับจาก ตอน ที่ เรา ทิ้งทวน วลี นี้ ยังไม่ถึง 5 นาที",
        "romaji": "náp jàak dton thi rao ting tuan walee nee yang mai teung 5 na tee",
        "en": "Counting from the time we recite this verse, it's not even 5 minutes yet.",
        "grammar_audio": "/audio/thai/grammar/s_นับจาก_náp_jàak_-_Counting_from_Starting_from_20231230_นับจาก_ตอน_ที่_เรา_ทิ้งทวน_วลี_นี้_ยังไม่ถึง_5_นาที.mp3"
      },
      {
        "th": "นับจาก วัน ที่ เขา ได้ รับ ทุน การศึกษา อีก สอง ปี เขา จะ จบ การศึกษา",
        "romaji": "náp jàak wan thi khao dai rap toon gan suksa eek song bpee khao ja jop gan suksa",
        "en": "Counting from the day he received a scholarship, he will graduate in two more years.",
        "grammar_audio": "/audio/thai/grammar/s_นับจาก_náp_jàak_-_Counting_from_Starting_from_20231230_นับจาก_วัน_ที่_เขา_ได้_รับ_ทุน_การศึกษา_อีก_สอง_ปี_เขา_จะ_จบ_การศึกษา.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "สู้กับ (sûu gàp) - To compete with, fight against",
    "short_explanation": "This phrase is used to indicate competition or confrontation with someone or something.",
    "long_explanation": "The phrase 'สู้กับ (sûu gàp)' in Thai language is used when we want to indicate a situation of competition, contest, fight or struggle against someone or something. It can refer to both literal and metaphorical fights or competitions. Often, it is used in the context of sports, business competition, everyday struggles, or any situation where there is rivalry or competition.",
    "formation": "Subject + สู้กับ + Object",
    "examples": [
      {
        "th": "แมว สู้กับ หมา ใน บ้าน ที่ ฉัน อยู่",
        "romaji": "Maew sûu gàp mah nai ban thi chan yùu",
        "en": "The cat competes with the dog in the house where I live.",
        "grammar_audio": "/audio/thai/grammar/s_สู้กับ_sûu_gàp_-_To_compete_with_fight_against_20231230_แมว_สู้กับ_หมา_ใน_บ้าน_ที่_ฉัน_อยู่.mp3"
      },
      {
        "th": "ทีม ฟุตบอล ของ เรา จะ สู้กับ ทีม จาก ประเทศ อังกฤษ ใน การ แข่งขัน ครั้ง หน้า",
        "romaji": "Team futbon kong rao ja sûu gàp team jak pratheh ang-grit nai kan khaeng kan krung na",
        "en": "Our football team is going to compete with a team from England in the next competition.",
        "grammar_audio": "/audio/thai/grammar/s_สู้กับ_sûu_gàp_-_To_compete_with_fight_against_20231230_ทีม_ฟุตบอล_ของ_เรา_จะ_สู้กับ_ทีม_จาก_ประเทศ_อังกฤษ_ใน_การ_แข่งขัน_ครั้ง_หน้า.mp3"
      },
      {
        "th": "ฉัน สู้กับ ความ ทุกข์ ที่ มี ใน ชีวิต",
        "romaji": "Chan sûu gàp khwam took thi mee nai cheewit",
        "en": "I fight against the hardship in my life.",
        "grammar_audio": "/audio/thai/grammar/s_สู้กับ_sûu_gàp_-_To_compete_with_fight_against_20231230_ฉัน_สู้กับ_ความ_ทุกข์_ที่_มี_ใน_ชีวิต.mp3"
      },
      {
        "th": "บริษัท ของ เรา สู้กับ การ แข่งขัน ตลาด ที่ สูง",
        "romaji": "Borisat kong rao sûu gàp kan khaeng kan talat thi soong",
        "en": "Our company competes with high market competition.",
        "grammar_audio": "/audio/thai/grammar/s_สู้กับ_sûu_gàp_-_To_compete_with_fight_against_20231230_บริษัท_ของ_เรา_สู้กับ_การ_แข่งขัน_ตลาด_ที่_สูง.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ซึ่งเมื่อ (sʉ̂ng mʉ̂a) - When, at the time that",
    "short_explanation": "Indicates the time when an event happened, similar to English 'when' or 'at the time that'.",
    "long_explanation": "The phrase 'ซึ่งเมื่อ (sʉ̂ng mʉ̂a)' is primarily used in written Thai to refer to the time an event took place, similar to the use of 'when' or 'at the time that' in English. It is often used to introduce clauses of time, usually showing the timing or sequence of events. It is also used to yoke together two events happening at the same time or one happening right after another.",
    "formation": "ซึ่งเมื่อ + Time phrase + Statement",
    "examples": [
      {
        "th": "ฉัน จำรุง ตอนที่ เรา เจอกัน ครั้งแรก ซึ่งเมื่อ เธอ ลงจากรถ แล้ว ยิ้ม ให้ ฉัน",
        "romaji": "Chan jamrung ton thi rao jae gan krang raek sʉ̂ng mʉ̂a thoe long jak rot laew yim hai chan",
        "en": "I remember the time when we first met, when you got out of the car and smiled at me.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเมื่อ_sʉ̂ng_mʉ̂a_-_When_at_the_time_that_20231230_ฉัน_จำรุง_ตอนที่_เรา_เจอกัน_ครั้งแรก_ซึ่งเมื่อ_เธอ_ลงจากรถ_แล้ว_ยิ้ม_ให้_ฉัน.mp3"
      },
      {
        "th": "ซึ่งเมื่อ ถึง วัย ทำงาน แล้ว ฉัน ต้อง เริ่ม หา รายได้ ให้ ตัวเอง",
        "romaji": "Sʉ̂ng mʉ̂a thưng wai tham ngan laew, chan dtong rĕrm hăa rai dai hâi dtua eng",
        "en": "When I reached working age, I had to start earning money for myself.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเมื่อ_sʉ̂ng_mʉ̂a_-_When_at_the_time_that_20231230_ซึ่งเมื่อ_ถึง_วัย_ทำงาน_แล้ว_ฉัน_ต้อง_เริ่ม_หา_รายได้_ให้_ตัวเอง.mp3"
      },
      {
        "th": "ซึ่งเมื่อ ฤดูฝน มาถึง ทำให้ ความชื้น สูง แล้ว ระวัง โรค ที่ เกิด จาก แมลง",
        "romaji": "Sʉ̂ng mʉ̂a reudoo fon ma thueng, tham hai khwaam cheun sǔng laew, rawang rohk thi gert jak malaeng",
        "en": "When the rainy season arrives, the humidity increases, so beware of diseases caused by insects.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเมื่อ_sʉ̂ng_mʉ̂a_-_When_at_the_time_that_20231230_ซึ่งเมื่อ_ฤดูฝน_มาถึง_ทำให้_ความชื้น_สูง_แล้ว_ระวัง_โรค_ที่_เกิด_จาก_แมลง.mp3"
      },
      {
        "th": "ซึ่งเมื่อ ภาพยนตร์ จบ แล้ว ฉัน รู้สึก อิ่มอก อิ่มใจ เพราะ เป็น ภาพยนตร์ ที่ น่า รัก มาก",
        "romaji": "sʉ̂ng mʉ̂a phapphayon job laew, chan ruseuk im-ok im-jai pror pen phapphayon thi na rak mak",
        "en": "When the movie ended, I felt satisfied because it was a very lovely movie.",
        "grammar_audio": "/audio/thai/grammar/s_ซึ่งเมื่อ_sʉ̂ng_mʉ̂a_-_When_at_the_time_that_20231230_ซึ่งเมื่อ_ภาพยนตร์_จบ_แล้ว_ฉัน_รู้สึก_อิ่มอก_อิ่มใจ_เพราะ_เป็น_ภาพยนตร์_ที่_น่า_รัก_มาก.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "อย่างที่ (yâang thîi) - As, like how",
    "short_explanation": "Used before a clause to indicate similarity or manner; 'as' or 'like how'.",
    "long_explanation": "The term 'อย่างที่ (yâang thîi)' is used in Thai to indicate a comparison, or to show how something is done, similar to English 'as' or 'like how'. It is usually used at the beginning of a clause to set the basis of comparison or the way an action is done. 'อย่างที่' can be used with many types of phrases to express similarity in actions, situations, or states.",
    "formation": "อย่างที่ + Statement",
    "examples": [
      {
        "th": "ฉัน เตรียม ตัว ไป เรียน ต่อ ต่างประเทศ อย่างที่ แพลน ไว้ แล้ว",
        "romaji": "Chan triam tua pai rien tor taang pra thet yâang thîi paen wai laew",
        "en": "I am preparing to study abroad as I have planned.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างที่_yâang_thîi_-_As_like_how_20231230_ฉัน_เตรียม_ตัว_ไป_เรียน_ต่อ_ต่างประเทศ_อย่างที่_แพลน_ไว้_แล้ว.mp3"
      },
      {
        "th": "เขา ออกกำลังกาย อย่างที่ คุณแพทย์ แนะนำ มา",
        "romaji": "Khao auk kam lang gai yâang thîi khun paet nae nam ma",
        "en": "He exercises as the doctor recommended.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างที่_yâang_thîi_-_As_like_how_20231230_เขา_ออกกำลังกาย_อย่างที่_คุณแพทย์_แนะนำ_มา.mp3"
      },
      {
        "th": "พวกเรา ทำงาน วันไปวันมา อย่างที่ ประกาศงาน ระบุ ไว้ เอง",
        "romaji": "Phuak rao tham ngan wan pai wan ma yâang thîi pra gat ngan rabu wai eng",
        "en": "We work day by day as the job announcement specified.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างที่_yâang_thîi_-_As_like_how_20231230_พวกเรา_ทำงาน_วันไปวันมา_อย่างที่_ประกาศงาน_ระบุ_ไว้_เอง.mp3"
      },
      {
        "th": "อย่างที่ ผม เคย พูด ว่า ฉัน จะ รัก เธอ ตลอดไป",
        "romaji": "Yâang thîi phom koei phut wa chan ja rak thoe talod pai",
        "en": "As I once said, I will love you forever.",
        "grammar_audio": "/audio/thai/grammar/s_อย่างที่_yâang_thîi_-_As_like_how_20231230_อย่างที่_ผม_เคย_พูด_ว่า_ฉัน_จะ_รัก_เธอ_ตลอดไป.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "จนบัดนี้ (jon bàt níi) - Up to now, so far",
    "short_explanation": "Indicates something that has been ongoing from the past until the present moment; 'up to now' or 'so far'.",
    "long_explanation": "The term 'จนบัดนี้ (jon bàt níi)' is used in Thai to refer to something that has been happening from the past and is still ongoing at the current time, mirroring the English phrases 'up to now' or 'so far'. It is typically situated at the end of the sentence to characterize the action or event concerning the timeframe.",
    "formation": "Statement + จนบัดนี้",
    "examples": [
      {
        "th": "เธอ ได้ เรียน ไทย อย่าง สม่ำเสมอ มา หลาย ปี แล้ว จนบัดนี้",
        "romaji": "Thoe dai rian Thai yang samam sa-moer ma lai bpii laeo jon bàt níi",
        "en": "She has been studying Thai regularly for many years up to now.",
        "grammar_audio": "/audio/thai/grammar/s_จนบัดนี้_jon_bàt_níi_-_Up_to_now_so_far_20231230_เธอ_ได้_เรียน_ไทย_อย่าง_สม่ำเสมอ_มา_หลาย_ปี_แล้ว_จนบัดนี้.mp3"
      },
      {
        "th": "เขา อยู่ ใน ทีม นี้ มา ตั้งแต่ เริ่ม ต้น จนบัดนี้",
        "romaji": "Khao yuu nai team nii ma tang tae ream ton jon bàt níi",
        "en": "He has been in this team since the beginning up to now.",
        "grammar_audio": "/audio/thai/grammar/s_จนบัดนี้_jon_bàt_níi_-_Up_to_now_so_far_20231230_เขา_อยู่_ใน_ทีม_นี้_มา_ตั้งแต่_เริ่ม_ต้น_จนบัดนี้.mp3"
      },
      {
        "th": "ผม กำลัง ทำ ธุรกิจ ของ ตัวเอง มา ตลอด เวลา นี้ จนบัดนี้",
        "romaji": "Phom gam lang tham thurakit kong tua eng ma talot welaa nii jon bàt níi",
        "en": "I have been running my own business throughout this time up to now.",
        "grammar_audio": "/audio/thai/grammar/s_จนบัดนี้_jon_bàt_níi_-_Up_to_now_so_far_20231230_ผม_กำลัง_ทำ_ธุรกิจ_ของ_ตัวเอง_มา_ตลอด_เวลา_นี้_จนบัดนี้.mp3"
      },
      {
        "th": "ฉัน อ่าน หนังสือ นี้ ไป มากมาย ตั้งแต่ ผม ยัง เป็น เด็ก จนบัดนี้",
        "romaji": "Chan aan nangsue nii pai maak mai tang tae phom yang pen dek jon bàt níi",
        "en": "I have read this book over and over again since I was a child up to now.",
        "grammar_audio": "/audio/thai/grammar/s_จนบัดนี้_jon_bàt_níi_-_Up_to_now_so_far_20231230_ฉัน_อ่าน_หนังสือ_นี้_ไป_มากมาย_ตั้งแต่_ผม_ยัง_เป็น_เด็ก_จนบัดนี้.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ไม่ว่าจะ (mâi wâa jà) - Regardless of whether, No matter",
    "short_explanation": "Used to express that the action in question is not affected by different circumstances.",
    "long_explanation": "The term 'ไม่ว่าจะ (mâi wâa jà)' is used in Thai to indicate a situation in which the main clause or action is not affected by the various potential conditions stated. Similar to the English expressions 'regardless of whether' or 'no matter', it is commonly used to set up different scenarios or conditions. Although these conditions may vary, they don't change the main statement or outcome. It is commonly used with a wide range of verbs and is typically placed at the beginning of the sentence.",
    "formation": "ไม่ว่าจะ + (conditions/variations) + Main statement",
    "examples": [
      {
        "th": "ไม่ว่าจะ ไป ที่ ไหน เขา ยัง คง ใส่ เสื้อ สี แดง เสมอ",
        "romaji": "Mâi wâa jà pai thi nai, khao yang kong sai seu see daeng sà-mǒer",
        "en": "No matter where he goes, he always wears a red shirt.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าจะ_mâi_wâa_jà_-_Regardless_of_whether_No_matter_20231230_ไม่ว่าจะ_ไป_ที่_ไหน_เขา_ยัง_คง_ใส่_เสื้อ_สี_แดง_เสมอ.mp3"
      },
      {
        "th": "ไม่ว่าจะ มี ความ ยุ่ง ยาก ยัง ไง ฉัน ยัง คง รัก เธอ เสมอ",
        "romaji": "Mâi wâa jà mee kwam yung yak yang ngai, chan yang kong rak thoe sà-mǒer",
        "en": "Regardless of how difficult things may get, I will always love you.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าจะ_mâi_wâa_jà_-_Regardless_of_whether_No_matter_20231230_ไม่ว่าจะ_มี_ความ_ยุ่ง_ยาก_ยัง_ไง_ฉัน_ยัง_คง_รัก_เธอ_เสมอ.mp3"
      },
      {
        "th": "ไม่ว่าจะ ต้อง ทำงาน จน ดึก ยัง โต้ง ริบ นอน เพื่อ สำเร็จ งาน เสมอ",
        "romaji": "Mâi wâa jà tong tham ngan jon deuk, yang tong rip non phuea samret ngan sà-mǒer",
        "en": "No matter if I have to work until late, I always force myself to sleep in order to complete the work.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าจะ_mâi_wâa_jà_-_Regardless_of_whether_No_matter_20231230_ไม่ว่าจะ_ต้อง_ทำงาน_จน_ดึก_ยัง_โต้ง_ริบ_นอน_เพื่อ_สำเร็จ_งาน_เสมอ.mp3"
      },
      {
        "th": "ไม่ว่าจะ ผ่าน พ้น มา กี่ ปี แล้ว ผม ถนัด การ ใช้ ปากกา หมึก สี น้ำ เขียว เสมอ",
        "romaji": "Mâi wâa jà phan phon ma gee pee laew, phom thanat kan chai pak ga muek see nam khiew sà-mǒer",
        "en": "No matter how many years have passed, I am always proficient at using green ink pens.",
        "grammar_audio": "/audio/thai/grammar/s_ไม่ว่าจะ_mâi_wâa_jà_-_Regardless_of_whether_No_matter_20231230_ไม่ว่าจะ_ผ่าน_พ้น_มา_กี่_ปี_แล้ว_ผม_ถนัด_การ_ใช้_ปากกา_หมึก_สี_น้ำ_เขียว_เสมอ.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "ตลอดจน (dtà-lɔ̀ɔt jon) - From... to, all the way until",
    "short_explanation": "Indicates a continuous period/time or process from a certain state/condition to another state/condition.",
    "long_explanation": "The phrase 'ตลอดจน (dtà-lɔ̀ɔt jon)' is typically used to denote an enduring time period, a continuous process, or a change from one state or condition to another in Thai language. It is semantically similar to the English phrases 'from...to' or 'all the way until'. In the sentence, it is generally positioned between two time points or conditions, setting a starting point and an ending point of a certain situation or activity.",
    "formation": "Initial state or time + ตลอดจน + Final state or time",
    "examples": [
      {
        "th": "ฉัน จะ คอย เธอ ตั้งแต่ ตอน นี้ ตลอดจน ถึง วัน สุดท้าย",
        "romaji": "Chan ja koi thoe tang-tae ton ni dtà-lɔ̀ɔt jon theung wan sut thai",
        "en": "I will wait for you from now all the way until the last day.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอดจน_dtà-lɔ̀ɔt_jon_-_From_to_all_the_way_until_20231230_ฉัน_จะ_คอย_เธอ_ตั้งแต่_ตอน_นี้_ตลอดจน_ถึง_วัน_สุดท้าย.mp3"
      },
      {
        "th": "เขา ทำงาน อย่าง หนัก ตลอดจน ได้ รับการ ตั้ง ชื่อ เป็น พนักงาน ที่ ดี ที่สุด ใน บริษัท",
        "romaji": "Khao tham-ngan yang nak dtà-lɔ̀ɔt jon dai ràp-kaan dtang cheu pen pha-nák-ngaan thi dee thi-sut nai bo-rí-sàt",
        "en": "He worked hard all the way until he was named the best employee in the company.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอดจน_dtà-lɔ̀ɔt_jon_-_From_to_all_the_way_until_20231230_เขา_ทำงาน_อย่าง_หนัก_ตลอดจน_ได้_รับการ_ตั้ง_ชื่อ_เป็น_พนักงาน_ที่_ดี_ที่สุด_ใน_บริษัท.mp3"
      },
      {
        "th": "เธอ เดินทาง จาก กรุงเทพฯ ตลอดจน ถึง เชียงใหม่",
        "romaji": "Thoe deon tang jak Krung Thep dtà-lɔ̀ɔt jon theung Chiang Mai",
        "en": "She traveled from Bangkok all the way to Chiang Mai.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอดจน_dtà-lɔ̀ɔt_jon_-_From_to_all_the_way_until_20231230_เธอ_เดินทาง_จาก_กรุงเทพฯ_ตลอดจน_ถึง_เชียงใหม่.mp3"
      },
      {
        "th": "พวกเรา ได้ เรียนรู้ วิชา นี้ ตั้งแต่ ระดับ มัธยมศึกษา ตลอดจน ถึง ปริญญา ตรี",
        "romaji": "Phuak rao dai rian ru wi-cha ni tang-tae rà-dap mat-yom-seuk-sa dtà-lɔ̀ɔt jon theung pa-rin-ya tri",
        "en": "We have been studying this subject from high school all the way until our bachelor's degree.",
        "grammar_audio": "/audio/thai/grammar/s_ตลอดจน_dtà-lɔ̀ɔt_jon_-_From_to_all_the_way_until_20231230_พวกเรา_ได้_เรียนรู้_วิชา_นี้_ตั้งแต่_ระดับ_มัธยมศึกษา_ตลอดจน_ถึง_ปริญญา_ตรี.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  },
  {
    "title": "เป็นต้นไป (pen dtôn bpai) - Onward, and so on",
    "short_explanation": "Used to indicate a continuous action from a specific point onward, similar to 'and so on', 'and so forth', 'etc.' in English.",
    "long_explanation": "The phrase 'เป็นต้นไป (pen dtôn bpai)' is used in Thai language to denote an ongoing action or condition from a certain point onward. It can be used in scenarios where you want to illustrate a sequence of actions, events or states, where the starting point is defined but the ending point may not be, signifying the continuation of a pattern. The equivalent expression in English would be 'and so on', 'and so forth', 'etc.'",
    "formation": "Statement + เป็นต้นไป",
    "examples": [
      {
        "th": "เรา จะ พูด ถึง เรื่อง การ ทำงาน อย่าง สม่ำเสมอ การ อ่าน หนังสือ ต่อไป จาก นั้น ลอง จินตนา การ เกี่ยว กับ ดาวอังคาร เป็นต้นไป",
        "romaji": "Rao ja pûut tǔeng rûeang gan tam-ngan yâng sà-mm̀ʹsmǔer gan àan nangsʉ̂ʉ dtòr-bpai jàak nán lorng jintanā gan gìeow gàp daaw ang-khan pen dtôn bpai",
        "en": "We will discuss routine work, followed by reading books, then imagine about Mars, and so on.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dtôn_bpai_-_Onward_and_so_on_20231230_เรา_จะ_พูด_ถึง_เรื่อง_การ_ทำงาน_อย่าง_สม่ำเสมอ_การ_อ่าน_หนังสือ_ต่อไป_จาก_นั้น_ลอง_จินตนา_การ_เกี่ยว_กับ_ดาวอังคาร_เป็นต้นไป.mp3"
      },
      {
        "th": "บริษัท ของ เขา นำ เข้า สินค้า มากมาย ตั้งแต่ อาหาร น้ำ ผลไม้ ขนม ปัง ข้าว คุณ ได้ สินค้า เป็นต้นไป",
        "romaji": "Bò-rì-sàt kǒong khǎo nam khâo sǐn-khâa maak-maai dtâng-dtàe aa-hǎan nâam phǒn-lá-múi khanom bpang khâao khun dâi sǐn-khâa pen dtôn bpai",
        "en": "His company imports many goods, from food and water to fruits, bread, rice, you have it and so forth.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dtôn_bpai_-_Onward_and_so_on_20231230_บริษัท_ของ_เขา_นำ_เข้า_สินค้า_มากมาย_ตั้งแต่_อาหาร_น้ำ_ผลไม้_ขนม_ปัง_ข้าว_คุณ_ได้_สินค้า_เป็นต้นไป.mp3"
      },
      {
        "th": "เขิน ดู หนัง ซีรี่ส์ หนึ่ง เรื่อง ต่อไป จน หมด ภายใน หนึ่ง วัน ตั้งแต่ ซีรี่ส์ นิยาย ทริลเลอร์ เพื่อ พัก ผ่อน เป็นต้นไป",
        "romaji": "Khǎen duu nǎng sǐin-rís nùeng rûeang dtòr-bpai jon mòt pay nai nùeng wan dtâng-dtàe sǐin-rís ní-yaaai thrir-ləə pʉ̂ʉa pâk pɔ̀ɔn pen dtôn bpai",
        "en": "He binge-watches one series after another within a day, from thrillers to relaxation series, and so on.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dtôn_bpai_-_Onward_and_so_on_20231230_เขิน_ดู_หนัง_ซีรี่ส์_หนึ่ง_เรื่อง_ต่อไป_จน_หมด_ภายใน_หนึ่ง_วัน_ตั้งแต่_ซีรี่ส์_นิยาย_ทริลเลอร์_เพื่อ_พัก_ผ่อน_เป็นต้นไป.mp3"
      },
      {
        "th": "ยินดี ให้ ข้อมูล เกี่ยวกับ หลักสูตร การ ท่องเที่ยว ประเทศ อื่น ๆ ต่อ จาก นี้ เช่น เอเชีย ยุโรป อเมริกา เป็นต้นไป",
        "romaji": "Yin dii hâi khǒong-muun gìeow-gàp lâk-sòot gaan tǒong-thǐeo bprà-thêt uen uen dtòr jàak níi chên Asia Europe America pen dtôn bpai",
        "en": "I am glad to provide information about tourism courses for various other countries, such as Asia, Europe, America, and so on.",
        "grammar_audio": "/audio/thai/grammar/s_เป็นต้นไป_pen_dtôn_bpai_-_Onward_and_so_on_20231230_ยินดี_ให้_ข้อมูล_เกี่ยวกับ_หลักสูตร_การ_ท่องเที่ยว_ประเทศ_อื่น_ๆ_ต่อ_จาก_นี้_เช่น_เอเชีย_ยุโรป_อเมริกา_เป็นต้นไป.mp3"
      }
    ],
    "p_tag": "CU-TFL_4",
    "s_tag": "125"
  }
]