[
  {
    "title": "除非...否则... (chúfēi...fǒuzé...) - Unless... otherwise...",
    "short_explanation": "Used to express the condition required for a certain outcome to occur.",
    "long_explanation": "The Mandarin Chinese expression '除非...否则...' (chúfēi...fǒuzé...) is similar to 'unless... otherwise...' in English. This grammar point is used to underline the necessity of a certain condition in order to achieve a given outcome. In other words, it's used to express the thought that, unless condition A happens, then result B will take place.",
    "formation": "除非 + Condition A, 否则 + Result B",
    "examples": [
      {
        "cn": "除非你每天都做运动，否则你不可能减肥成功。",
        "pinyin": "Chúfēi nǐ měitiān dōu zuò yùndòng, fǒuzé nǐ bù kěnéng jiǎnféi chénggōng.",
        "en": "Unless you exercise every day, you cannot successfully lose weight.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēifǒuzé_-_Unless_otherwise_20231230_除非你每天都做运动否则你不可能减肥成功.mp3"
      },
      {
        "cn": "除非你早点睡觉，否则你明天肯定会迟到。",
        "pinyin": "Chúfēi nǐ zǎodiǎn shuìjiào, fǒuzé nǐ míngtiān kěndìng huì chídào.",
        "en": "Unless you go to bed early, you will definitely be late tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēifǒuzé_-_Unless_otherwise_20231230_除非你早点睡觉否则你明天肯定会迟到.mp3"
      },
      {
        "cn": "除非他改变他的态度，否则我们不能再跟他合作。",
        "pinyin": "Chúfēi tā gǎibiàn tā de tàidu, fǒuzé wǒmen bù néng zài gēn tā hézuò.",
        "en": "Unless he changes his attitude, we can't cooperate with him anymore.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēifǒuzé_-_Unless_otherwise_20231230_除非他改变他的态度否则我们不能再跟他合作.mp3"
      },
      {
        "cn": "除非你告诉我真相，否则我不会相信你。",
        "pinyin": "Chúfēi nǐ gàosù wǒ zhēnxiàng, fǒuzé wǒ bù huì xiāngxìn nǐ.",
        "en": "Unless you tell me the truth, I won't believe you.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非否则_chúfēifǒuzé_-_Unless_otherwise_20231230_除非你告诉我真相否则我不会相信你.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "尽管 (jǐnguǎn) - Although, even though",
    "short_explanation": "This expresses a notion of 'despite', 'even if' or 'even though'. It is used to demonstrate that the following clause or action took place regardless of the situation suggested by the preceding clause.",
    "long_explanation": "The Mandarin Chinese term '尽管 (jǐnguǎn)' is a conjunction that is commonly used to show contrast or contradiction between two clauses. It's similar to the English expressions 'although', 'even if', or 'even though'. The clause following '尽管 (jǐnguǎn)' usually goes against what one would normally expect considering the situation described in the clause before '尽管 (jǐnguǎn)'.",
    "formation": "尽管 + Clause (situation), + Subject + Verb / Adjective (unexpected outcome)",
    "examples": [
      {
        "cn": "尽管他是一个新手，他仍然完成了多项任务。",
        "pinyin": "Jǐnguǎn tā shì yīgè xīnshǒu, tā réngrán wánchéng le duōxiàng rènwù.",
        "en": "Although he is a novice, he still completed many tasks.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管_jǐnguǎn_-_Although_even_though_20231230_尽管他是一个新手他仍然完成了多项任务.mp3"
      },
      {
        "cn": "尽管他睡的很晚，他还是早起去上学了。",
        "pinyin": "Jǐnguǎn tā shuì de hěn wǎn, tā háishì zǎoqǐ qù shàngxuéle.",
        "en": "Even though he slept very late, he still got up early to go to school.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管_jǐnguǎn_-_Although_even_though_20231230_尽管他睡的很晚他还是早起去上学了.mp3"
      },
      {
        "cn": "尽管下着大雨，他们还是准时到达了目的地。",
        "pinyin": "Jǐnguǎn xiàzhe dàyǔ, tāmen háishì zhǔnshí dàodá le mùdìdì.",
        "en": "Although it was raining heavily, they still arrived at the destination on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管_jǐnguǎn_-_Although_even_though_20231230_尽管下着大雨他们还是准时到达了目的地.mp3"
      },
      {
        "cn": "尽管他忙，他还是抽时间来帮助我。",
        "pinyin": "Jǐnguǎn tā máng, tā háishì chōu shíjiān lái bāngzhù wǒ.",
        "en": "Even though he is busy, he still finds time to help me.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管_jǐnguǎn_-_Although_even_though_20231230_尽管他忙他还是抽时间来帮助我.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "一切 (yīqiè) - All, every",
    "short_explanation": "Used to express the concept of 'all' or 'every'.",
    "long_explanation": "The Mandarin Chinese word '一切 (yīqiè)' is often used to state a comprehensive meaning of 'all' or 'every', touching every part of a subject or concept. It is equivalent to saying 'all' in English. This word is often found in declarative or narrative contexts.",
    "formation": "'一切' + Nouns",
    "examples": [
      {
        "cn": "他一切的行为都表现出他非常喜欢中国文化。",
        "pinyin": "Tā yīqiè de xíngwéi dōu biǎoxiàn chū tā fēicháng xǐhuān Zhōngguó wénhuà.",
        "en": "All his behaviors show that he is very fond of Chinese culture.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yīqiè_-_All_every_20231230_他一切的行为都表现出他非常喜欢中国文化.mp3"
      },
      {
        "cn": "她对一切的挑战都应对自如。",
        "pinyin": "Tā duì yīqiè de tiǎozhàn dōu yìngduì zìrú.",
        "en": "She responds with ease to all challenges.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yīqiè_-_All_every_20231230_她对一切的挑战都应对自如.mp3"
      },
      {
        "cn": "在考试之前，我们需要复习一切的课文和词汇。",
        "pinyin": "Zài kǎoshì zhīqián, wǒmen xūyào fùxí yīqiè de kèwén hé cíhuì.",
        "en": "Before the exam, we need to review all the texts and vocabulary.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yīqiè_-_All_every_20231230_在考试之前我们需要复习一切的课文和词汇.mp3"
      },
      {
        "cn": "尽管他遇到了很大的困难，他一切都没有放弃。",
        "pinyin": "Jǐnguǎn tā yùdào le hěn dà de kùnnán, tā yīqiè dōu méiyǒu fàngqì.",
        "en": "Despite facing great difficulties, he gave up nothing at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yīqiè_-_All_every_20231230_尽管他遇到了很大的困难他一切都没有放弃.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "另外 (lìngwài) - Furthermore, in addition",
    "short_explanation": "Used to introduce additional information or details.",
    "long_explanation": "The Mandarin Chinese word '另外 (lìngwài)' is used to introduce additional information or details related to the previous statement. It is similar to the English phrases 'furthermore', 'in addition', or 'moreover'. It's a great way to link together related points or ideas in a conversation or written text.",
    "formation": "'另外' + Additional Information",
    "examples": [
      {
        "cn": "我喜欢读书，另外我还很喜欢画画。",
        "pinyin": "Wǒ xǐhuan dúshū, lìngwài wǒ hái hěn xǐhuan huà huà.",
        "en": "I like reading books, furthermore, I also really like painting.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Furthermore_in_addition_20231230_我喜欢读书另外我还很喜欢画画.mp3"
      },
      {
        "cn": "他不仅会说德语，另外他还会说法语。",
        "pinyin": "Tā bùjǐn huì shuō déyǔ, lìngwài tā hái huì shuō fǎyǔ.",
        "en": "Not only can he speak German, but in addition, he can also speak French.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Furthermore_in_addition_20231230_他不仅会说德语另外他还会说法语.mp3"
      },
      {
        "cn": "他是个非常优秀的教师，另外也是个善良的父亲。",
        "pinyin": "Tā shì gè fēicháng yōuxiù de jiàoshī, lìngwài yěshì gè shànliáng de fùqīn.",
        "en": "He is not only a very excellent teacher, but furthermore, he's also a kind father.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Furthermore_in_addition_20231230_他是个非常优秀的教师另外也是个善良的父亲.mp3"
      },
      {
        "cn": "这个手机打折，另外我们还可以得到一个免费的保护套。",
        "pinyin": "Zhège shǒujī dǎzhé, lìngwài wǒmen hái kěyǐ dédào yīgè miǎnfèi de bǎohù tào.",
        "en": "This phone is on sale, and in addition, we can also get a free protective case.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Furthermore_in_addition_20231230_这个手机打折另外我们还可以得到一个免费的保护套.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "无疑 (wúyí) - Undoubtedly",
    "short_explanation": "Used to express certainty about something.",
    "long_explanation": "The Mandarin Chinese term '无疑 (wúyí)' is used when you want to say something is certain or without a doubt. It is used to express strong belief or conviction on a subject or topic. It is often placed in front of the verb or adjective that the speaker feels certain about, illustrating a strong level of confidence in what is being expressed.",
    "formation": "Subject + 无疑 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他无疑是我们班最聪明的学生。",
        "pinyin": "Tā wúyí shì wǒmen bān zuì cōngming de xuéshēng.",
        "en": "He is undoubtedly the smartest student in our class.",
        "grammar_audio": "/audio/mandarin/grammar/s_无疑_wúyí_-_Undoubtedly_20231230_他无疑是我们班最聪明的学生.mp3"
      },
      {
        "cn": "这次会议无疑非常成功。",
        "pinyin": "Zhè cì huìyì wúyí fēicháng chénggōng.",
        "en": "This meeting was undoubtedly very successful.",
        "grammar_audio": "/audio/mandarin/grammar/s_无疑_wúyí_-_Undoubtedly_20231230_这次会议无疑非常成功.mp3"
      },
      {
        "cn": "他的演讲无疑给大家留下了深刻的印象。",
        "pinyin": "Tā de yǎnjiǎng wúyí gěi dàjiā liú xiàle shēnkè de yìnxiàng.",
        "en": "His speech undoubtedly left a deep impression on everyone.",
        "grammar_audio": "/audio/mandarin/grammar/s_无疑_wúyí_-_Undoubtedly_20231230_他的演讲无疑给大家留下了深刻的印象.mp3"
      },
      {
        "cn": "这家餐厅无疑是我去过的最好的餐厅。",
        "pinyin": "Zhè jiā cāntīng wúyí shì wǒ qùguò de zuì hǎo de cāntīng.",
        "en": "This restaurant is undoubtedly the best one I have been to.",
        "grammar_audio": "/audio/mandarin/grammar/s_无疑_wúyí_-_Undoubtedly_20231230_这家餐厅无疑是我去过的最好的餐厅.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "鉴于 (jiànyú) - In light of, considering",
    "short_explanation": "Used to express consideration of certain facts or circumstances before making a decision or judgement.",
    "long_explanation": "The Mandarin Chinese phrase '鉴于 (jiànyú)' is used to indicate that the following judgement or decision is made by considering or judging from certain facts or circumstances. It is equivalent to 'In light of' or 'Considering' in English. This phrase is quite formal and often used in written language, professional or legal contexts.",
    "formation": "鉴于 + Fact or Circumstance, + Decision or Judgement",
    "examples": [
      {
        "cn": "鉴于你对我公司的长期支持，我们决定赠送你一份礼物。",
        "pinyin": "Jiànyú nǐ duì wǒ gōngsī de chángqí zhīchí, wǒmen juédìng zèngsòng nǐ yī fèn lǐwù.",
        "en": "In light of your long-term support for our company, we have decided to give you a gift.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于你对我公司的长期支持我们决定赠送你一份礼物.mp3"
      },
      {
        "cn": "鉴于天气预报显示今天将下大雨，所以我们的野餐活动不得不取消。",
        "pinyin": "Jiànyú tiānqì yùbào xiǎnshì jīntiān jiāng xià dà yǔ, suǒyǐ wǒmen de yěcān huódòng bùdébù qǔxiāo.",
        "en": "Considering the weather forecast indicates it will rain heavily today, we had to cancel our picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于天气预报显示今天将下大雨所以我们的野餐活动不得不取消.mp3"
      },
      {
        "cn": "鉴于他的特殊贡献，我们决定授予他这个奖项。",
        "pinyin": "Jiànyú tā de tèshū gòngxiàn, wǒmen juédìng shòuyǔ tā zhège jiǎngxiàng.",
        "en": "In light of his special contribution, we decided to award him this prize.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于他的特殊贡献我们决定授予他这个奖项.mp3"
      },
      {
        "cn": "鉴于现在的经济形势，投资者需要更谨慎。",
        "pinyin": "Jiànyú xiànzài de jīngjì xíngshì, tóuzī zhě xūyào gèng jǐnshèn.",
        "en": "Considering the current economic situation, investors need to be more cautious.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_light_of_considering_20231230_鉴于现在的经济形势投资者需要更谨慎.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "毕竟 (bìjìng) - After all, in the end",
    "short_explanation": "Used to show that the following reason or fact is the key or ultimate factor in a situation.",
    "long_explanation": "The Mandarin Chinese phrase '毕竟 (bìjìng)' can be translated as 'after all' or 'in the end' in English. It is usually used to highlight a crucial factor or reason that overrides preceding reasons or arguments. It is used to express that despite other considerations, the important thing to remember is the point made after '毕竟'.",
    "formation": "毕竟 + statement/reason",
    "examples": [
      {
        "cn": "虽然他难过，但毕竟这是他的决定。",
        "pinyin": "Suīrán tā nán'guò, dàn bìjìng zhè shì tā de juédìng.",
        "en": "Although he is sad, it's his decision after all.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_in_the_end_20231230_虽然他难过但毕竟这是他的决定.mp3"
      },
      {
        "cn": "她可能是对的，毕竟她有更多的经验。",
        "pinyin": "Tā kěnéng shì duì de, bìjìng tā yǒu gèng duō de jīngyàn.",
        "en": "She might be right, after all, she has more experience.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_in_the_end_20231230_她可能是对的毕竟她有更多的经验.mp3"
      },
      {
        "cn": "我们毕竟是朋友，我不会让你面对困难一个人。",
        "pinyin": "Wǒmen bìjìng shì péngyǒu, wǒ bù huì ràng nǐ miàn duì kùnnan yī gè rén.",
        "en": "We are friends after all, I won't let you face difficulties alone.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_in_the_end_20231230_我们毕竟是朋友我不会让你面对困难一个人.mp3"
      },
      {
        "cn": "毕竟这是你的生活，你应该做出自己的决定。",
        "pinyin": "Bìjìng zhè shì nǐ de shēnghuó, nǐ yīnggāi zuò chū zìjǐ de juédìng.",
        "en": "After all, this is your life, you should make your own decisions.",
        "grammar_audio": "/audio/mandarin/grammar/s_毕竟_bìjìng_-_After_all_in_the_end_20231230_毕竟这是你的生活你应该做出自己的决定.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "相对 (xiāngduì) - Relative, comparatively",
    "short_explanation": "Used to indicate comparison between two things or situations",
    "long_explanation": "The Mandarin Chinese term '相对 (xiāngduì)' is used as an adverb to indicate comparison or relative to something. It can be used to describe something in comparison with another thing, emphasizing the situation is not absolute, but relative or comparative to the context.",
    "formation": "Subject + Verb + 相对 + Adjective/Phrase",
    "examples": [
      {
        "cn": "相对于其他的学生，他的中文讲得更流利。",
        "pinyin": "Xiāngduì yú qítā de xuéshēng, tā de Zhōngwén jiǎng de gèng liúlì.",
        "en": "Compared to other students, he speaks Chinese more fluently.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对_xiāngduì_-_Relative_comparatively_20231230_相对于其他的学生他的中文讲得更流利.mp3"
      },
      {
        "cn": "相对于去年，我们的销售额增长了一倍。",
        "pinyin": "Xiāngduì yú qùnián, wǒmen de xiāoshòu é zēngzhǎng le yībèi.",
        "en": "Compared to last year, our sales have doubled.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对_xiāngduì_-_Relative_comparatively_20231230_相对于去年我们的销售额增长了一倍.mp3"
      },
      {
        "cn": "相对于电影，我更喜欢读书。",
        "pinyin": "Xiāngduì yú diànyǐng, wǒ gèng xǐhuān dúshū.",
        "en": "Compared to watching movies, I prefer reading books.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对_xiāngduì_-_Relative_comparatively_20231230_相对于电影我更喜欢读书.mp3"
      },
      {
        "cn": "相对于住在城市，我更喜欢住在乡村。",
        "pinyin": "Xiāngduì yú zhù zài chéngshì, wǒ gèng xǐhuān zhù zài xiāngcūn.",
        "en": "Compared to living in the city, I prefer living in the countryside.",
        "grammar_audio": "/audio/mandarin/grammar/s_相对_xiāngduì_-_Relative_comparatively_20231230_相对于住在城市我更喜欢住在乡村.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "为此 (wèicǐ) - For this reason",
    "short_explanation": "Used to express the reason or cause for a certain action or situation.",
    "long_explanation": "The Mandarin Chinese phrase '为此 (wèicǐ)' is used to indicate the reason or cause for a certain action or event, similar to 'for this reason' or 'therefore' in English. It helps in providing an explanation or justification for a preceding event or situation.",
    "formation": "Event/Situation, 为此 + Resulting action",
    "examples": [
      {
        "cn": "他的健康状况不好，为此他决定开始健身。",
        "pinyin": "Tā de jiànkāng zhuàngkuàng bù hǎo, wèicǐ tā juédìng kāishǐ jiànshēn.",
        "en": "His health was not good, for this reason, he decided to start working out.",
        "grammar_audio": "/audio/mandarin/grammar/s_为此_wèicǐ_-_For_this_reason_20231230_他的健康状况不好为此他决定开始健身.mp3"
      },
      {
        "cn": "我们公司今年业绩非常好，为此，我们决定给所有员工发奖金。",
        "pinyin": "Wǒmen gōngsī jīnnián yèjì fēicháng hǎo, wèicǐ, wǒmen juédìng gěi suǒyǒu yuángōng fā jiǎngjīn.",
        "en": "Our company's performance this year was very good, for this reason, we decided to give all employees a bonus.",
        "grammar_audio": "/audio/mandarin/grammar/s_为此_wèicǐ_-_For_this_reason_20231230_我们公司今年业绩非常好为此我们决定给所有员工发奖金.mp3"
      },
      {
        "cn": "我妈妈对我做的蛋糕不满意，为此，她决定重新做一个。",
        "pinyin": "Wǒ māmā duì wǒ zuò de dàngāo bùmǎnyì, wèicǐ, tā juédìng chóngxīn zuò yīgè.",
        "en": "My mother was not satisfied with the cake I made, for this reason, she decided to make a new one.",
        "grammar_audio": "/audio/mandarin/grammar/s_为此_wèicǐ_-_For_this_reason_20231230_我妈妈对我做的蛋糕不满意为此她决定重新做一个.mp3"
      },
      {
        "cn": "为此，我们应该在适合的时间做出适合的选择。",
        "pinyin": "Wèicǐ, wǒmen yīnggāi zài shìhé de shíjiān zuò chū shìhé de xuǎnzé.",
        "en": "For this reason, we should make the right decisions at the right time.",
        "grammar_audio": "/audio/mandarin/grammar/s_为此_wèicǐ_-_For_this_reason_20231230_为此我们应该在适合的时间做出适合的选择.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "否定 (fǒudìng) - To deny, negate",
    "short_explanation": "Used to deny or negate an action or state.",
    "long_explanation": "The Mandarin Chinese word '否定 (fǒudìng)' refers to the denial or negation of an action, attribute or state. It joins with other verbs or adjectives to express a negative meaning. It is similar to the usage of 'not' in English, but is more formal.",
    "formation": "Subject + actions/adjective + 不/没 + Rest of the sentence",
    "examples": [
      {
        "cn": "我没有去商店，因为我没有时间。",
        "pinyin": "Wǒ méiyǒu qù shāngdiàn, yīnwèi wǒ méiyǒu shíjiān.",
        "en": "I didn't go to the store because I didn't have time.",
        "grammar_audio": "/audio/mandarin/grammar/s_否定_fǒudìng_-_To_deny_negate_20231230_我没有去商店因为我没有时间.mp3"
      },
      {
        "cn": "他不是我的朋友，他是我的同事。",
        "pinyin": "Tā bùshì wǒ de péngyǒu, tā shì wǒ de tóngshì.",
        "en": "He's not my friend, he's my colleague.",
        "grammar_audio": "/audio/mandarin/grammar/s_否定_fǒudìng_-_To_deny_negate_20231230_他不是我的朋友他是我的同事.mp3"
      },
      {
        "cn": "这张照片不是我拍的，是我姐姐拍的。",
        "pinyin": "Zhè zhāng zhàopiàn bùshì wǒ pāi de, shì wǒ jiějie pāi de.",
        "en": "This photo wasn't taken by me, it was taken by my sister.",
        "grammar_audio": "/audio/mandarin/grammar/s_否定_fǒudìng_-_To_deny_negate_20231230_这张照片不是我拍的是我姐姐拍的.mp3"
      },
      {
        "cn": "我们没在那个餐馆吃饭，我们在家吃的。",
        "pinyin": "Wǒmen méi zài nàgè cānguǎn chīfàn, wǒmen zài jiā chī de.",
        "en": "We didn't eat at that restaurant, we ate at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_否定_fǒudìng_-_To_deny_negate_20231230_我们没在那个餐馆吃饭我们在家吃的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "稍微 (shāowēi) - A bit, slightly",
    "short_explanation": "Used to express a small or slight degree or extent of something.",
    "long_explanation": "The Mandarin Chinese word '稍微 (shāowēi)' is used to indicate a small or slight degree or extent of something. It is often used to describe some slight actions, degree or minor changes in state, similar to 'a bit' or 'slightly' in English. You can use it to describe situations where things are not too much or not too little, just a slight or minor amount or degree.",
    "formation": "Subject + Verb + 稍微 + Adjective/Verb",
    "examples": [
      {
        "cn": "你可以稍微等一下我吗？我需要准备一下。",
        "pinyin": "Nǐ kěyǐ shāowēi děng yīxià wǒ ma? Wǒ xūyào zhǔnbèi yīxià.",
        "en": "Can you wait for me a bit? I need to prepare.",
        "grammar_audio": "/audio/mandarin/grammar/s_稍微_shāowēi_-_A_bit_slightly_20231230_你可以稍微等一下我吗我需要准备一下.mp3"
      },
      {
        "cn": "她只是稍微晚了一点，不用那么生气。",
        "pinyin": "Tā zhǐshì shāowēi wǎnle yīdiǎn, bùyòng nàme shēngqì.",
        "en": "She's just a bit late, no need to be so angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_稍微_shāowēi_-_A_bit_slightly_20231230_她只是稍微晚了一点不用那么生气.mp3"
      },
      {
        "cn": "他稍微改变了一下他的计划。",
        "pinyin": "Tā shāowēi gǎibiànle yīxià tā de jìhuà.",
        "en": "He slightly altered his plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_稍微_shāowēi_-_A_bit_slightly_20231230_他稍微改变了一下他的计划.mp3"
      },
      {
        "cn": "我稍微有点不舒服，但是我觉得不需要去看医生。",
        "pinyin": "Wǒ shāowēi yǒudiǎn bù shūfú, dànshì wǒ juédé bù xūyào qù kàn yīshēng.",
        "en": "I feel a bit uncomfortable, but I don't think I need to see a doctor.",
        "grammar_audio": "/audio/mandarin/grammar/s_稍微_shāowēi_-_A_bit_slightly_20231230_我稍微有点不舒服但是我觉得不需要去看医生.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "难怪 (nánguài) - No wonder, so that's why",
    "short_explanation": "Used to express realization or understanding of something that was previously unclear.",
    "long_explanation": "The Mandarin Chinese phrase '难怪 (nánguài)' is used when someone suddenly understands or realizes something that was previously confusing or unclear. It translates to 'no wonder' or 'so that's why' in English. It often indicates a moment of realization and goes along very well with the surprise tone.",
    "formation": "难怪 + Fact.",
    "examples": [
      {
        "cn": "难怪你昨天没来上班，原来你生病了。",
        "pinyin": "Nánguài nǐ zuótiān méi lái shàngbān, yuánlái nǐ shēngbìng le.",
        "en": "No wonder you didn't come to work yesterday, so you were sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪你昨天没来上班原来你生病了.mp3"
      },
      {
        "cn": "难怪外面这么闹，原来是有游行。",
        "pinyin": "Nánguài wàimiàn zhème nào, yuánlái shì yǒu yóuxíng.",
        "en": "No wonder it's so noisy outside, it turns out there's a parade.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪外面这么闹原来是有游行.mp3"
      },
      {
        "cn": "难怪他看起来这么累，他昨晚一直在工作。",
        "pinyin": "Nánguài tā kànqǐlái zhème lèi, tā zuówǎn yīzhí zài gōngzuò.",
        "en": "No wonder he looks so tired, he has been working all night.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪他看起来这么累他昨晚一直在工作.mp3"
      },
      {
        "cn": "难怪这份菜单看起来那么熟悉，我们之前在这家餐厅吃过饭。",
        "pinyin": "Nánguài zhè fèn càidān kànqǐlái nàme shúxī, wǒmen zhīqián zài zhè jiā cāntīng chīguò fàn.",
        "en": "No wonder this menu looks so familiar, we have eaten at this restaurant before.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪这份菜单看起来那么熟悉我们之前在这家餐厅吃过饭.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "要么...要么... (yàome... yàome...) - Either... or...",
    "short_explanation": "Used to present two or more alternative options or conditions.",
    "long_explanation": "The Mandarin Chinese pattern '要么...要么...' (yàome... yàome...) is equivalent to 'either... or...' in English. It is used to present two or more alternative options, possibilities, or conditions that are mutually exclusive. It highlights that if one option is chosen, the other option(s) cannot be.",
    "formation": "要么 + Option 1, 要么 + Option 2",
    "examples": [
      {
        "cn": "你要么去城市旅行，要么去海滩度假。",
        "pinyin": "Nǐ yàome qù chéngshì lǚxíng, yàome qù hǎitān dùjià.",
        "en": "Either you go for a city tour, or you go for a beach vacation.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么去城市旅行要么去海滩度假.mp3"
      },
      {
        "cn": "我要么接受这份工作，要么回家种地。",
        "pinyin": "Wǒ yàome jiēshòu zhè fèn gōngzuò, yàome huí jiā zhòng dì.",
        "en": "Either I accept this job, or I go home and farm.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_我要么接受这份工作要么回家种地.mp3"
      },
      {
        "cn": "你要么保持安静, 要么离开图书馆。",
        "pinyin": "Nǐ yàome bǎochí ānjìng, yàome líkāi túshūguǎn.",
        "en": "Either you keep quiet, or you leave the library.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_你要么保持安静_要么离开图书馆.mp3"
      },
      {
        "cn": "这个问题要么非常简单，要么非常复杂。",
        "pinyin": "Zhège wèntí yàome fēicháng jiǎndān, yàome fēicháng fùzá.",
        "en": "This problem is either very simple, or very complex.",
        "grammar_audio": "/audio/mandarin/grammar/s_要么要么_yàome_yàome_-_Either_or_20231230_这个问题要么非常简单要么非常复杂.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "于是 (yúshì) - Consequently, as a result",
    "short_explanation": "Used to indicate the result of a particular condition or circumstance.",
    "long_explanation": "The Mandarin Chinese phrase '于是 (yúshì)' is a conjunction used to show the outcome or result of a particular event, action, or situation. It implies cause and effect, and is comparable to 'consequently', 'as a result', 'then' or 'so then' in English. It frequently appears in narratives or explanations to clarify the sequence of events or actions.",
    "formation": "Condition + 于是 + Result",
    "examples": [
      {
        "cn": "他感觉很累，于是决定休息一下。",
        "pinyin": "Tā gǎnjué hěn lèi, yúshì juédìng xiūxí yīxià.",
        "en": "He felt very tired, and so he decided to rest for a while.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_Consequently_as_a_result_20231230_他感觉很累于是决定休息一下.mp3"
      },
      {
        "cn": "我发现我忘记带钱包了，于是我回家拿去。",
        "pinyin": "Wǒ fāxiàn wǒ wàngjì dài qiánbāo le, yúshì wǒ huíjiā ná qù.",
        "en": "I realized that I had forgotten my wallet, so I went home to get it.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_Consequently_as_a_result_20231230_我发现我忘记带钱包了于是我回家拿去.mp3"
      },
      {
        "cn": "她失去了工作，于是开始寻找新的工作机会。",
        "pinyin": "Tā shīqùle gōngzuò, yúshì kāishǐ xúnzhǎo xīn de gōngzuò jīhuì.",
        "en": "She lost her job, so she started looking for new job opportunities.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_Consequently_as_a_result_20231230_她失去了工作于是开始寻找新的工作机会.mp3"
      },
      {
        "cn": "他们感到饿了，于是去了最近的餐馆吃饭。",
        "pinyin": "Tāmen gǎndào èle, yúshì qùle zuìjìn de cāntīng chīfàn.",
        "en": "They felt hungry, so they went to the nearest restaurant to eat.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_Consequently_as_a_result_20231230_他们感到饿了于是去了最近的餐馆吃饭.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "绝不 (juébù) - Absolutely not, Under no circumstances",
    "short_explanation": "绝不 (juébù) is used to convey a strong refusal or denial, equivalent to 'Absolutely not' or 'Under no circumstances' in English.",
    "long_explanation": "The Mandarin Chinese adverb '绝不 (juébù)' is used to firmly assert that something will not happen or is not the case. It is used to express a very strong or emphatic negative statement. When using '绝不', the speaker's tone often implies determination, or an emphasis on the refusal or denial.",
    "formation": "Subject + 绝不 + Verb + Object",
    "examples": [
      {
        "cn": "我绝不会忘记你给我最美好的记忆。",
        "pinyin": "Wǒ juébù huì wàngjì nǐ gěi wǒ zuì měihǎo de jìyì.",
        "en": "I will absolutely not forget the most beautiful memories you gave me.",
        "grammar_audio": "/audio/mandarin/grammar/s_绝不_juébù_-_Absolutely_not_Under_no_circumstances_20231230_我绝不会忘记你给我最美好的记忆.mp3"
      },
      {
        "cn": "为了环保，我们绝不使用一次性塑料袋。",
        "pinyin": "Wèile huánbǎo, wǒmen juébù shǐyòng yīcìxìng sùliào dài.",
        "en": "For the sake of the environment, we absolutely will not use disposable plastic bags.",
        "grammar_audio": "/audio/mandarin/grammar/s_绝不_juébù_-_Absolutely_not_Under_no_circumstances_20231230_为了环保我们绝不使用一次性塑料袋.mp3"
      },
      {
        "cn": "他绝不会承认自己的错误。",
        "pinyin": "Tā juébù huì chéngrèn zìjǐ de cuòwù.",
        "en": "He will absolutely not admit his own mistakes.",
        "grammar_audio": "/audio/mandarin/grammar/s_绝不_juébù_-_Absolutely_not_Under_no_circumstances_20231230_他绝不会承认自己的错误.mp3"
      },
      {
        "cn": "绝不放弃，这是我们的原则。",
        "pinyin": "Juébù fàngqì, zhè shì wǒmen de yuánzé.",
        "en": "We absolutely will not give up, this is our principle.",
        "grammar_audio": "/audio/mandarin/grammar/s_绝不_juébù_-_Absolutely_not_Under_no_circumstances_20231230_绝不放弃这是我们的原则.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "在于 (zàiyú) - Lies in, resides in",
    "short_explanation": "在于 (zàiyú) is used to express the reason, cause, or essence of something, meaning 'lies in' or 'resides in'.",
    "long_explanation": "The phrase '在于 (zàiyú)' in Mandarin Chinese is used to point to the key aspect or the main reason of something. It equates to 'lies in' or 'resides in' in English. This conjunction is commonly used to express the crux or essence of an issue, problem, situation, etc. or to highlight the main factor that affects an outcome.",
    "formation": "Subject + 在于 + Reason/Factor/Aspect",
    "examples": [
      {
        "cn": "学习任何语言的秘诀在于勤奋和坚持。",
        "pinyin": "Xuéxí rènhé yǔyán de mìjùe zàiyú qínfèn hé jiānchí.",
        "en": "The key to learning any language lies in diligence and persistence.",
        "grammar_audio": "/audio/mandarin/grammar/s_在于_zàiyú_-_Lies_in_resides_in_20231230_学习任何语言的秘诀在于勤奋和坚持.mp3"
      },
      {
        "cn": "成功的关键在于不断的努力和练习。",
        "pinyin": "Chénggōng de guānjiàn zàiyú búduàn de nǔlì hé liànxí.",
        "en": "The key to success lies in constant effort and practice.",
        "grammar_audio": "/audio/mandarin/grammar/s_在于_zàiyú_-_Lies_in_resides_in_20231230_成功的关键在于不断的努力和练习.mp3"
      },
      {
        "cn": "这个问题的解决在于我们大家的合作。",
        "pinyin": "Zhège wèntí de jiějué zàiyú wǒmen dàjiā de hézuò.",
        "en": "The solution to this problem lies in our cooperation.",
        "grammar_audio": "/audio/mandarin/grammar/s_在于_zàiyú_-_Lies_in_resides_in_20231230_这个问题的解决在于我们大家的合作.mp3"
      },
      {
        "cn": "健康的秘诀在于均衡的饮食和适量的运动。",
        "pinyin": "Jiànkāng de mìjùe zàiyú jūnhéng de yǐnshí hé shìliàng de yùndòng.",
        "en": "The secret to health lies in a balanced diet and moderate exercise.",
        "grammar_audio": "/audio/mandarin/grammar/s_在于_zàiyú_-_Lies_in_resides_in_20231230_健康的秘诀在于均衡的饮食和适量的运动.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "至少 (zhìshǎo) - At least",
    "short_explanation": "Used to express the minimum amount or degree of something.",
    "long_explanation": "The Mandarin Chinese phrase '至少 (zhìshǎo)' is used to indicate the minimum amount or degree of something that is required, accepted, or possible. It is equivalent to the English phrase 'at least'. This phrase can be used to express a suggestion, a condition, or a minimum requirement.",
    "formation": "至少 + Quantity/Measure Word + Noun/Verb",
    "examples": [
      {
        "cn": "我每天至少要读一个小时的书。",
        "pinyin": "Wǒ měitiān zhìshǎo yào dú yīgè xiǎoshí de shū.",
        "en": "I need to read for at least an hour every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_我每天至少要读一个小时的书.mp3"
      },
      {
        "cn": "你应该至少喝八杯水。",
        "pinyin": "Nǐ yīnggāi zhìshǎo hē bā bēi shuǐ.",
        "en": "You should drink at least eight glasses of water.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_你应该至少喝八杯水.mp3"
      },
      {
        "cn": "我们至少需要两个星期的时间来完成这个项目。",
        "pinyin": "Wǒmen zhìshǎo xūyào liǎng gè xīngqī de shíjiān lái wánchéng zhège xiàngmù.",
        "en": "We need at least two weeks to complete this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_我们至少需要两个星期的时间来完成这个项目.mp3"
      },
      {
        "cn": "他至少有三个不同的意见。",
        "pinyin": "Tā zhìshǎo yǒu sān gè bùtóng de yìjiàn.",
        "en": "He has at least three different opinions.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_他至少有三个不同的意见.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "从此 (cóngcǐ) - Since then, from that time on",
    "short_explanation": "Used to indicate the start of a situation or state that continues from a certain point in time.",
    "long_explanation": "'从此 (cóngcǐ)' is a Mandarin Chinese expression which means 'since then' or 'from that time on'. It is commonly used in narratives to transition to events or conditions that started at a certain time point and continue to the present, or lasted a long time. It highlights the continuation of the state or circumstances after an indicated event or time.",
    "formation": "从此 + (时间词) + Predicate ",
    "examples": [
      {
        "cn": "他小时候去过一次北京，从此就爱上了这个城市。",
        "pinyin": "Tā xiǎoshíhou qùguò yí cì Běijīng, cóngcǐ jiù ài shàng le zhège chéngshì.",
        "en": "He went to Beijing once when he was a child, and he fell in love with the city from then on.",
        "grammar_audio": "/audio/mandarin/grammar/s_从此_cóngcǐ_-_Since_then_from_that_time_on_20231230_他小时候去过一次北京从此就爱上了这个城市.mp3"
      },
      {
        "cn": "我上大学的时候听了一场摇滚音乐会，从此我就成了摇滚乐的忠实粉丝。",
        "pinyin": "Wǒ shàng dàxué de shíhou tīngle yī chǎng yáogǔn yīnyuè huì, cóngcǐ wǒ jiù chéngle yáogǔn yuè de zhōngshí fěnsī.",
        "en": "I attended a rock concert when I was in college, and since then I have become a faithful fan of rock music.",
        "grammar_audio": "/audio/mandarin/grammar/s_从此_cóngcǐ_-_Since_then_from_that_time_on_20231230_我上大学的时候听了一场摇滚音乐会从此我就成了摇滚乐的忠实粉丝.mp3"
      },
      {
        "cn": "从2010年起，从此我就开始每年都去旅行。",
        "pinyin": "Cóng 2010 nián qǐ, cóngcǐ wǒ jiù kāishǐ měi nián dōu qù lǚxíng.",
        "en": "Starting from the year 2010, I have started traveling every year since then.",
        "grammar_audio": "/audio/mandarin/grammar/s_从此_cóngcǐ_-_Since_then_from_that_time_on_20231230_从2010年起从此我就开始每年都去旅行.mp3"
      },
      {
        "cn": "他遭遇了一次严重的事故，从此他的生活彻底改变了。",
        "pinyin": "Tā zāoyùle yīcì yánzhòng de shìgù, cóngcǐ tā de shēnghuó chèdǐ gǎibiànle.",
        "en": "He had a serious accident, and since then his life has completely changed.",
        "grammar_audio": "/audio/mandarin/grammar/s_从此_cóngcǐ_-_Since_then_from_that_time_on_20231230_他遭遇了一次严重的事故从此他的生活彻底改变了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "避免 (bìmiǎn) - To avoid",
    "short_explanation": "避免 (bìmiǎn) is a verb used to indicate the action of avoiding or preventing something.",
    "long_explanation": "The Mandarin Chinese verb '避免 (bìmiǎn)' is used to describe the act of avoiding or preventing something undesirable from occurring. It is similar to applying the English word 'avoid' in sentences. The object being avoided often follows this verb, and the entire action forms the predicate of the sentence.",
    "formation": "Subject + 避免 + Object",
    "examples": [
      {
        "cn": "我选择健康的饮食以避免生病。",
        "pinyin": "Wǒ xuǎnzé jiànkāng de yǐnshí yǐ bìmiǎn shēngbìng.",
        "en": "I choose a healthy diet to avoid getting sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_20231230_我选择健康的饮食以避免生病.mp3"
      },
      {
        "cn": "我们应该限制赤字开支以避免经济崩溃。",
        "pinyin": "Wǒmen yīnggāi xiànzhì chìzì kāizhī yǐ bìmiǎn jīngjì bēngkuì.",
        "en": "We should limit deficit spending to avoid economic collapse.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_20231230_我们应该限制赤字开支以避免经济崩溃.mp3"
      },
      {
        "cn": "为了避免浪费，她总是把剩饭吃完。",
        "pinyin": "Wèile bìmiǎn làngfèi, tā zǒng shì bǎ shèng fàn chī wán.",
        "en": "To avoid waste, she always finishes her leftovers.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_20231230_为了避免浪费她总是把剩饭吃完.mp3"
      },
      {
        "cn": "他悄悄地走以避免唤醒儿子。",
        "pinyin": "Tā qiāoqiāo de zǒu yǐ bìmiǎn huànxǐng érzi.",
        "en": "He walked quietly to avoid waking his son.",
        "grammar_audio": "/audio/mandarin/grammar/s_避免_bìmiǎn_-_To_avoid_20231230_他悄悄地走以避免唤醒儿子.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "非但 (fēidàn) - Not only",
    "short_explanation": "It is used to express 'not only... but also...' in English language.",
    "long_explanation": "The phrase '非但 (fēidàn)' is a conjunction used to indicate that not only a certain situation is true but also some additional information follows. It is often used in tandem with '而且 (érqiě)', meaning 'but also', to form a structure similar to 'not only... but also...' in English. '非但' emphasizes the first part of the sentence, and '而且' introduces the additional information.",
    "formation": "非但 + Sentence 1, 而且 + Sentence 2",
    "examples": [
      {
        "cn": "他非但善良，而且很聪明。",
        "pinyin": "Tā fēidàn shànliáng, érqiě hěn cōngmíng.",
        "en": "Not only is he kind, but he is also very smart.",
        "grammar_audio": "/audio/mandarin/grammar/s_非但_fēidàn_-_Not_only_20231230_他非但善良而且很聪明.mp3"
      },
      {
        "cn": "我非但需要学习汉语，而且我想了解中国的历史和文化。",
        "pinyin": "Wǒ fēidàn xūyào xuéxí Hànyǔ, érqiě wǒ xiǎng liǎojiě Zhōngguó de lìshǐ hé wénhuà.",
        "en": "Not only do I need to learn Chinese, but I also want to understand China's history and culture.",
        "grammar_audio": "/audio/mandarin/grammar/s_非但_fēidàn_-_Not_only_20231230_我非但需要学习汉语而且我想了解中国的历史和文化.mp3"
      },
      {
        "cn": "她非但会做饭，而且还会弹钢琴。",
        "pinyin": "Tā fēidàn huì zuò fàn, érqiě hái huì dàn gāngqín.",
        "en": "Not only can she cook, but she can also play the piano.",
        "grammar_audio": "/audio/mandarin/grammar/s_非但_fēidàn_-_Not_only_20231230_她非但会做饭而且还会弹钢琴.mp3"
      },
      {
        "cn": "这台电视非但价格便宜，而且质量还很好。",
        "pinyin": "Zhè tái diànshì fēidàn jiàgé piányi, érqiě zhìliàng hái hěn hǎo.",
        "en": "Not only is this TV cheap, but its quality is also good.",
        "grammar_audio": "/audio/mandarin/grammar/s_非但_fēidàn_-_Not_only_20231230_这台电视非但价格便宜而且质量还很好.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "其中 (qízhōng) - Among, amongst",
    "short_explanation": "It is used to denote a specific portion or select members within a larger group.",
    "long_explanation": "The Mandarin Chinese term '其中 (qízhōng)' is used to refer to 'among' or 'amongst' in English. This term is used when we want to point out a specific subset or some members within a larger group, collection, or set. It conveys the meaning that a particular action or event involves a portion of the group rather than the entire group.",
    "formation": "总的 + (Noun) + 其中 + (Specific subset or details)",
    "examples": [
      {
        "cn": "我有很多朋友，其中有些人是我在大学时代认识的。",
        "pinyin": "Wǒ yǒu hěnduō péngyǒu, qízhōng yǒuxiē rén shì wǒ zài dàxué shídài rènshí de.",
        "en": "I have many friends, among whom some are people I met in my university days.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_amongst_20231230_我有很多朋友其中有些人是我在大学时代认识的.mp3"
      },
      {
        "cn": "这家店里有许多美食，其中的披萨和寿司是最受欢迎的。",
        "pinyin": "Zhè jiā diàn lǐ yǒu xǔduō měishí, qízhōng de pīsà hé shòusī shì zuì shòuhuānyíng de.",
        "en": "There are many delicacies in this shop, among which pizza and sushi are the most popular.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_amongst_20231230_这家店里有许多美食其中的披萨和寿司是最受欢迎的.mp3"
      },
      {
        "cn": "我们公司有五十个员工，其中半数来自其他国家。",
        "pinyin": "Wǒmen gōngsī yǒu wǔshí gè yuángōng, qízhōng bànshù láizì qítā guójiā.",
        "en": "Our company has fifty employees, half of whom come from other countries.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_amongst_20231230_我们公司有五十个员工其中半数来自其他国家.mp3"
      },
      {
        "cn": "他已经读了十本书，其中三本是我推荐的。",
        "pinyin": "Tā yǐjīng dú le shí běn shū, qízhōng sān běn shì wǒ tuījiàn de.",
        "en": "He has already read ten books, three of which I recommended.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_amongst_20231230_他已经读了十本书其中三本是我推荐的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "一方面...另一方面... (yī fāngmiàn... lìng yī fāngmiàn...) - On one hand... on the other hand...",
    "short_explanation": "Used for presenting two contrasting aspects or perspectives of a topic.",
    "long_explanation": "The Mandarin Chinese expression '一方面...另一方面...' (yī fāngmiàn... lìng yī fāngmiàn...) is used to present two contrasting aspects or perspectives of a topic. It is equivalent to 'On one hand... on the other hand...' in English. This pattern helps to express contrasting ideas or behaviors that can coexist for an individual, an object, or a situation.",
    "formation": "一方面 + Statement 1, 另一方面 + Statement 2",
    "examples": [
      {
        "cn": "一方面，她是一个很善良的人，另一方面，她又是个很严格的老师。",
        "pinyin": "Yī fāngmiàn, tā shì yīgè hěn shànliáng de rén, lìng yī fāngmiàn, tā yòu shì gè hěn yángé de lǎoshī.",
        "en": "On one hand, she is a very kind person, on the other hand, she is a very strict teacher.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面她是一个很善良的人另一方面她又是个很严格的老师.mp3"
      },
      {
        "cn": "一方面，我想去旅游，另一方面，我要节约钱。",
        "pinyin": "Yī fāngmiàn, wǒ xiǎng qù lǚyóu, lìng yī fāngmiàn, wǒ yào jiéyuē qián.",
        "en": "On one hand, I want to travel, on the other hand, I need to save money.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我想去旅游另一方面我要节约钱.mp3"
      },
      {
        "cn": "一方面，他们需要引进新技术，另一方面，他们又必须保护环境。",
        "pinyin": "Yī fāngmiàn, tāmen xūyào yǐnjìn xīn jìshù, lìng yī fāngmiàn, tāmen yòu bìxū bǎohù huánjìng.",
        "en": "On one hand, they need to introduce new technologies, on the other hand, they must protect the environment.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面他们需要引进新技术另一方面他们又必须保护环境.mp3"
      },
      {
        "cn": "一方面，我喜欢独立，另一方面，我却讨厌孤独。",
        "pinyin": "Yī fāngmiàn, wǒ xǐhuān dúlì, lìng yī fāngmiàn, wǒ què tǎoyàn gūdú.",
        "en": "On one hand, I like being independent, on the other hand, I hate being alone.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我喜欢独立另一方面我却讨厌孤独.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "既然 (jìrán) - Since, given that",
    "short_explanation": "The Chinese word '既然 (jìrán)' is used to express the idea of 'since' or 'given that' in English. It acknowledges a certain fact or condition, and then describes the logical or expected action or result based on that condition.",
    "long_explanation": "In Mandarin Chinese, '既然 (jìrán)' is used when indicating that since a certain situation is the case, something else should logically follow or is expected to happen. It is like saying 'given that' or 'since' in English, and is generally followed by a conclusion or result based on the stated condition or fact.",
    "formation": "既然 + Fact/Condition, + Conclusion/ Result",
    "examples": [
      {
        "cn": "既然你已经决定了，那我就支持你。",
        "pinyin": "Jìrán nǐ yǐjīng juédìngle, nà wǒ jiù zhīchí nǐ.",
        "en": "Since you've already decided, I will support you.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然你已经决定了那我就支持你.mp3"
      },
      {
        "cn": "既然你不喜欢吃鱼，我们就点别的菜吧。",
        "pinyin": "Jìrán nǐ bù xǐhuān chī yú, wǒmen jiù diǎn bié de cài ba.",
        "en": "Since you don't like to eat fish, let's order other dishes.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然你不喜欢吃鱼我们就点别的菜吧.mp3"
      },
      {
        "cn": "既然下雨了，我们就不去公园了。",
        "pinyin": "Jìrán xià yǔle, wǒmen jiù bù qù gōngyuánle.",
        "en": "Since it's raining, we won't go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然下雨了我们就不去公园了.mp3"
      },
      {
        "cn": "既然你疲劳，你应该早点休息。",
        "pinyin": "Jìrán nǐ píláo, nǐ yīnggāi zǎodiǎn xiūxí.",
        "en": "Since you're tired, you should rest earlier.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_given_that_20231230_既然你疲劳你应该早点休息.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "即便 (jíbiàn) - Even if, even though",
    "short_explanation": "Used to express the premise of a hypothetical situation, regardless of the outcome.",
    "long_explanation": "'即便 (jíbiàn)' is a conjunction that is commonly used in Mandarin Chinese to express a hypothetical condition, similar to 'even though' or 'even if' in English. It sets up a concession or contrary condition in a sentence, but does not change the conclusion or final result.",
    "formation": "即便 + Condition/Subject, Verb/Adjective + Rest of sentence",
    "examples": [
      {
        "cn": "即便我们的飞机晚点了, 我们还是会尽快地赶到那里。",
        "pinyin": "Jíbiàn wǒmen de fēijī wǎn diǎn le, wǒmen háishi huì jǐnkuài dì gǎn dào nàlǐ.",
        "en": "Even if our plane is delayed, we will still get there as soon as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便我们的飞机晚点了_我们还是会尽快地赶到那里.mp3"
      },
      {
        "cn": "即便你不同意我的观点, 我也不会改变我的立场。",
        "pinyin": "Jíbiàn nǐ bù tóngyì wǒ de guāndiǎn, wǒ yě bù huì gǎibiàn wǒ de lìchǎng.",
        "en": "Even if you don't agree with my opinion, I will not change my position.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便你不同意我的观点_我也不会改变我的立场.mp3"
      },
      {
        "cn": "即便天气不好, 我们的比赛依然会进行。",
        "pinyin": "Jíbiàn tiānqì bù hǎo, wǒmen de bǐsài yīrán huì jìnxíng.",
        "en": "Even if the weather is bad, our match will still go on.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便天气不好_我们的比赛依然会进行.mp3"
      },
      {
        "cn": "即便你不喜欢这部电影, 我还是想看。",
        "pinyin": "Jíbiàn nǐ bù xǐhuān zhè bù diànyǐng, wǒ háishì xiǎng kàn.",
        "en": "Even if you don't like this movie, I still want to watch it.",
        "grammar_audio": "/audio/mandarin/grammar/s_即便_jíbiàn_-_Even_if_even_though_20231230_即便你不喜欢这部电影_我还是想看.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "既...又... (jì... yòu...) - Both... and...",
    "short_explanation": "Used to express that something or someone has two or more qualities or characteristics concurrently.",
    "long_explanation": "The Mandarin Chinese phrase '既...又...' (jì... yòu...) is used to indicate that something or someone possesses two or more qualities or characteristics at the same time. It translates as 'both...and...' in English. This structure helps to emphasize the simultaneity of the properties or actions.",
    "formation": "Subject + 既 + adjective/verb1 + 又 + adjective/verb2",
    "examples": [
      {
        "cn": "她既聪明又美丽，真是令人羡慕。",
        "pinyin": "Tā jì cōngmíng yòu měilì, zhēnshì lìng rén xiànmù.",
        "en": "She is both intelligent and beautiful, truly admirable.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_她既聪明又美丽真是令人羡慕.mp3"
      },
      {
        "cn": "这部电影既搞笑又感人，我非常喜欢。",
        "pinyin": "Zhè bù diànyǐng jì gǎoxiào yòu gǎnrén, wǒ fēicháng xǐhuān.",
        "en": "This movie is both funny and touching, I like it very much.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这部电影既搞笑又感人我非常喜欢.mp3"
      },
      {
        "cn": "我既要工作又要照顾我病了的母亲，真是身心俱疲。",
        "pinyin": "Wǒ jì yào gōngzuò yòu yào zhàogù wǒ bìng le de mǔqīn, zhēnshì shēnxīn jù pí.",
        "en": "I have to both work and take care of my sick mother, I'm truly exhausted.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_我既要工作又要照顾我病了的母亲真是身心俱疲.mp3"
      },
      {
        "cn": "这家餐馆的菜既好吃又便宜，我经常来这里。",
        "pinyin": "Zhè jiā cānguǎn de cài jì hǎochī yòu piányí, wǒ jīngcháng lái zhèlǐ.",
        "en": "The food at this restaurant is both delicious and affordable, I come here often.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这家餐馆的菜既好吃又便宜我经常来这里.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "25"
  },
  {
    "title": "偶尔 (ǒu'ěr) - Occasionally, once in a while",
    "short_explanation": "Used to indicate that something happens not very often, but sometimes.",
    "long_explanation": "The Mandarin Chinese word '偶尔 (ǒu'ěr)' is a frequency adverb used to express the occasional occurrence of an event or situation. It is directly equivalent to 'occasionally' or 'once in a while' in English. Unlike English, however, '偶尔' is directly used before the verb/action you want to express 'occasionally' happening.",
    "formation": "Subject + 偶尔 + Verb + Object.",
    "examples": [
      {
        "cn": "我偶尔会去公园散步。",
        "pinyin": "Wǒ ǒu'ěr huì qù gōngyuán sànbù.",
        "en": "I occasionally go to the park for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_once_in_a_while_20231230_我偶尔会去公园散步.mp3"
      },
      {
        "cn": "他偶尔晚上会吃一些小吃。",
        "pinyin": "Tā ǒu'ěr wǎnshàng huì chī yīxiē xiǎochī.",
        "en": "He occasionally eats some snacks in the evening.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_once_in_a_while_20231230_他偶尔晚上会吃一些小吃.mp3"
      },
      {
        "cn": "你会偶尔去图书馆看书吗？",
        "pinyin": "Nǐ huì ǒu'ěr qù túshūguǎn kànshū ma?",
        "en": "Do you go to the library to read books occasionally?",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_once_in_a_while_20231230_你会偶尔去图书馆看书吗.mp3"
      },
      {
        "cn": "他们偶尔会在周末去看电影。",
        "pinyin": "Tāmen ǒu'ěr huì zài zhōumò qù kàn diànyǐng.",
        "en": "They occasionally go to see a movie on the weekend.",
        "grammar_audio": "/audio/mandarin/grammar/s_偶尔_ǒuěr_-_Occasionally_once_in_a_while_20231230_他们偶尔会在周末去看电影.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "并非 (bìngfēi) - Not at all, is not",
    "short_explanation": "This is used to express strong denial, it is a formal way to say 'not'.",
    "long_explanation": "The Mandarin Chinese term '并非 (bìngfēi)' is a formal way of negating a statement or condition, conveying the meaning of 'not at all' or 'is not'. It can be used in both spoken and written language to emphasize a strong denial. Unlike the more common '不是', '并非' is often used in more formal settings or written language.",
    "formation": "Subject + 并非 + Predicate",
    "examples": [
      {
        "cn": "他并非我所预期的那种人。",
        "pinyin": "Tā bìngfēi wǒ suǒ yùqí de nà zhǒng rén.",
        "en": "He is not at all the kind of person I expected.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_他并非我所预期的那种人.mp3"
      },
      {
        "cn": "这种观点并非没有道理。",
        "pinyin": "Zhè zhǒng guāndiǎn bìngfēi méiyǒu dàolǐ.",
        "en": "This viewpoint is not without reason.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_这种观点并非没有道理.mp3"
      },
      {
        "cn": "他的成功并非偶然。",
        "pinyin": "Tā de chénggōng bìngfēi ǒurán.",
        "en": "His success is not accidental.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_他的成功并非偶然.mp3"
      },
      {
        "cn": "乔治并非老板的儿子，他只是个实习生。",
        "pinyin": "Qiáo zhī bìngfēi lǎobǎn de érzi, tā zhǐshì gè shíxí shēng.",
        "en": "George is not the boss's son, he's just an intern.",
        "grammar_audio": "/audio/mandarin/grammar/s_并非_bìngfēi_-_Not_at_all_is_not_20231230_乔治并非老板的儿子他只是个实习生.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "似乎 (sìhū) - Seems, appears",
    "short_explanation": "Used to suggest that something appears to be the case or looks like something.",
    "long_explanation": "The Mandarin Chinese word '似乎 (sìhū)' is often used to convey the sense that an event seems to be the case or a person or a thing seems to have a certain characteristic. It is similar to saying 'seems' or 'appears to be' in English. '似乎' allows the speaker to express uncertain or indirect observations or assumptions.",
    "formation": "Subject + 似乎 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他似乎喜欢上了她，但是从未直接向她表白。",
        "pinyin": "Tā sìhū xǐhuān shàng le tā, dànshì cóngwèi zhíjiē xiàng tā biǎobái.",
        "en": "He seems to have fallen for her, but he never directly confessed to her.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_Seems_appears_20231230_他似乎喜欢上了她但是从未直接向她表白.mp3"
      },
      {
        "cn": "这个问题似乎很难解决，我们需要更多的时间去考虑。",
        "pinyin": "Zhège wèntí sìhū hěn nán jiějué, wǒmen xūyào gèngduō de shíjiān qù kǎolǜ.",
        "en": "This issue seems very difficult to resolve, we need more time to consider it.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_Seems_appears_20231230_这个问题似乎很难解决我们需要更多的时间去考虑.mp3"
      },
      {
        "cn": "这个菜似乎有点咸，你可以试试看。",
        "pinyin": "Zhège cài sìhū yǒudiǎn xián, nǐ kěyǐ shìshì kàn.",
        "en": "This dish seems a bit salty, you can try it.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_Seems_appears_20231230_这个菜似乎有点咸你可以试试看.mp3"
      },
      {
        "cn": "明天的天气似乎会很好，我们可以去公园野餐。",
        "pinyin": "Míngtiān de tiānqì sìhū huì hěn hǎo, wǒmen kěyǐ qù gōngyuán yěcān.",
        "en": "Tomorrow's weather seems to be good, we can have a picnic in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_似乎_sìhū_-_Seems_appears_20231230_明天的天气似乎会很好我们可以去公园野餐.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "逐渐 (zhújiàn) - Gradually",
    "short_explanation": "Used to express a gradual change or progress over time.",
    "long_explanation": "The Mandarin Chinese word '逐渐 (zhújiàn)' is used to illustrate a scenario where something changes, evolves, or progresses slowly over a certain period of time. It equates to 'gradually' or 'little by little' in English, and is generally placed, followed by a verb, in the predicate of a sentence.",
    "formation": "Subject + 逐渐 + Verb + Object",
    "examples": [
      {
        "cn": "他逐渐适应了新的工作环境。",
        "pinyin": "Tā zhújiàn shìyìng le xīn de gōngzuò huánjìng.",
        "en": "He gradually adapted to the new work environment.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_他逐渐适应了新的工作环境.mp3"
      },
      {
        "cn": "随着时间的推移，秋天的颜色逐渐变得丰富。",
        "pinyin": "Suízhe shíjiān de tuīyí, qiūtiān de yánsè zhújiàn biàn dé fēngfù.",
        "en": "As time went on, the colors of autumn gradually became rich.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_随着时间的推移秋天的颜色逐渐变得丰富.mp3"
      },
      {
        "cn": "怀孕后，她的胃口逐渐增大。",
        "pinyin": "Huáiyùn hòu, tā de wèikǒu zhújiàn zēngdà.",
        "en": "After getting pregnant, her appetite gradually increased.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_怀孕后她的胃口逐渐增大.mp3"
      },
      {
        "cn": "在登山过程中，我们逐渐看到了美丽的风景。",
        "pinyin": "Zài dēngshān guòchéng zhōng, wǒmen zhújiàn kàn dào le měilì de fēngjǐng.",
        "en": "During the climbing process, we gradually saw beautiful scenery.",
        "grammar_audio": "/audio/mandarin/grammar/s_逐渐_zhújiàn_-_Gradually_20231230_在登山过程中我们逐渐看到了美丽的风景.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "因此 (yīncǐ) - Therefore, thus",
    "short_explanation": "Used to express the result or consequence of a certain action or event.",
    "long_explanation": "The Mandarin Chinese term '因此 (yīncǐ)' is a conjunction often used to indicate the result or consequence of a certain action or event. It is equivalent to 'therefore' or 'thus' in English. Its use allows for a logical flow of ideas, leading to conclusions based on previously stated facts or assumptions.",
    "formation": "Fact or action + 因此 + Result or consequence",
    "examples": [
      {
        "cn": "他经常运动，因此他的身体非常健康。",
        "pinyin": "Tā jīngcháng yùndòng, yīncǐ tā de shēntǐ fēicháng jiànkāng.",
        "en": "He exercises regularly, therefore his body is very healthy.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_thus_20231230_他经常运动因此他的身体非常健康.mp3"
      },
      {
        "cn": "我没有带伞，因此我被雨淋湿了。",
        "pinyin": "Wǒ méiyǒu dài sǎn, yīncǐ wǒ bèi yǔ línshī le.",
        "en": "I didn't bring an umbrella, therefore I got soaked in the rain.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_thus_20231230_我没有带伞因此我被雨淋湿了.mp3"
      },
      {
        "cn": "她没能提前预习，因此在课堂上有点跟不上。",
        "pinyin": "Tā méinéng tíqián yùxí, yīncǐ zài kètáng shàng yǒudiǎn gēn bù shàng.",
        "en": "She didn't manage to preview the lesson in advance, therefore she is a bit behind in the class.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_thus_20231230_她没能提前预习因此在课堂上有点跟不上.mp3"
      },
      {
        "cn": "我们没有仔细检查，因此发生了一个错误。",
        "pinyin": "Wǒmen méiyǒu zǐxì jiǎnchá, yīncǐ fāshēngle yīgè cuòwù.",
        "en": "We didn't check carefully, therefore a mistake occurred.",
        "grammar_audio": "/audio/mandarin/grammar/s_因此_yīncǐ_-_Therefore_thus_20231230_我们没有仔细检查因此发生了一个错误.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "只有...才... (zhǐyǒu... cái...) - Only if/when... then...",
    "short_explanation": "Used to express that only in particular circumstances, a certain result can happen.",
    "long_explanation": "The Mandarin Chinese structure '只有...才...' is used to indicate the conditional relationship between two aspects of a situation, expressing 'only if...' or 'only when...' something happens, then the other thing can take place. It emphasizes the exclusiveness of the condition and the inevitability of the result.",
    "formation": "只有 + Condition + 才 + Result",
    "examples": [
      {
        "cn": "只有通过持续的努力，你才能实现你的目标。",
        "pinyin": "Zhǐyǒu tōngguò chíxù de nǔlì, nǐ cái néng shíxiàn nǐ de mùbiāo.",
        "en": "Only through continuous effort can you achieve your goals.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有通过持续的努力你才能实现你的目标.mp3"
      },
      {
        "cn": "只有当他了解到全情况之后，他才做出了决定。",
        "pinyin": "Zhǐyǒu dāng tā liǎojiě dào quán qíngkuàng zhīhòu, tā cái zuò chūle juédìng.",
        "en": "Only after he understood the whole situation did he make a decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有当他了解到全情况之后他才做出了决定.mp3"
      },
      {
        "cn": "只有保存好环境，我们的后代才能拥有美好的生活。",
        "pinyin": "Zhǐyǒu bǎocún hǎo huánjìng, wǒmen de hòudài cái néng yǒngyǒu měihǎo de shēnghuó.",
        "en": "Only by preserving the environment can our future generations have a good life.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有保存好环境我们的后代才能拥有美好的生活.mp3"
      },
      {
        "cn": "只有你每天都练习，你才能在这个考试中得高分。",
        "pinyin": "Zhǐyǒu nǐ měitiān dū liànxí, nǐ cái néng zài zhège kǎoshì zhōng dé gāofēn.",
        "en": "Only if you practice every day can you score high in this exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if/when_then_20231230_只有你每天都练习你才能在这个考试中得高分.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "何况 (hékuàng) - Let alone, moreover",
    "short_explanation": "Used to present a stronger point after a weaker one, also translated as 'let alone' or 'not to mention'.",
    "long_explanation": "The Mandarin Chinese term '何况 (hékuàng)' functions to intensify the argument by introducing an even more persuasive point after the first statement has been made. It could be translated as 'let alone,' 'not to mention,' or 'moreover'. The introduced statement typically represents a condition that is either more severe, more important, or more unlikely to happen compared to the first statement.",
    "formation": "Statement A + , + 何况 + Statement B?",
    "examples": [
      {
        "cn": "我连普通的中国菜都做不好，何况这么复杂的法国菜呢？",
        "pinyin": "Wǒ lián pǔtōng de Zhōngguó cài dōu zuò bù hǎo, hékuàng zhème fùzá de Fǎguó cài ne?",
        "en": "I can't even cook ordinary Chinese food, let alone such complicated French cuisine.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_moreover_20231230_我连普通的中国菜都做不好何况这么复杂的法国菜呢.mp3"
      },
      {
        "cn": "他连小学数字都算不出，何况解决这个复杂的数学问题呢?",
        "pinyin": "Tā lián xiǎoxué shùzì dōu suàn bù chū, hékuàng jiějué zhège fùzá de shùxué wèntí ne?",
        "en": "He can't even calculate elementary school numbers, let alone solve this complicated math problem.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_moreover_20231230_他连小学数字都算不出何况解决这个复杂的数学问题呢.mp3"
      },
      {
        "cn": "我都应付不了工作的压力，何况还要照顾一个小孩呢?",
        "pinyin": "Wǒ dū yìngfù bù liǎo gōngzuò de yālì, hékuàng hái yào zhàogù yīgè xiǎohái ne?",
        "en": "I can't even handle the pressure from work, let alone take care of a child.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_moreover_20231230_我都应付不了工作的压力何况还要照顾一个小孩呢.mp3"
      },
      {
        "cn": "如果连自己的问题都解决不了，何况帮助别人呢?",
        "pinyin": "Rúguǒ lián zìjǐ de wèntí dōu jiějué bù liǎo, hékuàng bāngzhù biérén ne?",
        "en": "If you can't even solve your own problems, how can you help others?",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékuàng_-_Let_alone_moreover_20231230_如果连自己的问题都解决不了何况帮助别人呢.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "丝毫 (sīháo) - The slightest amount or degree, a bit",
    "short_explanation": "Used to express a very small amount or degree, to the point of being negligible.",
    "long_explanation": "The Mandarin Chinese phrase '丝毫 (sīháo)' is used to describe a very small or negligible amount or degree of something. It can be utilized to convey that something is insignificant or lacks importance due to its small quantity or degree. The equivalent expression in English could be 'not at all', 'the slightest' or 'a bit'.",
    "formation": "丝毫 + Verb/Noun/Adjective",
    "examples": [
      {
        "cn": "我丝毫不担心这个问题。",
        "pinyin": "Wǒ sīháo bù dānxīn zhège wèntí.",
        "en": "I'm not the slightest bit worried about this issue.",
        "grammar_audio": "/audio/mandarin/grammar/s_丝毫_sīháo_-_The_slightest_amount_or_degree_a_bit_20231230_我丝毫不担心这个问题.mp3"
      },
      {
        "cn": "他丝毫没有感到紧张。",
        "pinyin": "Tā sīháo méiyǒu gǎndào jǐnzhāng.",
        "en": "He didn't feel nervous at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_丝毫_sīháo_-_The_slightest_amount_or_degree_a_bit_20231230_他丝毫没有感到紧张.mp3"
      },
      {
        "cn": "这次失败丝毫没有影响他的信心。",
        "pinyin": "Zhè cì shībài sīháo méiyǒu yǐngxiǎng tā de xìnxīn.",
        "en": "This failure hasn't affected his confidence in the slightest.",
        "grammar_audio": "/audio/mandarin/grammar/s_丝毫_sīháo_-_The_slightest_amount_or_degree_a_bit_20231230_这次失败丝毫没有影响他的信心.mp3"
      },
      {
        "cn": "她丝毫不介意大家的评论。",
        "pinyin": "Tā sīháo bù jièyì dàjiā de pínglùn.",
        "en": "She doesn't care about everyone's comments at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_丝毫_sīháo_-_The_slightest_amount_or_degree_a_bit_20231230_她丝毫不介意大家的评论.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "根据 (gēnjù) - According to, on the basis of",
    "short_explanation": "Used to derive or explain something based on a certain information or data.",
    "long_explanation": "The Mandarin Chinese word '根据 (gēnjù)' is equivalent to the English 'according to' or 'based on'. It is used when referring to definite information, evidence, or facts from which a conclusion or action is derived. It refers to the actual data or information used to justify or explain something.",
    "formation": "根据 + Data/Information + Rest of the sentence",
    "examples": [
      {
        "cn": "根据天气预报，明天会下雨。",
        "pinyin": "Gēnjù tiānqì yùbào, míngtiān huì xià yǔ.",
        "en": "According to the weather forecast, it will rain tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_on_the_basis_of_20231230_根据天气预报明天会下雨.mp3"
      },
      {
        "cn": "根据他的表现，我认为他很适合这份工作。",
        "pinyin": "Gēnjù tā de biǎoxiàn, wǒ rènwéi tā hěn shìhé zhè fèn gōngzuò.",
        "en": "Based on his performance, I believe he is very suitable for this job.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_on_the_basis_of_20231230_根据他的表现我认为他很适合这份工作.mp3"
      },
      {
        "cn": "根据研究，吃蔬菜和水果有利于健康。",
        "pinyin": "Gēnjù yánjiū, chī shūcài hé shuǐguǒ yǒulì yú jiànkāng.",
        "en": "According to research, eating vegetables and fruits is beneficial for health.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_on_the_basis_of_20231230_根据研究吃蔬菜和水果有利于健康.mp3"
      },
      {
        "cn": "根据规定，我们不能在公园里野餐。",
        "pinyin": "Gēnjù guīdìng, wǒmen bùnéng zài gōngyuán lǐ yěcān.",
        "en": "According to the rules, we cannot picnic in the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_根据_gēnjù_-_According_to_on_the_basis_of_20231230_根据规定我们不能在公园里野餐.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "由于 (yóuyú) - Due to, because of",
    "short_explanation": "Used to express the cause or reason of something.",
    "long_explanation": "The Mandarin Chinese phrase '由于 (yóuyú)' is commonly used to indicate the cause or reason of a result or an event. It helps to indicate that something happens or exists as a result of something else. It is equivalent to 'due to' or 'because of' in English.",
    "formation": "由于 + Cause/Reason, Result + Sentence",
    "examples": [
      {
        "cn": "由于下雨，我们的野餐被取消了。",
        "pinyin": "Yóuyú xià yǔ, wǒmen de yěcān bèi qǔxiāo le.",
        "en": "Due to the rain, our picnic was cancelled.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于下雨我们的野餐被取消了.mp3"
      },
      {
        "cn": "由于她的坚持，我们最后还是把这个项目完成了。",
        "pinyin": "Yóuyú tā de jiānchí, wǒmen zuìhòu háishì bǎ zhège xiàngmù wánchéng le.",
        "en": "Due to her persistence, we finally completed the project.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于她的坚持我们最后还是把这个项目完成了.mp3"
      },
      {
        "cn": "由于交通堵塞，他迟到了。",
        "pinyin": "Yóuyú jiāotōng dǔsè, tā chídào le.",
        "en": "Due to traffic congestion, he was late.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于交通堵塞他迟到了.mp3"
      },
      {
        "cn": "由于天气太冷，我决定留在家里。",
        "pinyin": "Yóuyú tiānqì tài lěng, wǒ juédìng liú zài jiā lǐ.",
        "en": "Due to the cold weather, I decided to stay at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_由于_yóuyú_-_Due_to_because_of_20231230_由于天气太冷我决定留在家里.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "尽量 (jǐnliàng) - As much as possible, to the best of one's ability",
    "short_explanation": "Used to express doing something to the greatest extent or as far as one can.",
    "long_explanation": "The phrase '尽量 (jǐnliàng)' in Mandarin Chinese is used to imply that a person is trying to do something to the best of their ability or as much as possible. It is equivalent to the English phrase 'as much as possible' or 'to the best of one's ability', suggesting an exertion of utmost effort or trying hard to maximize the result of an action.",
    "formation": "Subject + 尽量 + Verb + Object",
    "examples": [
      {
        "cn": "尽量避免吃油腻的食物，这样对健康有利。",
        "pinyin": "Jǐnliàng bìmiǎn chī yóunì de shíwù, zhèyàng duì jiànkāng yǒulì.",
        "en": "Try to avoid eating oily food as much as possible, this is beneficial for health.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_尽量避免吃油腻的食物这样对健康有利.mp3"
      },
      {
        "cn": "他尽量不去想那些不愉快的事情。",
        "pinyin": "Tā jǐnliàng bù qù xiǎng nàxiē bùyúkuài de shìqíng.",
        "en": "He tries not to think about those unpleasant things as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_他尽量不去想那些不愉快的事情.mp3"
      },
      {
        "cn": "尽量多喝水，可以帮助身体排毒。",
        "pinyin": "Jǐnliàng duō hē shuǐ, kěyǐ bāngzhù shēntǐ pàidú.",
        "en": "Try to drink as much water as possible, it can help detoxify the body.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_尽量多喝水可以帮助身体排毒.mp3"
      },
      {
        "cn": "她尽量在不伤害别人的情况下表达自己的观点。",
        "pinyin": "Tā jǐnliàng zài bù shānghài biérén de qíngkuàng xià biǎodá zìjǐ de guāndiǎn.",
        "en": "She tries to express her views as much as possible without hurting others.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jǐnliàng_-_As_much_as_possible_to_the_best_of_ones_ability_20231230_她尽量在不伤害别人的情况下表达自己的观点.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "正如 (zhèngrú) - Just like, as",
    "short_explanation": "Used to indicate comparison, similarity or a kind of equivalence between two things.",
    "long_explanation": "The Mandarin Chinese phrase '正如 (zhèngrú)' serves to compare two things or situations, highlighting their similarities or equivalence. It is similar to the English expression 'just like' or 'as'. The subordinate clause commonly sets context or provides a comparison that the main clause refers to.",
    "formation": "正如 + Phrase 1， + Phrase 2?",
    "examples": [
      {
        "cn": "正如那句老话，勤劳是成功的秘诀。",
        "pinyin": "Zhèngrú nà jù lǎohuà, qínláo shì chénggōng de mìjué.",
        "en": "Just like the old saying, hard work is the key to success.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_like_as_20231230_正如那句老话勤劳是成功的秘诀.mp3"
      },
      {
        "cn": "正如你所见，我已经完成了这项任务。",
        "pinyin": "Zhèngrú nǐ suǒ jiàn, wǒ yǐjīng wánchéng le zhè xiàng rènwù.",
        "en": "Just as you see, I have already completed this task.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_like_as_20231230_正如你所见我已经完成了这项任务.mp3"
      },
      {
        "cn": "正如预期的那样，他赢得了比赛。",
        "pinyin": "Zhèngrú yùqí de nàyàng, tā yíngdé le bǐsài.",
        "en": "Just as expected, he won the game.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_like_as_20231230_正如预期的那样他赢得了比赛.mp3"
      },
      {
        "cn": "正如我之前提到的，我将在下周开始新的工作。",
        "pinyin": "Zhèngrú wǒ zhīqián tí dào de, wǒ jiāng zài xià zhōu kāishǐ xīn de gōngzuò.",
        "en": "As I mentioned before, I will start a new job next week.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_like_as_20231230_正如我之前提到的我将在下周开始新的工作.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "不仅...而且... (bùjǐn... érqiě...) - Not only... but also...",
    "short_explanation": "This structure is used to connect two phrases or sentences, emphasizing that both stand true simultaneously.",
    "long_explanation": "The Mandarin Chinese structure '不仅...而且...' (bùjǐn... érqiě...) is equivalent to the pattern 'not only... but also...' in English. It is used to present two related pieces of information, implying that not only the first fact is true, but also the latter part is valid or significant. The statements connected by this structure can independently form complete thoughts.",
    "formation": "Subject + 不仅 + Statement 1 + 而且 + Statement 2.",
    "examples": [
      {
        "cn": "他不仅会说中文，而且可以用中文写故事。",
        "pinyin": "Tā bùjǐn huì shuō Zhōngwén, érqiě kěyǐ yòng Zhōngwén xiě gùshì.",
        "en": "He can not only speak Chinese, but also write stories in Chinese.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_他不仅会说中文而且可以用中文写故事.mp3"
      },
      {
        "cn": "这首歌不仅旋律优美，而且歌词富有深意。",
        "pinyin": "Zhè shǒu gē bùjǐn xuánlǜ yōuměi, érqiě gēcí fù yǒu shēnyì.",
        "en": "This song is not only melodic, but also the lyrics are profound.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_这首歌不仅旋律优美而且歌词富有深意.mp3"
      },
      {
        "cn": "他不仅喜欢运动，而且对音乐也非常感兴趣。",
        "pinyin": "Tā bùjǐn xǐhuān yùndòng, érqiě duì yīnyuè yě fēicháng gǎn xìngqù.",
        "en": "He not only likes sports, but also is very interested in music.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_他不仅喜欢运动而且对音乐也非常感兴趣.mp3"
      },
      {
        "cn": "这个国家不仅风景美丽，而且文化丰富。",
        "pinyin": "Zhège guójiā bùjǐn fēngjǐng měilì, érqiě wénhuà fēngfù.",
        "en": "This country is not only beautiful, but also culturally rich.",
        "grammar_audio": "/audio/mandarin/grammar/s_不仅而且_bùjǐn_érqiě_-_Not_only_but_also_20231230_这个国家不仅风景美丽而且文化丰富.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "尽早 (jǐnzǎo) - As soon as possible",
    "short_explanation": "Used to express the need for speed or expeditious action.",
    "long_explanation": "The Mandarin Chinese word '尽早 (jǐnzǎo)' is used when we want to indicate that a particular action or task should be accomplished as soon as possible, or at the earliest convenience. It's equivalent to 'As soon as possible' in English. This word is often used in formal contexts such as emails or requests.",
    "formation": "Subject + Verb + 尽早 + Rest of the sentence",
    "examples": [
      {
        "cn": "我希望你尽早回复我。",
        "pinyin": "Wǒ xīwàng nǐ jǐnzǎo huífù wǒ.",
        "en": "I hope you can reply to me as soon as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_soon_as_possible_20231230_我希望你尽早回复我.mp3"
      },
      {
        "cn": "请你尽早完成这个项目。",
        "pinyin": "Qǐng nǐ jǐnzǎo wánchéng zhège xiàngmù.",
        "en": "Please finish this project as soon as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_soon_as_possible_20231230_请你尽早完成这个项目.mp3"
      },
      {
        "cn": "他们需要尽早决定是否参加那个会议。",
        "pinyin": "Tāmen xūyào jǐnzǎo juédìng shìfǒu cānjiā nàgè huìyì.",
        "en": "They need to decide as soon as possible whether to attend that meeting.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_soon_as_possible_20231230_他们需要尽早决定是否参加那个会议.mp3"
      },
      {
        "cn": "我们必须尽早处理这个问题。",
        "pinyin": "Wǒmen bìxū jǐnzǎo chǔlǐ zhège wèntí.",
        "en": "We must address this issue as soon as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽早_jǐnzǎo_-_As_soon_as_possible_20231230_我们必须尽早处理这个问题.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "尽管如此 (jǐnguǎn rúcǐ) - Nevertheless, nonetheless",
    "short_explanation": "Used to indicate that despite what has just been said, the speaker is going to present a contrasting point.",
    "long_explanation": "The Mandarin Chinese phrase '尽管如此 (jǐnguǎn rúcǐ)' is an adverbial clause that means 'nevertheless' or 'nonetheless.' It introduces a contradictory or opposing viewpoint in a conversation. Despite the fact stated or made before the phrase, the circumstance or situation afterwards still holds true. This grammar point is especially used when the speaker wants to emphasize a contrasting point.",
    "formation": "Statement + 尽管如此, + Contrasting point.",
    "examples": [
      {
        "cn": "我知道你很忙，尽管如此，你还是需要花些时间去放松自己。",
        "pinyin": "Wǒ zhīdào nǐ hěn máng, jǐnguǎn rúcǐ, nǐ háishì xūyào huā xiē shíjiān qù fàngsōng zìjǐ.",
        "en": "I know you are very busy, nevertheless, you still need to take some time to relax.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_nonetheless_20231230_我知道你很忙尽管如此你还是需要花些时间去放松自己.mp3"
      },
      {
        "cn": "晚上的风很冷，尽管如此，他们还是决定出去散步。",
        "pinyin": "Wǎnshang de fēng hěn lěng, jǐnguǎn rúcǐ, tāmen háishì juédìng chūqù sànbù.",
        "en": "The wind is very cold at night, nonetheless, they still decided to go out for a walk.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_nonetheless_20231230_晚上的风很冷尽管如此他们还是决定出去散步.mp3"
      },
      {
        "cn": "他的脾气很差，尽管如此，我仍然深深的爱着他。",
        "pinyin": "Tā de píqì hěn chà, jǐnguǎn rúcǐ, wǒ réngrán shēnshēn de ài zhe tā.",
        "en": "His temper is very bad, nevertheless, I am still deeply in love with him.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_nonetheless_20231230_他的脾气很差尽管如此我仍然深深的爱着他.mp3"
      },
      {
        "cn": "光线很暗，尽管如此，我们仍然能看清楚演出。",
        "pinyin": "Guāngxiàn hěn àn, jǐnguǎn rúcǐ, wǒmen réngrán nénɡ kànqīngchu yǎnchū.",
        "en": "The lights are very dim, nonetheless, we can still clearly see the show.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管如此_jǐnguǎn_rúcǐ_-_Nevertheless_nonetheless_20231230_光线很暗尽管如此我们仍然能看清楚演出.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "无论...都... (wúlùn... dōu...) - No matter... always...",
    "short_explanation": "Used to express 'regardless of' or 'no matter what'.",
    "long_explanation": "The Mandarin Chinese phrase '无论...都... (wúlùn... dōu...)' is a structure used to show that the action or state in the main clause will always happen no matter what the condition described in the 无论 clause. It is equivalent to saying 'no matter...' or 'regardless of...' in English. In the structure, the subject usually comes after '无论', followed by a verb, and '都' is placed before the main part of the sentence.",
    "formation": "无论 + Subject + Verb/Condition, Subject + 都 + Verb + Outcome.",
    "examples": [
      {
        "cn": "无论你走到哪里，我都会找到你。",
        "pinyin": "Wúlùn nǐ zǒu dào nǎlǐ, wǒ dōu huì zhǎo dào nǐ.",
        "en": "No matter where you go, I will always find you.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论你走到哪里我都会找到你.mp3"
      },
      {
        "cn": "无论你说什么，他都不会改变他的决定。",
        "pinyin": "Wúlùn nǐ shuō shénme, tā dōu bù huì gǎibiàn tā de juédìng.",
        "en": "No matter what you say, he will not change his decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论你说什么他都不会改变他的决定.mp3"
      },
      {
        "cn": "无论天气如何，我们都要去野餐。",
        "pinyin": "Wúlùn tiānqì rúhé, wǒmen dōu yào qù yěcān.",
        "en": "No matter what the weather is like, we will always go for the picnic.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论天气如何我们都要去野餐.mp3"
      },
      {
        "cn": "无论工作多么辛苦，我都会坚持下去。",
        "pinyin": "Wúlùn gōngzuò duōme xīnkǔ, wǒ dōu huì jiānchí xiàqù.",
        "en": "No matter how hard the job is, I will always persevere.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论工作多么辛苦我都会坚持下去.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "起初 (qǐchū) - At first, originally",
    "short_explanation": "Used to refer to the initial stage or start of something.",
    "long_explanation": "The Mandarin Chinese term '起初 (qǐchū)' indicates the beginning stage or original state of an event, situation or action. It's similar to the English phrases 'at first' or 'originally'. The term emphasizes the beginning or starting point of something before changes take place.",
    "formation": "起初 + Phrase indicating what happened or the situation at the beginning",
    "examples": [
      {
        "cn": "起初，我不了解他，但我现在明白他了。",
        "pinyin": "Qǐchū, wǒ bù liǎojiě tā, dàn wǒ xiànzài míngbái tāle.",
        "en": "At first, I didn't understand him, but now I understand him.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初我不了解他但我现在明白他了.mp3"
      },
      {
        "cn": "起初，我以为学中文很难，但后来我发现其实并不是。",
        "pinyin": "Qǐchū, wǒ yǐwéi xué Zhōngwén hěn nán, dàn hòulái wǒ fāxiàn qíshí bìng bùshì.",
        "en": "At first, I thought learning Chinese was hard, but later I found that it actually isn't.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初我以为学中文很难但后来我发现其实并不是.mp3"
      },
      {
        "cn": "起初，她对音乐没什么兴趣，后来她却成为工作室里最优秀的音乐家。",
        "pinyin": "Qǐchū, tā duì yīnyuè méishénme xìngqù, hòulái tā què chéngwéi gōngzuò shì lǐ zuì yōuxiù de yīnyuèjiā.",
        "en": "Originally, she had no interest in music, but later she became the most excellent musician in the studio.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初她对音乐没什么兴趣后来她却成为工作室里最优秀的音乐家.mp3"
      },
      {
        "cn": "起初，大家都担心这个项目会失败，没想到我们最后成功了。",
        "pinyin": "Qǐchū, dàjiā dōu dānxīn zhège xiàngmù huì shībài, méi xiǎngdào wǒmen zuìhòu chénggōng le.",
        "en": "At first, everyone was worried that this project would fail, but unexpectedly, we succeeded in the end.",
        "grammar_audio": "/audio/mandarin/grammar/s_起初_qǐchū_-_At_first_originally_20231230_起初大家都担心这个项目会失败没想到我们最后成功了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "除了...以外...还/也... (chúle... yǐwài... hái/yě...) - Besides... also...",
    "short_explanation": "This phrase is used to indicate that in addition to the first mentioned thing or action, there are other things or actions.",
    "long_explanation": "The phrase '除了...以外...还/也...' (chúle... yǐwài... hái/yě...) is used in Mandarin Chinese to present additional items or actions other than those mentioned before. '除了' (chúle) means 'besides,' '以外' (yǐwài) means 'aside from', '还' (hái) and '也' (yě) both mean 'also' or 'too'. This structure can be used with both nouns and verbs.",
    "formation": "除了 + Noun/Verb Phrase + 以外， Subject + 还/也 + Noun/Verb Phrase",
    "examples": [
      {
        "cn": "除了会说英语以外，他还会说法语和德语。",
        "pinyin": "Chúle huì shuō yīngyǔ yǐwài, tā hái huì shuō fǎyǔ hé déyǔ.",
        "en": "Besides being able to speak English, he can also speak French and German.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外还/也_chúle_yǐwài_hái/yě_-_Besides_also_20231230_除了会说英语以外他还会说法语和德语.mp3"
      },
      {
        "cn": "除了喜欢听音乐以外，我还喜欢看书。",
        "pinyin": "Chúle xǐhuān tīng yīnyuè yǐwài, wǒ hái xǐhuān kàn shū.",
        "en": "Besides enjoying listening to music, I also enjoy reading books.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外还/也_chúle_yǐwài_hái/yě_-_Besides_also_20231230_除了喜欢听音乐以外我还喜欢看书.mp3"
      },
      {
        "cn": "除了在公司上班以外，她还在晚上做兼职。",
        "pinyin": "Chúle zài gōngsī shàngbān yǐwài, tā hái zài wǎnshang zuò jiānzhí.",
        "en": "Besides working at the company, she also works part-time in the evening.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外还/也_chúle_yǐwài_hái/yě_-_Besides_also_20231230_除了在公司上班以外她还在晚上做兼职.mp3"
      },
      {
        "cn": "除了我以外，他在班上还有很多朋友。",
        "pinyin": "Chúle wǒ yǐwài, tā zài bān shàng hái yǒu hěnduō péngyǒu.",
        "en": "Besides me, he also has many friends in class.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了以外还/也_chúle_yǐwài_hái/yě_-_Besides_also_20231230_除了我以外他在班上还有很多朋友.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "虽然...但是... (suīrán... dànshì...) - Although... but...",
    "short_explanation": "Used to express a contrast or contradiction between two states or actions.",
    "long_explanation": "The Mandarin Chinese phrase '虽然...但是... (suīrán... dànshì...)' is a conjunction used to indicate a concession or contradictory conditions. It equates to 'although...but...' in English. The first part of the sentence presents a situation or condition, while the second part usually brings up a contrasting situation or a result that is unexpected or opposite.",
    "formation": "虽然 + Statement 1, 但是 + Statement 2",
    "examples": [
      {
        "cn": "虽然他很忙，但是他每天还是会让自己有时间去健身。",
        "pinyin": "Suīrán tā hěn máng, dànshì tā měitiān háishì huì ràng zìjǐ yǒu shíjiān qù jiànshēn.",
        "en": "Although he is very busy, he still makes time to exercise every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他很忙但是他每天还是会让自己有时间去健身.mp3"
      },
      {
        "cn": "虽然今天天气很热，但是我决定走路去学校。",
        "pinyin": "Suīrán jīntiān tiānqì hěn rè, dànshì wǒ juédìng zǒulù qù xuéxiào.",
        "en": "Although the weather is very hot today, I decided to walk to school.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然今天天气很热但是我决定走路去学校.mp3"
      },
      {
        "cn": "虽然他们是竞争对手，但是他们依然尊重对方。",
        "pinyin": "Suīrán tāmen shì jìngzhēng duìshǒu, dànshì tāmen yīrán zūnzhòng duìfāng.",
        "en": "Although they are competitors, they still respect each other.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然他们是竞争对手但是他们依然尊重对方.mp3"
      },
      {
        "cn": "虽然她生病了，但是她依然坚持完成工作。",
        "pinyin": "Suīrán tā shēngbìng le, dànshì tā yīrán jiānchí wánchéng gōngzuò.",
        "en": "Although she is sick, she still insists on completing her work.",
        "grammar_audio": "/audio/mandarin/grammar/s_虽然但是_suīrán_dànshì_-_Although_but_20231230_虽然她生病了但是她依然坚持完成工作.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "就算 (jiùsuàn) - Even if, granted that",
    "short_explanation": "This phrase is used to express a hypothetical or supposition, similar to the English 'even if' or 'granted that'.",
    "long_explanation": "The Mandarin Chinese phrase '就算 (jiùsuàn)' is mostly used at the beginning of a sentence or clause to present a hypothetical scenario, condition, or supposition. The clause or sentence that follows '就算' usually states an unlikely or extreme situation, while the next part of the sentence expresses an outcome or consequences which will remain the same despite the hypothetical situation described.",
    "formation": "就算 + Hypothetical situation, + Result",
    "examples": [
      {
        "cn": "就算你再怎么努力，也无法改变事实。",
        "pinyin": "Jiùsuàn nǐ zài zěnme nǔlì, yě wúfǎ gǎibiàn shìshí.",
        "en": "Even if you try your hardest, you can't change the fact.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算_jiùsuàn_-_Even_if_granted_that_20231230_就算你再怎么努力也无法改变事实.mp3"
      },
      {
        "cn": "就算这份工作很繁忙，我也愿意接受。",
        "pinyin": "Jiùsuàn zhè fèn gōngzuò hěn fánmáng, wǒ yě yuànyì jiēshòu.",
        "en": "Even if this job is very busy, I am willing to accept it.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算_jiùsuàn_-_Even_if_granted_that_20231230_就算这份工作很繁忙我也愿意接受.mp3"
      },
      {
        "cn": "就算天气不好，我们还是必须坚持锻炼。",
        "pinyin": "Jiùsuàn tiānqì bù hǎo, wǒmen háishì bìxū jiānchí duànliàn.",
        "en": "Even if the weather is bad, we must still keep exercising.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算_jiùsuàn_-_Even_if_granted_that_20231230_就算天气不好我们还是必须坚持锻炼.mp3"
      },
      {
        "cn": "就算他是公司的总裁，也不能无视规定。",
        "pinyin": "Jiùsuàn tā shì gōngsī de zǒngcái, yě bùnéng wúshì guīdìng.",
        "en": "Even if he is the president of the company, he cannot ignore the rules.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算_jiùsuàn_-_Even_if_granted_that_20231230_就算他是公司的总裁也不能无视规定.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "不管 (bùguǎn) - Regardless of, no matter how/what",
    "short_explanation": "Used to express that the situation remains the same under any circumstances.",
    "long_explanation": "The Mandarin Chinese phrase '不管 (bùguǎn)' is a conjunction used to express the concept of 'regardless of' or 'no matter what'. '不管' is similar to 'no matter' in English and is often used in hypothetical situations to emphasize that the outcome will not change regardless of the circumstances.",
    "formation": "不管 + Situation, Outcome",
    "examples": [
      {
        "cn": "不管风还是雨，他都会去跑步。",
        "pinyin": "Bùguǎn fēng háishì yǔ, tā dūhuì qù pǎobù.",
        "en": "Regardless of whether it's wind or rain, he will go jogging.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_Regardless_of_no_matter_how/what_20231230_不管风还是雨他都会去跑步.mp3"
      },
      {
        "cn": "不管怎么样，我一定会支持你的决定。",
        "pinyin": "Bùguǎn zěnme yàng, wǒ yídìng huì zhīchí nǐ de juédìng.",
        "en": "No matter what, I will definitely support your decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_Regardless_of_no_matter_how/what_20231230_不管怎么样我一定会支持你的决定.mp3"
      },
      {
        "cn": "不管你去哪里，我都会跟你一起去。",
        "pinyin": "Bùguǎn nǐ qù nǎlǐ, wǒ dū huì gēn nǐ yìqǐ qù.",
        "en": "Regardless of where you go, I will go with you.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_Regardless_of_no_matter_how/what_20231230_不管你去哪里我都会跟你一起去.mp3"
      },
      {
        "cn": "不管你说什么，我都不会改变我的决定。",
        "pinyin": "Bùguǎn nǐ shuō shénme, wǒ dū bù huì gǎibiàn wǒ de juédìng.",
        "en": "No matter what you say, I will not change my decision.",
        "grammar_audio": "/audio/mandarin/grammar/s_不管_bùguǎn_-_Regardless_of_no_matter_how/what_20231230_不管你说什么我都不会改变我的决定.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "再三 (zàisān) - again and again, repeatedly",
    "short_explanation": "再三 is used to emphasize that an action is done repeatedly or continuously.",
    "long_explanation": "The Chinese term '再三 (zàisān)' is often used to express the continuation or repetition of an action, implying that something has been done numerous times. It is much like saying 'again and again' or 'repeatedly' in English. The phrase is typically used when someone has repeatedly urged, advised or reminded another person about something.",
    "formation": "Subject + 再三 + Verb ",
    "examples": [
      {
        "cn": "我再三告诉你，不要在街上玩球。",
        "pinyin": "Wǒ zàisān gàosù nǐ, bùyào zài jiēshàng wán qiú.",
        "en": "I've told you again and again, don't play ball on the street.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_again_and_again_repeatedly_20231230_我再三告诉你不要在街上玩球.mp3"
      },
      {
        "cn": "我妈妈再三叮嘱我一定要吃早餐。",
        "pinyin": "Wǒ māma zàisān dīngzhù wǒ yīdìng yào chī zǎocān.",
        "en": "My mom has repeatedly reminded me to definitely eat breakfast.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_again_and_again_repeatedly_20231230_我妈妈再三叮嘱我一定要吃早餐.mp3"
      },
      {
        "cn": "我的老师再三强调细心检查所有的作业。",
        "pinyin": "Wǒ de lǎoshī zàisān qiángdiào xìxīn jiǎnchá suǒyǒu de zuòyè.",
        "en": "My teacher has emphasized again and again to check all the homework carefully.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_again_and_again_repeatedly_20231230_我的老师再三强调细心检查所有的作业.mp3"
      },
      {
        "cn": "他再三保证他会按时完成这个项目。",
        "pinyin": "Tā zàisān bǎozhèng tā huì ànshí wánchéng zhège xiàngmù.",
        "en": "He has repeatedly assured that he will complete the project on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_again_and_again_repeatedly_20231230_他再三保证他会按时完成这个项目.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "如今 (rújīn) - Nowadays, currently",
    "short_explanation": "This term is used to indicate the present time or the particular period in time you are currently in.",
    "long_explanation": "如今 (rújīn) is a Mandarin Chinese term that is similar to 'nowadays' or 'currently' in English. It is used when one wants to refer to the present time or the state of affairs as they are now. It usually stands at the beginning of a sentence but can also be placed after the subject in some contexts.",
    "formation": "如今 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "如今，人们能够通过互联网迅速获取到大量的信息。",
        "pinyin": "Rújīn, rénmen nénggòu tōngguò hùliánwǎng xùnsù huòqǔdào dàliàng de xìnxī.",
        "en": "Nowadays, people can quickly access a large amount of information through the internet.",
        "grammar_audio": "/audio/mandarin/grammar/s_如今_rújīn_-_Nowadays_currently_20231230_如今人们能够通过互联网迅速获取到大量的信息.mp3"
      },
      {
        "cn": "他如今已经成为了这家公司的总经理。",
        "pinyin": "Tā rújīn yǐjīng chéngwéi le zhè jiā gōngsī de zǒngjīnglǐ.",
        "en": "He is now the general manager of this company.",
        "grammar_audio": "/audio/mandarin/grammar/s_如今_rújīn_-_Nowadays_currently_20231230_他如今已经成为了这家公司的总经理.mp3"
      },
      {
        "cn": "如今，学习外语已经变得越来越重要了。",
        "pinyin": "Rújīn, xuéxí wàiyǔ yǐjīng biàn dé yuè lái yuè zhòngyào le.",
        "en": "Nowadays, learning foreign languages has become increasingly important.",
        "grammar_audio": "/audio/mandarin/grammar/s_如今_rújīn_-_Nowadays_currently_20231230_如今学习外语已经变得越来越重要了.mp3"
      },
      {
        "cn": "她如今在一家著名的电影公司工作。",
        "pinyin": "Tā rújīn zài yījiā zhùmíng de diànyǐng gōngsī gōngzuò.",
        "en": "She is now working at a famous film company.",
        "grammar_audio": "/audio/mandarin/grammar/s_如今_rújīn_-_Nowadays_currently_20231230_她如今在一家著名的电影公司工作.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "反而 (fǎn'ér) - On the contrary, instead",
    "short_explanation": "Used to express a contrast with a previous statement, indicating an unexpected or reverse outcome.",
    "long_explanation": "The Mandarin Chinese word '反而 (fǎn'ér)' is used to indicate a contrast or contradiction to a prior statement or expectation, expressing a result that is opposite or contrary. It is similar to the English phrases 'on the contrary' or 'instead'. Generally, it follows a negative clause and precedes a contrasting positive result.",
    "formation": "Situation A, 反而 + Situation B",
    "examples": [
      {
        "cn": "我没做太多准备，反而考试考得很好。",
        "pinyin": "Wǒ méi zuò tài duō zhǔnbèi, fǎn'ér kǎoshì kǎo de hěn hǎo.",
        "en": "I didn't prepare much, but on the contrary, I performed well in the exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我没做太多准备反而考试考得很好.mp3"
      },
      {
        "cn": "他不去旅游，反而决定在家休息。",
        "pinyin": "Tā bù qù lǚyóu, fǎn'ér juédìng zài jiā xiūxí.",
        "en": "He didn't go traveling, instead, he decided to rest at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_他不去旅游反而决定在家休息.mp3"
      },
      {
        "cn": "我以为他会生气，反而他笑了。",
        "pinyin": "Wǒ yǐwéi tā huì shēngqì, fǎn'ér tā xiào le.",
        "en": "I thought he would be angry, but on the contrary, he laughed.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我以为他会生气反而他笑了.mp3"
      },
      {
        "cn": "这个药应该让我好转，但是反而让我觉得更糟糕了。",
        "pinyin": "Zhège yào yīnggāi ràng wǒ hǎozhuǎn, dànshì fǎn'ér ràng wǒ juédé gèng zāogāole.",
        "en": "This medicine was supposed to make me feel better, but instead it made me feel worse.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_这个药应该让我好转但是反而让我觉得更糟糕了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "毫无 (háo wú) - Without any, not in the least",
    "short_explanation": "Used to express the complete absence of something.",
    "long_explanation": "The Mandarin Chinese phrase '毫无 (háo wú)' signifies an absolute lack or absence of something. It is often used to exhibit the complete nonexistence or nonoccurrence of a certain concept, idea, action, or thing. This term is the equivalent of saying 'without any' or 'not in the least' in English.",
    "formation": "Subject + 毫无 + Object",
    "examples": [
      {
        "cn": "他毫无理由的就离开了聚会。",
        "pinyin": "Tā háo wú lǐyóu de jiù líkāi le jùhuì.",
        "en": "He left the party without any reason.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_any_not_in_the_least_20231230_他毫无理由的就离开了聚会.mp3"
      },
      {
        "cn": "这件事我毫无所知。",
        "pinyin": "Zhè jiàn shì wǒ háowú suǒzhī.",
        "en": "I know nothing about this matter.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_any_not_in_the_least_20231230_这件事我毫无所知.mp3"
      },
      {
        "cn": "头疼的药已经吃完了，可是我还是毫无改善。",
        "pinyin": "Tóuténg de yào yǐjīng chī wánle, kěshì wǒ háishì háowú gǎishàn.",
        "en": "I've finished the headache medicine, but I've not improved at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_any_not_in_the_least_20231230_头疼的药已经吃完了可是我还是毫无改善.mp3"
      },
      {
        "cn": "他毫无节制的吃了太多甜食。",
        "pinyin": "Tā háo wú jiézhì de chīle tài duō tiánshí.",
        "en": "He ate too many sweets without any restraint.",
        "grammar_audio": "/audio/mandarin/grammar/s_毫无_háo_wú_-_Without_any_not_in_the_least_20231230_他毫无节制的吃了太多甜食.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "50"
  },
  {
    "title": "反正 (fǎnzhèng) - Anyway, in any case",
    "short_explanation": "Used to show indifference or that something is inevitable.",
    "long_explanation": "The Mandarin Chinese word '反正 (fǎnzhèng)' is an adverb that can be translated into English as 'anyway' or 'in any case'. It is often used to show that the speaker is indifferent towards the situation, or to express that a certain outcome is expected or inevitable despite circumstances.",
    "formation": "Explicative Sentence + 反正 + Stative Sentence",
    "examples": [
      {
        "cn": "我不知道他会不会来，反正我是准备好了。",
        "pinyin": "Wǒ bùzhīdào tā huì bù huì lái, fǎnzhèng wǒ shì zhǔnbèi hǎo le.",
        "en": "I don't know if he will come or not, anyway I am ready.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_我不知道他会不会来反正我是准备好了.mp3"
      },
      {
        "cn": "反正我们还有时间，不如去看一场电影吧。",
        "pinyin": "Fǎnzhèng wǒmen hái yǒu shíjiān, bùrú qù kàn yī chǎng diànyǐng ba.",
        "en": "We still have time anyway, why don’t we see a movie.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我们还有时间不如去看一场电影吧.mp3"
      },
      {
        "cn": "你去不去无所谓，反正我是会去的。",
        "pinyin": "Nǐ qù bù qù wúsuǒwèi, fǎnzhèng wǒ shì huì qù de.",
        "en": "It doesn't matter whether you go or not, in any case I will.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_你去不去无所谓反正我是会去的.mp3"
      },
      {
        "cn": "反正明天是周末，我们可以晚一点回家。",
        "pinyin": "Fǎnzhèng míngtiān shì zhōumò, wǒmen kěyǐ wǎn yīdiǎn huíjiā.",
        "en": "Anyway, tomorrow is the weekend, we can go home a bit later.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正明天是周末我们可以晚一点回家.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "即使 (jíshǐ) - Even if, Even though",
    "short_explanation": "Used to express a hypothetical situation or condition, similar to 'even if' or 'even though' in English.",
    "long_explanation": "The Mandarin Chinese phrase '即使 (jíshǐ)' is a conjunction used to indicate a hypothetical or contrary-to-fact condition. It is equivalent to the English phrases 'even if' or 'even though'. Thus, it is commonly used to express an assumption or a condition, regardless of the outcome or reality.",
    "formation": "即使 + Hypothetical situation, Main clause",
    "examples": [
      {
        "cn": "即使下雨，我们还是要去公园游玩。",
        "pinyin": "Jíshǐ xià yǔ, wǒmen háishì yào qù gōngyuán yóuwán.",
        "en": "Even if it rains, we still want to go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_Even_though_20231230_即使下雨我们还是要去公园游玩.mp3"
      },
      {
        "cn": "即使他已经工作很晚了，他还是不想放弃这个项目。",
        "pinyin": "Jíshǐ tā yǐjīng gōngzuò hěn wǎn le, tā háishì bù xiǎng fàngqì zhège xiàngmù.",
        "en": "Even though he has already worked late, he still does not want to give up this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_Even_though_20231230_即使他已经工作很晚了他还是不想放弃这个项目.mp3"
      },
      {
        "cn": "即使她在尽其所能，她的父母还是不满意。",
        "pinyin": "Jíshǐ tā zài jìn qí suǒ néng, tā de fùmǔ háishì bù mǎnyì.",
        "en": "Even though she tries her best, her parents still aren't satisfied.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_Even_though_20231230_即使她在尽其所能她的父母还是不满意.mp3"
      },
      {
        "cn": "即使我比你小，我也知道什么是对的什么是错的。",
        "pinyin": "Jíshǐ wǒ bǐ nǐ xiǎo, wǒ yě zhīdao shénme shì duì de shénme shì cuò de.",
        "en": "Even though I am younger than you, I still know what is right and what is wrong.",
        "grammar_audio": "/audio/mandarin/grammar/s_即使_jíshǐ_-_Even_if_Even_though_20231230_即使我比你小我也知道什么是对的什么是错的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "一旦 (yīdàn) - Once, in case (something happens)",
    "short_explanation": "Used to express the hypothetical or potential occurrence of an event, usually followed by a condition or a result.",
    "long_explanation": "The Mandarin Chinese phrase '一旦 (yīdàn)' is used to signify a potential event or situation that may happen. It emphasizes the immediacy or suddenness of the event, often in situations where there is a degree of unpredictability or uncertainty. In English, this phrase can be translated as 'once' or 'in case'. It is typically followed by the consequence or result if the stated situation occurs.",
    "formation": "一旦 + Condition/Hypothetical Event, + Result/Effected Action",
    "examples": [
      {
        "cn": "一旦发生火灾，你应立即离开大楼。",
        "pinyin": "Yīdàn fāshēng huǒzhài, nǐ yīng lìjí líkāi dàlóu.",
        "en": "Once a fire breaks out, you should leave the building immediately.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦发生火灾你应立即离开大楼.mp3"
      },
      {
        "cn": "一旦考试结果出来，我就可以决定是否要去旅行。",
        "pinyin": "Yīdàn kǎoshì jiéguǒ chūlái, wǒ jiù kěyǐ juédìng shìfǒu yào qù lǚxíng.",
        "en": "Once the exam results are out, I can decide whether to go traveling or not.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦考试结果出来我就可以决定是否要去旅行.mp3"
      },
      {
        "cn": "一旦你决定了，就不应该后悔。",
        "pinyin": "Yīdàn nǐ juédìng le, jiù bù yīnggāi hòuhuǐ.",
        "en": "Once you make a decision, you should not regret it.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦你决定了就不应该后悔.mp3"
      },
      {
        "cn": "一旦发现错误，我们将立刻进行修改。",
        "pinyin": "Yīdàn fāxiàn cuòwù, wǒmen jiāng lìkè jìnxíng xiūgǎi.",
        "en": "Once we discover errors, we will make corrections immediately.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦_yīdàn_-_Once_in_case_something_happens_20231230_一旦发现错误我们将立刻进行修改.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "不然 (bùrán) - Otherwise, if not",
    "short_explanation": "Used to express the potential negative consequence of not following a specified action.",
    "long_explanation": "In Mandarin Chinese, the conjunction '不然 (bùrán)' is used to convey the meaning 'otherwise' or 'if not'. It is typically used in the second half of a sentence to express consequences or outcomes that might occur if the condition or action in the first half of the sentence is not performed or fulfilled.",
    "formation": "Sentence 1, 不然 + Sentence 2",
    "examples": [
      {
        "cn": "你最好早点回家，不然妈妈会担心的。",
        "pinyin": "Nǐ zuì hǎo zǎo diǎn huí jiā, bùrán māmā huì dānxīn de.",
        "en": "You should come home early, otherwise, mom will worry.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_if_not_20231230_你最好早点回家不然妈妈会担心的.mp3"
      },
      {
        "cn": "我们需要赶快出发，不然会错过飞机。",
        "pinyin": "Wǒmen xūyào gǎnkuài chūfā, bùrán huì cuòguò fēijī.",
        "en": "We need to leave quickly, otherwise, we will miss the plane.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_if_not_20231230_我们需要赶快出发不然会错过飞机.mp3"
      },
      {
        "cn": "你应该立刻开始做作业，不然你会不及格。",
        "pinyin": "Nǐ yīnggāi lìkè kāishǐ zuò zuòyè, bùrán nǐ huì bù jígé.",
        "en": "You should start doing your homework immediately, otherwise, you will fail.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_if_not_20231230_你应该立刻开始做作业不然你会不及格.mp3"
      },
      {
        "cn": "请记得带雨伞，不然你会淋湿。",
        "pinyin": "Qǐng jìde dài yǔsǎn, bùrán nǐ huì línshī.",
        "en": "Remember to bring an umbrella, otherwise, you will get wet.",
        "grammar_audio": "/audio/mandarin/grammar/s_不然_bùrán_-_Otherwise_if_not_20231230_请记得带雨伞不然你会淋湿.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "总之 (zǒngzhī) - In short, in a word",
    "short_explanation": "Used to summarize or conclude a statement or conversation.",
    "long_explanation": "The Mandarin Chinese phrase '总之 (zǒngzhī)' is used to wrap up a point or to conclude something. This phrase is often used in both spoken and written language to draw a conclusion or to summarize previous points. It is equivalent to saying 'in short' or 'in a word' in English.",
    "formation": "总之 + Conclusive Statement",
    "examples": [
      {
        "cn": "总之，如果我们不努力工作，我们就不可能成功。",
        "pinyin": "Zǒngzhī, rúguǒ wǒmen bù nǔlì gōngzuò, wǒmen jiù bù kěnéng chénggōng.",
        "en": "In short, if we don't work hard, we cannot succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_总之_zǒngzhī_-_In_short_in_a_word_20231230_总之如果我们不努力工作我们就不可能成功.mp3"
      },
      {
        "cn": "总之，这次学期我学到了很多新的知识。",
        "pinyin": "Zǒngzhī, zhè cì xuéqī wǒ xué dào le hěnduō xīn de zhīshì.",
        "en": "In a word, I have learned a lot of new knowledge this semester.",
        "grammar_audio": "/audio/mandarin/grammar/s_总之_zǒngzhī_-_In_short_in_a_word_20231230_总之这次学期我学到了很多新的知识.mp3"
      },
      {
        "cn": "总之，与其抱怨生活不公，不如努力去改变。",
        "pinyin": "Zǒngzhī, yǔqí bàoyuàn shēnghuó bùgōng, bùrú nǔlì qù gǎibiàn.",
        "en": "In short, instead of complaining about the unfairness of life, it's better to work hard to make changes.",
        "grammar_audio": "/audio/mandarin/grammar/s_总之_zǒngzhī_-_In_short_in_a_word_20231230_总之与其抱怨生活不公不如努力去改变.mp3"
      },
      {
        "cn": "总之，不论发生什么，我们都要保持乐观的态度。",
        "pinyin": "Zǒngzhī, bùlùn fāshēng shénme, wǒmen dōu yào bǎochí lèguān de tàidù.",
        "en": "In a word, no matter what happens, we must maintain a positive attitude.",
        "grammar_audio": "/audio/mandarin/grammar/s_总之_zǒngzhī_-_In_short_in_a_word_20231230_总之不论发生什么我们都要保持乐观的态度.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "至于 (zhìyú) - As for, regarding",
    "short_explanation": "Used to shift topic to another subject related to the conversation.",
    "long_explanation": "The Mandarin Chinese phrase '至于 (zhìyú)' functions to shift the focus to another subject within the same discussion. It is comparable to phrases like 'as for' or 'regarding' in English. It helps maintain smooth transitions during exchanges and can be vital while discussing multiple points or subjects.",
    "formation": "至于 + Topic",
    "examples": [
      {
        "cn": "我喜欢每种水果，至于香蕉我特别喜欢。",
        "pinyin": "Wǒ xǐhuān měi zhǒng shuǐguǒ, zhìyú xiāngjiāo wǒ tèbié xǐhuān.",
        "en": "I like every kind of fruit, but regarding bananas, I particularly like them.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_我喜欢每种水果至于香蕉我特别喜欢.mp3"
      },
      {
        "cn": "他是我男朋友，至于他的朋友们我一点都不了解。",
        "pinyin": "Tā shì wǒ nán péngyǒu, zhìyú tā de péngyǒu men wǒ yīdiǎn dōu bù liǎo jiě.",
        "en": "He's my boyfriend, but as for his friends, I don't understand them at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_他是我男朋友至于他的朋友们我一点都不了解.mp3"
      },
      {
        "cn": "明天的计划我已经决定了，至于后天的我还没想好。",
        "pinyin": "Míngtiān de jìhuà wǒ yǐjīng juédìngle, zhìyú hòutiān de wǒ hái méi xiǎng hǎo.",
        "en": "I have already decided on tomorrow's plan, as for the day after tomorrow, I haven't thought about it yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_明天的计划我已经决定了至于后天的我还没想好.mp3"
      },
      {
        "cn": "这篇文章的主题我已经明确了，至于配图我还在考虑。",
        "pinyin": "Zhè piān wénzhāng de zhǔtí wǒ yǐjīng míngquè le, zhìyú pèitú wǒ hái zài kǎolǜ.",
        "en": "I have already confirmed the theme of this article, as for the illustrations, I'm still considering it.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_regarding_20231230_这篇文章的主题我已经明确了至于配图我还在考虑.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "以便 (yǐbiàn) - So that, in order to",
    "short_explanation": "This phrase is used to show the intended purpose or outcome of an action.",
    "long_explanation": "The Mandarin Chinese phrase '以便 (yǐbiàn)' is a conjunction used to connect two clauses, where the later clause expresses the purpose or intended result of the action in the former clause. Translated as 'so that' or 'in order to' in English, this phrase connects actions with their intentions or desired outcomes.",
    "formation": "Clause 1 + 以便 + Clause 2 (purpose/intended result of Clause 1)",
    "examples": [
      {
        "cn": "我早早就来公司，以便有足够的时间准备报告。",
        "pinyin": "Wǒ zǎozǎo jiù lái gōngsī, yǐbiàn yǒu zúgòu de shíjiān zhǔnbèi bàogào.",
        "en": "I came to the office early so that I have enough time to prepare the report.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_我早早就来公司以便有足够的时间准备报告.mp3"
      },
      {
        "cn": "请你把电视关小声一点，以便我可以专心读书。",
        "pinyin": "Qǐng nǐ bǎ diànshì guān xiǎo shēng yīdiǎn, yǐbiàn wǒ kěyǐ zhuānxīn dúshū.",
        "en": "Please turn down the television so that I can concentrate on reading.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_请你把电视关小声一点以便我可以专心读书.mp3"
      },
      {
        "cn": "他提前一个月开始学习，以便他可以通过HSK考试。",
        "pinyin": "Tā tíqián yīgè yuè kāishǐ xuéxí, yǐbiàn tā kěyǐ tōngguò HSK kǎoshì.",
        "en": "He started studying a month in advance so that he can pass the HSK test.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_他提前一个月开始学习以便他可以通过HSK考试.mp3"
      },
      {
        "cn": "我早起做早饭，以便全家人都可以吃到热乎乎的早餐。",
        "pinyin": "Wǒ zǎo qǐ zuò zǎofàn, yǐbiàn quánjiā rén dōu kěyǐ chī dào rèhūhū de zǎocān.",
        "en": "I wake up early to make breakfast so that the whole family can eat a hot breakfast.",
        "grammar_audio": "/audio/mandarin/grammar/s_以便_yǐbiàn_-_So_that_in_order_to_20231230_我早起做早饭以便全家人都可以吃到热乎乎的早餐.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "若是 (ruòshì) - If",
    "short_explanation": "Used to express a hypothetical situation or a condition.",
    "long_explanation": "The Mandarin Chinese term '若是 (ruòshì)' is an expression used to describe a hypothetical event, situation, or condition. It is equivalent to saying 'if' in English. This phrase is often used to construct conditional sentences.",
    "formation": "若是 + Condition, Result.",
    "examples": [
      {
        "cn": "若是明天天气好，我们可以去公园。",
        "pinyin": "Ruòshì míngtiān tiānqì hǎo, wǒmen kěyǐ qù gōngyuán.",
        "en": "If the weather is good tomorrow, we can go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_20231230_若是明天天气好我们可以去公园.mp3"
      },
      {
        "cn": "若是你想学好汉语，你就需要每天都努力。",
        "pinyin": "Ruòshì nǐ xiǎng xué hǎo Hànyǔ, nǐ jiù xūyào měitiān dōu nǔlì.",
        "en": "If you want to learn Chinese well, you need to work hard every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_20231230_若是你想学好汉语你就需要每天都努力.mp3"
      },
      {
        "cn": "若是我有足够的时间,我一定会来参加你的生日派对。",
        "pinyin": "Ruòshì wǒ yǒu zúgòu de shíjiān, wǒ yídìng huì lái cānjiā nǐ de shēngrì pàiduì.",
        "en": "If I have enough time, I will definitely come to your birthday party.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_20231230_若是我有足够的时间我一定会来参加你的生日派对.mp3"
      },
      {
        "cn": "若是你累了，就休息一会儿。",
        "pinyin": "Ruòshì nǐ lèi le, jiù xiūxí yīhuǐr.",
        "en": "If you are tired, rest for a while.",
        "grammar_audio": "/audio/mandarin/grammar/s_若是_ruòshì_-_If_20231230_若是你累了就休息一会儿.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "照 (zhào) - According to, in accordance with",
    "short_explanation": "Used to express 'in accordance with' or 'according to' a certain rule, method, or someone's words.",
    "long_explanation": "'照 (zhào)' in Mandarin Chinese grammar is used to indicate that an action or behavior is carried out 'according to' or 'in accordance with' a given rule, guideline, instructions, or someone's words. It can be used in many contexts and is analogous to the English 'according to' or 'in accordance with'.",
    "formation": "照 + Rule/Method/Person's Words + Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "请照我给你的方法来做，这样就不会出错了。",
        "pinyin": "Qǐng zhào wǒ gěi nǐ de fāngfǎ lái zuò, zhèyàng jiù bú huì chūcuòle.",
        "en": "Please do it according to the method I gave you, so you won't make mistakes.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_请照我给你的方法来做这样就不会出错了.mp3"
      },
      {
        "cn": "我们照老师的指示完成了那个项目。",
        "pinyin": "Wǒmen zhào lǎoshī de zhǐshì wánchéngle nàgè xiàngmù.",
        "en": "We completed the project according to the teacher's instructions.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_我们照老师的指示完成了那个项目.mp3"
      },
      {
        "cn": "照他的计划，我们应该在明天就能到达那里。",
        "pinyin": "Zhào tā de jìhuà, wǒmen yīnggāi zài míngtiān jiù néng dàodá nàlǐ.",
        "en": "According to his plan, we should be able to get there by tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_照他的计划我们应该在明天就能到达那里.mp3"
      },
      {
        "cn": "你需要照规定行事，否则就会被惩罚。",
        "pinyin": "Nǐ xūyào zhào guīdìng xíngshì, fǒuzé jiù huì bèi chéngfá.",
        "en": "You need to act in accordance with the rules, or you will be punished.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_accordance_with_20231230_你需要照规定行事否则就会被惩罚.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "反映 (fǎnyìng) - Reflect, reflection",
    "short_explanation": "Used to describe a situation or event that adequately represents or indicates a particular circumstance, fact, or feeling.",
    "long_explanation": "The Mandarin Chinese verb '反映 (fǎnyìng)' refers to the act of representing, illustrating, or manifesting something indirectly. This verb is similar to the English 'reflect' as it involves the idea of providing evidence or displaying a characteristic related to a certain fact, situation, or sentiment. It is flexible and can be used in a variety of contexts and situations, both concrete and abstract.",
    "formation": "Subject + 反映 + Object (the thing reflected/indicated)",
    "examples": [
      {
        "cn": "这个问题的存在反映了公司管理的不足。",
        "pinyin": "Zhège wèntí de cúnzài fǎnyìngle gōngsī guǎnlǐ de bùzú.",
        "en": "The existence of this problem reflects the inadequacy of the company's management.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_reflection_20231230_这个问题的存在反映了公司管理的不足.mp3"
      },
      {
        "cn": "学生们的成绩反映他们的学习态度和方法。",
        "pinyin": "Xuéshēngmen de chéngjì fǎnyìng tāmen de xuéxí tàidù hé fāngfǎ.",
        "en": "The students' grades reflect their learning attitudes and methods.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_reflection_20231230_学生们的成绩反映他们的学习态度和方法.mp3"
      },
      {
        "cn": "她的笑反映了她内心的快乐。",
        "pinyin": "Tā de xiào fǎnyìng le tā nèixīn de kuàilè.",
        "en": "Her smile reflects her inner happiness.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_reflection_20231230_她的笑反映了她内心的快乐.mp3"
      },
      {
        "cn": "市场的波动反映了经济的状况。",
        "pinyin": "Shìchǎng de bōdòng fǎnyìng le jīngjì de zhuàngkuàng.",
        "en": "Market fluctuations reflect the state of the economy.",
        "grammar_audio": "/audio/mandarin/grammar/s_反映_fǎnyìng_-_Reflect_reflection_20231230_市场的波动反映了经济的状况.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "不如 (bùrú) - Not as good as, inferior to",
    "short_explanation": "Used to compare two things or situations, indicating that one is inferior to the other.",
    "long_explanation": "The Mandarin Chinese phrase '不如 (bùrú)' is used in comparative contexts to indicate that one thing or situation is not as good as another, or inferior to another. It can be translated as 'not as good as' or 'inferior to' in English. This expression is often used in comparisons of objects, people, actions or circumstances.",
    "formation": "Object/People/Action A + 不如 + Object/People/Action B",
    "examples": [
      {
        "cn": "我发现我的中文口语水平不如写作水平高。",
        "pinyin": "Wǒ fāxiàn wǒ de zhōngwén kǒuyǔ shuǐpíng bùrú xiězuò shuǐpíng gāo.",
        "en": "I found that my Chinese speaking level is not as high as my writing level.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_我发现我的中文口语水平不如写作水平高.mp3"
      },
      {
        "cn": "他在数学方面的成就不如他在物理方面的成就。",
        "pinyin": "Tā zài shùxué fāngmiàn de chéngjiù bùrú tā zài wùlǐ fāngmiàn de chéngjiù.",
        "en": "His achievement in Math is not as good as his achievement in Physics.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_他在数学方面的成就不如他在物理方面的成就.mp3"
      },
      {
        "cn": "考试结果来看，小明的成绩不如小红。",
        "pinyin": "Kǎoshì jiéguǒ lái kàn, xiǎo míng de chéngjī bùrú xiǎohóng.",
        "en": "Judging from the exam results, Xiao Ming's grades are inferior to Xiao Hong's.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_考试结果来看小明的成绩不如小红.mp3"
      },
      {
        "cn": "他的烹饪技术不如他的妻子。",
        "pinyin": "Tā de pēngrèn jìshù bùrú tā de qīzi.",
        "en": "His cooking skills are not as good as his wife's.",
        "grammar_audio": "/audio/mandarin/grammar/s_不如_bùrú_-_Not_as_good_as_inferior_to_20231230_他的烹饪技术不如他的妻子.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "至少 (zhìshǎo) - At least",
    "short_explanation": "Used to denote the minimum requirement or the least possible.",
    "long_explanation": "The Mandarin Chinese term '至少 (zhìshǎo)' demonstrates the minimum expectation or the bare minimum that should occur. It is equivalent to 'at least' in English and serves as an expression for ensuring that a certain condition is not lower than a certain standard.",
    "formation": "Subject + Verb + 至少 + Quantity/Time + Object",
    "examples": [
      {
        "cn": "我每天至少喝两杯水来保持健康。",
        "pinyin": "Wǒ měitiān zhìshǎo hē liǎng bēi shuǐ lái bǎochí jiànkāng.",
        "en": "I drink at least two cups of water every day to maintain my health.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_我每天至少喝两杯水来保持健康.mp3"
      },
      {
        "cn": "你至少需要花一个小时才能完全理解这个问题。",
        "pinyin": "Nǐ zhìshǎo xūyào huā yīgè xiǎoshí cáinéng wánquán lǐjiě zhège wèntí.",
        "en": "You need to spend at least one hour to fully understand this issue.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_你至少需要花一个小时才能完全理解这个问题.mp3"
      },
      {
        "cn": "我至少会去两次中国，用来提高我的中文水平。",
        "pinyin": "Wǒ zhìshǎo huì qù liǎng cì Zhōngguó, yòng lái tígāo wǒ de Zhōngwén shuǐpíng.",
        "en": "I will visit China at least twice to improve my Chinese language skills.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_我至少会去两次中国用来提高我的中文水平.mp3"
      },
      {
        "cn": "他每个月至少会阅读一本书。",
        "pinyin": "Tā měi gè yuè zhìshǎo huì yuèdú yī běn shū.",
        "en": "He reads at least one book every month.",
        "grammar_audio": "/audio/mandarin/grammar/s_至少_zhìshǎo_-_At_least_20231230_他每个月至少会阅读一本书.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "另外 (lìngwài) - Additionally, furthermore",
    "short_explanation": "Used to add more information or to introduce a different topic.",
    "long_explanation": "The Mandarin Chinese term '另外 (lìngwài)' is commonly utilized to provide additional information or to bring in a distinct topic in a conversation. It is equivalent to using 'additionally', 'furthermore', or 'also' in English. This term is frequently used in formal language both spoken and written.",
    "formation": "另外 + Sentence (additional information)",
    "examples": [
      {
        "cn": "另外，我还需要告诉你，我们的会议时间已经变更为下午三点。",
        "pinyin": "Lìngwài, wǒ hái xūyào gàosù nǐ, wǒmen de huìyì shíjiān yǐjīng biàngēng wéi xiàwǔ sān diǎn.",
        "en": "Additionally, I need to tell you that our meeting time has been changed to three in the afternoon.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Additionally_furthermore_20231230_另外我还需要告诉你我们的会议时间已经变更为下午三点.mp3"
      },
      {
        "cn": "另外，我想提醒你明天提交你的报告。",
        "pinyin": "Lìngwài, wǒ xiǎng tíxǐng nǐ míngtiān tíjiǎo nǐ de bàogào.",
        "en": "Furthermore, I want to remind you to submit your report tomorrow.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Additionally_furthermore_20231230_另外我想提醒你明天提交你的报告.mp3"
      },
      {
        "cn": "另外，我们计划明年夏天去北京旅行。",
        "pinyin": "Lìngwài, wǒmen jìhuà míngnián xiàtiān qù Běijīng lǚxíng.",
        "en": "Additionally, we are planning to travel to Beijing next summer.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Additionally_furthermore_20231230_另外我们计划明年夏天去北京旅行.mp3"
      },
      {
        "cn": "另外，中午的餐厅非常繁忙，我们决定下午再去。",
        "pinyin": "Lìngwài, zhōngwǔ de cāntīng fēicháng fánmáng, wǒmen juédìng xiàwǔ zài qù.",
        "en": "Furthermore, the restaurant was very busy at noon, so we decided to go in the afternoon instead.",
        "grammar_audio": "/audio/mandarin/grammar/s_另外_lìngwài_-_Additionally_furthermore_20231230_另外中午的餐厅非常繁忙我们决定下午再去.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "为了 (wèile) - In order to, for the purpose of",
    "short_explanation": "Used to denote the purpose or the goal of an action.",
    "long_explanation": "The Mandarin Chinese phrase '为了 (wèile)' is utilized to indicate the aim or intention behind conducting a particular action. It can be closely related to the English expressions 'in order to' or 'for the sake of'. This phrase is frequently used to describe the underlying motive of an action.",
    "formation": "为了 + Goal + Subject + Verb",
    "examples": [
      {
        "cn": "为了提高我的汉语水平，我决定每天都练习。",
        "pinyin": "Wèile tígāo wǒ de Hànyǔ shuǐpíng, wǒ juédìng měitiān dōu liànxí.",
        "en": "In order to improve my Chinese level, I have decided to practice every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_purpose_of_20231230_为了提高我的汉语水平我决定每天都练习.mp3"
      },
      {
        "cn": "他为了买这个电脑，存了一年的钱。",
        "pinyin": "Tā wèile mǎi zhège diànnǎo, cúnle yī nián de qián.",
        "en": "He saved money for a year in order to buy this computer.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_purpose_of_20231230_他为了买这个电脑存了一年的钱.mp3"
      },
      {
        "cn": "为了健康，你应该每天都锻炼。",
        "pinyin": "Wèile jiànkāng, nǐ yīnggāi měitiān dōu duànliàn.",
        "en": "For the sake of health, you should exercise every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_purpose_of_20231230_为了健康你应该每天都锻炼.mp3"
      },
      {
        "cn": "为了考试，他们每天都在图书馆学习直到很晚。",
        "pinyin": "Wèile kǎoshì, tāmen měitiān dōu zài túshūguǎn xuéxí zhídào hěn wǎn.",
        "en": "In order to prepare for the exam, they study in the library until late every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_为了_wèile_-_In_order_to_for_the_purpose_of_20231230_为了考试他们每天都在图书馆学习直到很晚.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "只要...就... (zhǐyào... jiù...) - As long as... then...",
    "short_explanation": "This structure is used to express 'as long as a certain condition is met, then a certain result will happen'.",
    "long_explanation": "The phrase '只要...就...' in Mandarin Chinese is used to indicate a condition and a result. It translates to 'as long as... then...' in English. It denotes the fact that if the condition (expressed after '只要') is met, then the action or situation (expressed after '就') is certain to happen.",
    "formation": "只要 + Condition, 就 + Result",
    "examples": [
      {
        "cn": "只要你努力，就一定能成功。",
        "pinyin": "Zhǐyào nǐ nǔlì, jiù yīdìng néng chénggōng.",
        "en": "As long as you work hard, you will definitely succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你努力就一定能成功.mp3"
      },
      {
        "cn": "只要他答应帮忙，我就放心了。",
        "pinyin": "Zhǐyào tā dāying bāngmáng, wǒ jiù fàngxīn le.",
        "en": "As long as he agrees to help, I will be relieved.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要他答应帮忙我就放心了.mp3"
      },
      {
        "cn": "只要你按时完成作业，就能提高你的分数。",
        "pinyin": "Zhǐyào nǐ ànshí wánchéng zuòyè, jiù néng tígāo nǐ de fēnshù.",
        "en": "As long as you complete the homework on time, you can improve your score.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要你按时完成作业就能提高你的分数.mp3"
      },
      {
        "cn": "只要我们坚持，就没有什么不能做到的。",
        "pinyin": "Zhǐyào wǒmen jiānchí, jiù méiyǒu shénme bù néng zuò dào de.",
        "en": "As long as we persist, there's nothing we cannot achieve.",
        "grammar_audio": "/audio/mandarin/grammar/s_只要就_zhǐyào_jiù_-_As_long_as_then_20231230_只要我们坚持就没有什么不能做到的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "即 (jí) - Namely, that is to say",
    "short_explanation": "Used to clarify, explain or rectify the meaning of the previous sentence or phrase.",
    "long_explanation": "The Mandarin Chinese word '即 (jí)' is a conjunction that is commonly used to provide a more specific explanation or the precise meaning of a term or phrase that has just been mentioned. It functions similarly to the English expressions 'namely' or 'that is to say'. This word is often used when the speaker wants to ensure that their point has been clearly understood or that there is no misunderstanding about a certain term or expression.",
    "formation": "Sentence/Phrase + 即 + Explanation/Clarification",
    "examples": [
      {
        "cn": "我们将前往美国的一个城市，即纽约。",
        "pinyin": "Wǒmen jiāng qiánwǎng Měiguó de yīgè chéngshì, jí Niǔyuē.",
        "en": "We will go to a city in the United States, namely New York.",
        "grammar_audio": "/audio/mandarin/grammar/s_即_jí_-_Namely_that_is_to_say_20231230_我们将前往美国的一个城市即纽约.mp3"
      },
      {
        "cn": "他喜欢吃水果，即苹果和橙子。",
        "pinyin": "Tā xǐhuān chī shuǐguǒ, jí píngguǒ hé chéngzi.",
        "en": "He likes to eat fruits, namely apples and oranges.",
        "grammar_audio": "/audio/mandarin/grammar/s_即_jí_-_Namely_that_is_to_say_20231230_他喜欢吃水果即苹果和橙子.mp3"
      },
      {
        "cn": "我将用我最喜欢的工具来进行这项任务，即我的笔记本电脑。",
        "pinyin": "Wǒ jiāng yòng wǒ zuì xǐhuan de gōngjù lái jìnxíng zhè xiàng rènwù, jí wǒ de bǐjìběn diànnǎo.",
        "en": "I will use my favorite tool to carry out this task, that is my laptop.",
        "grammar_audio": "/audio/mandarin/grammar/s_即_jí_-_Namely_that_is_to_say_20231230_我将用我最喜欢的工具来进行这项任务即我的笔记本电脑.mp3"
      },
      {
        "cn": "他们坐在房间的那一边，即靠近窗户的地方。",
        "pinyin": "Tāmen zuò zài fángjiān de nà yībiān, jí kàojìn chuānghu de dìfāng.",
        "en": "They are sitting on that side of the room, namely near the window.",
        "grammar_audio": "/audio/mandarin/grammar/s_即_jí_-_Namely_that_is_to_say_20231230_他们坐在房间的那一边即靠近窗户的地方.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "不见得 (bú jiàn de) - Not necessarily, not likely",
    "short_explanation": "Used to express doubt or to oppose an assertion.",
    "long_explanation": "The Mandarin Chinese phrase '不见得 (bú jiàn de)' is used when you want to express that something is not necessarily true or likely to happen. It is used to express doubt or opposition to an assertion, hinting at the effect of implying, 'Even if it is like what you say, I don’t think it will necessarily lead to the result you predicted.'",
    "formation": "Subject + Predicate + 不见得 + Outcome",
    "examples": [
      {
        "cn": "你说他会喜欢这个礼物，我不见得这样认为。",
        "pinyin": "Nǐ shuō tā huì xǐhuān zhège lǐwù, wǒ bú jiàn dé zhèyàng rènwéi.",
        "en": "You say he would like this gift, but I don't necessarily think so.",
        "grammar_audio": "/audio/mandarin/grammar/s_不见得_bú_jiàn_de_-_Not_necessarily_not_likely_20231230_你说他会喜欢这个礼物我不见得这样认为.mp3"
      },
      {
        "cn": "虽然他跑得快，但是赢比赛的可能性不见得大。",
        "pinyin": "Suīrán tā pǎo dé kuài, dànshì yíng bǐsài de kěnéngxìng bú jiàn dé dà.",
        "en": "Even though he runs fast, it doesn't necessarily mean he has a high chance of winning the race.",
        "grammar_audio": "/audio/mandarin/grammar/s_不见得_bú_jiàn_de_-_Not_necessarily_not_likely_20231230_虽然他跑得快但是赢比赛的可能性不见得大.mp3"
      },
      {
        "cn": "你认为学习更多的语言一定有利，我不见得同意这个看法。",
        "pinyin": "Nǐ rènwéi xuéxí gèng duō de yǔyán yīdìng yǒulì, wǒ bú jiàn dé tóngyì zhège kànfǎ.",
        "en": "You think that learning more languages is definitely beneficial, but I don't necessarily agree with this view.",
        "grammar_audio": "/audio/mandarin/grammar/s_不见得_bú_jiàn_de_-_Not_necessarily_not_likely_20231230_你认为学习更多的语言一定有利我不见得同意这个看法.mp3"
      },
      {
        "cn": "她参加了很多面试，但是找到工作的机会不见得高。",
        "pinyin": "Tā cānjiā le hěnduō miànshì, dànshì zhǎo dào gōngzuò de jīhuì bú jiàn dé gāo.",
        "en": "She has attended many interviews, but it doesn't necessarily mean she has a high chance of getting a job.",
        "grammar_audio": "/audio/mandarin/grammar/s_不见得_bú_jiàn_de_-_Not_necessarily_not_likely_20231230_她参加了很多面试但是找到工作的机会不见得高.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "除非 (chúfēi) - Unless, only if",
    "short_explanation": "Used to express the condition that the following situation must be true for the action in the main clause to happen.",
    "long_explanation": "The Mandarin Chinese phrase '除非 (chúfēi)' is a conjunction used to express a necessary, yet often unlikely condition for a certain event or action to take place. This translates to 'unless' or 'only if' in English. The structure '除非...否则...' ('chúfēi... fǒuzé...') can be translated as 'unless...otherwise...' or 'only if...or else...'.",
    "formation": "除非 + Condition A, (否则) + Result B",
    "examples": [
      {
        "cn": "除非你努力工作，否则你无法成功。",
        "pinyin": "Chúfēi nǐ nǔlì gōngzuò, fǒuzé nǐ wúfǎ chénggōng.",
        "en": "Unless you work hard, you cannot succeed.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_only_if_20231230_除非你努力工作否则你无法成功.mp3"
      },
      {
        "cn": "除非他道歉，我不会原谅他。",
        "pinyin": "Chúfēi tā dàoqiàn, wǒ bù huì yuánliàng tā.",
        "en": "I won't forgive him unless he apologizes.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_only_if_20231230_除非他道歉我不会原谅他.mp3"
      },
      {
        "cn": "除非你提前预订，否则你可能找不到酒店房间。",
        "pinyin": "Chúfēi nǐ tíqián yùdìng, fǒuzé nǐ kěnéng zhǎo bùdào jiǔdiàn fángjiān.",
        "en": "Unless you book in advance, you may not find a hotel room.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_only_if_20231230_除非你提前预订否则你可能找不到酒店房间.mp3"
      },
      {
        "cn": "除非他们改变策略，否则他们不会赢得比赛。",
        "pinyin": "Chúfēi tāmen gǎibiàn cèlüè, fǒuzé tāmen bù huì yíngdé bǐsài.",
        "en": "They won't win the match unless they change their strategy.",
        "grammar_audio": "/audio/mandarin/grammar/s_除非_chúfēi_-_Unless_only_if_20231230_除非他们改变策略否则他们不会赢得比赛.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "于是 (yúshì) - So, therefore, as a result",
    "short_explanation": "Used to indicate the result or consequence of a certain action or condition.",
    "long_explanation": "The Mandarin Chinese word '于是 (yúshì)' is used to transition from the cause of an event to its effect, similar to using 'so', 'therefore', or 'as a result' in English. It can be used in both formal and informal conversations to express the consequence or outcome of a previous activity, condition, or circumstance.",
    "formation": "Condition/Action + 于是 + Result",
    "examples": [
      {
        "cn": "他很累，于是早早地去睡觉了。",
        "pinyin": "Tā hěn lèi, yúshì zǎozǎo de qù shuìjiào le.",
        "en": "He was very tired, so he went to bed early.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_So_therefore_as_a_result_20231230_他很累于是早早地去睡觉了.mp3"
      },
      {
        "cn": "李明看到天黑了，于是决定回家。",
        "pinyin": "Lǐ Míng kàn dào tiān hēi le, yúshì juédìng huí jiā.",
        "en": "Li Ming saw it was getting dark, so he decided to go home.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_So_therefore_as_a_result_20231230_李明看到天黑了于是决定回家.mp3"
      },
      {
        "cn": "她没有带伞，于是在雨中跑回家。",
        "pinyin": "Tā méiyǒu dài sǎn, yúshì zài yǔ zhōng pǎo huí jiā.",
        "en": "She didn't bring an umbrella, so she ran home in the rain.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_So_therefore_as_a_result_20231230_她没有带伞于是在雨中跑回家.mp3"
      },
      {
        "cn": "他发现自己迷路了，于是打电话找朋友帮忙。",
        "pinyin": "Tā fāxiàn zìjǐ mílù le, yúshì dǎ diànhuà zhǎo péngyǒu bāngmáng.",
        "en": "He realized he was lost, so he called a friend for help.",
        "grammar_audio": "/audio/mandarin/grammar/s_于是_yúshì_-_So_therefore_as_a_result_20231230_他发现自己迷路了于是打电话找朋友帮忙.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "正当 (zhèngdāng) - Just as, right when",
    "short_explanation": "Used to indicate that something happened precisely at the moment something else was taking place",
    "long_explanation": "The Mandarin Chinese phrase '正当 (zhèngdāng)' is used to imply an event that took place exactly at the same time as another event. It is often used to add a sense of simultaneity and typically carries the sense 'just as' or 'right when' in English. The event described after '正当' is usually unexpected and interrupts the event described before '正当'.",
    "formation": "正当 + Event 1, Event 2",
    "examples": [
      {
        "cn": "正当我看电视的时候，突然停电了。",
        "pinyin": "Zhèngdāng wǒ kàn diànshì de shíhou, tūrán tíngdiàn le.",
        "en": "Just as I was watching TV, the power suddenly went out.",
        "grammar_audio": "/audio/mandarin/grammar/s_正当_zhèngdāng_-_Just_as_right_when_20231230_正当我看电视的时候突然停电了.mp3"
      },
      {
        "cn": "正当我们在公园里散步的时候，遇到了一个老朋友。",
        "pinyin": "Zhèngdāng wǒmen zài gōngyuán lǐ sànbù de shíhou, yù dào le yīgè lǎo péngyǒu.",
        "en": "Just as we were strolling in the park, we ran into an old friend.",
        "grammar_audio": "/audio/mandarin/grammar/s_正当_zhèngdāng_-_Just_as_right_when_20231230_正当我们在公园里散步的时候遇到了一个老朋友.mp3"
      },
      {
        "cn": "正当我准备离开的时候，他突然过来跟我说再见。",
        "pinyin": "Zhèngdāng wǒ zhǔnbèi líkāi de shíhou, tā tūrán guòlái gēn wǒ shuō zàijiàn.",
        "en": "Just as I was about to leave, he suddenly came over to say goodbye to me.",
        "grammar_audio": "/audio/mandarin/grammar/s_正当_zhèngdāng_-_Just_as_right_when_20231230_正当我准备离开的时候他突然过来跟我说再见.mp3"
      },
      {
        "cn": "正当他们举行婚礼的时候，突然开始下大雨。",
        "pinyin": "Zhèngdāng tāmen jǔxíng hūnlǐ de shíhou, tūrán kāishǐ xià dàyǔ.",
        "en": "Just as they were holding a wedding ceremony, it suddenly started to rain heavily.",
        "grammar_audio": "/audio/mandarin/grammar/s_正当_zhèngdāng_-_Just_as_right_when_20231230_正当他们举行婚礼的时候突然开始下大雨.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "甚至 (shènzhì) - Even, so much so that",
    "short_explanation": "Used to introduce an unexpected or extreme circumstance or result.",
    "long_explanation": "The Mandarin Chinese conjunction '甚至 (shènzhì)' is used to denote a degree that extends to unexpected or exceptional circumstances, similar to 'even' or 'so much so that' in English. It is used to accentuate a certain situation or add emphasis to an unusually extreme outcome. This word is commonly used when describing a situation that is more serious or beyond what one would usually expect.",
    "formation": "Sentence 1 + 甚至 + Sentence 2 (where Sentence 2 is an unexpected or extreme result)",
    "examples": [
      {
        "cn": "他每天锻炼，甚至在严寒的冬天也不会停止。",
        "pinyin": "Tā měitiān duànliàn, shènzhì zài yánhán de dōngtiān yě bù huì tíngzhǐ.",
        "en": "He exercises every day, even in the freezing winter he will not stop.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_他每天锻炼甚至在严寒的冬天也不会停止.mp3"
      },
      {
        "cn": "她热爱汉语学习，甚至决定去中国留学。",
        "pinyin": "Tā rèài Hànyǔ xuéxí, shènzhì juédìng qù Zhōngguó liúxué.",
        "en": "She loves studying Chinese, so much so that she decided to study abroad in China.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_她热爱汉语学习甚至决定去中国留学.mp3"
      },
      {
        "cn": "他对音乐充满热情，甚至在午夜也会弹吉他。",
        "pinyin": "Tā duì yīnyuè chōngmǎn rèqíng, shènzhì zài wǔyè yě huì tán jítā.",
        "en": "He is full of passion for music, even at midnight he will play the guitar.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_他对音乐充满热情甚至在午夜也会弹吉他.mp3"
      },
      {
        "cn": "这个菜太辣了，甚至有一些人吃了以后都哭了。",
        "pinyin": "Zhège cài tài làle, shènzhì yǒu yīxiē rén chīle yǐhòu dōu kūle.",
        "en": "This dish is so spicy, so much so that some people cried after eating it.",
        "grammar_audio": "/audio/mandarin/grammar/s_甚至_shènzhì_-_Even_so_much_so_that_20231230_这个菜太辣了甚至有一些人吃了以后都哭了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "若 (ruò) - If, in case",
    "short_explanation": "Used to express 'if' or 'in case of' in hypothetical conditions.",
    "long_explanation": "The Mandarin Chinese word '若 (ruò)' is used to convey conditional meanings like 'if' or 'in case' in English. It is used to show a condition that must be met for something else to happen. This is often used to express hypothetical situations or a course of action contingent on another action or event.",
    "formation": "若 + Condition, Sentence",
    "examples": [
      {
        "cn": "若他明天来，你要告诉他我找他。",
        "pinyin": "Ruò tā míngtiān lái, nǐ yào gàosu tā wǒ zhǎo tā.",
        "en": "If he comes tomorrow, you have to tell him I'm looking for him.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若他明天来你要告诉他我找他.mp3"
      },
      {
        "cn": "若我中了彩票，我将带你去环游世界。",
        "pinyin": "Ruò wǒ zhōng le cǎipiào, wǒ jiāng dài nǐ qù huányóu shìjiè.",
        "en": "If I win the lottery, I will take you to travel around the world.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若我中了彩票我将带你去环游世界.mp3"
      },
      {
        "cn": "若你累了，马上就休息。",
        "pinyin": "Ruò nǐ lèi le, mǎshàng jiù xiūxí.",
        "en": "Rest immediately if you are tired.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若你累了马上就休息.mp3"
      },
      {
        "cn": "若我们丢了比赛，我们就要更努力训练。",
        "pinyin": "Ruò wǒmen diū le bǐsài, wǒmen jiù yào gèng nǔlì xuànliàn.",
        "en": "If we lose the match, we need to train even harder.",
        "grammar_audio": "/audio/mandarin/grammar/s_若_ruò_-_If_in_case_20231230_若我们丢了比赛我们就要更努力训练.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "根本 (gēnběn) - At all, simply (as in 'not at all')",
    "short_explanation": "Used to emphasize a negative statement, similar to 'at all' or 'simply' in English.",
    "long_explanation": "The Mandarin Chinese word '根本 (gēnběn)' is a adverb that is often used for emphasis in negative statements, similar to the usage of 'at all' or 'simply' in English. It is generally used to stress the nonexistence or unlikelihood of a particular event, action, or situation. The term frequently appears before the verb in most sentence structures.",
    "formation": "Subject + 根本 + Negative Verb + Rest of the sentence",
    "examples": [
      {
        "cn": "他根本不喜欢看电影。",
        "pinyin": "Tā gēnběn bù xǐhuān kàn diànyǐng.",
        "en": "He doesn't like watching movies at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_根本_gēnběn_-_At_all_simply_as_in_not_at_all_20231230_他根本不喜欢看电影.mp3"
      },
      {
        "cn": "我根本没时间去旅游。",
        "pinyin": "Wǒ gēnběn méi shíjiān qù lǚyóu.",
        "en": "I simply don't have time to travel.",
        "grammar_audio": "/audio/mandarin/grammar/s_根本_gēnběn_-_At_all_simply_as_in_not_at_all_20231230_我根本没时间去旅游.mp3"
      },
      {
        "cn": "你的建议他根本不会听。",
        "pinyin": "Nǐ de jiànyì tā gēnběn bù huì tīng.",
        "en": "He won't listen to your advice at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_根本_gēnběn_-_At_all_simply_as_in_not_at_all_20231230_你的建议他根本不会听.mp3"
      },
      {
        "cn": "他根本就没有去过美国。",
        "pinyin": "Tā gēnběn jiù méiyǒu qùguò Měiguó.",
        "en": "He has never been to America at all.",
        "grammar_audio": "/audio/mandarin/grammar/s_根本_gēnběn_-_At_all_simply_as_in_not_at_all_20231230_他根本就没有去过美国.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "不料 (bùliào) - Unexpectedly",
    "short_explanation": "Used to express an unexpected turn of events.",
    "long_explanation": "The Mandarin Chinese expression '不料 (bùliào)' is used to indicate that something happened unexpectedly or contrary to what was expected. It often leads to a surprising event or outcome, and is used to add a sense of unpredictability or surprise to a statement.",
    "formation": "Sentence + 不料 + Unexpected event",
    "examples": [
      {
        "cn": "我以为他会迟到，不料他準时到达.",
        "pinyin": "Wǒ yǐwéi tā huì chídào, bùliào tā zhǔnshí dàodá.",
        "en": "I thought he would be late, but unexpectedly he arrived on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_不料_bùliào_-_Unexpectedly_20231230_我以为他会迟到不料他準时到达.mp3"
      },
      {
        "cn": "他们本来以为会赢得这场比赛，不料最后却输了。",
        "pinyin": "Tāmen běnlái yǐwéi huì yíngdé zhè chǎng bǐsài, bùliào zuìhòu què shūle.",
        "en": "They originally thought they would win the match, but unexpectedly they lost in the end.",
        "grammar_audio": "/audio/mandarin/grammar/s_不料_bùliào_-_Unexpectedly_20231230_他们本来以为会赢得这场比赛不料最后却输了.mp3"
      },
      {
        "cn": "他在森林中很小心地走，不料还是滑倒了。",
        "pinyin": "Tā zài sēnlín zhōng hěn xiǎoxīn de zǒu, bùliào háishì huá dǎole.",
        "en": "He was walking carefully in the forest, but unexpectedly he still slipped.",
        "grammar_audio": "/audio/mandarin/grammar/s_不料_bùliào_-_Unexpectedly_20231230_他在森林中很小心地走不料还是滑倒了.mp3"
      },
      {
        "cn": "昨天我去图书馆学习，不料碰到了我的老朋友。",
        "pinyin": "Zuótiān wǒ qù túshūguǎn xuéxí, bùliào pèng dàole wǒ de lǎo péngyǒu.",
        "en": "Yesterday I went to the library to study, but unexpectedly I bumped into my old friend.",
        "grammar_audio": "/audio/mandarin/grammar/s_不料_bùliào_-_Unexpectedly_20231230_昨天我去图书馆学习不料碰到了我的老朋友.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "似的 (shì de) - Seems like, as if",
    "short_explanation": "Used to express comparison or similarity.",
    "long_explanation": "The Mandarin Chinese phrase '似的 (shì de)' is used to describe something that seems like, or shows characteristics similar to something else. It correlates to the phrase 'as if' or 'like' in English. It is commonly used to highlight the similarities between two things or to imply a comparison.",
    "formation": "Subject + Verb + 似的 + Noun/Adjective",
    "examples": [
      {
        "cn": "他笑得像孩子似的可爱。",
        "pinyin": "Tā xiào de xiàng háizi shì de kě'ài.",
        "en": "He laughs as adorable as a child.",
        "grammar_audio": "/audio/mandarin/grammar/s_似的_shì_de_-_Seems_like_as_if_20231230_他笑得像孩子似的可爱.mp3"
      },
      {
        "cn": "天空中的乌云滚滚，像海浪似的翻腾。",
        "pinyin": "Tiānkōng zhōng de wūyún gǔngǔn, xiàng hǎilàng shì de fānténg.",
        "en": "The dark clouds in the sky are rolling, rippling like ocean waves.",
        "grammar_audio": "/audio/mandarin/grammar/s_似的_shì_de_-_Seems_like_as_if_20231230_天空中的乌云滚滚像海浪似的翻腾.mp3"
      },
      {
        "cn": "他忧郁的眼神，像雨天似的湿润。",
        "pinyin": "Tā yōuyù de yǎnshén, xiàng yǔtiān shì de shīrùn.",
        "en": "His melancholic eyes, moist as a rainy day.",
        "grammar_audio": "/audio/mandarin/grammar/s_似的_shì_de_-_Seems_like_as_if_20231230_他忧郁的眼神像雨天似的湿润.mp3"
      },
      {
        "cn": "她眼中闪烁的激情，像烈火似的燃烧。",
        "pinyin": "Tā yǎn zhōng shǎnshuò de jīqíng, xiàng lièhuǒ shì de ránshāo.",
        "en": "The passion flickering in her eyes is burning like a fierce fire.",
        "grammar_audio": "/audio/mandarin/grammar/s_似的_shì_de_-_Seems_like_as_if_20231230_她眼中闪烁的激情像烈火似的燃烧.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "75"
  },
  {
    "title": "顺便 (shùnbiàn) - By the way, while doing something else",
    "short_explanation": "Used to refer to doing something additional while primarily focusing on another action.",
    "long_explanation": "In Mandarin Chinese, '顺便 (shùnbiàn)' is an auxiliary word used to indicate that one task is done in addition to or along with another. It's equivalent to saying 'by the way' or 'while I'm at it' in English. It is often used to manage multiple tasks in an efficient manner by doing them simultaneously or in succession.",
    "formation": "Subject + Verb + 顺便 + Second Action",
    "examples": [
      {
        "cn": "我到超市买东西，顺便去邮局寄包裹。",
        "pinyin": "Wǒ dào chāoshì mǎi dōngxi, shùnbiàn qù yóujú jì bāoguǒ.",
        "en": "I go to the supermarket to buy things, and by the way, I go to the post office to send parcels.",
        "grammar_audio": "/audio/mandarin/grammar/s_顺便_shùnbiàn_-_By_the_way_while_doing_something_else_20231230_我到超市买东西顺便去邮局寄包裹.mp3"
      },
      {
        "cn": "明天我要去上海出差, 顺便参加一个朋友的婚礼。",
        "pinyin": "Míngtiān wǒ yào qù Shànghǎi chūchāi, shùnbiàn cānjiā yīgè péngyǒu de hūnlǐ.",
        "en": "I'm going to Shanghai on a business trip tomorrow, and by the way, I will attend a friend's wedding.",
        "grammar_audio": "/audio/mandarin/grammar/s_顺便_shùnbiàn_-_By_the_way_while_doing_something_else_20231230_明天我要去上海出差_顺便参加一个朋友的婚礼.mp3"
      },
      {
        "cn": "我去图书馆借书，顺便看一看新到的杂志。",
        "pinyin": "Wǒ qù túshūguǎn jiè shū, shùnbiàn kàn yī kàn xīn dào de zázhì.",
        "en": "I go to the library to borrow books, and by the way, take a look at the newly arrived magazines.",
        "grammar_audio": "/audio/mandarin/grammar/s_顺便_shùnbiàn_-_By_the_way_while_doing_something_else_20231230_我去图书馆借书顺便看一看新到的杂志.mp3"
      },
      {
        "cn": "你去学校的时候, 可以顺便帮我交这份报告吗？",
        "pinyin": "Nǐ qù xuéxiào de shíhòu, kěyǐ shùnbiàn bāng wǒ jiāo zhè fèn bàogào ma?",
        "en": "Can you hand in this report for me by the way when you go to school?",
        "grammar_audio": "/audio/mandarin/grammar/s_顺便_shùnbiàn_-_By_the_way_while_doing_something_else_20231230_你去学校的时候_可以顺便帮我交这份报告吗.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "由此 (yóucǐ) - Thus, hence",
    "short_explanation": "This expression is used to show the result or conclusion from the information or situation previously mentioned.",
    "long_explanation": "The Mandarin Chinese phrase '由此 (yóucǐ)' means 'thus', 'hence', or 'therefore'. It is a conjunction that shows the cause and effect relationship between two clauses. The preceding clause mentions a fact or a circumstance and the following clause expresses a conclusion or a result deriving from the first clause.",
    "formation": "Fact or circumstance + 由此 + Conclusion or result.",
    "examples": [
      {
        "cn": "他明白了这个问题的重要性，由此他决定把更多时间投入到研究中。",
        "pinyin": "Tā míngbái le zhège wèntí de zhòngyàoxìng, yóucǐ tā juédìng bǎ gèng duō shíjiān tóurù dào yánjiū zhōng.",
        "en": "He understood the importance of this issue, thus he decided to devote more time to the research.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Thus_hence_20231230_他明白了这个问题的重要性由此他决定把更多时间投入到研究中.mp3"
      },
      {
        "cn": "由此我们可以得出这样的结论：吃健康的食物对我们的健康有很大的益处。",
        "pinyin": "Yóucǐ wǒmen kěyǐ déchū zhèyàng de jiélùn: chī jiànkāng de shíwù duì wǒmen de jiànkāng yǒu hěn dà de yìchù.",
        "en": "Hence we can draw such a conclusion: Eating healthy food has great benefits for our health.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Thus_hence_20231230_由此我们可以得出这样的结论：吃健康的食物对我们的健康有很大的益处.mp3"
      },
      {
        "cn": "研究表明这种疾病的罹患率正在逐年增加，由此可见，我们需要采取更积极的预防措施。",
        "pinyin": "Yánjiū biǎomíng zhè zhǒng jíbìng de lí huàn lǜ zhèngzài zhúnián zēngjiā, yóucǐ kějiàn, wǒmen xūyào cǎiqǔ gèng jījí de yùfáng cuòshī.",
        "en": "Research shows that the incidence of this disease is increasing year by year, hence it is evident that we need to take more proactive preventive measures.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Thus_hence_20231230_研究表明这种疾病的罹患率正在逐年增加由此可见我们需要采取更积极的预防措施.mp3"
      },
      {
        "cn": "他已经通过了所有的考试，由此，他将得到硕士学位。",
        "pinyin": "Tā yǐjīng tōngguòle suǒyǒu de kǎoshì, yóucǐ, tā jiāng dédào shuòshì xuéwèi.",
        "en": "He has passed all the exams, thus, he will receive a master's degree.",
        "grammar_audio": "/audio/mandarin/grammar/s_由此_yóucǐ_-_Thus_hence_20231230_他已经通过了所有的考试由此他将得到硕士学位.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "假如 (jiǎrú) - Suppose, if",
    "short_explanation": "Used to express a hypothetical situation or condition.",
    "long_explanation": "The Mandarin Chinese phrase '假如 (jiǎrú)' is used when talking about theoretical or hypothetical situations. It is equivalent to the English word 'if', and is used to set up a condition that could potentially happen, although it may not be certain or actual. The phrase '假如' is followed by a clause that depicts the hypothetical scenario. Remember, '假如' refers to situations that are less definite or less factual.",
    "formation": "假如 + Clause 1 (Hypothetical Scenario), Clause 2 (Result)",
    "examples": [
      {
        "cn": "假如你赢了彩票，你会怎么做？我会先存起一部分，然后再考虑如何使用剩下的。",
        "pinyin": "Jiǎrú nǐ yíng le cǎipiào, nǐ huì zěnme zuò? Wǒ huì xiān cún qǐ yībùfen, ránhòu zài kǎolǜ rúhé shǐyòng shèng xià de.",
        "en": "If you won the lottery, what would you do? I would first save a part of it, then consider how to use the rest.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_Suppose_if_20231230_假如你赢了彩票你会怎么做我会先存起一部分然后再考虑如何使用剩下的.mp3"
      },
      {
        "cn": "假如你可以在世界上任何一个地方旅行，你会选择哪里？我会选择去法国巴黎。",
        "pinyin": "Jiǎrú nǐ kěyǐ zài shìjiè shàng rènhé yīgè dìfāng lǚxíng, nǐ huì xuǎnzé nǎlǐ? Wǒ huì xuǎnzé qù Fǎguó Bālí.",
        "en": "If you could travel anywhere in the world, where would you choose? I would choose to go to Paris, France.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_Suppose_if_20231230_假如你可以在世界上任何一个地方旅行你会选择哪里我会选择去法国巴黎.mp3"
      },
      {
        "cn": "假如你的朋友需要帮助，但是你正在忙的话，你会怎么办？我会告诉他们我尽快帮他们。",
        "pinyin": "Jiǎrú nǐ de péngyǒu xūyào bāngzhù, dànshì nǐ zhèngzài máng dehuà, nǐ huì zěnme bàn? Wǒ huì gàosù tāmen wǒ jǐnkuài bāng tāmen.",
        "en": "If your friend needed help, but you were busy, what would you do? I would tell them that I would help them as soon as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_Suppose_if_20231230_假如你的朋友需要帮助但是你正在忙的话你会怎么办我会告诉他们我尽快帮他们.mp3"
      },
      {
        "cn": "假如你有一天可以不用上班，你想做什么？我想看一整天的电影。",
        "pinyin": "Jiǎrú nǐ yǒu yītiān kěyǐ bùyòng shàngbān, nǐ xiǎng zuò shénme? Wǒ xiǎng kàn yī zhěngtiān de diànyǐng.",
        "en": "If you had a day off work, what would you want to do? I would like to watch movies all day.",
        "grammar_audio": "/audio/mandarin/grammar/s_假如_jiǎrú_-_Suppose_if_20231230_假如你有一天可以不用上班你想做什么我想看一整天的电影.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "尤其 (yóuqí) - Especially, particularly",
    "short_explanation": "Used to stress a specific point or item among others.",
    "long_explanation": "The Mandarin Chinese word '尤其 (yóuqí)' is an adverb used to emphasize a specific point, item, or aspect within a context. It is equivalent to the term 'especially' or 'particularly' in English. This word is used when you want to stress or highlight something that stands out from the rest or is of great importance.",
    "formation": "Subject + Verb + 尤其 + Specific Point",
    "examples": [
      {
        "cn": "我喜欢吃水果，尤其是香蕉。",
        "pinyin": "Wǒ xǐhuan chī shuǐguǒ, yóuqí shì xiāngjiāo.",
        "en": "I like eating fruit, especially bananas.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我喜欢吃水果尤其是香蕉.mp3"
      },
      {
        "cn": "他对所有的课程都感兴趣，尤其是物理课。",
        "pinyin": "Tā duì suǒyǒu de kèchéng dōu gǎn xìngqù, yóuqí shì wùlǐ kè.",
        "en": "He is interested in all subjects, especially physics.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_他对所有的课程都感兴趣尤其是物理课.mp3"
      },
      {
        "cn": "这个城市有很多好玩的地方，尤其是博物馆。",
        "pinyin": "Zhè gè chéngshì yǒu hěn duō hǎowán de dìfang, yóuqí shì bówùguǎn.",
        "en": "This city has many interesting places, particularly the museums.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_这个城市有很多好玩的地方尤其是博物馆.mp3"
      },
      {
        "cn": "我在学校的活动中都参与，尤其是篮球比赛。",
        "pinyin": "Wǒ zài xuéxiào dè huódòng zhōng dōu cānyù, yóuqí shì lánqiú bǐsài.",
        "en": "I participate in all the activities at school, especially the basketball matches.",
        "grammar_audio": "/audio/mandarin/grammar/s_尤其_yóuqí_-_Especially_particularly_20231230_我在学校的活动中都参与尤其是篮球比赛.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "倘若 (tǎngruò) - If, supposing",
    "short_explanation": "Used to present a hypothetical situation or condition in Mandarin Chinese.",
    "long_explanation": "'倘若 (tǎngruò)' is a Chinese conjunction word used in the presentation of hypothetical scenarios or conditions. It is equivalent to the English 'if' or 'supposing'. This word is used when we are speculating about a condition which will bring about or may bring about a certain result.",
    "formation": "倘若 + Hypothetical Condition + Result",
    "examples": [
      {
        "cn": "倘若明天天气好，我们就去海边玩。",
        "pinyin": "Tǎngruò míngtiān tiānqì hǎo, wǒmen jiù qù hǎibiān wán.",
        "en": "If the weather is good tomorrow, we will go to the beach.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若明天天气好我们就去海边玩.mp3"
      },
      {
        "cn": "倘若你不忘记带护照，你就能准时登机。",
        "pinyin": "Tǎngruò nǐ bù wàngjì dài hùzhào, nǐ jiù néng zhǔnshí dēngjī.",
        "en": "If you don't forget to bring your passport, you will be able to board the plane on time.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若你不忘记带护照你就能准时登机.mp3"
      },
      {
        "cn": "倘若我有足够的钱，我就会购买一辆新车。",
        "pinyin": "Tǎngruò wǒ yǒu zúgòu de qián, wǒ jiù huì gòumǎi yī liàng xīnchē.",
        "en": "If I have enough money, I will buy a new car.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若我有足够的钱我就会购买一辆新车.mp3"
      },
      {
        "cn": "倘若你需要帮助，随时可以找我。",
        "pinyin": "Tǎngruò nǐ xūyào bāngzhù, suíshí kěyǐ zhǎo wǒ.",
        "en": "If you need help, you can find me at any time.",
        "grammar_audio": "/audio/mandarin/grammar/s_倘若_tǎngruò_-_If_supposing_20231230_倘若你需要帮助随时可以找我.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "否则 (fǒuzé) - Otherwise, or else",
    "short_explanation": "Used to present potential negative consequences if a certain condition is not met.",
    "long_explanation": "The term '否则 (fǒuzé)' in Mandarin Chinese is a conjunction used to introduce a clause indicating the negative result that will happen if the action in the main clause does not occur. It corresponds to 'otherwise' or 'or else' used in English. It hints at undesirable consequences if a specific condition is not fulfilled.",
    "formation": "Sentence/Action + 否则 + Negative Consequence",
    "examples": [
      {
        "cn": "你应该在冬天穿的暖和一些，否则你会感冒的。",
        "pinyin": "Nǐ yīnggāi zài dōngtiān chuān de nuǎnhuo yīxiē, fǒuzé nǐ huì gǎnmào de.",
        "en": "You should dress warmly in winter, otherwise you will catch a cold.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_or_else_20231230_你应该在冬天穿的暖和一些否则你会感冒的.mp3"
      },
      {
        "cn": "请准时提交作业，否则将会扣除分数。",
        "pinyin": "Qǐng zhǔnshí tíjiǎo zuòyè, fǒuzé jiāng huì kòuchú fēnshù.",
        "en": "Please submit your homework on time, otherwise points will be deducted.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_or_else_20231230_请准时提交作业否则将会扣除分数.mp3"
      },
      {
        "cn": "我们必须尽早出发，否则我们会错过飞机。",
        "pinyin": "Wǒmen bìxū jǐnzǎo chūfā, fǒuzé wǒmen huì cuòguò fēijī.",
        "en": "We must set off as early as possible, otherwise we will miss the plane.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_or_else_20231230_我们必须尽早出发否则我们会错过飞机.mp3"
      },
      {
        "cn": "你必须学习努力，否则你将无法通过考试。",
        "pinyin": "Nǐ bìxū xuéxí nǔlì, fǒuzé nǐ jiāng wúfǎ tōngguò kǎoshì.",
        "en": "You must study hard, otherwise you will not be able to pass the exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_否则_fǒuzé_-_Otherwise_or_else_20231230_你必须学习努力否则你将无法通过考试.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "一旦...就... (yīdàn... jiù...) - Once... then...",
    "short_explanation": "Used to express the condition and result sequence or when something happens, then something else will follow.",
    "long_explanation": "The Mandarin Chinese grammar structure '一旦...就...' is used to denote a cause-and-effect relationship, where, once a certain condition is met, a certain result will follow. In English, this would be akin to the 'Once... then...' structure. It is usually used when the event is somewhat unexpected, inevitable, or irreversible.",
    "formation": "一旦 + Condition, 就 + Result",
    "examples": [
      {
        "cn": "一旦决定做就要全力以赴，不要留有遗憾。",
        "pinyin": "Yīdàn juédìng zuò jiùyào quánlìyǐfù, bùyào liú yǒu yíhàn.",
        "en": "Once you decide to do it, you should give it your all, and don't leave any regrets.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦决定做就要全力以赴不要留有遗憾.mp3"
      },
      {
        "cn": "这种药一旦停用就会有副作用。",
        "pinyin": "Zhèzhǒng yào yīdàn tíngyòng jiù huì yǒu fùzuòyòng.",
        "en": "Once you stop using this medicine, there will be side effects.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_这种药一旦停用就会有副作用.mp3"
      },
      {
        "cn": "一旦开始学习新的语言，就会发现一个新的世界。",
        "pinyin": "Yīdàn kāishǐ xuéxí xīn de yǔyán, jiù huì fāxiàn yīgè xīn de shìjiè.",
        "en": "Once you start learning a new language, you will discover a new world.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦开始学习新的语言就会发现一个新的世界.mp3"
      },
      {
        "cn": "一旦你试过飞翔，你就永远不会满足于走路。",
        "pinyin": "Yīdàn nǐ shìguò fēixiáng, nǐ jiù yǒngyuǎn bù huì mǎnzú yú zǒulù.",
        "en": "Once you have tasted flight, you will forever walk the earth with your eyes turned skyward.",
        "grammar_audio": "/audio/mandarin/grammar/s_一旦就_yīdàn_jiù_-_Once_then_20231230_一旦你试过飞翔你就永远不会满足于走路.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "正如 (zhèngrú) - Just as, as",
    "short_explanation": "Used to make comparisons or show similarity between two things.",
    "long_explanation": "The Mandarin Chinese phrase '正如 (zhèngrú)' is used to draw comparisons or similarities between two things or situations. It translates to 'just as' or 'as' in English. This phrase conveys the idea that something is the same or similar to something else in a particular aspect.",
    "formation": "正如 + Clause 1, Clause 2",
    "examples": [
      {
        "cn": "正如人们经常说的那样，生活就像一场马拉松。",
        "pinyin": "Zhèngrú rénmen jīngcháng shuō de nàyàng, shēnghuó jiù xiàng yīchǎng mǎlāsōng.",
        "en": "Just as people often say, life is like a marathon.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如人们经常说的那样生活就像一场马拉松.mp3"
      },
      {
        "cn": "正如老师所说，我们应该对待每一个人都要有礼貌。",
        "pinyin": "Zhèngrú lǎoshī suǒ shuō, wǒmen yīnggāi duìdài měi yīgèrén dōu yào yǒu lǐmào.",
        "en": "Just as the teacher said, we should be polite to everyone.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如老师所说我们应该对待每一个人都要有礼貌.mp3"
      },
      {
        "cn": "正如你所见，这个城市的夜景非常美丽。",
        "pinyin": "Zhèngrú nǐ suǒjiàn, zhège chéngshì de yèjǐng fēicháng měilì.",
        "en": "As you can see, the nightlife of this city is very beautiful.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如你所见这个城市的夜景非常美丽.mp3"
      },
      {
        "cn": "正如我前面提到的，你可以随时来我家玩。",
        "pinyin": "Zhèngrú wǒ qiánmiàn tí dào de, nǐ kěyǐ suíshí lái wǒ jiā wán.",
        "en": "As I mentioned before, you can come to my house to play at any time.",
        "grammar_audio": "/audio/mandarin/grammar/s_正如_zhèngrú_-_Just_as_as_20231230_正如我前面提到的你可以随时来我家玩.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "不禁 (bùjīn) - Can't help (doing something)",
    "short_explanation": "Used to express that one can't help but carry out a certain action, or express a certain feeling or emotion.",
    "long_explanation": "The Mandarin Chinese phrase '不禁 (bùjīn)' translates to 'can't help' in English and is used to express an uncontrollable action or feeling. Essentially, it's used to show that one is so affected by something that they can't help but respond in a certain way. It's not literally about something 'forbidden' but refers to a lack of control over a response to some stimulus.",
    "formation": "Subject + 不禁 + Verb",
    "examples": [
      {
        "cn": "听到这个好消息，他不禁笑了起来。",
        "pinyin": "Tīng dào zhège hǎo xiāoxi, tā bùjīn xiào le qǐlái.",
        "en": "Upon hearing the good news, he couldn't help but laugh.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_doing_something_20231230_听到这个好消息他不禁笑了起来.mp3"
      },
      {
        "cn": "看到她那样伤心，我不禁流下了眼泪。",
        "pinyin": "Kàn dào tā nà yàng shāngxīn, wǒ bùjīn liúxià le yǎnlèi.",
        "en": "Seeing her so sad, I couldn't help but shed tears.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_doing_something_20231230_看到她那样伤心我不禁流下了眼泪.mp3"
      },
      {
        "cn": "每次看到这部电影，我都不禁感到激动。",
        "pinyin": "Měi cì kàn dào zhè bù diànyǐng, wǒ dū bùjīn gǎndào jīdòng.",
        "en": "Every time I see this movie, I can't help but feel excited.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_doing_something_20231230_每次看到这部电影我都不禁感到激动.mp3"
      },
      {
        "cn": "走在冬天的雪地上，我不禁想起了童年的快乐时光。",
        "pinyin": "Zǒu zài dōngtiān de xuědì shàng, wǒ bùjīn xiǎngqǐle tóngnián de kuàilè shíguāng.",
        "en": "Walking on the snowy ground in winter, I can't help but remember the happy times of my childhood.",
        "grammar_audio": "/audio/mandarin/grammar/s_不禁_bùjīn_-_Cant_help_doing_something_20231230_走在冬天的雪地上我不禁想起了童年的快乐时光.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "既然 (jìrán) - Since, now that",
    "short_explanation": "Used to express that given a certain fact or situation, a certain action or consequence naturally follows.",
    "long_explanation": "The Mandarin Chinese phrase '既然 (jìrán)' is a conjunction that is similar to 'since' or 'now that' in English. It is used when the speaker has recognized a certain fact or circumstance, and naturally leads to a subsequent action, behavior, or result. It often implies a cause and effect relationship in sentences.",
    "formation": "(既然 + Known fact), (Consequent action or result)",
    "examples": [
      {
        "cn": "既然你不喜欢吃辣的，我们就去吃日本料理吧。",
        "pinyin": "Jìrán nǐ bù xǐhuān chī là de, wǒmen jiù qù chī Rìběn liàolǐ ba.",
        "en": "Since you don't like eating spicy food, let's go eat Japanese cuisine.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你不喜欢吃辣的我们就去吃日本料理吧.mp3"
      },
      {
        "cn": "既然今天是星期五，我们周末去旅游怎么样？",
        "pinyin": "Jìrán jīntiān shì Xīngqīwǔ, wǒmen zhōumò qù lǚyóu zěnme yàng?",
        "en": "Now that it's Friday, how about we go traveling on the weekend?",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然今天是星期五我们周末去旅游怎么样.mp3"
      },
      {
        "cn": "既然你已经决定了，我就支持你。",
        "pinyin": "Jìrán nǐ yǐjīng juédìngle, wǒ jiù zhīchí nǐ.",
        "en": "Since you've already decided, I'll support you.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然你已经决定了我就支持你.mp3"
      },
      {
        "cn": "既然已经下雨了，我们就不去公园了。",
        "pinyin": "Jìrán yǐjīng xià yǔle, wǒmen jiù bù qù gōngyuánle.",
        "en": "Now that it is raining, we will not go to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_既然_jìrán_-_Since_now_that_20231230_既然已经下雨了我们就不去公园了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "趁 (chèn) - Take advantage of, while",
    "short_explanation": "Used to express 'taking advantage of a situation or an opportunity'.",
    "long_explanation": "The Mandarin Chinese word '趁 (chèn)' is used to express the concept of 'taking advantage of a situation or an opportunity', or 'while'. It is used to indicate that an action is performed when there is an opportunity or while a certain situation holds true.",
    "formation": "Subject + 趁 + Situation + Verb Phrase",
    "examples": [
      {
        "cn": "趁着天还没完全黑，我们应该赶紧走。",
        "pinyin": "Chèn zhe tiān hái méi wánquán hēi, wǒmen yīnggāi gǎnjǐn zǒu.",
        "en": "We should hurry up and leave while it's not completely dark yet.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁着天还没完全黑我们应该赶紧走.mp3"
      },
      {
        "cn": "趁我还在家，你有问题可以问我。",
        "pinyin": "Chèn wǒ hái zài jiā, nǐ yǒu wèntí kěyǐ wèn wǒ.",
        "en": "You can ask me questions while I'm still at home.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_趁我还在家你有问题可以问我.mp3"
      },
      {
        "cn": "他趁老师不注意，偷偷看小说。",
        "pinyin": "Tā chèn lǎoshī bù zhùyì, tōutōu kàn xiǎoshuō.",
        "en": "He takes advantage of the teacher not paying attention to secretly read novels.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_他趁老师不注意偷偷看小说.mp3"
      },
      {
        "cn": "你可以趁着暑假去旅游。",
        "pinyin": "Nǐ kěyǐ chèn zhe shǔjià qù lǚyóu.",
        "en": "You can take advantage of the summer vacation to travel.",
        "grammar_audio": "/audio/mandarin/grammar/s_趁_chèn_-_Take_advantage_of_while_20231230_你可以趁着暑假去旅游.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "其中 (qízhōng) - Among, of which",
    "short_explanation": "Used to refer to a part or members of something.",
    "long_explanation": "The Mandarin Chinese phrase '其中 (qízhōng)' refers to a certain part, component, or member of a set, group, or whole. It is equivalent to 'among' or 'of which' in English. It is often used to provide specific information about a subgroup within a larger group or an aspect of a larger situation.",
    "formation": "Whole + 其中 + part",
    "examples": [
      {
        "cn": "我们班级有40个学生，其中有10个是留学生。",
        "pinyin": "Wǒmen bānjí yǒu 40 gè xuéshēng, qízhōng yǒu 10 gè shì liúxuéshēng.",
        "en": "There are 40 students in our class, among which 10 are international students.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_of_which_20231230_我们班级有40个学生其中有10个是留学生.mp3"
      },
      {
        "cn": "我已经看过了几百个电影，其中《教父》是我最喜欢的。",
        "pinyin": "Wǒ yǐjīng kàn guò le jǐ bǎi gè diànyǐng, qízhōng 《jiàofù》shì wǒ zuì xǐhuān de.",
        "en": "I have watched hundreds of movies, among which 'The Godfather' is my favorite.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_of_which_20231230_我已经看过了几百个电影其中《教父》是我最喜欢的.mp3"
      },
      {
        "cn": "中国有很多伟大的城市，其中北京和上海是最著名的。",
        "pinyin": "Zhōngguó yǒu hěnduō wěidà de chéngshì, qízhōng Běijīng hé Shànghǎi shì zuìzhùmíng de.",
        "en": "China has many great cities, of which Beijing and Shanghai are the most famous.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_of_which_20231230_中国有很多伟大的城市其中北京和上海是最著名的.mp3"
      },
      {
        "cn": "他写下了很多的诗，其中一首是关于爱情的。",
        "pinyin": "Tā xiěxià le hěnduō de shī, qízhōng yī shǒu shì guānyú àiqíng de.",
        "en": "He wrote many poems, one of which is about love.",
        "grammar_audio": "/audio/mandarin/grammar/s_其中_qízhōng_-_Among_of_which_20231230_他写下了很多的诗其中一首是关于爱情的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "就此 (jiùcǐ) - Thereupon, thus",
    "short_explanation": "Used to express the meaning 'thus' or 'thereupon', implying that one event or situation is a direct response or result of a previous one.",
    "long_explanation": "The Mandarin Chinese phrase '就此 (jiùcǐ)' is used to indicate the meaning 'as a result' or 'thereupon'. It is usually used in conjunction with a preceding event or situation to express that something is a direct effect or response to this action or situation. It can thus be compared to English expressions like 'then', 'therefore', or 'as a result'. A significant property of '就此 (jiùcǐ)' is that it often implies an immediate or abrupt action or change.",
    "formation": "Event/Situation 1, 就此 + Event/Situation 2",
    "examples": [
      {
        "cn": "我想，所有的悲伤就此结束。",
        "pinyin": "Wǒ xiǎng, suǒyǒu de bēishāng jiù cǐ jiéshù.",
        "en": "I wish, all the sorrow ends thus.",
        "grammar_audio": "/audio/mandarin/grammar/s_就此_jiùcǐ_-_Thereupon_thus_20231230_我想所有的悲伤就此结束.mp3"
      },
      {
        "cn": "他突然决定停下来，就此离开了公司。",
        "pinyin": "Tā tūrán juédìng tíng xià lái, jiù cǐ líkāi le gōngsī.",
        "en": "He suddenly decided to stop and thereupon left the company.",
        "grammar_audio": "/audio/mandarin/grammar/s_就此_jiùcǐ_-_Thereupon_thus_20231230_他突然决定停下来就此离开了公司.mp3"
      },
      {
        "cn": "她接到了这个消息，就此决定改变计划。",
        "pinyin": "Tā jiēdào le zhège xiāoxi, jiù cǐ juédìng gǎibiàn jìhuà.",
        "en": "She received this news and thus decided to change the plan.",
        "grammar_audio": "/audio/mandarin/grammar/s_就此_jiùcǐ_-_Thereupon_thus_20231230_她接到了这个消息就此决定改变计划.mp3"
      },
      {
        "cn": "我们在这个小镇发现了一份宝藏，就此开始了新的生活。",
        "pinyin": "Wǒmen zài zhège xiǎo zhèn fāxiàn le yī fèn bǎozàng, jiù cǐ kāishǐ le xīn de shēnghuó.",
        "en": "We found a treasure in this small town and thereupon began a new life.",
        "grammar_audio": "/audio/mandarin/grammar/s_就此_jiùcǐ_-_Thereupon_thus_20231230_我们在这个小镇发现了一份宝藏就此开始了新的生活.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "无非 (wúfēi) - Nothing but, no more than",
    "short_explanation": "Used to express 'nothing but', 'just', 'merely', indicating that something is not as complicated as it appears.",
    "long_explanation": "无非 (wúfēi) is used in Mandarin Chinese to express the idea of 'nothing but' or 'simply'. It is often used when a speaker wants to indicate something is not as complicated or significant as it might initially appear. In other words, the situation or object being discussed is 'nothing more than' the simple or basic elements that the speaker then goes on to describe.",
    "formation": "The phrase usually comes after the subject and before the verb in a sentence. Subject + 无非 + Description.",
    "examples": [
      {
        "cn": "他的工作无非就是每天接听几个电话。",
        "pinyin": "Tā de gōngzuò wúfēi jiùshì měitiān jiētīng jǐ gè diànhuà.",
        "en": "His job is nothing more than answering a few phone calls every day.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_no_more_than_20231230_他的工作无非就是每天接听几个电话.mp3"
      },
      {
        "cn": "这个项目的目标无非是提升我们的产品质量。",
        "pinyin": "Zhège xiàngmù de mùbiāo wúfēi shì tíshēng wǒmen de chǎnpǐn zhìliàng.",
        "en": "The goal of this project is simply to improve the quality of our products.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_no_more_than_20231230_这个项目的目标无非是提升我们的产品质量.mp3"
      },
      {
        "cn": "他去北京无非是为了找个好工作。",
        "pinyin": "Tā qù běijīng wúfēi shì wèile zhǎo gè hǎo gōngzuò.",
        "en": "He is going to Beijing for nothing more than finding a good job.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_no_more_than_20231230_他去北京无非是为了找个好工作.mp3"
      },
      {
        "cn": "这个问题无非是由于沟通不足引起的。",
        "pinyin": "Zhège wèntí wúfēi shì yóuyú gōutōng bùzú yǐnqǐ de.",
        "en": "This issue is simply caused by lack of communication.",
        "grammar_audio": "/audio/mandarin/grammar/s_无非_wúfēi_-_Nothing_but_no_more_than_20231230_这个问题无非是由于沟通不足引起的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "究竟 (jiūjìng) - After all, in the end",
    "short_explanation": "Used to intensify a question or to express impatience or urgency in knowing the answer.",
    "long_explanation": "The Mandarin Chinese word '究竟 (jiūjìng)' is used to emphasize a question or to express a sense of urgency or impatience in wanting to know the answer. It can denote a sense of after all or in the end, and it's usually used in question contexts. A rough English equivalence can be found in phrases such as 'in the end', 'finally', or 'once and for all'.",
    "formation": "究竟 + Question",
    "examples": [
      {
        "cn": "你究竟想去哪里？我想去中国旅游。",
        "pinyin": "Nǐ jiūjìng xiǎng qù nǎlǐ? Wǒ xiǎng qù Zhōngguó lǚyóu.",
        "en": "Where do you really want to go? I want to go to China for a trip.",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_你究竟想去哪里我想去中国旅游.mp3"
      },
      {
        "cn": "你究竟为什么那么喜欢看电影？因为我对电影的故事情节和人物角色的刻画非常感兴趣。",
        "pinyin": "Nǐ jiūjìng wèishénme nàme xǐhuān kàn diànyǐng? Yīnwèi wǒ duì diànyǐng de gùshì qíngjié hé rénwù juésè de kèhuà fēicháng gǎn xìngqù.",
        "en": "Why do you love watching movies so much? Because I'm very interested in the plot and character portrayal in films.",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_你究竟为什么那么喜欢看电影因为我对电影的故事情节和人物角色的刻画非常感兴趣.mp3"
      },
      {
        "cn": "他究竟为什么还没有回家？他可能还在工作。",
        "pinyin": "Tā jiūjìng wèishénme hái méiyǒu huí jiā? Tā kěnéng hái zài gōngzuò.",
        "en": "Why hasn't he come home yet? He might still be working.",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_他究竟为什么还没有回家他可能还在工作.mp3"
      },
      {
        "cn": "你究竟为什么想学习中文？因为我对中国的文化和历史感兴趣。",
        "pinyin": "Nǐ jiūjìng wèishénme xiǎng xuéxí Zhōngwén? Yīnwèi wǒ duì Zhōngguó de wénhuà hé lìshǐ gǎn xìngqù.",
        "en": "Why do you want to study Chinese? Because I have interest in Chinese culture and history.",
        "grammar_audio": "/audio/mandarin/grammar/s_究竟_jiūjìng_-_After_all_in_the_end_20231230_你究竟为什么想学习中文因为我对中国的文化和历史感兴趣.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "竟然 (jìngrán) - Unexpectedly, to one's surprise",
    "short_explanation": "Used to express something unexpected or surprising.",
    "long_explanation": "'竟然 (jìngrán)' is a grammatical expression in Mandarin Chinese that is used to convey surprise or disbelief about an event or action that is unexpected or contrary to one's belief or assumption. In English, it would be equivalent to 'unexpectedly' or 'to one's surprise'.",
    "formation": "Subject + Time/Place (optional) + 竟然 + Predicate",
    "examples": [
      {
        "cn": "我竟然在考试中得了满分，真是太让人惊喜了。",
        "pinyin": "Wǒ jìngrán zài kǎoshì zhōng déle mǎnfēn, zhēnshi tài ràng rén jīngxǐ le.",
        "en": "I unexpectedly got a full score in the exam, it's really surprising.",
        "grammar_audio": "/audio/mandarin/grammar/s_竟然_jìngrán_-_Unexpectedly_to_ones_surprise_20231230_我竟然在考试中得了满分真是太让人惊喜了.mp3"
      },
      {
        "cn": "雨竟然停了，我们可以出去玩了。",
        "pinyin": "Yǔ jìngrán tíng le, wǒmen kěyǐ chūqù wán le.",
        "en": "The rain unexpectedly stopped, we can go out and play now.",
        "grammar_audio": "/audio/mandarin/grammar/s_竟然_jìngrán_-_Unexpectedly_to_ones_surprise_20231230_雨竟然停了我们可以出去玩了.mp3"
      },
      {
        "cn": "这家餐馆的菜竟然那么好吃，我真没想到。",
        "pinyin": "Zhè jiā cānguǎn de cài jìngrán nàme hǎochī, wǒ zhēn méi xiǎngdào.",
        "en": "The food in this restaurant is unexpectedly delicious, I really didn't expect it.",
        "grammar_audio": "/audio/mandarin/grammar/s_竟然_jìngrán_-_Unexpectedly_to_ones_surprise_20231230_这家餐馆的菜竟然那么好吃我真没想到.mp3"
      },
      {
        "cn": "他竟然没完成作业，老师会很生气的。",
        "pinyin": "Tā jìngrán méi wánchéng zuòyè, lǎoshī huì hěn shēngqì de.",
        "en": "He unexpectedly didn't finish his homework, the teacher will be very angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_竟然_jìngrán_-_Unexpectedly_to_ones_surprise_20231230_他竟然没完成作业老师会很生气的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "只不过 (zhǐbùguò) - Merely, only",
    "short_explanation": "Used to describe a fact or situation, downplaying its significance.",
    "long_explanation": "The Mandarin Chinese phrase '只不过 (zhǐbùguò)' means 'merely' or 'only' and is most commonly used in negative responses or to emphasize the insignificance or simplicity of the situation. It can be used to make an event or fact seem less dramatic, serious, or important than it may have originally been perceived.",
    "formation": "只不过 + Statement",
    "examples": [
      {
        "cn": "她只不过是一个普通的女孩，但她有一颗善良的心。",
        "pinyin": "Tā zhǐbùguò shì yīgè pǔtōng de nǚhái, dàn tā yǒu yī kē shànlìang de xīn.",
        "en": "She's just an ordinary girl, but she has a kind heart.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐbùguò_-_Merely_only_20231230_她只不过是一个普通的女孩但她有一颗善良的心.mp3"
      },
      {
        "cn": "我们只不过是朋友，他不是我男朋友。",
        "pinyin": "Wǒmen zhǐbùguò shì péngyǒu, tā bùshì wǒ nán péngyǒu.",
        "en": "We're just friends, he's not my boyfriend.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐbùguò_-_Merely_only_20231230_我们只不过是朋友他不是我男朋友.mp3"
      },
      {
        "cn": "这只不过是一个小错误，没什么大不了的。",
        "pinyin": "Zhè zhǐbùguò shì yīgè xiǎo cuòwù, méi shénme dàbùliǎo de.",
        "en": "This is just a minor mistake, it's not a big deal.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐbùguò_-_Merely_only_20231230_这只不过是一个小错误没什么大不了的.mp3"
      },
      {
        "cn": "他只不过是开个玩笑，不要生气。",
        "pinyin": "Tā zhǐbùguò shì kāi gè wánxiào, bùyào shēngqì.",
        "en": "He was just joking, don't get mad.",
        "grammar_audio": "/audio/mandarin/grammar/s_只不过_zhǐbùguò_-_Merely_only_20231230_他只不过是开个玩笑不要生气.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "早已 (zǎoyǐ) - Long ago, for a long time",
    "short_explanation": "Used to indicate something that has happened or been true for a long time.",
    "long_explanation": "早已 (zǎoyǐ) is a Mandarin Chinese adverb that signifies something has occurred or been in existence for a long duration. It is similar to the English terms 'long ago' or 'for a long time'. This adverb is typically used to show that an action or situation occurred well apart from the present time, and its influence or effect has been ongoing.",
    "formation": "Subject + 早已 + Verb/Adjective",
    "examples": [
      {
        "cn": "我早已听说你要回国了。",
        "pinyin": "Wǒ zǎoyǐ tīngshuō nǐ yào huíguó le.",
        "en": "I heard long ago that you were going to return to your country.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_我早已听说你要回国了.mp3"
      },
      {
        "cn": "他早已不再住在这个城市了。",
        "pinyin": "Tā zǎoyǐ bù zài zhù zài zhège chéngshì le.",
        "en": "He hasn't lived in this city for a long time.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_他早已不再住在这个城市了.mp3"
      },
      {
        "cn": "她早已忘记了那个痛苦的记忆。",
        "pinyin": "Tā zǎoyǐ wàngjì le nàgè tòngkǔ de jìyì.",
        "en": "She has long forgotten that painful memory.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_她早已忘记了那个痛苦的记忆.mp3"
      },
      {
        "cn": "你早已该知道我是对你的感情了。",
        "pinyin": "Nǐ zǎoyǐ gāi zhīdào wǒ shì duì nǐ de gǎnqíng le.",
        "en": "You should've known about my feelings for you a long time ago.",
        "grammar_audio": "/audio/mandarin/grammar/s_早已_zǎoyǐ_-_Long_ago_for_a_long_time_20231230_你早已该知道我是对你的感情了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "不光...还... (bù guāng... hái...) - Not only... but also...",
    "short_explanation": "Used to express not just one thing, but also some additional things.",
    "long_explanation": "The Mandarin Chinese phrase '不光...还...' (bù guāng... hái...) is a conjunction used to express that not only is one thing true, but also some other additional things. It is equivalent to saying 'not only... but also...' in English. This phrase is often used to emphasize an unexpected additional matter or highlight the range or extent of a particular situation.",
    "formation": "不光 + Statement 1 +，还 + Statement 2",
    "examples": [
      {
        "cn": "他不光会说英语，还会说法语和西班牙语。",
        "pinyin": "Tā bù guāng huì shuō Yīngyǔ, hái huì shuō Fǎyǔ hé Xībānyáyǔ.",
        "en": "He not only speaks English, but also speaks French and Spanish.",
        "grammar_audio": "/audio/mandarin/grammar/s_不光还_bù_guāng_hái_-_Not_only_but_also_20231230_他不光会说英语还会说法语和西班牙语.mp3"
      },
      {
        "cn": "这个城市不光有美丽的风景，还有丰富的历史文化。",
        "pinyin": "Zhège chéngshì bù guāng yǒu měilì de fēngjǐng, hái yǒu fēngfù de lìshǐ wénhuà.",
        "en": "This city not only has beautiful scenery, but also has a rich historical culture.",
        "grammar_audio": "/audio/mandarin/grammar/s_不光还_bù_guāng_hái_-_Not_only_but_also_20231230_这个城市不光有美丽的风景还有丰富的历史文化.mp3"
      },
      {
        "cn": "她不光聪明，还很善良。",
        "pinyin": "Tā bù guāng cōngmíng, hái hěn shànliáng.",
        "en": "She is not only smart, but also very kind.",
        "grammar_audio": "/audio/mandarin/grammar/s_不光还_bù_guāng_hái_-_Not_only_but_also_20231230_她不光聪明还很善良.mp3"
      },
      {
        "cn": "我不光喜欢看电影，还喜欢剧本创作。",
        "pinyin": "Wǒ bù guāng xǐhuān kàn diànyǐng, hái xǐhuān jùběn chuàngzuò.",
        "en": "I not only like watching movies, but also enjoy scriptwriting.",
        "grammar_audio": "/audio/mandarin/grammar/s_不光还_bù_guāng_hái_-_Not_only_but_also_20231230_我不光喜欢看电影还喜欢剧本创作.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "何况 (hékùang) - Let alone, much less",
    "short_explanation": "Used to raise an even stronger point after stating a less strong point.",
    "long_explanation": "The Mandarin Chinese expression '何况 (hékùang)' is used to introduce a further point or argument that is even more persuasive than the one just made. It can be translated in English as 'let alone', 'much less' or 'not to mention'. By using 何况, you can express that if a certain condition can't be met or is already problematic, then the situation mentioned afterward, which is generally more extreme or harder to achieve, is definitely impossible or even more problematic.",
    "formation": "Statement 1 +，何况 + Statement 2 (usually more extreme)",
    "examples": [
      {
        "cn": "我连普通的汉字都写不好，何况这样复杂的句子。",
        "pinyin": "Wǒ lián pǔtōng de hànzì dōu xiě bù hǎo, hékuàng zhèyàng fùzá de jùzi.",
        "en": "I can't even write ordinary Chinese characters well, let alone such complex sentences.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékùang_-_Let_alone_much_less_20231230_我连普通的汉字都写不好何况这样复杂的句子.mp3"
      },
      {
        "cn": "我连烧水都不会，何况做饭。",
        "pinyin": "Wǒ lián shāo shuǐ dōu bù huì, hékuàng zuò fàn.",
        "en": "I can't even boil water, let alone cook.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékùang_-_Let_alone_much_less_20231230_我连烧水都不会何况做饭.mp3"
      },
      {
        "cn": "他都不会玩简单的游戏，何况这种专业级别的游戏。",
        "pinyin": "Tā dōu bù huì wán jiǎndān de yóuxì, hékuàng zhè zhǒng zhuānyè jíbié de yóuxì.",
        "en": "He can't even play simple games, much less this kind of professional level game.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékùang_-_Let_alone_much_less_20231230_他都不会玩简单的游戏何况这种专业级别的游戏.mp3"
      },
      {
        "cn": "如果你连五分钟都无法专心，何况一整天。",
        "pinyin": "Rúguǒ nǐ lián wǔ fēnzhōng dōu wúfǎ zhuānxīn, hékuàng yī zhěng tiān.",
        "en": "If you can't focus for even five minutes, much less a whole day.",
        "grammar_audio": "/audio/mandarin/grammar/s_何况_hékùang_-_Let_alone_much_less_20231230_如果你连五分钟都无法专心何况一整天.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "难怪 (nánguài) - No wonder, so that's why",
    "short_explanation": "Used to express realization, surprise, or understanding about a situation.",
    "long_explanation": "The Mandarin Chinese expression '难怪 (nánguài)' is often used when the speaker suddenly understands or realizes the reason for something, similar to the expressions 'no wonder' or 'so that's why' in English. It is usually used when a previous confusion, mystery, or question has been clarified or answered.",
    "formation": "难怪+Subject + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "难怪你昨天没来上班，原来你生病了。",
        "pinyin": "Nánguài nǐ zuótiān méi lái shàngbān, yuánlái nǐ shēngbìng le.",
        "en": "No wonder you didn't come to work yesterday, so you were sick.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪你昨天没来上班原来你生病了.mp3"
      },
      {
        "cn": "难怪他跑得这么快，他原来是田径队的。",
        "pinyin": "Nánguài tā pǎo de zhème kuài, tā yuánlái shì tiánjìng duì de.",
        "en": "No wonder he runs so fast, he is actually from the track and field team.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪他跑得这么快他原来是田径队的.mp3"
      },
      {
        "cn": "难怪这家餐厅的菜这么好吃，厨师是从四川来的。",
        "pinyin": "Nánguài zhè jiā cāntīng de cài zhème hǎochī, chúshī shì cóng Sìchuān lái de.",
        "en": "No wonder the food in this restaurant is so delicious, the chef is from Sichuan.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪这家餐厅的菜这么好吃厨师是从四川来的.mp3"
      },
      {
        "cn": "难怪他每天都这么早来学校，原来他要先做早操。",
        "pinyin": "Nánguài tā měitiān dōu zhème zǎo lái xuéxiào, yuánlái tā yào xiān zuò zǎocāo.",
        "en": "No wonder he comes to school so early every day, he has to do morning exercises first.",
        "grammar_audio": "/audio/mandarin/grammar/s_难怪_nánguài_-_No_wonder_so_thats_why_20231230_难怪他每天都这么早来学校原来他要先做早操.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "既...又... (jì... yòu...) - Both... and...",
    "short_explanation": "Used to indicate that something or someone has two or more qualities or characteristics at the same time.",
    "long_explanation": "The Mandarin Chinese structure '既...又...' is used to indicate that something or someone possesses two or more qualities simultaneously. In English, this would often be translated as 'both... and....'. It is used to emphasize that all the mentioned qualities or characteristics apply, not just one or the other.",
    "formation": "Subject + 既 + Adjective/Verb 1 + 又 + Adjective/Verb 2",
    "examples": [
      {
        "cn": "他既聪明又勤奋，是我们班上的优秀学生。",
        "pinyin": "Tā jì cōngmíng yòu qínfèn, shì wǒmen bānshàng de yōuxiù xuéshēng.",
        "en": "He is both intelligent and hardworking, and is an excellent student in our class.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_他既聪明又勤奋是我们班上的优秀学生.mp3"
      },
      {
        "cn": "这部电影既搞笑又感人，真的很值得一看。",
        "pinyin": "Zhè bù diànyǐng jì gǎoxiào yòu gǎnrén, zhēn de hěn zhídé yī kàn.",
        "en": "This movie is both funny and touching, it's really worth watching.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这部电影既搞笑又感人真的很值得一看.mp3"
      },
      {
        "cn": "她的新歌既有节奏感又富有情感，听起来很有韵味。",
        "pinyin": "Tā de xīn gē jì yǒu jiézòu gǎn yòu fù yǒu qínggǎn, tīng qǐlái hěn yǒu yùnwèi.",
        "en": "Her new song has both rhythm and emotion, it sounds very appealing.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_她的新歌既有节奏感又富有情感听起来很有韵味.mp3"
      },
      {
        "cn": "这个决定既合理又公正，我们大家都很满意。",
        "pinyin": "Zhè gè juédìng jì hélǐ yòu gōngzhèng, wǒmén dàjiā dōu hěn mǎnyì.",
        "en": "This decision is both reasonable and fair, we are all very satisfied.",
        "grammar_audio": "/audio/mandarin/grammar/s_既又_jì_yòu_-_Both_and_20231230_这个决定既合理又公正我们大家都很满意.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "莫非 (mòfēi) - Could it be that, unless",
    "short_explanation": "This is used when the speaker is speculating or guessing about a situation.",
    "long_explanation": "The Mandarin Chinese phrase '莫非 (mòfēi)' can translate to 'could it be that' or 'unless' and is generally used when the speaker is hypothesizing, surmising, or musing over certain facts or scenarios. This phrase typically indicates the speaker's element of doubt or assumption about something.",
    "formation": "莫非 + Hypothetical situation or assumption",
    "examples": [
      {
        "cn": "莫非你已经知道这个秘密了？",
        "pinyin": "Mòfēi nǐ yǐjīng zhīdào zhège mìmì le?",
        "en": "Could it be that you already know this secret?",
        "grammar_audio": "/audio/mandarin/grammar/s_莫非_mòfēi_-_Could_it_be_that_unless_20231230_莫非你已经知道这个秘密了.mp3"
      },
      {
        "cn": "莫非他是因为病得太重而没来学校的？",
        "pinyin": "Mòfēi tā shì yīnwèi bìng dé tài zhòng ér méi lái xuéxiào de?",
        "en": "Could it be that he didn't come to school because he was too sick?",
        "grammar_audio": "/audio/mandarin/grammar/s_莫非_mòfēi_-_Could_it_be_that_unless_20231230_莫非他是因为病得太重而没来学校的.mp3"
      },
      {
        "cn": "莫非你不喜欢我做的菜？",
        "pinyin": "Mòfēi nǐ bù xǐhuān wǒ zuò de cài?",
        "en": "Could it be that you don't like the food I cooked?",
        "grammar_audio": "/audio/mandarin/grammar/s_莫非_mòfēi_-_Could_it_be_that_unless_20231230_莫非你不喜欢我做的菜.mp3"
      },
      {
        "cn": "莫非你已经决定要搬家了？",
        "pinyin": "Mòfēi nǐ yǐjīng juédìng yào bānjiā le?",
        "en": "Could it be that you've already decided to move out?",
        "grammar_audio": "/audio/mandarin/grammar/s_莫非_mòfēi_-_Could_it_be_that_unless_20231230_莫非你已经决定要搬家了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "正好 (zhènghǎo) - Just in time, just right",
    "short_explanation": "Used to express that something is just right or happens at the right time.",
    "long_explanation": "The Mandarin Chinese word '正好 (zhènghǎo)' is used to indicate that something is exactly right or happens at the exact ideal time. It's similar to saying 'just right' or 'just in time' in English. It can be used in a variety of contexts, whether it's referring to the timing of an event, the fitting of a clothing item, or the appropriateness of a certain amount.",
    "formation": "Subject + 正好 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "我刚刚走进书店，你正好打电话给我。",
        "pinyin": "Wǒ gānggāng zǒu jìn shūdiàn, nǐ zhènghǎo dǎ diànhuà gěi wǒ.",
        "en": "I just walked into the bookstore and you called me just in time.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_我刚刚走进书店你正好打电话给我.mp3"
      },
      {
        "cn": "我饿了，这个苹果正好可以解饿。",
        "pinyin": "Wǒ è le, zhè gè píngguǒ zhènghǎo kěyǐ jiě è.",
        "en": "I'm hungry, this apple is just right to satisfy my hunger.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_我饿了这个苹果正好可以解饿.mp3"
      },
      {
        "cn": "正好我明天有空，我可以帮你做这个工作。",
        "pinyin": "Zhènghǎo wǒ míngtiān yǒu kòng, wǒ kěyǐ bāng nǐ zuò zhè gè gōngzuò.",
        "en": "I happen to be free tomorrow, I can help you do this job.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_正好我明天有空我可以帮你做这个工作.mp3"
      },
      {
        "cn": "这件衬衫的尺寸正好适合我。",
        "pinyin": "Zhè jiàn chènshān de chǐcùn zhènghǎo shìhé wǒ.",
        "en": "The size of this shirt fits me just right.",
        "grammar_audio": "/audio/mandarin/grammar/s_正好_zhènghǎo_-_Just_in_time_just_right_20231230_这件衬衫的尺寸正好适合我.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "就算...也... (jiùsuàn... yě...) - Even if... still...",
    "short_explanation": "Used to express that despite a certain condition, the outcome would still be the same.",
    "long_explanation": "The Mandarin Chinese expression '就算...也...' (jiùsuàn... yě...) is a compound structure that is used to present a hypothetical situation (the part following '就算') and its unchanging outcome or reaction (the part following '也'). The English equivalent is 'Even if... still...'. It signifies a determination or emphasising a point regardless of circumstances.",
    "formation": "就算 + Condition + 也 + Outcome",
    "examples": [
      {
        "cn": "就算我没有钱，我也会帮你的。",
        "pinyin": "Jiùsuàn wǒ méiyǒu qián, wǒ yě huì bāng nǐ de.",
        "en": "Even if I don't have money, I will still help you.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算我没有钱我也会帮你的.mp3"
      },
      {
        "cn": "就算下雨，我也要去跑步。",
        "pinyin": "Jiùsuàn xià yǔ, wǒ yě yào qù pǎobù.",
        "en": "Even if it is raining, I still want to go jogging.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算下雨我也要去跑步.mp3"
      },
      {
        "cn": "就算你不去学习，你还是会知道的。",
        "pinyin": "Jiùsuàn nǐ bù qù xuéxí, nǐ háishì huì zhīdào de.",
        "en": "Even if you don't study, you will still know.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算你不去学习你还是会知道的.mp3"
      },
      {
        "cn": "就算工作再忙，我也不会忘记吃饭。",
        "pinyin": "Jiùsuàn gōngzuò zài máng, wǒ yě bùhuì wàngjì chīfàn.",
        "en": "Even if work is very busy, I will not forget to eat.",
        "grammar_audio": "/audio/mandarin/grammar/s_就算也_jiùsuàn_yě_-_Even_if_still_20231230_就算工作再忙我也不会忘记吃饭.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "100"
  },
  {
    "title": "何必 (hébì) - Why should, why bother",
    "short_explanation": "Used when expressing that something is unnecessary or not worth doing.",
    "long_explanation": "The Mandarin Chinese phrase '何必 (hébì)' is utilized when one wants to communicate that an action or task is unnecessary, wasteful, or not worth the effort. This can express personal dissatisfaction, incredulity or to discourage another party from engaging in a particular action. It is equivalent to asking 'why should' or 'why bother' in English.",
    "formation": "何必 + Statement",
    "examples": [
      {
        "cn": "你何必每天工作到很晚？应该照顾你的健康。",
        "pinyin": "Nǐ hébì měitiān gōngzuò dào hěn wǎn? Yīnggāi zhàogù nǐ de jiànkāng.",
        "en": "Why should you work till late every day? You ought to take care of your health.",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_bother_20231230_你何必每天工作到很晚应该照顾你的健康.mp3"
      },
      {
        "cn": "他不喜欢你，你何必再为他哭泣呢？",
        "pinyin": "Tā bù xǐhuān nǐ, nǐ hébì zài wèi tā kūqì ne?",
        "en": "He doesn't like you, why do you bother crying for him?",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_bother_20231230_他不喜欢你你何必再为他哭泣呢.mp3"
      },
      {
        "cn": "他们何必为这么小的事情争执呢？",
        "pinyin": "Tāmen hébì wèi zhème xiǎo de shìqíng zhēngzhí ne?",
        "en": "Why should they argue over such a small matter?",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_bother_20231230_他们何必为这么小的事情争执呢.mp3"
      },
      {
        "cn": "你何必为他的话伤心呢？他不懂你的价值。",
        "pinyin": "Nǐ hébì wèi tā de huà shāngxīn ne? Tā bù dǒng nǐ de jiàzhí.",
        "en": "Why should you be saddened by his words? He doesn't understand your worth.",
        "grammar_audio": "/audio/mandarin/grammar/s_何必_hébì_-_Why_should_why_bother_20231230_你何必为他的话伤心呢他不懂你的价值.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "一切 (yíqiè) - All, everything",
    "short_explanation": "Used to indicate the entirety or the whole of something, much like 'all' or 'everything' in English.",
    "long_explanation": "The Mandarin Chinese phrase '一切 (yíqiè)' is used to talk about the whole or entirety of something. It could refer to all people, things, actions, ideas, or situations in a certain group or category. When used with a plural noun, it is commonly used without a measure word.",
    "formation": "一切 + Noun",
    "examples": [
      {
        "cn": "我一切都会告诉你，没有什么可以隐瞒的。",
        "pinyin": "Wǒ yíqiè dōu huì gàosù nǐ, méiyǒu shé me kěyǐ yǐnmán de.",
        "en": "I will tell you everything, there is nothing to hide.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yíqiè_-_All_everything_20231230_我一切都会告诉你没有什么可以隐瞒的.mp3"
      },
      {
        "cn": "他把一切归因于运气好。",
        "pinyin": "Tā bǎ yíqiè guīyīn yú yùnqì hǎo.",
        "en": "He attributes everything to good luck.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yíqiè_-_All_everything_20231230_他把一切归因于运气好.mp3"
      },
      {
        "cn": "我对一切都失去了信心。",
        "pinyin": "Wǒ duì yíqiè dōu shīqù le xìnxīn.",
        "en": "I have lost faith in everything.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yíqiè_-_All_everything_20231230_我对一切都失去了信心.mp3"
      },
      {
        "cn": "如果有任何问题，她可以解答你的一切问题。",
        "pinyin": "Rúguǒ yǒu rènhé wèntí, tā kěyǐ jiědá nǐ de yíqiè wèntí.",
        "en": "If there is any question, she can answer all your questions.",
        "grammar_audio": "/audio/mandarin/grammar/s_一切_yíqiè_-_All_everything_20231230_如果有任何问题她可以解答你的一切问题.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "除了...之外 (chúle... zhīwài) - Apart from, besides",
    "short_explanation": "Used to express 'aside from', 'apart from', or 'in addition to'.",
    "long_explanation": "The Mandarin Chinese phrase '除了...之外 (chúle... zhīwài)' is a way to include something additional or indicate exception. It is equivalent to saying 'apart from', 'in addition to' or 'besides' in English. This structure is often used to express that the scope of a certain situation, action, or condition extends beyond what has been mentioned.",
    "formation": "除了 + Known Information + 之外, + New Information",
    "examples": [
      {
        "cn": "除了看书之外，他还喜欢画画。",
        "pinyin": "Chúle kànshū zhīwài, tā hái xǐhuān huàhuà.",
        "en": "Apart from reading books, he also likes to draw.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了之外_chúle_zhīwài_-_Apart_from_besides_20231230_除了看书之外他还喜欢画画.mp3"
      },
      {
        "cn": "除了中国之外，我还想去日本和韩国旅游。",
        "pinyin": "Chúle Zhōngguó zhīwài, wǒ hái xiǎng qù Rìběn hé Hánguó lǚyóu.",
        "en": "Besides China, I also want to travel to Japan and Korea.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了之外_chúle_zhīwài_-_Apart_from_besides_20231230_除了中国之外我还想去日本和韩国旅游.mp3"
      },
      {
        "cn": "除了学习中文之外，他也在学习日文。",
        "pinyin": "Chúle xuéxí Zhōngwén zhīwài, tā yě zài xuéxí Rìwén.",
        "en": "In addition to studying Chinese, he is also studying Japanese.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了之外_chúle_zhīwài_-_Apart_from_besides_20231230_除了学习中文之外他也在学习日文.mp3"
      },
      {
        "cn": "除了篮球之外，我还会打羽毛球和排球。",
        "pinyin": "Chúle lánqiú zhīwài, wǒ hái huì dǎ yǔmáoqiú hé páiqiú.",
        "en": "Apart from basketball, I can also play badminton and volleyball.",
        "grammar_audio": "/audio/mandarin/grammar/s_除了之外_chúle_zhīwài_-_Apart_from_besides_20231230_除了篮球之外我还会打羽毛球和排球.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "宁可 (nìngkě) - Would rather, preferably",
    "short_explanation": "Used to express one's preferred choice or actions.",
    "long_explanation": "In Mandarin Chinese, '宁可 (nìngkě)' is used to express a preference towards a certain choice or action, even if it might have some downsides or inconvenience. It implies a deliberate selection of one thing over another due to personal reasons or circumstances. Think about using it when you want to say 'would rather...' or 'preferably...' in English.",
    "formation": "Subject + 宁可 + Verb/Action 1, 也 + 不/没 + Verb/Action 2",
    "examples": [
      {
        "cn": "我宁可早点回家，也不想去那个无聊的聚会。",
        "pinyin": "Wǒ nìngkě zǎo diǎn huí jiā, yě bùxiǎng qù nàgè wúliáo de jùhuì.",
        "en": "I would rather go home early than go to that boring party.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_preferably_20231230_我宁可早点回家也不想去那个无聊的聚会.mp3"
      },
      {
        "cn": "他宁可每天走路上班，也不愿意开车。",
        "pinyin": "Tā nìngkě měitiān zǒulù shàngbān, yě bù yuànyì kāichē.",
        "en": "He would rather walk to work every day than drive.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_preferably_20231230_他宁可每天走路上班也不愿意开车.mp3"
      },
      {
        "cn": "我宁可选择住在老公寓，也不想住在没有窗户的高楼。",
        "pinyin": "Wǒ nìngkě xuǎnzé zhù zài lǎo gōngyù, yě bùxiǎng zhù zài méiyǒu chuānghù de gāolóu.",
        "en": "I would prefer to live in an old apartment rather than in a high-rise building without windows.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_preferably_20231230_我宁可选择住在老公寓也不想住在没有窗户的高楼.mp3"
      },
      {
        "cn": "她宁可多花点钱买质量好的产品，也不想买便宜但质量差的商品。",
        "pinyin": "Tā nìngkě duō huā diǎn qián mǎi zhìliàng hǎo de chǎnpǐn, yě bùxiǎng mǎi piányi dàn zhìliàng chà de shāngpǐn.",
        "en": "She would rather spend a little more money to buy good quality products than buy cheap but poor quality goods.",
        "grammar_audio": "/audio/mandarin/grammar/s_宁可_nìngkě_-_Would_rather_preferably_20231230_她宁可多花点钱买质量好的产品也不想买便宜但质量差的商品.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "反而 (fǎn'ér) - On the contrary, instead",
    "short_explanation": "Used to indicate an unexpected or contrary result.",
    "long_explanation": "The Mandarin Chinese phrase '反而 (fǎn'ér)' is used to express the meaning 'on the contrary' or 'instead'. It is used to introduce a result or situation that is the opposite of what one might expect, and is typically used after stating a certain condition or circumstance.",
    "formation": "Condition + 反而 + Unexpected Result",
    "examples": [
      {
        "cn": "他没有感到累，反而更有精神了。",
        "pinyin": "Tā méiyǒu gǎndào lèi, fǎn'ér gèng yǒu jīngshén le.",
        "en": "He didn't feel tired, on the contrary, he felt more energetic.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_他没有感到累反而更有精神了.mp3"
      },
      {
        "cn": "我以为这会让她开心，反而让她生气了。",
        "pinyin": "Wǒ yǐwéi zhè huì ràng tā kāixīn, fǎn'ér ràng tā shēngqì le.",
        "en": "I thought this would make her happy, but instead, it made her angry.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_我以为这会让她开心反而让她生气了.mp3"
      },
      {
        "cn": "这部电影没有让我感到无聊，反而让我觉得很有趣。",
        "pinyin": "Zhè bù diànyǐng méiyǒu ràng wǒ gǎndào wúliáo, fǎn'ér ràng wǒ juédé hěn yǒuqù.",
        "en": "This movie didn't make me feel bored, instead, I found it very interesting.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_这部电影没有让我感到无聊反而让我觉得很有趣.mp3"
      },
      {
        "cn": "天气预报说今天会下雨，反而出了太阳。",
        "pinyin": "Tiānqì yùbào shuō jīntiān huì xiàyǔ, fǎn'ér chū le tàiyáng.",
        "en": "The weather forecast said it would rain today, but instead, the sun came out.",
        "grammar_audio": "/audio/mandarin/grammar/s_反而_fǎnér_-_On_the_contrary_instead_20231230_天气预报说今天会下雨反而出了太阳.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "尽量 (jìnliàng) - As much as possible",
    "short_explanation": "Used to express doing something to the best extent or as much as one can.",
    "long_explanation": "'尽量 (jìnliàng)' is a Mandarin Chinese adverb used to express that one should try or attempt to do something to the best of their ability or to the greatest extent possible. It is equivalent to the English expression 'as much as possible' or 'to the best of one's ability'.",
    "formation": "Subject + 尽量 + Verb",
    "examples": [
      {
        "cn": "我会尽量在明天之前完成这份工作。",
        "pinyin": "Wǒ huì jìnliàng zài míngtiān zhīqián wánchéng zhè fèn gōngzuò.",
        "en": "I will try to finish this work before tomorrow as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jìnliàng_-_As_much_as_possible_20231230_我会尽量在明天之前完成这份工作.mp3"
      },
      {
        "cn": "为了我们的健康，我们应该尽量吃更多的蔬菜和水果。",
        "pinyin": "Wèi le wǒ men de jiànkāng, wǒ men yīnggāi jìnliàng chī gèng duō de shūcài hé shuǐguǒ.",
        "en": "For the sake of our health, we should try to eat more vegetables and fruits as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jìnliàng_-_As_much_as_possible_20231230_为了我们的健康我们应该尽量吃更多的蔬菜和水果.mp3"
      },
      {
        "cn": "你应该尽量少看电视，多做运动。",
        "pinyin": "Nǐ yīnggāi jìnliàng shǎo kàn diànshì, duō zuò yùndòng.",
        "en": "You should try to watch TV as little as possible and do more exercises.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jìnliàng_-_As_much_as_possible_20231230_你应该尽量少看电视多做运动.mp3"
      },
      {
        "cn": "他尽量每天都花一些时间去学习新的词汇。",
        "pinyin": "Tā jìnliàng měi tiān dū huā yìxiē shíjiān qù xuéxí xīn de cíhuì.",
        "en": "He tries to spend some time learning new vocabulary every day as much as possible.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽量_jìnliàng_-_As_much_as_possible_20231230_他尽量每天都花一些时间去学习新的词汇.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "无论...都... (wúlùn... dōu...) - No matter... always...",
    "short_explanation": "This pattern is used to express 'no matter what or how, always...'",
    "long_explanation": "The Mandarin Chinese expression '无论...都...' is used to indicate that no matter what the conditions are, the stated action or situation will always occur. It is equivalent to the English structure 'no matter... always...'. The part that follows 无论 describes different conditions or situations, followed by 都 and a phrase that tells what always happens under those conditions.",
    "formation": "无论 + Condition + 都 + Consequence",
    "examples": [
      {
        "cn": "无论你去哪里，我都会跟随你。",
        "pinyin": "Wúlùn nǐ qù nǎlǐ, wǒ dōu huì gēnsuí nǐ.",
        "en": "No matter where you go, I will always follow you.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论你去哪里我都会跟随你.mp3"
      },
      {
        "cn": "无论多大的困难，我都会继续努力。",
        "pinyin": "Wúlùn duō dà de kùnnán, wǒ dōu huì jìxù nǔlì.",
        "en": "No matter how great the difficulty, I will always continue to work hard.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论多大的困难我都会继续努力.mp3"
      },
      {
        "cn": "无论什么时候你需要帮助，我都会在你身边。",
        "pinyin": "Wúlùn shénme shíhou nǐ xūyào bāngzhù, wǒ dōu huì zài nǐ shēnbiān.",
        "en": "No matter when you need help, I will always be by your side.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论什么时候你需要帮助我都会在你身边.mp3"
      },
      {
        "cn": "无论天气如何，他都会每天早上跑步。",
        "pinyin": "Wúlùn tiānqì rúhé, tā dōu huì měitiān zǎoshang pǎobù.",
        "en": "No matter what the weather is like, he always goes jogging every morning.",
        "grammar_audio": "/audio/mandarin/grammar/s_无论都_wúlùn_dōu_-_No_matter_always_20231230_无论天气如何他都会每天早上跑步.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "照 (zhào) - According to, in light of",
    "short_explanation": "This term is used to indicate a standard or rule that is being followed, equivalent to 'according to' or 'in light of' in English.",
    "long_explanation": "照 (zhào) is a very useful word in Mandarin Chinese that can be used to illustrate that an action, behavior or decision is made based on a certain standard, guideline, advice, etc. It's mostly translated as 'according to', 'following' or 'in light of' in English. It is placed before the standard or guideline that is being referred to.",
    "formation": "照 + Standard / Rule / Guideline + Verb",
    "examples": [
      {
        "cn": "照我父亲的建议，我决定报名参加汉语水平考试。",
        "pinyin": "Zhào wǒ fùqīn de jiànyì, wǒ juédìng bàomíng cānjiā Hànyǔ shuǐpíng kǎoshì.",
        "en": "According to my father's advice, I decided to register for the HSK test.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_light_of_20231230_照我父亲的建议我决定报名参加汉语水平考试.mp3"
      },
      {
        "cn": "照老师的计划，我们每天需要复习一个小时的课文。",
        "pinyin": "Zhào lǎoshī de jìhuà, wǒmen měitiān xūyào fùxí yīgè xiǎoshí de kèwén.",
        "en": "According to the teacher's plan, we need to revise the text for an hour each day.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_light_of_20231230_照老师的计划我们每天需要复习一个小时的课文.mp3"
      },
      {
        "cn": "你应该照这个菜谱准备晚餐。",
        "pinyin": "Nǐ yīnggāi zhào zhè ge càipǔ zhǔnbèi wǎncān.",
        "en": "You should prepare dinner according to this recipe.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_light_of_20231230_你应该照这个菜谱准备晚餐.mp3"
      },
      {
        "cn": "照市场分析预测，这个产品将会非常受欢迎。",
        "pinyin": "Zhào shìchǎng fēnxī yùcè, zhè ge chǎnpǐn jiāng huì fēicháng shòu huānyíng.",
        "en": "According to market analysis predictions, this product will be very popular.",
        "grammar_audio": "/audio/mandarin/grammar/s_照_zhào_-_According_to_in_light_of_20231230_照市场分析预测这个产品将会非常受欢迎.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "经过 (jīngguò) - After, through (in a process context)",
    "short_explanation": "Used to express 'after' or 'through', often in the context of a process or series of events.",
    "long_explanation": "The Mandarin Chinese phrase '经过 (jīngguò)' is used to imply progression or passing through a process or series of events, often equivalent to 'after' or 'through' in English in a process context. It often represents the passage of something from start to finish or referring to a process or method.",
    "formation": "Subject + 经过 + Process/Method + Rest of the sentence",
    "examples": [
      {
        "cn": "经过了几个月的努力，我终于把中国话说得流利了。",
        "pinyin": "Jīngguò le jǐ gè yuè de nǔlì, wǒ zhōngyú bǎ Zhōngguóhuà shuō de liúlì le.",
        "en": "After several months of effort, I finally speak Chinese fluently.",
        "grammar_audio": "/audio/mandarin/grammar/s_经过_jīngguò_-_After_through_in_a_process_context_20231230_经过了几个月的努力我终于把中国话说得流利了.mp3"
      },
      {
        "cn": "经过三天的讨论，他们终于达成了协议。",
        "pinyin": "Jīngguò sān tiān de tǎolùn, tāmen zhōngyú dáchéng le xiéyì.",
        "en": "After three days of discussion, they finally reached an agreement.",
        "grammar_audio": "/audio/mandarin/grammar/s_经过_jīngguò_-_After_through_in_a_process_context_20231230_经过三天的讨论他们终于达成了协议.mp3"
      },
      {
        "cn": "这个决策是经过深思熟虑后做出的。",
        "pinyin": "Zhè gè jué cè shì jīngguò shēn sī shúlǜ hòu zuò chū de.",
        "en": "This decision was made after careful consideration.",
        "grammar_audio": "/audio/mandarin/grammar/s_经过_jīngguò_-_After_through_in_a_process_context_20231230_这个决策是经过深思熟虑后做出的.mp3"
      },
      {
        "cn": "饭后我们经过了公园回到家。",
        "pinyin": "Fàn hòu wǒmen jīngguò le gōngyuán huídào jiā.",
        "en": "After dinner, we passed through the park on our way home.",
        "grammar_audio": "/audio/mandarin/grammar/s_经过_jīngguò_-_After_through_in_a_process_context_20231230_饭后我们经过了公园回到家.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "至于 (zhìyú) - As for, as to",
    "short_explanation": "Used to transition to another topic or to contrast with a previous statement.",
    "long_explanation": "'至于 (zhìyú)' is a conjunctive phrase in Mandarin Chinese used to switch the topic of discussion to another person or thing, or to make a contrast with a previous statement. It can be equivalent to terms such as 'as for', 'as to', or 'regarding' in English. This word is used when the speaker intends to talk about another subject or add some additional information to the conversation.",
    "formation": "A statement + 至于 + New statement or topic",
    "examples": [
      {
        "cn": "我下个月要去中国旅行，至于我的妹妹，她要去日本。",
        "pinyin": "Wǒ xià gè yuè yào qù Zhōngguó lǚxíng, zhìyú wǒ de mèimei, tā yào qù Rìběn.",
        "en": "I am going to China for a trip next month, as for my sister, she is going to Japan.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_as_to_20231230_我下个月要去中国旅行至于我的妹妹她要去日本.mp3"
      },
      {
        "cn": "至于晚餐，你想吃什么，就自己去做。",
        "pinyin": "Zhìyú wǎncān, nǐ xiǎng chī shénme, jiù zìjǐ qù zuò.",
        "en": "As for dinner, whatever you feel like eating, go and make it yourself.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_as_to_20231230_至于晚餐你想吃什么就自己去做.mp3"
      },
      {
        "cn": "这个电影很好看，至于那个电影，我觉得很无聊。",
        "pinyin": "Zhègè diànyǐng hěn hǎokàn, zhìyú nàgè diànyǐng, wǒ juédé hěn wúliáo.",
        "en": "This movie is very good to watch, as for that movie, I think it's very boring.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_as_to_20231230_这个电影很好看至于那个电影我觉得很无聊.mp3"
      },
      {
        "cn": "周末我打算去购物，至于我的朋友，他们要去公园玩。",
        "pinyin": "Zhōumò wǒ dǎsuàn qù gòuwù, zhìyú wǒ de péngyǒu, tāmen yào qù gōngyuán wán.",
        "en": "I plan to go shopping on the weekend, as for my friends, they are going to the park.",
        "grammar_audio": "/audio/mandarin/grammar/s_至于_zhìyú_-_As_for_as_to_20231230_周末我打算去购物至于我的朋友他们要去公园玩.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "一方面...另一方面... (yī fāngmiàn... lìng yī fāngmiàn...) - On one hand... on the other hand...",
    "short_explanation": "Used to express contrasting ideas or points in a balanced or parallel manner.",
    "long_explanation": "The Mandarin Chinese phrase '一方面...另一方面...' is used to show two contrasting or contradictory points, actions or situations, similar to the English phrase 'on one hand... on the other hand.'. It provides a way to discuss two different perspectives or aspects about a topic, and is frequently used in both spoken and written Chinese to present a balanced view.",
    "formation": "一方面 + Statement 1, 另一方面 + Statement 2",
    "examples": [
      {
        "cn": "一方面我喜欢这个工作，另一方面我又怕工作压力太大。",
        "pinyin": "Yī fāngmiàn wǒ xǐhuān zhègè gōngzuò, lìng yī fāngmiàn wǒ yòu pà gōngzuò yālì tài dà.",
        "en": "On one hand, I like this job, on the other hand, I'm afraid the work pressure is too great.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我喜欢这个工作另一方面我又怕工作压力太大.mp3"
      },
      {
        "cn": "一方面我们要保护环境，另一方面我们也需要发展经济。",
        "pinyin": "Yī fāngmiàn wǒmen yào bǎohù huánjìng, lìng yī fāngmiàn wǒmen yě xūyào fāzhǎn jīngjì.",
        "en": "On the one hand, we need to protect the environment, on the other hand, we also need to develop the economy.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面我们要保护环境另一方面我们也需要发展经济.mp3"
      },
      {
        "cn": "一方面他想去大城市工作，另一方面他又不愿离开家乡。",
        "pinyin": "Yī fāngmiàn tā xiǎng qù dà chéngshì gōngzuò, lìng yī fāngmiàn tā yòu bù yuàn líkāi jiāxiāng.",
        "en": "On one hand, he wants to work in the big city, on the other hand, he does not want to leave his hometown.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面他想去大城市工作另一方面他又不愿离开家乡.mp3"
      },
      {
        "cn": "一方面他希望孩子们独立，另一方面他又害怕孩子们遇到困难。",
        "pinyin": "Yī fāngmiàn tā xīwàng háizimen dúlì, lìng yī fāngmiàn tā yòu hàipà háizimen yùdào kùnnán.",
        "en": "On one hand, he hopes his children will be independent, on the other hand, he is afraid they will encounter difficulties.",
        "grammar_audio": "/audio/mandarin/grammar/s_一方面另一方面_yī_fāngmiàn_lìng_yī_fāngmiàn_-_On_one_hand_on_the_other_hand_20231230_一方面他希望孩子们独立另一方面他又害怕孩子们遇到困难.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "鉴于 (jiànyú) - In view of, considering",
    "short_explanation": "This phrase is used to present the foundation of a decision, opinion, or action based on certain facts or evidence.",
    "long_explanation": "In Mandarin Chinese, '鉴于 (jiànyú)' is used to indicate that one has taken into consideration certain facts or evidence before forming an opinion, making a decision, or taking an action. Therefore, it essentially serves the same function as the English phrases 'in view of' or 'considering'. It is often followed by factual information or established evidence.",
    "formation": "鉴于 + Fact/ Evidence +，+ Resulting action/ decision/ opinion",
    "examples": [
      {
        "cn": "鉴于他的专业能力，我们决定聘请他担任这个职位。",
        "pinyin": "Jiànyú tā de zhuānyè nénglì, wǒmen juédìng pìnqǐng tā dānrèn zhège zhíwèi.",
        "en": "In view of his professional ability, we decided to hire him for the position.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于他的专业能力我们决定聘请他担任这个职位.mp3"
      },
      {
        "cn": "鉴于目前的经济状况，我认为我们应该加大投资。",
        "pinyin": "Jiànyú mùqián de jīngjì zhuàngkuàng, wǒ rènwéi wǒmen yīnggāi jiādà tóuzī.",
        "en": "Considering the current economic situation, I think we should increase investment.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于目前的经济状况我认为我们应该加大投资.mp3"
      },
      {
        "cn": "鉴于你的健康问题，我建议你少吃油腻的食物。",
        "pinyin": "Jiànyú nǐ de jiànkāng wèntí, wǒ jiànyì nǐ shǎo chī yóunì de shíwù.",
        "en": "Considering your health issues, I suggest you eat less greasy food.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于你的健康问题我建议你少吃油腻的食物.mp3"
      },
      {
        "cn": "鉴于他的过去成绩，我们有信心他能完成这个项目。",
        "pinyin": "Jiànyú tā de guòqù chéngjì, wǒmen yǒu xìnxīn tā néng wánchéng zhège xiàngmù.",
        "en": "In view of his past performance, we are confident that he can complete this project.",
        "grammar_audio": "/audio/mandarin/grammar/s_鉴于_jiànyú_-_In_view_of_considering_20231230_鉴于他的过去成绩我们有信心他能完成这个项目.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "反正 (fǎnzhèng) - Anyway, in any case",
    "short_explanation": "Used to express that the outcome or result is the same under different conditions.",
    "long_explanation": "The Mandarin Chinese word '反正 (fǎnzhèng)' is a common conjunction used to express the idea of 'anyway' or 'in any case' in English. No matter what conditions or assumptions may change, the outcome or result stays the same. It often implies a sense of resignation or indifference.",
    "formation": "Subject + 反正 + Verb/Adjective + Rest of the sentence.",
    "examples": [
      {
        "cn": "反正我已经很晚了，你不需要等我。",
        "pinyin": "Fǎnzhèng wǒ yǐjīng hěn wǎn le, nǐ bù xūyào děng wǒ.",
        "en": "Anyway, it's already very late, you don't need to wait for me.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我已经很晚了你不需要等我.mp3"
      },
      {
        "cn": "反正你都已经决定了，我说什么也没用。",
        "pinyin": "Fǎnzhèng nǐ dōu yǐjīng juédìngle, wǒ shuō shénme yě méi yòng.",
        "en": "Anyway, you have already decided, whatever I say is useless.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正你都已经决定了我说什么也没用.mp3"
      },
      {
        "cn": "反正明天是假日，我可以晚一点去睡觉。",
        "pinyin": "Fǎnzhèng míngtiān shì jiàrì, wǒ kěyǐ wǎn yīdiǎn qù shuìjiào.",
        "en": "Anyway, tomorrow is a holiday, I can go to sleep a little later.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正明天是假日我可以晚一点去睡觉.mp3"
      },
      {
        "cn": "反正我已经失败了，再试一次也没有损失。",
        "pinyin": "Fǎnzhèng wǒ yǐjīng shībàile, zài shì yīcì yě méiyǒu sǔnshī.",
        "en": "Anyway, I have already failed, there is no loss in trying again.",
        "grammar_audio": "/audio/mandarin/grammar/s_反正_fǎnzhèng_-_Anyway_in_any_case_20231230_反正我已经失败了再试一次也没有损失.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "尽管...但是... (jǐnguǎn... dànshì...) - Although... but...",
    "short_explanation": "Used when expressing a certain circumstance or fact, only to then state something in contrast.",
    "long_explanation": "The Mandarin Chinese phrase '尽管...但是... (jǐnguǎn... dànshì...)' is equivalent to 'although... but...' in English. This structure is used to express how despite a certain circumstance, fact, or condition given in the initial clause, the outcome in the following clause contrasts with it. The '尽管 (jǐnguǎn)' signifies 'despite' or 'although' and '但是 (dànshì)' introduces the contrasting outcome or thought.",
    "formation": "尽管 + Statement 1, 但是 + Statement 2",
    "examples": [
      {
        "cn": "尽管他已经很努力了，但是他还是没能达到目标。",
        "pinyin": "Jǐnguǎn tā yǐjīng hěn nǔlì le, dànshì tā háishi méi néng dádào mùbiāo.",
        "en": "Although he has worked very hard, he still couldn't reach the goal.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管他已经很努力了但是他还是没能达到目标.mp3"
      },
      {
        "cn": "尽管这部电影很有名，但是我没有看过。",
        "pinyin": "Jǐnguǎn zhè bù diànyǐng hěn yǒumíng, dànshì wǒ méiyǒu kànguò.",
        "en": "Although this film is very famous, I have not seen it.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管这部电影很有名但是我没有看过.mp3"
      },
      {
        "cn": "尽管他很忙，但是他总是抽时间帮助别人。",
        "pinyin": "Jǐnguǎn tā hěn máng, dànshì tā zǒngshì chōu shíjiān bāngzhù biérén.",
        "en": "Although he is very busy, he always finds time to help others.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管他很忙但是他总是抽时间帮助别人.mp3"
      },
      {
        "cn": "尽管我失败了，但是我不会放弃的。",
        "pinyin": "Jǐnguǎn wǒ shībài le, dànshì wǒ bù huì fàngqì de.",
        "en": "Although I failed, I will not give up.",
        "grammar_audio": "/audio/mandarin/grammar/s_尽管但是_jǐnguǎn_dànshì_-_Although_but_20231230_尽管我失败了但是我不会放弃的.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "只有...才... (zhǐyǒu... cái...) - Only if... then...",
    "short_explanation": "Used to express that 'only if' a certain condition is fulfilled, 'then' a certain result follows.",
    "long_explanation": "The Mandarin Chinese structure  '只有...才...' (zhǐyǒu... cái...) is used to convey the expression 'only if... then...'. It sets up a cause-effect relationship between two situations, where the effect (the second clause following '才') only happens under the specific condition stated in the cause part (the first clause following '只有').",
    "formation": "'只有' + Condition + '才' + Result",
    "examples": [
      {
        "cn": "只有通过努力学习，才能通过HSK考试。",
        "pinyin": "Zhǐyǒu tōngguò nǔlì xuéxí, cái néng tōngguò HSK kǎoshì.",
        "en": "Only if you study hard, then you can pass the HSK exam.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if_then_20231230_只有通过努力学习才能通过HSK考试.mp3"
      },
      {
        "cn": "只有当你失去了一切，你才会明白什么是最重要的。",
        "pinyin": "Zhǐyǒu dāng nǐ shīqùle yīqiè, nǐ cái huì míngbái shénme shì zuì zhòngyào de.",
        "en": "Only if you lose everything, then you will understand what is the most important.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if_then_20231230_只有当你失去了一切你才会明白什么是最重要的.mp3"
      },
      {
        "cn": "只有把手机关掉，他才能专注于学习。",
        "pinyin": "Zhǐyǒu bǎ shǒujī guān diào, tā cái néng zhuānzhù yú xuéxí.",
        "en": "Only if he turns off his phone, then he can focus on studying.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if_then_20231230_只有把手机关掉他才能专注于学习.mp3"
      },
      {
        "cn": "只有预先订票，你才能保证有位子。",
        "pinyin": "Zhǐyǒu yùxiān dìngpiào, nǐ cái néng bǎozhèng yǒu wèizi.",
        "en": "Only if you book in advance, then you can ensure there are seats.",
        "grammar_audio": "/audio/mandarin/grammar/s_只有才_zhǐyǒu_cái_-_Only_if_then_20231230_只有预先订票你才能保证有位子.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "不过 (búguò) - However, but",
    "short_explanation": "Used to express a contrast or contradiction.",
    "long_explanation": "The Mandarin Chinese phrase '不过 (búguò)' is a conjunction used to express a contrast or contradiction to a previous statement. It indicates a change of direction in the sentence, and is equivalent to 'however' or 'but' in English. This phrase can be used to introduce a limitation or qualification to the initial assertion, or a surprising or unanticipated fact.",
    "formation": "Sentence 1 + 不过 + Sentence 2",
    "examples": [
      {
        "cn": "我原来不喜欢看书，不过现在我已经非常喜欢了。",
        "pinyin": "Wǒ yuánlái bù xǐhuān kànshū, búguò xiànzài wǒ yǐjīng fēicháng xǐhuān le.",
        "en": "I originally didn't like reading, but now I really enjoy it.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_However_but_20231230_我原来不喜欢看书不过现在我已经非常喜欢了.mp3"
      },
      {
        "cn": "我非常想去看足球比赛，不过我没有时间。",
        "pinyin": "Wǒ fēicháng xiǎng qù kàn zúqiú bǐsài, búguò wǒ méiyǒu shíjiān.",
        "en": "I really want to go watch the football match, but I don't have time.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_However_but_20231230_我非常想去看足球比赛不过我没有时间.mp3"
      },
      {
        "cn": "他是我的好朋友，不过他的脾气真的让人受不了。",
        "pinyin": "Tā shì wǒ de hǎo péngyǒu, búguò tā de píqi zhēn de ràng rén shòu bù liǎo.",
        "en": "He is my good friend, but his temper is really unbearable.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_However_but_20231230_他是我的好朋友不过他的脾气真的让人受不了.mp3"
      },
      {
        "cn": "我已经做好了面试的准备，不过我还是很紧张。",
        "pinyin": "Wǒ yǐjīng zuò hǎo le miànshì de zhǔnbèi, búguò wǒ háishi hěn jǐnzhāng.",
        "en": "I've already prepared for the interview, but I'm still very nervous.",
        "grammar_audio": "/audio/mandarin/grammar/s_不过_búguò_-_However_but_20231230_我已经做好了面试的准备不过我还是很紧张.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "再三 (zàisān) - Repeatedly, over and over again",
    "short_explanation": "Used to express doing something repeatedly or many times.",
    "long_explanation": "The Mandarin Chinese expression '再三 (zàisān)' is used to describe the act of repeating something multiple times or over and over again. It is equivalent to the English phrases 'again and again' or 'repeatedly'. This phrase is often used to emphasize the frequency or repetitiveness of a particular action or event.",
    "formation": "再三 + Verb.",
    "examples": [
      {
        "cn": "他再三告诉我那件事，我还是没有完全明白。",
        "pinyin": "Tā zàisān gàosù wǒ nà jiàn shì, wǒ háishì méiyǒu wánquán míngbái.",
        "en": "He told me that same thing over and over again, but I still didn't fully understand.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_Repeatedly_over_and_over_again_20231230_他再三告诉我那件事我还是没有完全明白.mp3"
      },
      {
        "cn": "父亲再三警告他不要贸然行事，但他还是没听。",
        "pinyin": "Fùqīn zàisān jǐnggào tā búyào màorán xíngshì, dàn tā háishì méi tīng.",
        "en": "His father warned him many times not to act rashly, but he still didn't listen.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_Repeatedly_over_and_over_again_20231230_父亲再三警告他不要贸然行事但他还是没听.mp3"
      },
      {
        "cn": "她再三尝试通过驾照考试，终于在第五次通过了。",
        "pinyin": "Tā zàisān chángshì tōngguò jiàzhào kǎoshì, zhōngyú zài dì wǔ cì tōngguòle.",
        "en": "She tried over and over again to pass the driving test and finally passed on the fifth attempt.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_Repeatedly_over_and_over_again_20231230_她再三尝试通过驾照考试终于在第五次通过了.mp3"
      },
      {
        "cn": "我再三让他别来看我，他还是来了。",
        "pinyin": "Wǒ zàisān ràng tā bié lái kàn wǒ, tā háishì láile.",
        "en": "Despite my repeated requests for him not to visit me, he still came.",
        "grammar_audio": "/audio/mandarin/grammar/s_再三_zàisān_-_Repeatedly_over_and_over_again_20231230_我再三让他别来看我他还是来了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "偏偏 (piānpiān) - Against expectations, of all things",
    "short_explanation": "Used to express an action or event that is contrary to expectations or ironically happened.",
    "long_explanation": "The Mandarin Chinese expression '偏偏 (piānpiān)' is used to depict a situation that is contrary to what one might expect, or to highlight the irony of an event. It is comparable to saying 'against expectations' or 'of all things' in English. This phrase is often used when expressing feelings of surprise, annoyance, or irony.",
    "formation": "Subject + 偏偏 + Verb/Adjective + Rest of the sentence",
    "examples": [
      {
        "cn": "他不善于打篮球，但偏偏喜欢这个运动。",
        "pinyin": "Tā bù shàn yú dǎ lánqiú, dàn piānpiān xǐhuān zhège yùndòng.",
        "en": "He's not good at playing basketball, but of all things, he likes this sport.",
        "grammar_audio": "/audio/mandarin/grammar/s_偏偏_piānpiān_-_Against_expectations_of_all_things_20231230_他不善于打篮球但偏偏喜欢这个运动.mp3"
      },
      {
        "cn": "我一直告诉他不要马虎做事，他偏偏不听。",
        "pinyin": "Wǒ yīzhí gàosu tā bùyào mǎhū zuòshì, tā piānpiān bùtīng.",
        "en": "I always told him not to be sloppy, but against all expectations, he didn't listen.",
        "grammar_audio": "/audio/mandarin/grammar/s_偏偏_piānpiān_-_Against_expectations_of_all_things_20231230_我一直告诉他不要马虎做事他偏偏不听.mp3"
      },
      {
        "cn": "她偏偏在我最忙的时候来找我。",
        "pinyin": "Tā piānpiān zài wǒ zuì máng de shíhòu lái zhǎo wǒ.",
        "en": "She, of all people, came to find me when I was the busiest.",
        "grammar_audio": "/audio/mandarin/grammar/s_偏偏_piānpiān_-_Against_expectations_of_all_things_20231230_她偏偏在我最忙的时候来找我.mp3"
      },
      {
        "cn": "我偏偏喜欢你，那个让我无法睡眠的你。",
        "pinyin": "Wǒ piānpiān xǐhuān nǐ, nàgè ràng wǒ wúfǎ shuìmián de nǐ.",
        "en": "Against all odds, I like you, the you that keeps me awake.",
        "grammar_audio": "/audio/mandarin/grammar/s_偏偏_piānpiān_-_Against_expectations_of_all_things_20231230_我偏偏喜欢你那个让我无法睡眠的你.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  },
  {
    "title": "更不用说 (gèng bùyòng shuō) - Not to mention, let alone",
    "short_explanation": "This phrase is used to indicate something is even more so the case.",
    "long_explanation": "The Mandarin Chinese expression '更不用说 (gèng bùyòng shuō)' is used to further emphasize a point or situation, much like 'not to mention' or 'let alone' in English. It follows a statement to mean 'even more so,' 'to say nothing of,' or 'let alone.'",
    "formation": "Sentence 1 + 更不用说 + Sentence 2",
    "examples": [
      {
        "cn": "我连咖啡都不喝，更不用说抽烟了。",
        "pinyin": "Wǒ lián kāfēi dōu bù hē, gèng bùyòng shuō chōuyān le.",
        "en": "I don't even drink coffee, let alone smoke.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_我连咖啡都不喝更不用说抽烟了.mp3"
      },
      {
        "cn": "我受不了冷天气，更不用说在雪地里过夜了。",
        "pinyin": "Wǒ shòu bùliǎo lěng tiānqì, gèng bùyòng shuō zài xuě dì lǐ guòyè le.",
        "en": "I can't stand cold weather, let alone spending a night in the snow.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_我受不了冷天气更不用说在雪地里过夜了.mp3"
      },
      {
        "cn": "他对数学本来就不感兴趣，更不用说学物理了。",
        "pinyin": "Tā duì shùxué běnlái jiù bù gǎn xìngqù, gèng bùyòng shuō xué wùlǐ le.",
        "en": "He has no interest in math to begin with, let alone studying physics.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_他对数学本来就不感兴趣更不用说学物理了.mp3"
      },
      {
        "cn": "他连自己的家都打理不了，更不用说照顾老人了。",
        "pinyin": "Tā lián zìjǐ de jiā dōu dǎlǐ bù liǎo, gèng bùyòng shuō zhàogù lǎorén le.",
        "en": "He can't even take care of his own home, not to mention look after the elderly.",
        "grammar_audio": "/audio/mandarin/grammar/s_更不用说_gèng_bùyòng_shuō_-_Not_to_mention_let_alone_20231230_他连自己的家都打理不了更不用说照顾老人了.mp3"
      }
    ],
    "p_tag": "HSK_5",
    "s_tag": "125"
  }
]