[
  {
    "title": "~거든요 [geodeunyo] (You see; Explaining)",
    "short_explanation": "Used for explaining or giving background information to the listener.",
    "long_explanation": "'~거든요 [geodeunyo]' is a grammar point used in Korean when the speaker wants to provide additional information or background to the listener, usually as an explanation or justification. It is common in spoken language and indicates that the speaker believes the listener may not know or might be surprised by this information.",
    "formation": "Verb + 거든요 / Adjective + 거든요",
    "examples": [
      {
        "kr": "저는 오래전에 학교를 다녔거든요, 그래서 현재 교육 시스템이 어떻게 바뀌었는지 잘 모르겠어요.",
        "romaji": "Jeoneun oraejeone hakgyoreul danyeotgeodeunyo, geuraeseo hyeonjae gyoyuk siseutemi eotteoke bakkwinji jal moreugesseoyo.",
        "en": "You see, I attended school a long time ago, so I don't really know how the current educational system has changed.",
        "grammar_audio": "/audio/korean/grammar/s_거든요_geodeunyo_You_see_Explaining_20250209_저는_오래전에_학교를_다녔거든요_그래서_현재_교육_시스템이_어떻게_바뀌었는지_잘_모르겠어요.mp3"
      },
      {
        "kr": "제가 지각한 것은 버스가 늦었거든요, 그래서 시간을 맞추지 못했어요.",
        "romaji": "Jega jigakhan geoseun beoseuga neujeotgeodeunyo, geuraeseo siganeul matchuji mothaesseoyo.",
        "en": "The reason I was late is because the bus was delayed, so I couldn't make it on time.",
        "grammar_audio": "/audio/korean/grammar/s_거든요_geodeunyo_You_see_Explaining_20250209_제가_지각한_것은_버스가_늦었거든요_그래서_시간을_맞추지_못했어요.mp3"
      },
      {
        "kr": "저는 커피를 마시지 않아요. 커피에 카페인이 많이 들어있거든요, 그래서 잠을 잘 못 자요.",
        "romaji": "Jeoneun keopireul masiji anhayo. Keopie kapeini mani deureoitgeodeunyo, geuraeseo jameul jal mot jayo.",
        "en": "I don't drink coffee. You see, coffee contains a lot of caffeine, so I can't sleep well.",
        "grammar_audio": "/audio/korean/grammar/s_거든요_geodeunyo_You_see_Explaining_20250209_저는_커피를_마시지_않아요_커피에_카페인이_많이_들어있거든요_그래서_잠을_잘_못_자요.mp3"
      },
      {
        "kr": "하루 종일 집에 있어서 지루해요. 날씨가 너무 춥거든요, 그래서 밖에 나갈 수 없어요.",
        "romaji": "Haru jongil jibe isseoseo jiruhaeyo. Nalssiga neomu chupgeodeunyo, geuraeseo bakke nagal su eopseoyo.",
        "en": "I'm bored staying in the house all day. You see, it's really cold outside, so I can't go out.",
        "grammar_audio": "/audio/korean/grammar/s_거든요_geodeunyo_You_see_Explaining_20250209_하루_종일_집에_있어서_지루해요_날씨가_너무_춥거든요_그래서_밖에_나갈_수_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~게 되다 [ge dweda] (End up doing)",
    "short_explanation": "Used to express an action or state that ends up happening due to certain circumstances or changes.",
    "long_explanation": "'~게 되다 [ge dweda]' is used when an action or situation comes about because of a certain circumstance or influence, often unexpectedly or unintentionally. It often implies a change from an initial plan or a passive result of external factors.",
    "formation": "Verb stem + 게 되다",
    "examples": [
      {
        "kr": "저는 공부에 집중하다가 잠이 들게 되었어요. 참 기분이 이상해요.",
        "romaji": "Jeoneun gongbue jipjunghadaga jami deul-ge doeeosseoyo. Cham gibuni isanghaeyo.",
        "en": "I ended up falling asleep while concentrating on my studies. It feels weird.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_dweda_End_up_doing_20250209_저는_공부에_집중하다가_잠이_들게_되었어요_참_기분이_이상해요.mp3"
      },
      {
        "kr": "처음에는 일주일 동안 한국어를 배우려고 했는데, 나중에는 한 달 동안 배우게 되었어요.",
        "romaji": "Cheoeumeneun ilju-il dongan hangugeoreul baeuryeogo haetneunde, najungeneun han dal dongan baeuge doeeosseoyo.",
        "en": "At first, I planned to learn Korean for just a week, but in the end, I ended up studying it for a month.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_dweda_End_up_doing_20250209_처음에는_일주일_동안_한국어를_배우려고_했는데_나중에는_한_달_동안_배우게_되었어요.mp3"
      },
      {
        "kr": "우리는 원래 여름에 결혼하려고 했지만, 결국 겨울에 결혼하게 되었어요.",
        "romaji": "Urineun wonrae yeoreume gyeolhonharyeogo haetjiman, gyeolguk gyeoure gyeolhonhage doeeosseoyo.",
        "en": "We originally intended to get married in the summer, but we ended up having the wedding in the winter.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_dweda_End_up_doing_20250209_우리는_원래_여름에_결혼하려고_했지만_결국_겨울에_결혼하게_되었어요.mp3"
      },
      {
        "kr": "처음에는 회사에서 너무 많이 일하게 되었어요, 그래서 가족을 자주 볼 수가 없었어요.",
        "romaji": "Cheoeumeneun hoesaeseo neomu mani ilhage doeeosseoyo, geuraeseo gajogeul jaju bol suga eopseosseoyo.",
        "en": "At first, I ended up working too much at the company, so I couldn't see my family often.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_dweda_End_up_doing_20250209_처음에는_회사에서_너무_많이_일하게_되었어요_그래서_가족을_자주_볼_수가_없었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~게 하다 [ge hada] (Make/let someone do)",
    "short_explanation": "Used to express that someone causes or allows another person to do something.",
    "long_explanation": "'~게 하다' indicates that an action occurs because someone made, let, allowed, or caused it to happen. It can show compulsion, permission, encouragement, etc., depending on context.",
    "formation": "Verb stem + 게 하다",
    "examples": [
      {
        "kr": "세탁기 가격이 너무 비싸서 가게 주인이 저에게 할인을 해 주어서 사게 해주었어요.",
        "romaji": "Setakgi gakyegi neomu bissaseo gage juini jeoege halineul hae jueoseo sage haeju-eosseoyo.",
        "en": "The washing machine was so expensive that the store owner gave me a discount and made it possible for me to buy it.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Makelet_someone_do_20250209_세탁기_가격이_너무_비싸서_가게_주인이_저에게_할인을_해_주어서_사게_해주었어요.mp3"
      },
      {
        "kr": "그녀는 저를 기쁘게 해서 더욱 열심히 활동하게 했습니다.",
        "romaji": "Geunyeoneun jeoreul gippeuge haeseo deouk yeolsimhi hwaldonghage haetseumnida.",
        "en": "She made me happy and motivated me to be more active.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Makelet_someone_do_20250209_그녀는_저를_기쁘게_해서_더욱_열심히_활동하게_했습니다.mp3"
      },
      {
        "kr": "어머니는 제가 영어를 배울 수 있도록 도서관에 데려가 주셨어요.",
        "romaji": "Eomeonineun jega yeongeoreul baeul su itdorok doseogwane deryeoga jusyeosseoyo.",
        "en": "My mother took me to the library so that I could learn English.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Makelet_someone_do_20250209_어머니는_제가_영어를_배울_수_있도록_도서관에_데려가_주셨어요.mp3"
      },
      {
        "kr": "우리 팀원들은 저를 승진하게 하는 데 도움을 주었습니다.",
        "romaji": "Uri tim-wondeureun jeoreul seungjinhage haneun de doumeul ju-eosseumnida.",
        "en": "Our team members helped me get promoted.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Makelet_someone_do_20250209_우리_팀원들은_저를_승진하게_하는_데_도움을_주었습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~게 해서는 안 되다 [ge haeseoneun an dweda] (Shouldn't make/let someone do)",
    "short_explanation": "Used to convey that one shouldn’t make or allow someone to do something.",
    "long_explanation": "'~게 해서는 안 되다' expresses the idea that it is wrong or not allowed to make or let someone do a certain action. It often implies an admonition or rule for proper conduct.",
    "formation": "Verb stem + 게 해서는 안 되다",
    "examples": [
      {
        "kr": "자기 시험에만 집중하게 해서는 안 돼요. 다른 사람들의 공부도 신경 써야 해요.",
        "romaji": "Jagi siheomeman jipjunghage haeseoneun an dwaeyo. Dareun saramdeurui gongbudo singyeong sseoya haeyo.",
        "en": "You shouldn't make them focus only on their own tests. They should also care about others' studies.",
        "grammar_audio": "/audio/korean/grammar/s_게_해서는_안_되다_ge_haeseoneun_an_dweda_Shouldnt_makelet_someone_do_20250209_자기_시험에만_집중하게_해서는_안_돼요_다른_사람들의_공부도_신경_써야_해요.mp3"
      },
      {
        "kr": "계획을 먼저 확인하지 않고 진행하게 해서는 안 됩니다.",
        "romaji": "Gyehoeg-eul meonjeo hwaginhaji anko jinhaenghage haeseoneun an doemnida.",
        "en": "You shouldn't let it proceed without checking the plan first.",
        "grammar_audio": "/audio/korean/grammar/s_게_해서는_안_되다_ge_haeseoneun_an_dweda_Shouldnt_makelet_someone_do_20250209_계획을_먼저_확인하지_않고_진행하게_해서는_안_됩니다.mp3"
      },
      {
        "kr": "어린이들을 TV 시청만 하게 해서는 안 됩니다. 독서 등 다른 활동도 필요해요.",
        "romaji": "Eorinideureul TV sicheongman hage haeseoneun an doemnida. Dokseo deung dareun hwaldongdo pillyohaeyo.",
        "en": "You shouldn't just let children watch TV. They need other activities like reading as well.",
        "grammar_audio": "/audio/korean/grammar/s_게_해서는_안_되다_ge_haeseoneun_an_dweda_Shouldnt_makelet_someone_do_20250209_어린이들을_TV_시청만_하게_해서는_안_됩니다_독서_등_다른_활동도_필요해요.mp3"
      },
      {
        "kr": "고객을 오래 기다리게 해서는 안 됩니다. 서비스가 빨라야 해요.",
        "romaji": "Gogaegeul orae gidarige haeseoneun an doemnida. Seobiseuga pparaya haeyo.",
        "en": "You shouldn't make customers wait for a long time. The service should be quick.",
        "grammar_audio": "/audio/korean/grammar/s_게_해서는_안_되다_ge_haeseoneun_an_dweda_Shouldnt_makelet_someone_do_20250209_고객을_오래_기다리게_해서는_안_됩니다_서비스가_빨라야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "겠다 [getda] (will, guess, hope, wish)",
    "short_explanation": "A verb ending used to express ‘will’ (future), ‘guess’ (conjecture), or a strong wish or hope.",
    "long_explanation": "'겠다 [getda]' is a versatile verb ending in Korean that can express the speaker’s future intention (‘will’), their inference or guess (‘must be…’ / ‘probably’), or a strong desire/wish depending on context. It often appears with first-person statements or in concluding inferences.",
    "formation": "Verb stem + 겠다",
    "examples": [
      {
        "kr": "오늘 밤에는 비가 오겠어요. 구름이 짙고 어두워 보여요.",
        "romaji": "Oneul bamenen biga ogesseoyo. Gureumi jitgo eoduweo boyeoyo.",
        "en": "It will probably rain tonight. The clouds look thick and dark.",
        "grammar_audio": "/audio/korean/grammar/s_겠다_getda_will_guess_hope_wish_20250209_오늘_밤에는_비가_오겠어요_구름이_짙고_어두워_보여요.mp3"
      },
      {
        "kr": "그분이 저한테 화를 내시겠네요. 제가 지시를 따르지 않았거든요.",
        "romaji": "Geubuni jeohante hwareul naesigesseyo. Jega jisireul ttareuji anhassgeodeunyo.",
        "en": "He will probably get angry with me because I didn’t follow his instructions.",
        "grammar_audio": "/audio/korean/grammar/s_겠다_getda_will_guess_hope_wish_20250209_그분이_저한테_화를_내시겠네요_제가_지시를_따르지_않았거든요.mp3"
      },
      {
        "kr": "이 책을 다 읽으면 한국어를 더 잘 알게 되겠어요. 새로운 단어나 문법이 많이 들어 있어요.",
        "romaji": "I chaegeul da ilgeumyeon hangugeoreul deo jal alge doegesseoyo. Saeroun daneona munbeopi mani deureo isseoyo.",
        "en": "I guess I'll know Korean better once I finish this book. It has a lot of new vocabulary and grammar points.",
        "grammar_audio": "/audio/korean/grammar/s_겠다_getda_will_guess_hope_wish_20250209_이_책을_다_읽으면_한국어를_더_잘_알게_되겠어요_새로운_단어나_문법이_많이_들어_있어요.mp3"
      },
      {
        "kr": "다음 주가 되면 저는 새로운 스포츠 클럽에 가입하겠어요. 뭔가 새로운 활동을 시작하고 싶거든요.",
        "romaji": "Daum ju-ga doemyeon jeoneun saeroun seupocheu keullebe gaiphagesseoyo. Mwonga saeroun hwaldongeul sijakhago sipgeodeunyo.",
        "en": "When next week comes, I will join a new sports club. I want to start something new.",
        "grammar_audio": "/audio/korean/grammar/s_겠다_getda_will_guess_hope_wish_20250209_다음_주가_되면_저는_새로운_스포츠_클럽에_가입하겠어요_뭔가_새로운_활동을_시작하고_싶거든요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~고 말다 [go malda] (Ended up doing)",
    "short_explanation": "Emphasizes an unexpected or often undesirable result: ‘ended up doing.’",
    "long_explanation": "'~고 말다 [go malda]' highlights that an action concluded in a certain way, often with a sense of regret, inevitability, or simply an unexpected final outcome. It can be translated as ‘ended up …ing’ or ‘finally ….’",
    "formation": "Verb stem + 고 말다",
    "examples": [
      {
        "kr": "오랜 시간을 기다렸는데, 결국 혼자 먹고 말았어요. 친구들이 오지 않았거든요.",
        "romaji": "Oraen siganeul gidaryeotneunde, gyeolguk honja meokgo marasseoyo. Chingudeuri oji anhassgeodeunyo.",
        "en": "I waited for a long time but ended up eating alone since my friends didn’t come.",
        "grammar_audio": "/audio/korean/grammar/s_고_말다_go_malda_Ended_up_doing_20250209_오랜_시간을_기다렸는데_결국_혼자_먹고_말았어요_친구들이_오지_않았거든요.mp3"
      },
      {
        "kr": "제가 어제 너무 늦게 잠드는 바람에 결국 지각하고 말았어요.",
        "romaji": "Jega eoje neomu neutge jamdeuneun barame gyeolguk jigakago marasseoyo.",
        "en": "Because I went to sleep so late yesterday, I ended up being late.",
        "grammar_audio": "/audio/korean/grammar/s_고_말다_go_malda_Ended_up_doing_20250209_제가_어제_너무_늦게_잠드는_바람에_결국_지각하고_말았어요.mp3"
      },
      {
        "kr": "그는 공부를 계속 미루다가 결국 시험에서 떨어지고 말았어요.",
        "romaji": "Geuneun gongbureul gyesok mirudaga gyeolguk siheomeseo tteoreojigo marasseoyo.",
        "en": "He kept putting off studying and in the end, he failed the exam.",
        "grammar_audio": "/audio/korean/grammar/s_고_말다_go_malda_Ended_up_doing_20250209_그는_공부를_계속_미루다가_결국_시험에서_떨어지고_말았어요.mp3"
      },
      {
        "kr": "열심히 달렸지만 결국 첫 번째 자리를 얻지 못하고 말았어요.",
        "romaji": "Yeolsimhi dallyeotjiman gyeolguk cheot beonjjae jarireul eotji mothago marasseoyo.",
        "en": "I ran really hard, but in the end, I didn’t get first place.",
        "grammar_audio": "/audio/korean/grammar/s_고_말다_go_malda_Ended_up_doing_20250209_열심히_달렸지만_결국_첫_번째_자리를_얻지_못하고_말았어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~고 보니 [go boni] (After doing, I noticed)",
    "short_explanation": "Expresses that a realization or discovery is made after doing something.",
    "long_explanation": "The form '~고 보니' is used when one notices or realizes something new after completing an action. It often implies that the speaker did not expect this outcome before the action was done.",
    "formation": "Verb stem + 고 보니",
    "examples": [
      {
        "kr": "그림을 다 그리고 보니 정말 재미있었어요.",
        "romaji": "Geurimeul da geurigo boni jeongmal jaemiisseosseoyo.",
        "en": "After finishing the drawing, I realized it was really fun.",
        "grammar_audio": "/audio/korean/grammar/s_고_보니_go_boni_After_doing_I_noticed_20250209_그림을_다_그리고_보니_정말_재미있었어요.mp3"
      },
      {
        "kr": "고향에 돌아가고 보니 옛날 추억이 많이 떠올랐어요.",
        "romaji": "Gohyange doragago boni yetnal chu-eogi manhi tteoollasseoyo.",
        "en": "After going back to my hometown, a lot of old memories came to mind.",
        "grammar_audio": "/audio/korean/grammar/s_고_보니_go_boni_After_doing_I_noticed_20250209_고향에_돌아가고_보니_옛날_추억이_많이_떠올랐어요.mp3"
      },
      {
        "kr": "친구와 이별하고 보니 그의 소중함을 더 크게 느꼈어요.",
        "romaji": "Chinguwa ibyeolhago boni geuui sojunghameul deo keuge neukkyeosseoyo.",
        "en": "After parting ways with my friend, I realized even more how precious he was.",
        "grammar_audio": "/audio/korean/grammar/s_고_보니_go_boni_After_doing_I_noticed_20250209_친구와_이별하고_보니_그의_소중함을_더_크게_느꼈어요.mp3"
      },
      {
        "kr": "책을 다 읽고 보니 배울 점이 정말 많았어요.",
        "romaji": "Chaeg-eul da ilggo boni baeul jeomi jeongmal manasseoyo.",
        "en": "After I finished reading the book, I realized there was a lot to learn.",
        "grammar_audio": "/audio/korean/grammar/s_고_보니_go_boni_After_doing_I_noticed_20250209_책을_다_읽고_보니_배울_점이_정말_많았어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~고 싶다 [go sipda] (Want to)",
    "short_explanation": "Used to express a desire or wish to do something.",
    "long_explanation": "'~고 싶다 [go sipda]' is used to indicate that the speaker (or someone) wants to do something. It can be softened to express one’s own wishes or used to ask politely about someone else’s wishes.",
    "formation": "Verb stem + 고 싶다",
    "examples": [
      {
        "kr": "저는 한국어를 배우고 싶어요. 그래서 매일 공부하고 있어요.",
        "romaji": "Jeoneun hangugeoreul baeugo sipeoyo. Geuraeseo maeil gongbuhago isseoyo.",
        "en": "I want to learn Korean, so I study every day.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_20250209_저는_한국어를_배우고_싶어요_그래서_매일_공부하고_있어요.mp3"
      },
      {
        "kr": "친구가 내일 영화를 보고 싶다고 해서 표를 사려고 해요.",
        "romaji": "Chinguga naeil yeonghwareul bogo sipdago haeseo pyoreul saryeogo haeyo.",
        "en": "My friend said she wants to see a movie tomorrow, so I'm going to buy tickets.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_20250209_친구가_내일_영화를_보고_싶다고_해서_표를_사려고_해요.mp3"
      },
      {
        "kr": "오늘 밤에는 집에 가고 싶지 않아서 친구 집에서 묵을 거예요.",
        "romaji": "Oneul bamenen jibe gago sipji anhaseo chingu jibeseo mugeul geoyeyo.",
        "en": "I don’t want to go home tonight, so I’m going to stay at my friend’s house.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_20250209_오늘_밤에는_집에_가고_싶지_않아서_친구_집에서_묵을_거예요.mp3"
      },
      {
        "kr": "요리를 배우고 싶어서 요리 학교에 가고 싶었어요.",
        "romaji": "Yorireul baeugo sipeoseo yori hakgyoe gago sipeosseoyo.",
        "en": "I wanted to learn cooking, so I wanted to go to a cooking school.",
        "grammar_audio": "/audio/korean/grammar/s_고_싶다_go_sipda_Want_to_20250209_요리를_배우고_싶어서_요리_학교에_가고_싶었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~고 있다 [go itda] (In the process of doing)",
    "short_explanation": "Used to express an ongoing action or a continuing state.",
    "long_explanation": "'~고 있다 [go itda]' corresponds roughly to the present progressive in English (e.g., 'am doing'), but can also show a continued state (e.g., 'am wearing' something).",
    "formation": "Verb stem + 고 있다",
    "examples": [
      {
        "kr": "그녀는 햇빛 아래에서 책을 읽고 있어요.",
        "romaji": "Geunyeoneun haetbit araeseo chaegeul ilggo isseoyo.",
        "en": "She is reading a book under the sunlight.",
        "grammar_audio": "/audio/korean/grammar/s_고_있다_go_itda_In_the_process_of_doing_20250209_그녀는_햇빛_아래에서_책을_읽고_있어요.mp3"
      },
      {
        "kr": "꽃들이 바람에 흔들리고 있어요.",
        "romaji": "Kkotdeuri barame heundeulligo isseoyo.",
        "en": "The flowers are swaying in the wind.",
        "grammar_audio": "/audio/korean/grammar/s_고_있다_go_itda_In_the_process_of_doing_20250209_꽃들이_바람에_흔들리고_있어요.mp3"
      },
      {
        "kr": "그는 올해 내내 스트레스를 받고 있어요.",
        "romaji": "Geuneun olhae naenae seuteureseureul batgo isseoyo.",
        "en": "He has been under stress all year.",
        "grammar_audio": "/audio/korean/grammar/s_고_있다_go_itda_In_the_process_of_doing_20250209_그는_올해_내내_스트레스를_받고_있어요.mp3"
      },
      {
        "kr": "우리 아버지는 지금 유럽을 여행하고 있어요.",
        "romaji": "Uri abeoji-neun jigeum yureobeul yeohaenghago isseoyo.",
        "en": "My father is currently traveling around Europe.",
        "grammar_audio": "/audio/korean/grammar/s_고_있다_go_itda_In_the_process_of_doing_20250209_우리_아버지는_지금_유럽을_여행하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~고자 하다 [goja hada] (In order to)",
    "short_explanation": "A more formal/official way to express intention or purpose: ‘in order to,’ ‘for the purpose of.’",
    "long_explanation": "'~고자 하다 [goja hada]' is typically used in more formal contexts to express the speaker’s intention or plan to do something, similar to ‘in order to’ in English. It often appears in written or official discourse.",
    "formation": "Verb stem + 고자 하다 (often ~고자 + main verb in formal sentences)",
    "examples": [
      {
        "kr": "저는 한국어 실력을 향상시키고자 매일 한국 드라마를 보고 있어요.",
        "romaji": "Jeoneun hangugeo sillyeogeul hyangsangsikigoja maeil hanguk deuramareul bogo isseoyo.",
        "en": "In order to improve my Korean skills, I watch Korean dramas every day.",
        "grammar_audio": "/audio/korean/grammar/s_고자_하다_goja_hada_In_order_to_20250209_저는_한국어_실력을_향상시키고자_매일_한국_드라마를_보고_있어요.mp3"
      },
      {
        "kr": "당신의 건강을 돌보고자 아침마다 일찍 일어나서 운동을 하고 있어요.",
        "romaji": "Dangsinui geongangeul dolbogoja achimmada iljjik ireonaseo undongeul hago isseoyo.",
        "en": "In order to take care of your health, you should get up early every morning and exercise.",
        "grammar_audio": "/audio/korean/grammar/s_고자_하다_goja_hada_In_order_to_20250209_당신의_건강을_돌보고자_아침마다_일찍_일어나서_운동을_하고_있어요.mp3"
      },
      {
        "kr": "기업의 환경 보호를 이행하고자 제품의 친환경 포장을 도입했습니다.",
        "romaji": "Gieobui hwangyeong bohoreul ihaenghagoja jepumui chin-hwangyeong pojangeul doiphaetseumnida.",
        "en": "In order to fulfill the company's environmental protection efforts, they introduced eco-friendly packaging.",
        "grammar_audio": "/audio/korean/grammar/s_고자_하다_goja_hada_In_order_to_20250209_기업의_환경_보호를_이행하고자_제품의_친환경_포장을_도입했습니다.mp3"
      },
      {
        "kr": "그녀는 진정한 행복을 찾고자 먼 나라로 여행을 떠났어요.",
        "romaji": "Geunyeoneun jinjeonghan haengbokeul chatgoja meon nararo yeohaengeul tteonasseoyo.",
        "en": "In order to find true happiness, she traveled to a far-off country.",
        "grammar_audio": "/audio/korean/grammar/s_고자_하다_goja_hada_In_order_to_20250209_그녀는_진정한_행복을_찾고자_먼_나라로_여행을_떠났어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~곤 하다 [gon hada] (Often do)",
    "short_explanation": "Used to express the repetition or frequency of an action or state.",
    "long_explanation": "'~곤 하다 [gon hada]' is a pattern used in Korean to convey habitual or repeated actions. It attaches to action verbs to suggest that something happens repeatedly or as a habit. It generally reflects a recurring behavior, often in both the past and present.",
    "formation": "Verb stem + 곤 하다 (commonly used as '~곤 해요', '~곤 했어요', etc.)",
    "examples": [
      {
        "kr": "나는 마음이 힘들 때 종종 책을 읽곤 해요. 그러면 그리운 마음을 달래곤 해요.",
        "romaji": "Naneun maeumi himdeul ttae jongjong chaegeul ilkkon haeyo. Geureomyeon geuliun maeumeul dallaegon haeyo.",
        "en": "I often read books when I feel down. Doing that often soothes my longing heart.",
        "grammar_audio": "/audio/korean/grammar/s_곤_하다_gon_hada_Often_do_20250209_나는_마음이_힘들_때_종종_책을_읽곤_해요_그러면_그리운_마음을_달래곤_해요.mp3"
      },
      {
        "kr": "아침에 일어나면 항상 창문을 열곤 해요. 신선한 공기를 맞이하곤 해요.",
        "romaji": "Achime ileonamyeon hangsang changmuneul yeolgon haeyo. Sinseonhan gonggireul majihagon haeyo.",
        "en": "When I wake up in the morning, I often open the window. I often greet the fresh air.",
        "grammar_audio": "/audio/korean/grammar/s_곤_하다_gon_hada_Often_do_20250209_아침에_일어나면_항상_창문을_열곤_해요_신선한_공기를_맞이하곤_해요.mp3"
      },
      {
        "kr": "그녀는 새로운 레시피를 발견하면 자주 시도하곤 해요. 그래서 항상 새로운 요리를 만들곤 해요.",
        "romaji": "Geunyeoneun saeroun resipireul balgyeonhamyeon jaju sidohagon haeyo. Geuraeseo hangsang saeroun yorireul mandeulgon haeyo.",
        "en": "Whenever she discovers a new recipe, she often tries it out, so she often ends up cooking new dishes.",
        "grammar_audio": "/audio/korean/grammar/s_곤_하다_gon_hada_Often_do_20250209_그녀는_새로운_레시피를_발견하면_자주_시도하곤_해요_그래서_항상_새로운_요리를_만들곤_해요.mp3"
      },
      {
        "kr": "저는 운동 후에 항상 스트레칭을 하곤 해요. 그러면 근육이 뻣뻣해지는 것을 방지하곤 해요.",
        "romaji": "Jeoneun undong hue hangsang seuteurechingeul hagon haeyo. Geureomyeon geunyugi ppeotppeothaejineun geoseul bangjihagon haeyo.",
        "en": "I often do stretching after exercising. That way, I often prevent my muscles from getting stiff.",
        "grammar_audio": "/audio/korean/grammar/s_곤_하다_gon_hada_Often_do_20250209_저는_운동_후에_항상_스트레칭을_하곤_해요_그러면_근육이_뻣뻣해지는_것을_방지하곤_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기도 하다 [gido hada] (Sometimes do)",
    "short_explanation": "Expresses that an action is done occasionally or sometimes.",
    "long_explanation": "'~기도 하다 [gido hada]' is used to indicate that someone sometimes (not always) does a certain action. It can also be used to emphasize that there are multiple actions: one does A and sometimes B, too. The '도' particle shows this sense of 'also' or 'too.'",
    "formation": "Verb stem + 기도 하다",
    "examples": [
      {
        "kr": "저는 보통 축구를 보지만, 때때로 야구를 보기도 해요.",
        "romaji": "Jeoneun botong chuggureul bojiman, ttaettaero yagureul bogido haeyo.",
        "en": "I usually watch soccer, but sometimes I also watch baseball.",
        "grammar_audio": "/audio/korean/grammar/s_기도_하다_gido_hada_Sometimes_do_20250209_저는_보통_축구를_보지만_때때로_야구를_보기도_해요.mp3"
      },
      {
        "kr": "그녀는 요리를 잘하지만, 그럼에도 불구하고 배울 것이 많아서 요리 수업에 가기도 해요.",
        "romaji": "Geunyeoneun yorireul jalhajiman, geureomedo bulguhago baewul geosi manaseo yori sueobe gagido haeyo.",
        "en": "Even though she cooks well, she still has a lot to learn, so she sometimes goes to cooking classes.",
        "grammar_audio": "/audio/korean/grammar/s_기도_하다_gido_hada_Sometimes_do_20250209_그녀는_요리를_잘하지만_그럼에도_불구하고_배울_것이_많아서_요리_수업에_가기도_해요.mp3"
      },
      {
        "kr": "우리는 주로 산을 등반하는데, 가끔 강가에서 피크닉을 즐기기도 해요.",
        "romaji": "Urineun juro saneul deungbanhaneunde, gakkeum ganggaeseo pikeunik-eul jeulgigido haeyo.",
        "en": "We usually go hiking in the mountains, but occasionally we enjoy picnics by the river.",
        "grammar_audio": "/audio/korean/grammar/s_기도_하다_gido_hada_Sometimes_do_20250209_우리는_주로_산을_등반하는데_가끔_강가에서_피크닉을_즐기기도_해요.mp3"
      },
      {
        "kr": "제가 보통 이른 아침에 일어나지만, 때로는 늦잠을 자기도 해요.",
        "romaji": "Jega botong ireun achime ileonajiman, ttaeroneun neutjameul jagido haeyo.",
        "en": "I usually wake up early in the morning, but sometimes I sleep in.",
        "grammar_audio": "/audio/korean/grammar/s_기도_하다_gido_hada_Sometimes_do_20250209_제가_보통_이른_아침에_일어나지만_때로는_늦잠을_자기도_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기로 [giro] (Decided to)",
    "short_explanation": "Indicates a decision or agreement to do something.",
    "long_explanation": "The '~기로 [giro]' construction is used to express that a decision or promise has been made to do something. It often appears as '~기로 하다', '~기로 결정하다', or '~기로 약속하다' to emphasize that a firm plan or promise is in place.",
    "formation": "Verb stem + 기로 (often followed by 하다/결정하다/약속하다)",
    "examples": [
      {
        "kr": "그녀는 다음 주에 시험을 보기로 결정했어요.",
        "romaji": "Geunyeoneun daeum jue siheomeul bogiro gyeoljeonghaesseoyo.",
        "en": "She decided to take the test next week.",
        "grammar_audio": "/audio/korean/grammar/s_기로_giro_Decided_to_20250209_그녀는_다음_주에_시험을_보기로_결정했어요.mp3"
      },
      {
        "kr": "나는 내일 친구들과 영화를 보기로 약속했어요.",
        "romaji": "Naneun naeil chingudeulgwa yeonghwareul bogiro yaksokhaesseoyo.",
        "en": "I promised to watch a movie with my friends tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_기로_giro_Decided_to_20250209_나는_내일_친구들과_영화를_보기로_약속했어요.mp3"
      },
      {
        "kr": "우리 부모님은 내년에 새 집으로 이사하기로 결정했어요.",
        "romaji": "Uri bumonimeun naenyeone sae jib-euro isagiro gyeoljeonghaesseoyo.",
        "en": "My parents have decided to move to a new house next year.",
        "grammar_audio": "/audio/korean/grammar/s_기로_giro_Decided_to_20250209_우리_부모님은_내년에_새_집으로_이사하기로_결정했어요.mp3"
      },
      {
        "kr": "우리는 다음 회의에서 이 문제를 논의하기로 했어요.",
        "romaji": "Urineun daeum hoeuiese o i munjereul nonuihagiro haesseoyo.",
        "en": "We decided to discuss this issue at the next meeting.",
        "grammar_audio": "/audio/korean/grammar/s_기로_giro_Decided_to_20250209_우리는_다음_회의에서_이_문제를_논의하기로_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기로 되다 [giro dweda] (It's decided to)",
    "short_explanation": "Expresses that something has been decided or arranged.",
    "long_explanation": "'~기로 되다 [giro dweda]' is used when you want to indicate that some plan or arrangement has been set, often by an external decision or mutual agreement. It often translates to 'It has been decided that...' or 'It's arranged that...'",
    "formation": "Verb stem + 기로 되다",
    "examples": [
      {
        "kr": "회사에서 월요일에 회의하기로 되었어요.",
        "romaji": "Hoesaeseo woryoil-e hoeuihagiro doeeosseoyo.",
        "en": "It has been decided that we will have a meeting on Monday at the company.",
        "grammar_audio": "/audio/korean/grammar/s_기로_되다_giro_dweda_Its_decided_to_20250209_회사에서_월요일에_회의하기로_되었어요.mp3"
      },
      {
        "kr": "우리는 내일 오후 3시에 만나기로 되었어요.",
        "romaji": "Urineun naeil ohu sam si-e mannagiro doeeosseoyo.",
        "en": "It's been decided that we will meet at 3 p.m. tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_기로_되다_giro_dweda_Its_decided_to_20250209_우리는_내일_오후_3시에_만나기로_되었어요.mp3"
      },
      {
        "kr": "그녀와의 결혼은 내년에 하기로 되었어요.",
        "romaji": "Geunyeowa-ui gyeolhoneun naenyeon-e hagiro doeeosseoyo.",
        "en": "It's been decided that we will get married next year.",
        "grammar_audio": "/audio/korean/grammar/s_기로_되다_giro_dweda_Its_decided_to_20250209_그녀와의_결혼은_내년에_하기로_되었어요.mp3"
      },
      {
        "kr": "다음 주에 친구들과 여행 가기로 되었어요.",
        "romaji": "Daeum jue chingudeulgwa yeohaeng gagiro doeeosseoyo.",
        "en": "It's been decided that we’ll go on a trip with friends next week.",
        "grammar_audio": "/audio/korean/grammar/s_기로_되다_giro_dweda_Its_decided_to_20250209_다음_주에_친구들과_여행_가기로_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기로 하다 [giro hada] (Decide to)",
    "short_explanation": "Used to say that one decides or agrees to do something.",
    "long_explanation": "'~기로 하다' is a common way to say 'decide to...' in Korean. It highlights that a resolution or plan has been set for some future action. It is also used for promises or mutual agreements (e.g., with friends or family).",
    "formation": "Verb stem + 기로 하다",
    "examples": [
      {
        "kr": "우리는 다음 주에 여행 가기로 했어요. 날씨가 좋으면 바다로 갈까 해요.",
        "romaji": "Urineun daeum jue yeohaeng gagiro haesseoyo. Nalssiga joeumyeon badaro galkka haeyo.",
        "en": "We decided to go on a trip next week. If the weather is good, we might go to the beach.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_20250209_우리는_다음_주에_여행_가기로_했어요_날씨가_좋으면_바다로_갈까_해요.mp3"
      },
      {
        "kr": "나는 내일 헬스장에 가기로 했어요. 운동을 시작해서 건강해지기로 했어요.",
        "romaji": "Naneun naeil helseujange gagiro haesseoyo. Undongeul sijakhaeseo geonganghaejigiro haesseoyo.",
        "en": "I decided to go to the gym tomorrow. I decided to start exercising and become healthier.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_20250209_나는_내일_헬스장에_가기로_했어요_운동을_시작해서_건강해지기로_했어요.mp3"
      },
      {
        "kr": "서윤은 미래에 스스로 직장을 갖기로 했습니다.",
        "romaji": "Seo Yuneun mirae-e seuseuro jigjangeul gatgiro haessseumnida.",
        "en": "Seo Yoon decided to have her own job in the future.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_20250209_서윤은_미래에_스스로_직장을_갖기로_했습니다.mp3"
      },
      {
        "kr": "우리 그룹은 사업 확장을 위해 더 많은 직원을 고용하기로 결정했습니다.",
        "romaji": "Uri geurubeun saeop hwagjangeul wihae deo maneun jigweoneul goyonghagiro gyeoljeonghaessseumnida.",
        "en": "Our group decided to hire more employees for business expansion.",
        "grammar_audio": "/audio/korean/grammar/s_기로_하다_giro_hada_Decide_to_20250209_우리_그룹은_사업_확장을_위해_더_많은_직원을_고용하기로_결정했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기 시작하다 [gi sijakhada] (Begin to)",
    "short_explanation": "Used to express the start or beginning of an action.",
    "long_explanation": "'~기 시작하다 [gi sijakhada]' indicates that an action has just begun (or will soon begin). It is the rough equivalent of 'to start doing' or 'to begin to do' in English.",
    "formation": "Verb stem + 기 시작하다",
    "examples": [
      {
        "kr": "그녀는 다섯 살 때 피아노를 치기 시작했어요. 그래서 지금은 피아노를 정말 잘 칩니다.",
        "romaji": "Geunyeoneun daseot sal ttae pianoreul chigi sijakhaesseoyo. Geuraeseo jigeumeun pianoreul jeongmal jal chimnida.",
        "en": "She began to play the piano at the age of five, so now she plays really well.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Begin_to_20250209_그녀는_다섯_살_때_피아노를_치기_시작했어요_그래서_지금은_피아노를_정말_잘_칩니다.mp3"
      },
      {
        "kr": "나는 아침에 일어나자마자 커피를 마시기 시작했어요. 커피 없이는 하루를 시작할 수 없어요.",
        "romaji": "Naneun achime ireonajamaja keopireul masigi sijakhaesseoyo. Keopi eopsineun harureul sijakhal su eopseoyo.",
        "en": "I begin to drink coffee as soon as I wake up in the morning. I can't start the day without coffee.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Begin_to_20250209_나는_아침에_일어나자마자_커피를_마시기_시작했어요_커피_없이는_하루를_시작할_수_없어요.mp3"
      },
      {
        "kr": "우리는 처음 회의를 시작할 때부터 심각한 문제에 대해 이야기하기 시작했어요.",
        "romaji": "Urineun cheoeum hoeuireul sijakhal ttaebuteo simgakhan munje-e daehae iyagihagi sijakhaesseoyo.",
        "en": "We began to talk about serious issues right from the start of the meeting.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Begin_to_20250209_우리는_처음_회의를_시작할_때부터_심각한_문제에_대해_이야기하기_시작했어요.mp3"
      },
      {
        "kr": "저는 한국어를 배우기 시작한 지 1년이 지났는데, 아직도 배울 게 많아요.",
        "romaji": "Jeoneun hangugeoreul baeugi sijakhan ji ilnyeoni jinannende, ajikdo baeul ge manayo.",
        "en": "It has been a year since I started learning Korean, and I still have a lot to learn.",
        "grammar_audio": "/audio/korean/grammar/s_기_시작하다_gi_sijakhada_Begin_to_20250209_저는_한국어를_배우기_시작한_지_1년이_지났는데_아직도_배울_게_많아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기 위해서 [gi wihaeseo] (In order to)",
    "short_explanation": "Used to express the purpose or reason for doing something.",
    "long_explanation": "'~기 위해서 [gi wihaeseo]' means 'in order to' or 'for the purpose of.' When attached to a verb in the '~기' nominal form, it denotes the reason or purpose for taking a particular action. It is common in both spoken and written Korean when describing why someone is doing something (especially future or ongoing actions).",
    "formation": "Verb stem + 기 위해서",
    "examples": [
      {
        "kr": "영어를 잘하게 되기 위해서 매일 아침에 영어 듣기 연습을 하고 있어요.",
        "romaji": "Yeongeoreul jalhage doegi wihaeseo maeil achime yeong-eo deudgi yeonseubeul hago isseoyo.",
        "en": "In order to become good at English, I practice listening every morning.",
        "grammar_audio": "/audio/korean/grammar/s_기_위해서_gi_wihaeseo_In_order_to_20250209_영어를_잘하게_되기_위해서_매일_아침에_영어_듣기_연습을_하고_있어요.mp3"
      },
      {
        "kr": "운동선수가 되기 위해서 학교가 끝난 후에 항상 훈련에 참여해요.",
        "romaji": "Undongseonsuga doegi wihaeseo hakgyoga kkeutnan hue hangsang hunryeone chamyeohaeyo.",
        "en": "In order to become an athlete, I always participate in training after school.",
        "grammar_audio": "/audio/korean/grammar/s_기_위해서_gi_wihaeseo_In_order_to_20250209_운동선수가_되기_위해서_학교가_끝난_후에_항상_훈련에_참여해요.mp3"
      },
      {
        "kr": "시험에 합격하기 위해서 많은 시간을 공부하는 데 투자했어요.",
        "romaji": "Siheome hapgyeokhagi wihaeseo manheun siganeul gongbuhaneun de tujahaeosseoyo.",
        "en": "I invested a lot of time studying in order to pass the exam.",
        "grammar_audio": "/audio/korean/grammar/s_기_위해서_gi_wihaeseo_In_order_to_20250209_시험에_합격하기_위해서_많은_시간을_공부하는_데_투자했어요.mp3"
      },
      {
        "kr": "행복한 삶을 살기 위해서 자기 자신을 사랑하는 것이 중요해요.",
        "romaji": "Haengbokhan salmeul salgi wihaeseo jagi jasineul saranghaneun geosi jungyohaeyo.",
        "en": "In order to live a happy life, it’s important to love yourself.",
        "grammar_audio": "/audio/korean/grammar/s_기_위해서_gi_wihaeseo_In_order_to_20250209_행복한_삶을_살기_위해서_자기_자신을_사랑하는_것이_중요해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기는 [gineun] (But)",
    "short_explanation": "Used to indicate contrast or an exception; similar to 'but' in English.",
    "long_explanation": "'~기는 [gineun]' is attached to a verb stem (or sometimes an adjective stem) to imply a contrast with a following clause. It acknowledges or concedes one point, while highlighting a contrasting fact or viewpoint. It is somewhat similar to 'but' or 'although' in English, often used to say something “is true, but…”",
    "formation": "Verb stem + 기는 (or Adjective stem + 기는)",
    "examples": [
      {
        "kr": "저는 여행하기는 좋아하는데, 비행기를 타는 것이 아직도 두렵습니다.",
        "romaji": "Jeoneun yeohaenghagineun joahaneunde, bihaenggireul taneun geosi ajikdo duryeopseumnida.",
        "en": "I do like traveling, but I’m still scared of flying.",
        "grammar_audio": "/audio/korean/grammar/s_기는_gineun_But_20250209_저는_여행하기는_좋아하는데_비행기를_타는_것이_아직도_두렵습니다.mp3"
      },
      {
        "kr": "그 건물은 크기는 큰데, 상태가 너무 안 좋아서 리모델링이 필요해 보여요.",
        "romaji": "Geu geonmureun keugineun keunde, sangtaega neomu an joahaseo rimodeilling-i piryohae boyeoyo.",
        "en": "That building is large, but it seems like it needs remodeling because it’s in bad condition.",
        "grammar_audio": "/audio/korean/grammar/s_기는_gineun_But_20250209_그_건물은_크기는_큰데_상태가_너무_안_좋아서_리모델링이_필요해_보여요.mp3"
      },
      {
        "kr": "그 친구는 친절하기는 한데, 솔직히 말해서 너무 많이 물어봐서 조금 짜증나요.",
        "romaji": "Geu chinguneun chinjeolhagineun hande, soljikhage malhaeseo neomu mani mureobwaseo jogeum jjajeungnayo.",
        "en": "That friend is kind, but to be honest, I’m a bit annoyed because he asks too many questions.",
        "grammar_audio": "/audio/korean/grammar/s_기는_gineun_But_20250209_그_친구는_친절하기는_한데_솔직히_말해서_너무_많이_물어봐서_조금_짜증나요.mp3"
      },
      {
        "kr": "이번 계절은 봄이기는 한데, 날씨가 아직도 춥고, 따뜻해지기를 기다리고 있어요.",
        "romaji": "Ibeon gyejeoreun bomigineun hande, nalssiga ajikdo chupgo, ttatteuthaejigireul gidarigo isseoyo.",
        "en": "This season is spring, but the weather is still cold, so I'm waiting for it to warm up.",
        "grammar_audio": "/audio/korean/grammar/s_기는_gineun_But_20250209_이번_계절은_봄이기는_한데_날씨가_아직도_춥고_따뜻해지기를_기다리고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기에는 [gieneun] (For doing)",
    "short_explanation": "Used to express 'for doing something' or 'in order to'.",
    "long_explanation": "'~기에는 [gieneun]' typically indicates that something is either suitable or unsuitable for a certain purpose. It can often be translated as 'for (the purpose of) doing X' or 'to do X.' It frequently appears with judgments about time, conditions, or suitability for an action.",
    "formation": "Verb stem + 기에는 (+ complement)",
    "examples": [
      {
        "kr": "이번 시험을 준비하기에는 시간이 충분하지 않다고 생각합니다.",
        "romaji": "Ibeon siheomeul junbigieneun sigani chungbunhaji anhdago saenggakhamnida.",
        "en": "I think there is not enough time to prepare for this exam.",
        "grammar_audio": "/audio/korean/grammar/s_기에는_gieneun_For_doing_20250209_이번_시험을_준비하기에는_시간이_충분하지_않다고_생각합니다.mp3"
      },
      {
        "kr": "운동하기에는 밖이 너무 추워요, 그래서 집에서 운동하려고 합니다.",
        "romaji": "Undonghagieneun bakki neomu chuwoyo, geuraeseo jib-eseo undongharyeogo hamnida.",
        "en": "It is too cold outside to exercise, so I plan to work out at home.",
        "grammar_audio": "/audio/korean/grammar/s_기에는_gieneun_For_doing_20250209_운동하기에는_밖이_너무_추워요_그래서_집에서_운동하려고_합니다.mp3"
      },
      {
        "kr": "좋은 성적을 받기에는 진심으로 노력해야 합니다.",
        "romaji": "Joheun seongjeogeul batgieneun jinsimeuro noryeokhaeya hamnida.",
        "en": "You have to make a sincere effort in order to get a good grade.",
        "grammar_audio": "/audio/korean/grammar/s_기에는_gieneun_For_doing_20250209_좋은_성적을_받기에는_진심으로_노력해야_합니다.mp3"
      },
      {
        "kr": "축구를 배우기에는 나이가 너무 많다고 생각하는 경우도 있어요.",
        "romaji": "Chukgureul baeugieneun naiga neomu manhdago saenggakhaneun gyeongudo isseoyo.",
        "en": "Sometimes people think they are too old to learn soccer.",
        "grammar_audio": "/audio/korean/grammar/s_기에는_gieneun_For_doing_20250209_축구를_배우기에는_나이가_너무_많다고_생각하는_경우도_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~기 전에 [gi jeone] (Before doing)",
    "short_explanation": "Used to express that one action occurs before another.",
    "long_explanation": "'~기 전에 [gi jeone]' means 'before doing (something).' It is used to specify an action that takes place prior to another action. The literal translation is 'before V-ing' in English. It is very common when giving a chronological order of steps or instructions.",
    "formation": "Verb stem + 기 전에",
    "examples": [
      {
        "kr": "운동을 하기 전에 충분히 스트레칭을 해야 해요. 그렇지 않으면 부상을 당할 수 있어요.",
        "romaji": "Undongeul hagi jeone chungbunhi seuteurechingeul haeya haeyo. Geureohji anheumyeon busangeul danghal su isseoyo.",
        "en": "You have to stretch enough before exercising; otherwise, you might get injured.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20250209_운동을_하기_전에_충분히_스트레칭을_해야_해요_그렇지_않으면_부상을_당할_수_있어요.mp3"
      },
      {
        "kr": "집을 나가기 전에 전기를 꺼야 해요. 그렇지 않으면 화재가 발생할 수 있어요.",
        "romaji": "Jibeul nagagi jeone jeongireul kkeoya haeyo. Geureohji anheumyeon hwajaega balsaenghal su isseoyo.",
        "en": "You must turn off the electricity before leaving the house; otherwise, a fire could start.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20250209_집을_나가기_전에_전기를_꺼야_해요_그렇지_않으면_화재가_발생할_수_있어요.mp3"
      },
      {
        "kr": "수업이 시작하기 전에 숙제를 제출해야 해요. 그렇지 않으면 학점이 깎일 수 있어요.",
        "romaji": "Sueobi sijakagi jeone sukjereul jechulhaeya haeyo. Geureohji anheumyeon hakjeomi kkakkil su isseoyo.",
        "en": "You need to submit your homework before class starts; otherwise, your grade might be lowered.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20250209_수업이_시작하기_전에_숙제를_제출해야_해요_그렇지_않으면_학점이_깎일_수_있어요.mp3"
      },
      {
        "kr": "먹기 전에 손을 꼭 씻어야 해요. 그렇지 않으면 병균에 감염될 수 있어요.",
        "romaji": "Meokgi jeone soneul kkok ssiseoya haeyo. Geureohji anheumyeon byeonggyune gamyeomdoel su isseoyo.",
        "en": "You must wash your hands before eating; otherwise, you can get infected by germs.",
        "grammar_audio": "/audio/korean/grammar/s_기_전에_gi_jeone_Before_doing_20250209_먹기_전에_손을_꼭_씻어야_해요_그렇지_않으면_병균에_감염될_수_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~나 보다 [na boda] (Seems like, guess)",
    "short_explanation": "Used to express an assumption or supposition (e.g., 'it seems that...').",
    "long_explanation": "'~나 보다 [na boda]' is used when the speaker draws a guess or conclusion from evidence, often translated as 'it seems...', 'I guess...', or 'looks like...'. It can be used with both verbs and adjectives: '하나 보다' (I guess one does it), '크나 보다' (I guess it's big), etc.",
    "formation": "Verb or adjective stem + 나 보다",
    "examples": [
      {
        "kr": "피곤하나 봐요, 학교에 와서 계속 잤어요.",
        "romaji": "Pigonhana bwayo, hakgyoe waseo gyesok jasseoyo.",
        "en": "I guess he’s tired. He kept sleeping after he arrived at school.",
        "grammar_audio": "/audio/korean/grammar/s_나_보다_na_boda_Seems_like_guess_20250209_피곤하나_봐요_학교에_와서_계속_잤어요.mp3"
      },
      {
        "kr": "이 풍경을 보면 행복해지나 봐요. 그림을 그리면서 눈물을 흘렸어요.",
        "romaji": "I punggyeongeul bomyeon haengbokhaejina bwayo. Geurimeul geurimyeonseo nunmureul heullyeosseoyo.",
        "en": "I guess I feel happy when I see this scenery. I even shed tears while painting.",
        "grammar_audio": "/audio/korean/grammar/s_나_보다_na_boda_Seems_like_guess_20250209_이_풍경을_보면_행복해지나_봐요_그림을_그리면서_눈물을_흘렸어요.mp3"
      },
      {
        "kr": "비가 오나 봐요. 밖에 사람들이 우산을 들고 있어요.",
        "romaji": "Biga ona bwayo. Bakke saramdeuri usaneul deulgo isseoyo.",
        "en": "It seems to be raining. People outside are carrying umbrellas.",
        "grammar_audio": "/audio/korean/grammar/s_나_보다_na_boda_Seems_like_guess_20250209_비가_오나_봐요_밖에_사람들이_우산을_들고_있어요.mp3"
      },
      {
        "kr": "그녀가 감기에 걸렸나 봐요. 계속 헛기침을 하고 있어요.",
        "romaji": "Geunyeoga gamgie geollyeotna bwayo. Gyesok heotgicheumeul hago isseoyo.",
        "en": "I guess she caught a cold. She keeps clearing her throat.",
        "grammar_audio": "/audio/korean/grammar/s_나_보다_na_boda_Seems_like_guess_20250209_그녀가_감기에_걸렸나_봐요_계속_헛기침을_하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~나다 [nada] (End up doing, come to do)",
    "short_explanation": "Expresses that an action happened unexpectedly or wasn’t originally intended.",
    "long_explanation": "The verb “나다” can appear in certain compound forms like ‘결정이 나다’ (‘a decision is made’), ‘끝나다’ (‘to end’), or ‘결론이 나다’ (‘a conclusion is reached’). In these contexts, it often carries the nuance of something happening or being completed somewhat beyond one’s direct intention. It can be translated as ‘end up ~ing’ or ‘come to ~.’",
    "formation": "Commonly in fixed expressions (e.g., 결정이 나다, 끝나다).",
    "examples": [
      {
        "kr": "그녀는 고민을 하다가 결국 친구의 조언을 따르기로 결정이 났어요.",
        "romaji": "Geunyeoneun gomineul hadaga gyeolguk chinguui joeoneul ttarugiro gyeoljeongi natseoyo.",
        "en": "After much consideration, she ended up deciding to follow her friend’s advice.",
        "grammar_audio": "/audio/korean/grammar/s_나다_nada_End_up_doing_come_to_do_20250209_그녀는_고민을_하다가_결국_친구의_조언을_따르기로_결정이_났어요.mp3"
      },
      {
        "kr": "저는 간단히 쇼핑하러 갔다가 결국 많은 돈을 쓰는 것으로 끝났어요.",
        "romaji": "Jeoneun gandanhi syopinghareo gatdaga gyeolguk manheun doneul sseuneun geoseuro kkeutnasseoyo.",
        "en": "I went out for just a little shopping but ended up spending a lot of money.",
        "grammar_audio": "/audio/korean/grammar/s_나다_nada_End_up_doing_come_to_do_20250209_저는_간단히_쇼핑하러_갔다가_결국_많은_돈을_쓰는_것으로_끝났어요.mp3"
      },
      {
        "kr": "어제 집에 일찍 돌아가려 했지만, 늦게까지 일하다가 결국 늦게 돌아가게 됐어요.",
        "romaji": "Eoje jibe iljjik doragaryeo haetjiman, neutgekkaji ilhadaga gyeolguk neutge doragage dwaesseoyo.",
        "en": "I intended to go home early yesterday, but I kept working until late and ended up going home much later.",
        "grammar_audio": "/audio/korean/grammar/s_나다_nada_End_up_doing_come_to_do_20250209_어제_집에_일찍_돌아가려_했지만_늦게까지_일하다가_결국_늦게_돌아가게_됐어요.mp3"
      },
      {
        "kr": "학교에 가려고 했는데, 결국 비가 너무 많이 내려서 집에 있게 됐어요.",
        "romaji": "Hakgyoe garyeogo haetneunde, gyeolguk biga neomu manhi naeryeoseo jibe itge dwaesseoyo.",
        "en": "I intended to go to school, but it rained so much that I ended up staying at home.",
        "grammar_audio": "/audio/korean/grammar/s_나다_nada_End_up_doing_come_to_do_20250209_학교에_가려고_했는데_결국_비가_너무_많이_내려서_집에_있게_됐어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~나요? [nayo?] (Isn't it?)",
    "short_explanation": "Used to form tag questions or to express doubt (like 'isn't it?' or 'don't you?').",
    "long_explanation": "'~나요? [nayo?]' is a question ending that often seeks confirmation or agreement. It can mean 'isn’t it?', 'don’t you?', or 'right?' in English. The speaker is fairly polite but is also expressing some uncertainty or asking for the listener’s opinion/confirmation.",
    "formation": "Verb/Adjective stem + 나요?",
    "examples": [
      {
        "kr": "오늘 날씨가 좋지 않나요? 비가 계속 오고 있어서요.",
        "romaji": "Oneul nalssiga johji annayo? Biga gyesok ogo isseoseoyo.",
        "en": "The weather isn’t too good today, is it? It's been raining continuously.",
        "grammar_audio": "/audio/korean/grammar/s_나요_nayo_Isnt_it_20250209_오늘_날씨가_좋지_않나요_비가_계속_오고_있어서요.mp3"
      },
      {
        "kr": "당신은 저와 같이 저녁 식사를 할 거예요, 그렇지 않나요?",
        "romaji": "Dangsineun jeowa gachi jeonyeok siksareul hal geoyeyo, geureochi annayo?",
        "en": "You’re going to have dinner with me, aren’t you?",
        "grammar_audio": "/audio/korean/grammar/s_나요_nayo_Isnt_it_20250209_당신은_저와_같이_저녁_식사를_할_거예요_그렇지_않나요.mp3"
      },
      {
        "kr": "저는 요즘 너무 바빠서 주말에 휴식이 필요하지 않나요?",
        "romaji": "Jeoneun yojeum neomu bappaseo jumare hyusigi pilyohaji annayo?",
        "en": "I’ve been really busy these days; I need some rest on the weekend, don't I?",
        "grammar_audio": "/audio/korean/grammar/s_나요_nayo_Isnt_it_20250209_저는_요즘_너무_바빠서_주말에_휴식이_필요하지_않나요.mp3"
      },
      {
        "kr": "우리 모두 코로나 백신을 맞아야 합니다, 그렇지 않나요?",
        "romaji": "Uri modu korona baeksineul maj-aya hamnida, geureochi annayo?",
        "en": "We all need to get the COVID vaccine, shouldn’t we?",
        "grammar_audio": "/audio/korean/grammar/s_나요_nayo_Isnt_it_20250209_우리_모두_코로나_백신을_맞아야_합니다_그렇지_않나요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~는 대로 [neun daero] (As it is)",
    "short_explanation": "Expresses 'just as', 'according to', or 'in the same way as'.",
    "long_explanation": "'~는 대로 [neun daero]' is used to mean 'exactly as' or 'according to.' It can be attached to verbs (e.g., '하는 대로') or nouns (with particles, e.g., '예측대로'). It emphasizes following instructions, patterns, or facts precisely as stated or observed.",
    "formation": "Verb stem + 는 대로 / Noun + 대로",
    "examples": [
      {
        "kr": "그림은 그림을 그리는 대로, 노래는 노래를 부르는 대로 배우는 게 좋아요.",
        "romaji": "Geurimeun geurimeul geurineun daero, noraeneun noraereul bureuneun daero baeuneun ge johayo.",
        "en": "It’s best to learn drawing by actually drawing, and learn singing by actually singing.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20250209_그림은_그림을_그리는_대로_노래는_노래를_부르는_대로_배우는_게_좋아요.mp3"
      },
      {
        "kr": "그녀의 예측대로, 비가 정말 많이 왔어요.",
        "romaji": "Geunyeoui yecheukdaero, biga jeongmal manhi wasseoyo.",
        "en": "Just as she predicted, it really rained a lot.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20250209_그녀의_예측대로_비가_정말_많이_왔어요.mp3"
      },
      {
        "kr": "요리는 레시피대로, 선생님의 지시대로 따라하세요.",
        "romaji": "Yorineun resipidaero, seonsaengnimui jisidaero ttarahaseyo.",
        "en": "Cook according to the recipe and follow exactly what your teacher instructs.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20250209_요리는_레시피대로_선생님의_지시대로_따라하세요.mp3"
      },
      {
        "kr": "우리는 지도대로, 오늘 계획된 대로 여행할 거예요.",
        "romaji": "Urineun jidodaero, oneul gyehoegdoen daero yeohaenghal geoyeyo.",
        "en": "We will travel according to the map and as planned today.",
        "grammar_audio": "/audio/korean/grammar/s_는_대로_neun_daero_As_it_is_20250209_우리는_지도대로_오늘_계획된_대로_여행할_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~는 도중에 [neun dojunge] (While doing)",
    "short_explanation": "Used to indicate that something happens in the midst of an ongoing action.",
    "long_explanation": "'~는 도중에 [neun dojunge]' literally means 'in the middle of (doing something).' It shows that an event occurs while another action is still in progress. It is similar to 'while (verb)-ing' or 'in the midst of' in English.",
    "formation": "Verb stem + 는 도중에",
    "examples": [
      {
        "kr": "나는 책을 읽는 도중에 잠이 들었어요. 그래서 내용을 다 기억하지 못하겠어요.",
        "romaji": "Naneun chaekeul ilgneun dojunge jami deureosseoyo. Geuraeseo naeyongeul da gieokhaji motagesseoyo.",
        "en": "I fell asleep while reading the book, so I don’t think I remember all of its contents.",
        "grammar_audio": "/audio/korean/grammar/s_는_도중에_neun_dojunge_While_doing_20250209_나는_책을_읽는_도중에_잠이_들었어요_그래서_내용을_다_기억하지_못하겠어요.mp3"
      },
      {
        "kr": "그녀는 음악을 듣는 도중에 갑자기 춤을 추기 시작했어요.",
        "romaji": "Geunyeoneun eumageul deunneun dojunge gabjagi chumeul chugi sijakhaesseoyo.",
        "en": "She suddenly started dancing while listening to music.",
        "grammar_audio": "/audio/korean/grammar/s_는_도중에_neun_dojunge_While_doing_20250209_그녀는_음악을_듣는_도중에_갑자기_춤을_추기_시작했어요.mp3"
      },
      {
        "kr": "타이핑을 하는 도중에 컴퓨터가 갑자기 꺼져서 작업을 다시 시작해야 했어요.",
        "romaji": "Taiping-eul haneun dojunge keompyuteoga gabjagi kkeojyeoseo jageobeul dasi sijakhaeya haesseoyo.",
        "en": "The computer suddenly turned off while I was typing, so I had to start my work over.",
        "grammar_audio": "/audio/korean/grammar/s_는_도중에_neun_dojunge_While_doing_20250209_타이핑을_하는_도중에_컴퓨터가_갑자기_꺼져서_작업을_다시_시작해야_했어요.mp3"
      },
      {
        "kr": "친구들과 캠핑을 하는 도중에 갑자기 비가 내려서 텐트 안으로 들어갔어요.",
        "romaji": "Chingudeulgwa kaemping-eul haneun dojunge gabjagi biga naeryeoseo tenteu aneuro deureogasseoyo.",
        "en": "It suddenly began to rain while we were camping with friends, so we went inside the tent.",
        "grammar_audio": "/audio/korean/grammar/s_는_도중에_neun_dojunge_While_doing_20250209_친구들과_캠핑을_하는_도중에_갑자기_비가_내려서_텐트_안으로_들어갔어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "25"
  },
  {
    "title": "~는 방향으로 [neun banghyangeuro] (Toward)",
    "short_explanation": "Indicates movement or orientation 'toward' a certain direction.",
    "long_explanation": "'~는 방향으로 [neun banghyangeuro]' is used to describe movement or orientation toward some direction or goal. It is often translated as 'in the direction of.' For instance, '학교 있는 방향으로 가다' means to walk or move toward where the school is located.",
    "formation": "Noun + (이/가/은/는) + 있는 방향으로 + Verb",
    "examples": [
      {
        "kr": "나는 학교가 있는 방향으로 가고 있어요. 그게 가장 빠른 길이에요.",
        "romaji": "Naneun hakgyoga itneun banghyangeuro gago isseoyo. Geuge gajang ppareun girieyo.",
        "en": "I’m heading in the direction of the school. That’s the quickest way.",
        "grammar_audio": "/audio/korean/grammar/s_는_방향으로_neun_banghyangeuro_Toward_20250209_나는_학교가_있는_방향으로_가고_있어요_그게_가장_빠른_길이에요.mp3"
      },
      {
        "kr": "그는 집이 있는 방향으로 달려갔어요. 엄청 빨리 돌아가고 싶어 했어요.",
        "romaji": "Geuneun jibi itneun banghyangeuro dallyeogasseoyo. Eomcheong ppalli doragago sipeo haesseoyo.",
        "en": "He ran toward where his house is. He really wanted to get back quickly.",
        "grammar_audio": "/audio/korean/grammar/s_는_방향으로_neun_banghyangeuro_Toward_20250209_그는_집이_있는_방향으로_달려갔어요_엄청_빨리_돌아가고_싶어_했어요.mp3"
      },
      {
        "kr": "그 여자는 나 있는 쪽 방향으로 자리를 옮겼어요. 그래서 조금 설렜어요.",
        "romaji": "Geu yeojaneun na itneun jjok banghyangeuro jarireul olmgyeosseoyo. Geuraeseo jogeum seolleosseoyo.",
        "en": "That woman moved her seat toward where I was, so I felt a bit fluttered.",
        "grammar_audio": "/audio/korean/grammar/s_는_방향으로_neun_banghyangeuro_Toward_20250209_그_여자는_나_있는_쪽_방향으로_자리를_옮겼어요_그래서_조금_설렜어요.mp3"
      },
      {
        "kr": "우리는 비가 오는 방향으로 계속 걸어가서 옷이 다 젖었어요.",
        "romaji": "Urineun biga oneun banghyangeuro gyesok georeogaseo osi da jeojeosseoyo.",
        "en": "We kept walking toward where it was raining, so we got completely wet.",
        "grammar_audio": "/audio/korean/grammar/s_는_방향으로_neun_banghyangeuro_Toward_20250209_우리는_비가_오는_방향으로_계속_걸어가서_옷이_다_젖었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는 법이다 [neun beopida] (Usually, always)",
    "short_explanation": "This expression is used to describe a general rule or habit that always tends to happen.",
    "long_explanation": "The phrase '~는 법이다 [neun beopida]' is a grammar structure used to say that something usually or always happens in a certain way, almost like a rule or law. It describes general truths, habits, or principles that tend not to change.",
    "formation": "Verb (dictionary form) + 는 + 법이다",
    "examples": [
      {
        "kr": "우리 가족은 매일 밤 같이 저녁을 먹는 법이다.",
        "romaji": "Uri gajogeun maeil bam gachi jeonyeogeul meokneun beopida.",
        "en": "It's our family's rule to eat dinner together every night.",
        "grammar_audio": "/audio/korean/grammar/s_는_법이다_neun_beopida_Usually_always_20250209_우리_가족은_매일_밤_같이_저녁을_먹는_법이다.mp3"
      },
      {
        "kr": "그는 항상 일찍 일어나서 책을 읽는 법이다.",
        "romaji": "Geuneun hangsang iljjik ileonaseo chaegeul ilgneun beopida.",
        "en": "He always gets up early to read books.",
        "grammar_audio": "/audio/korean/grammar/s_는_법이다_neun_beopida_Usually_always_20250209_그는_항상_일찍_일어나서_책을_읽는_법이다.mp3"
      },
      {
        "kr": "커피를 마신 후에는 항상 입을 헹구는 법이다.",
        "romaji": "Keopireul masin hueneun hangsang ibeul hengguneun beopida.",
        "en": "It's always the case that I rinse my mouth after drinking coffee.",
        "grammar_audio": "/audio/korean/grammar/s_는_법이다_neun_beopida_Usually_always_20250209_커피를_마신_후에는_항상_입을_헹구는_법이다.mp3"
      },
      {
        "kr": "나는 항상 집에서 공부하면서 음악을 듣는 법이다.",
        "romaji": "Naneun hangsang jibeseo gongbuhamyeonseo eumageul deudneun beopida.",
        "en": "I always make a habit of listening to music while studying at home.",
        "grammar_audio": "/audio/korean/grammar/s_는_법이다_neun_beopida_Usually_always_20250209_나는_항상_집에서_공부하면서_음악을_듣는_법이다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는데다 [neunde-da] (Furthermore, and)",
    "short_explanation": "Used to add additional information or to emphasize a situation; 'furthermore', 'in addition'.",
    "long_explanation": "'~는데다 [neunde-da]' is used to add another fact or condition that strengthens or expands upon the previous statement. It often translates to 'in addition to that...' or 'furthermore...' in English. It can be attached to verbs or adjectives to connect reasons or circumstances.",
    "formation": "Adjective/Action verb + 는데다",
    "examples": [
      {
        "kr": "그 카페는 커피가 맛있는데다 분위기도 참 좋아요.",
        "romaji": "Geu kapeeneun keopiga masitneunde-da bunwigido cham joayo.",
        "en": "The café serves delicious coffee, and in addition, the atmosphere is really nice.",
        "grammar_audio": "/audio/korean/grammar/s_는데다_neunde-da_Furthermore_and_20250209_그_카페는_커피가_맛있는데다_분위기도_참_좋아요.mp3"
      },
      {
        "kr": "이 호텔은 위치도 좋은데다 직원들의 서비스도 훌륭해요.",
        "romaji": "I hoteleun wichido joheunde-da jigweondeurui seobiseudo hullyunghaeyo.",
        "en": "This hotel has a great location, and furthermore, the staff service is excellent.",
        "grammar_audio": "/audio/korean/grammar/s_는데다_neunde-da_Furthermore_and_20250209_이_호텔은_위치도_좋은데다_직원들의_서비스도_훌륭해요.mp3"
      },
      {
        "kr": "책을 읽는 것은 지식을 쌓는데다 스트레스 해소에도 도움이 돼요.",
        "romaji": "Chaekeul ilgneun geoseun jisigeul ssanneunde-da seuteureseu haesoeedo doumi dwaeyo.",
        "en": "Reading books not only builds up your knowledge, but it also helps relieve stress.",
        "grammar_audio": "/audio/korean/grammar/s_는데다_neunde-da_Furthermore_and_20250209_책을_읽는_것은_지식을_쌓는데다_스트레스_해소에도_도움이_돼요.mp3"
      },
      {
        "kr": "그는 학점이 높은데다 학교 활동에도 적극적으로 참여하니 대학 생활이 많이 바쁠 것 같아요.",
        "romaji": "Geuneun hakjeomi nopneunde-da hakgyo hwaldong-edo jeokgeukjeogeuro chamyeohani daehak saenghwali manhi bappeul geot gatayo.",
        "en": "He has high grades, and on top of that, he actively participates in school activities, so it seems his university life is quite busy.",
        "grammar_audio": "/audio/korean/grammar/s_는데다_neunde-da_Furthermore_and_20250209_그는_학점이_높은데다_학교_활동에도_적극적으로_참여하니_대학_생활이_많이_바쁠_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는데도 [neundedo] (Even though, but still)",
    "short_explanation": "Used to express a contrasting or contradictory situation: 'even though', 'but still'.",
    "long_explanation": "'~는데도 [neundedo]' is a conjunctive particle that describes a surprising or unexpected result, given some situation or fact. It is similar to 'even though,' 'despite,' or 'but still' in English.",
    "formation": "Verb/Adjective + 는데도",
    "examples": [
      {
        "kr": "아기인데도 많이 잠을 자지 않아요. 하루 종일 놀기만 해요.",
        "romaji": "Agineundedo mani jameul jaji anhayo. Haru jongil nolgiman haeyo.",
        "en": "Even though he is a baby, he doesn’t sleep much. He just plays all day long.",
        "grammar_audio": "/audio/korean/grammar/s_는데도_neundedo_Even_though_but_still_20250209_아기인데도_많이_잠을_자지_않아요_하루_종일_놀기만_해요.mp3"
      },
      {
        "kr": "많이 공부해서 잘 볼 줄 알았는데도 시험 점수가 낮게 나왔어요.",
        "romaji": "Mani gongbuhaeseo jal bol jul aratneundedo siheom jeomsuga najge nawasseoyo.",
        "en": "Even though I studied a lot and expected a good result, I got a low score on the test.",
        "grammar_audio": "/audio/korean/grammar/s_는데도_neundedo_Even_though_but_still_20250209_많이_공부해서_잘_볼_줄_알았는데도_시험_점수가_낮게_나왔어요.mp3"
      },
      {
        "kr": "많이 먹는데도 그녀는 늘 날씬해 보여요.",
        "romaji": "Mani meokneundedo geunyeoneun neul nalssinhae boyeoyo.",
        "en": "Even though she eats a lot, she always appears slim.",
        "grammar_audio": "/audio/korean/grammar/s_는데도_neundedo_Even_though_but_still_20250209_많이_먹는데도_그녀는_늘_날씬해_보여요.mp3"
      },
      {
        "kr": "이런 일을 여러 번 경험했는데도 저는 계속 같은 실수를 반복하고 있어요.",
        "romaji": "Ireon ireul yeoreo beon gyeongheomhaetneundedo jeoneun gyesok gateun silsureul banbokhago isseoyo.",
        "en": "Even though I have gone through this many times, I keep making the same mistakes.",
        "grammar_audio": "/audio/korean/grammar/s_는데도_neundedo_Even_though_but_still_20250209_이런_일을_여러_번_경험했는데도_저는_계속_같은_실수를_반복하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는지 [neunji] (Whether or not)",
    "short_explanation": "Used to express doubt or to inquire about a certain fact: 'whether or not'.",
    "long_explanation": "'~는지 [neunji]' is attached to a verb or adjective stem to indicate uncertainty or to form an indirect question. It can be translated as 'whether (or not)...' in English, and it’s often used when one is unsure or curious about some information.",
    "formation": "Verb/Adjective stem + 는지",
    "examples": [
      {
        "kr": "그는 내가 사랑하는지 알고 있을까요?",
        "romaji": "Geuneun naega saranghaneunji algo isseulkkayo?",
        "en": "I wonder if he knows that I love him.",
        "grammar_audio": "/audio/korean/grammar/s_는지_neunji_Whether_or_not_20250209_그는_내가_사랑하는지_알고_있을까요.mp3"
      },
      {
        "kr": "우리는 내일 회사에 갈 수 있는지 모르겠어요.",
        "romaji": "Urineun naeil hoesae gal su inneunji moreugesseoyo.",
        "en": "We don't know if we can go into the office tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_는지_neunji_Whether_or_not_20250209_우리는_내일_회사에_갈_수_있는지_모르겠어요.mp3"
      },
      {
        "kr": "그녀가 어디에 있는지 알아낼 수 있을까요?",
        "romaji": "Geunyeoga eodie itneunji aranael su isseulkkayo?",
        "en": "Can we find out where she is?",
        "grammar_audio": "/audio/korean/grammar/s_는지_neunji_Whether_or_not_20250209_그녀가_어디에_있는지_알아낼_수_있을까요.mp3"
      },
      {
        "kr": "그 영화가 재미있는지 아닌지 알아보기 위해 평을 읽어보세요.",
        "romaji": "Geu yeonghwaga jaemiinneunji aninji arabogi wihae pyeongeul ilgeoboseyo.",
        "en": "Read some reviews to find out whether or not that movie is interesting.",
        "grammar_audio": "/audio/korean/grammar/s_는지_neunji_Whether_or_not_20250209_그_영화가_재미있는지_아닌지_알아보기_위해_평을_읽어보세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는지 모르겠다 [neunji moreugessda] (I'm not sure if)",
    "short_explanation": "Used to express uncertainty: 'I'm not sure if...', 'I don't know whether...'.",
    "long_explanation": "'~는지 모르겠다 [neunji moreugessda]' expresses doubt or uncertainty about a certain fact or outcome. It roughly corresponds to 'I’m not sure if...' or 'I don’t know whether...' in English.",
    "formation": "Verb/Adjective stem + 는지 모르겠다",
    "examples": [
      {
        "kr": "그가 어떻게 반응할지 모르겠어요, 그래서 조금 긴장되네요.",
        "romaji": "Geuga eotteohge baneunghalji moreugesseoyo, geuraeseo jogeum ginjangdeneyo.",
        "en": "I'm not sure how he will react, so I'm a bit nervous.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르겠다_neunji_moreugessda_Im_not_sure_if_20250209_그가_어떻게_반응할지_모르겠어요_그래서_조금_긴장되네요.mp3"
      },
      {
        "kr": "비가 오는지 안 오는지 모르겠어요. 날씨가 너무 흐려서요.",
        "romaji": "Biga oneunji an oneunji moreugesseoyo. Nalssiga neomu heuryeoseoyo.",
        "en": "I'm not sure if it's raining or not because it's so overcast.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르겠다_neunji_moreugessda_Im_not_sure_if_20250209_비가_오는지_안_오는지_모르겠어요_날씨가_너무_흐려서요.mp3"
      },
      {
        "kr": "내일 시험을 잘 볼 수 있는지 모르겠어요. 아직 공부가 많이 남았거든요.",
        "romaji": "Naeil siheomeul jal bol su inneunji moreugesseoyo. Ajik gongbuga manhi namatgeodeunyo.",
        "en": "I'm not sure if I'll do well on tomorrow’s test. I still have a lot to study.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르겠다_neunji_moreugessda_Im_not_sure_if_20250209_내일_시험을_잘_볼_수_있는지_모르겠어요_아직_공부가_많이_남았거든요.mp3"
      },
      {
        "kr": "회사에서 프로모션을 받을 수 있는지 모르겠어요. 경쟁이 무척 치열해서요.",
        "romaji": "Hoesaeseo peulomosyeoneul badeul su inneunji moreugesseoyo. Gyeongjaengi mucheok chiyeolhaeseoyo.",
        "en": "I'm not sure if I can get a promotion at work. The competition is really fierce.",
        "grammar_audio": "/audio/korean/grammar/s_는지_모르겠다_neunji_moreugessda_Im_not_sure_if_20250209_회사에서_프로모션을_받을_수_있는지_모르겠어요_경쟁이_무척_치열해서요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~는지라 [neunjira] (Because, since)",
    "short_explanation": "Used to provide a reason or cause for something: 'because', 'since'.",
    "long_explanation": "'~는지라 [neunjira]' is a connective ending in Korean that provides a reason or cause. It is often used in relatively formal or written contexts and means 'because' or 'since' in English. It generally implies that the stated reason is decisive for the outcome in the main clause.",
    "formation": "Verb/Adjective stem + 는지라",
    "examples": [
      {
        "kr": "그가 매우 똑똑한데다가 성실한지라, 누구든지 그를 존경합니다.",
        "romaji": "Geuga maeu ttokttokhandae-daga seongsilhanjira, nugudeunji geureul jong-gyeonghamnida.",
        "en": "Because he’s very smart and also diligent, everyone respects him.",
        "grammar_audio": "/audio/korean/grammar/s_는지라_neunjira_Because_since_20250209_그가_매우_똑똑한데다가_성실한지라_누구든지_그를_존경합니다.mp3"
      },
      {
        "kr": "이 일이 너무 절실한지라, 제가 최선을 다해 해결해야 했습니다.",
        "romaji": "I iri neomu jeolsilhanjira, jega choeseoneul dahae haegyeolhaeya haetseumnida.",
        "en": "Since this matter was very urgent, I had to do my best to solve it.",
        "grammar_audio": "/audio/korean/grammar/s_는지라_neunjira_Because_since_20250209_이_일이_너무_절실한지라_제가_최선을_다해_해결해야_했습니다.mp3"
      },
      {
        "kr": "그녀가 너무 예쁜지라, 사람들이 자주 그녀를 보고 미소 지어요.",
        "romaji": "Geunyeoga neomu yeppeunjira, saramdeuri jaju geunyeoreul bogo miso jieoyo.",
        "en": "Because she is so pretty, people often look at her and smile.",
        "grammar_audio": "/audio/korean/grammar/s_는지라_neunjira_Because_since_20250209_그녀가_너무_예쁜지라_사람들이_자주_그녀를_보고_미소_지어요.mp3"
      },
      {
        "kr": "라면이 너무 매운지라, 제가 물을 여러 잔 마셔야 했습니다.",
        "romaji": "Ramyeoni neomu maeunjira, jega mureul yeoreo jan masyeoya haetseumnida.",
        "en": "Since the ramen was too spicy, I had to drink several glasses of water.",
        "grammar_audio": "/audio/korean/grammar/s_는지라_neunjira_Because_since_20250209_라면이_너무_매운지라_제가_물을_여러_잔_마셔야_했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~다가 [daga] (While, and then)",
    "short_explanation": "Used to express 'in the middle of something, when suddenly...' or 'and then'.",
    "long_explanation": "'~다가 [daga]' indicates that one action was in progress, and then another action or event occurred. It can imply an interruption ('while doing X, suddenly Y happened') or a sequence ('I was doing X and then moved on to Y').",
    "formation": "Verb stem + 다가",
    "examples": [
      {
        "kr": "제가 소풍 가는 길에 빨간불을 기다리다가 휴대전화가 울렸어요.",
        "romaji": "Jega sopung ganeun gire ppalganbureul gidaridaga hyudaejeonhwaga ulryeosseoyo.",
        "en": "While I was waiting at a red light on my way to a picnic, my phone rang.",
        "grammar_audio": "/audio/korean/grammar/s_다가_daga_While_and_then_20250209_제가_소풍_가는_길에_빨간불을_기다리다가_휴대전화가_울렸어요.mp3"
      },
      {
        "kr": "장미가 음악을 듣다가 잠이 들어버렸어요.",
        "romaji": "Jangmi-ga eumageul deuddaga jami deureobeoryeosseoyo.",
        "en": "Jangmi was listening to music and then suddenly fell asleep.",
        "grammar_audio": "/audio/korean/grammar/s_다가_daga_While_and_then_20250209_장미가_음악을_듣다가_잠이_들어버렸어요.mp3"
      },
      {
        "kr": "나는 저녁을 먹다가 갑자기 배가 아팠어요.",
        "romaji": "Naneun jeonyeogeul meokdaga gapjagi baega apasseoyo.",
        "en": "I was eating dinner when suddenly I got a stomachache.",
        "grammar_audio": "/audio/korean/grammar/s_다가_daga_While_and_then_20250209_나는_저녁을_먹다가_갑자기_배가_아팠어요.mp3"
      },
      {
        "kr": "그는 책을 읽다가 피곤해서 잠들었습니다.",
        "romaji": "Geuneun chaekeul ilgdaga pigonhaeseo jamdeureosseumnida.",
        "en": "He was reading a book and then dozed off because he was tired.",
        "grammar_audio": "/audio/korean/grammar/s_다가_daga_While_and_then_20250209_그는_책을_읽다가_피곤해서_잠들었습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~다가는 [daganeun] (If keep doing)",
    "short_explanation": "Expresses a negative consequence if the current action continues.",
    "long_explanation": "'~다가는 [daganeun]' warns that if one keeps doing something (or if the current situation persists), a negative or undesired outcome will result. It translates roughly as 'if you keep doing this, then...' in English.",
    "formation": "Verb stem + 다가는",
    "examples": [
      {
        "kr": "숙제를 계속 미루다가는 결국 시험에 실패할 거예요.",
        "romaji": "Sukjereul gyesok mirudaganeun gyeolguk siheome silpaehal geoyeyo.",
        "en": "If you keep putting off your homework, you'll end up failing the test in the end.",
        "grammar_audio": "/audio/korean/grammar/s_다가는_daganeun_If_keep_doing_20250209_숙제를_계속_미루다가는_결국_시험에_실패할_거예요.mp3"
      },
      {
        "kr": "항상 늦게 자다가는 건강에 문제가 생길 거예요.",
        "romaji": "Hangsang neutge jadaganeun geongange munjega saenggil geoyeyo.",
        "en": "If you always go to bed late, you're likely to develop health problems.",
        "grammar_audio": "/audio/korean/grammar/s_다가는_daganeun_If_keep_doing_20250209_항상_늦게_자다가는_건강에_문제가_생길_거예요.mp3"
      },
      {
        "kr": "언제나 그렇게 게임만 하다가는 눈이 나빠질 거예요.",
        "romaji": "Eonjena geureohge geimman hadaganeun nuni nappajil geoyeyo.",
        "en": "If you keep playing games like that all the time, your eyesight will get worse.",
        "grammar_audio": "/audio/korean/grammar/s_다가는_daganeun_If_keep_doing_20250209_언제나_그렇게_게임만_하다가는_눈이_나빠질_거예요.mp3"
      },
      {
        "kr": "너무 고민만 하다가는 결정할 시간이 없어질 거예요.",
        "romaji": "Neomu gominman hadaganeun gyeoljeonghal sigani eopseojil geoyeyo.",
        "en": "If you keep worrying too much, you won't have any time left to make a decision.",
        "grammar_audio": "/audio/korean/grammar/s_다가는_daganeun_If_keep_doing_20250209_너무_고민만_하다가는_결정할_시간이_없어질_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~다가도 [dagado] (Even though was doing)",
    "short_explanation": "Used when an unexpected event occurs while another action is in progress.",
    "long_explanation": "'~다가도 [dagado]' describes a scenario where the speaker was in the midst of doing something, yet an unexpected or contrasting outcome occurred. It can be interpreted as 'even though I was doing X, it turned out Y.'",
    "formation": "Verb stem + 다가도",
    "examples": [
      {
        "kr": "저는 열심히 공부하다가도 시험에서 떨어질 때가 있어요. 그래도 다음엔 꼭 합격하고 싶어요.",
        "romaji": "Jeoneun yeolsimhi gongbuhadagado siheomeseo tteoreojil ttaega isseoyo. Geuraedo daeumen kkok hapgyeokhago sipeoyo.",
        "en": "Even though I study hard, sometimes I still fail exams. But I really want to pass next time.",
        "grammar_audio": "/audio/korean/grammar/s_다가도_dagado_Even_though_was_doing_20250209_저는_열심히_공부하다가도_시험에서_떨어질_때가_있어요_그래도_다음엔_꼭_합격하고_싶어요.mp3"
      },
      {
        "kr": "카페에서 커피를 마시다가도 비가 갑자기 내려서 우산을 쓰고도 조금 젖었어요.",
        "romaji": "Ka페eseo keopireul mashidagado biga gapjagi naeryeoseo usaneul sseugodo jogeum jeojeosseoyo.",
        "en": "Even though I was just drinking coffee at the cafe, it suddenly started raining, and I got a bit wet even with an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_다가도_dagado_Even_though_was_doing_20250209_카페에서_커피를_마시다가도_비가_갑자기_내려서_우산을_쓰고도_조금_젖었어요.mp3"
      },
      {
        "kr": "요리를 만드는 동안 주의를 기울이다가도 결국 끓는 물에 그릇을 떨어뜨려서 손을 데었어요.",
        "romaji": "Yorireul mandeuneun dongan juuieul giulyeodagado gyeolguk kkeulneun mure geureuteul tteoreotteuryeoseo soneul deyeosseoyo.",
        "en": "Even though I was being careful while cooking, I ended up dropping the bowl into boiling water and burned my hand.",
        "grammar_audio": "/audio/korean/grammar/s_다가도_dagado_Even_though_was_doing_20250209_요리를_만드는_동안_주의를_기울이다가도_결국_끓는_물에_그릇을_떨어뜨려서_손을_데었어요.mp3"
      },
      {
        "kr": "강의를 듣다가도 중요한 부분을 놓치곤 해요. 다시 들어보려 해도 찾기가 어렵네요.",
        "romaji": "Gangireul deuddagado jungyohan bubuneul nohchigon haeyo. Dasi deureoboryeo haedo chajgiga eoryeopneyo.",
        "en": "Even though I'm listening to the lecture, I sometimes miss important parts. It’s hard to find them again even if I try to re-listen.",
        "grammar_audio": "/audio/korean/grammar/s_다가도_dagado_Even_though_was_doing_20250209_강의를_듣다가도_중요한_부분을_놓치곤_해요_다시_들어보려_해도_찾기가_어렵네요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~다는 것 [daneun geot] (The fact that)",
    "short_explanation": "Used to express 'the fact that' or 'the idea that' when referring to specific information.",
    "long_explanation": "'~다는 것 [daneun geot]' is a Korean grammar construct used to convey or emphasize the idea or concept of something, similar to 'the fact that' or 'the idea that' in English. It can also carry a nuance of 'it is said that,' but is most often used to highlight certain information the speaker has come to understand or wishes to point out.",
    "formation": "Verb stem + 다는 것",
    "examples": [
      {
        "kr": "저는 그녀가 한국에서 온다는 것을 전혀 몰랐어요. 그래서 그녀의 한국어 실력에 깜짝 놀랐어요.",
        "romaji": "Jeoneun geunyeoga hanguk-eseo on-daneun geoseul jeonhyeo mollasseoyo. Geuraeseo geunyeoui hangugeo sillyeoge kkamjjak nollasseoyo.",
        "en": "I didn’t know the fact that she came from Korea, so I was really surprised by her Korean skills.",
        "grammar_audio": "/audio/korean/grammar/s_다는_것_daneun_geot_The_fact_that_20250209_저는_그녀가_한국에서_온다는_것을_전혀_몰랐어요_그래서_그녀의_한국어_실력에_깜짝_놀랐어요.mp3"
      },
      {
        "kr": "나는 내가 이길 것이라는 것을 확실히 믿고 있어요. 그래서 모든 준비를 철저히 해서 오늘 경기를 치를 것입니다.",
        "romaji": "Naneun naega igil georaneun geoseul hwaksilhage midgo isseoyo. Geuraeseo modeun junbireul cheoljeohi haeseo oneul gyeonggireul chireul geosimnida.",
        "en": "I firmly believe in the fact that I will win, so I'm thoroughly preparing for today’s match.",
        "grammar_audio": "/audio/korean/grammar/s_다는_것_daneun_geot_The_fact_that_20250209_나는_내가_이길_것이라는_것을_확실히_믿고_있어요_그래서_모든_준비를_철저히_해서_오늘_경기를_치를_것입니다.mp3"
      },
      {
        "kr": "당신이 그만두었다는 것을 들었을 때, 저는 정말로 허탈해졌습니다. 왜냐하면 당신이 이 프로젝트에 중요한 부분이었기 때문입니다.",
        "romaji": "Dangshini geumandueot-daneun geoseul deureosseul ttae, jeoneun jeongmallo heotalhaejyeosseumnida. Waenyahamyeon dangshini i peulojekteu-e jungyohan bubunieotgi ttaemunimnida.",
        "en": "When I heard the fact that you quit, I felt truly devastated because you were a crucial part of this project.",
        "grammar_audio": "/audio/korean/grammar/s_다는_것_daneun_geot_The_fact_that_20250209_당신이_그만두었다는_것을_들었을_때_저는_정말로_허탈해졌습니다_왜냐하면_당신이_이_프로젝트에_중요한_부분이었기_때문입니다.mp3"
      },
      {
        "kr": "나는 그녀가 나를 좋아한다는 것을 알게 되었을 때 정말 행복했습니다. 왜냐하면 나도 그녀를 좋아하고 있었기 때문입니다.",
        "romaji": "Naneun geunyeoga nareul joahandaneun geoseul alge doeeosseul ttae jeongmal haengbokhaesseumnida. Waenyahamyeon nado geunyeoreul joahago isseotgi ttaemunimnida.",
        "en": "When I found out the fact that she likes me, I was really happy because I also liked her.",
        "grammar_audio": "/audio/korean/grammar/s_다는_것_daneun_geot_The_fact_that_20250209_나는_그녀가_나를_좋아한다는_것을_알게_되었을_때_정말_행복했습니다_왜냐하면_나도_그녀를_좋아하고_있었기_때문입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~다며 [damyeo] (Saying that)",
    "short_explanation": "Used to relay an action or state that the speaker (or someone else) says, thinks, or feels.",
    "long_explanation": "'~다며 [damyeo]' is used in Korean when the speaker is quoting or restating something that was said or thought. It often appears when reporting direct speech or personal thoughts, indicating a subjective viewpoint. Tense is indicated by the overall sentence rather than by '다며' itself.",
    "formation": "Declarative verb/adjective form + 다며",
    "examples": [
      {
        "kr": "모두가 하늘이 정말 파랗다며 말했을 때, 저는 그냥 당연하다고 생각했어요.",
        "romaji": "Moduga haneuri jeongmal paratdamyeo malhaesseul ttae, jeoneun geunyang dangyeonhadago saenggakhaesseoyo.",
        "en": "When everyone was saying that the sky was really blue, I just thought it was obvious.",
        "grammar_audio": "/audio/korean/grammar/s_다며_damyeo_Saying_that_20250209_모두가_하늘이_정말_파랗다며_말했을_때_저는_그냥_당연하다고_생각했어요.mp3"
      },
      {
        "kr": "그녀는 자신이 더 이상 참을 수 없다며 그만두기로 결정했어요.",
        "romaji": "Geunyeoneun jasini deo isang chameul su eopdamyeo geumandugiro gyeoljeonghaesseoyo.",
        "en": "She decided to quit, saying that she couldn't stand it anymore.",
        "grammar_audio": "/audio/korean/grammar/s_다며_damyeo_Saying_that_20250209_그녀는_자신이_더_이상_참을_수_없다며_그만두기로_결정했어요.mp3"
      },
      {
        "kr": "제 친구는 밤새 공부한다며 이야기했지만, 저는 그것이 거짓말이라고 생각했어요.",
        "romaji": "Je chinguneun bamsae gongbuhandamyeo iyagihaetjiman, jeoneun geugeosi geojitmarirago saenggakhaesseoyo.",
        "en": "My friend said that he studies all night, but I thought he was lying.",
        "grammar_audio": "/audio/korean/grammar/s_다며_damyeo_Saying_that_20250209_제_친구는_밤새_공부한다며_이야기했지만_저는_그것이_거짓말이라고_생각했어요.mp3"
      },
      {
        "kr": "엄마는 올해는 반드시 다이어트를 해야 한다며 스스로에게 약속했어요.",
        "romaji": "Eommaneun olhaeneun bandeusi daieoteureul haeya handamyeo seuseuroege yaksokhaesseoyo.",
        "en": "Mom promised herself that she must go on a diet this year, saying so herself.",
        "grammar_audio": "/audio/korean/grammar/s_다며_damyeo_Saying_that_20250209_엄마는_올해는_반드시_다이어트를_해야_한다며_스스로에게_약속했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~대로 [daero] (According to, as)",
    "short_explanation": "Used to indicate actions performed according to a certain method, rule, or manner.",
    "long_explanation": "'~대로 [daero]' expresses that something is done 'according to' or 'in the same manner as' a previously mentioned instruction, plan, or situation. It can also mean 'just as it is.'",
    "formation": "Noun + 대로 / Verb stem + (으)ㄴ/는 대로",
    "examples": [
      {
        "kr": "선생님이 가르쳐 준 대로 문제를 풀어 보았지만, 아직 이해가 잘 안 돼요.",
        "romaji": "Seonsaengnimi gareuchyeo jun daero munjeleul pureo boassjiman, ajik ihaega jal andwaeyo.",
        "en": "I tried to solve the problem as the teacher taught me, but I still don’t really understand.",
        "grammar_audio": "/audio/korean/grammar/s_대로_daero_According_to_as_20250209_선생님이_가르쳐_준_대로_문제를_풀어_보았지만_아직_이해가_잘_안_돼요.mp3"
      },
      {
        "kr": "언니가 추천해 준 대로 책을 읽어봤더니 깊은 뜻이 담긴 재미있는 책이었어요.",
        "romaji": "Eonniga chucheonhae jun daero chaegeul ilgeobwatdeoni gipeun tteusi damgin jaemiinneun chaegieosseoyo.",
        "en": "I read the book as my older sister recommended and found it to be quite interesting with a deep message.",
        "grammar_audio": "/audio/korean/grammar/s_대로_daero_According_to_as_20250209_언니가_추천해_준_대로_책을_읽어봤더니_깊은_뜻이_담긴_재미있는_책이었어요.mp3"
      },
      {
        "kr": "우리가 계획한 대로 여행을 계속하면서 여러 랜드마크를 볼 수 있었어요.",
        "romaji": "Uriga gyehoekhan daero yeohaengeul gyesokhamyeonseo yeoreo raendeu-makeureul bol su isseosseoyo.",
        "en": "We continued our trip according to our plan and got to see various landmarks.",
        "grammar_audio": "/audio/korean/grammar/s_대로_daero_According_to_as_20250209_우리가_계획한_대로_여행을_계속하면서_여러_랜드마크를_볼_수_있었어요.mp3"
      },
      {
        "kr": "사진에 보이는 경치대로 실제로 보니까 너무 아름다워서 기분이 좋아졌어요.",
        "romaji": "Sajine boineun gyeongchidaero siljero bonikka neomu areumdawoseo gibuni joajyeosseoyo.",
        "en": "Seeing the scenery just as it appeared in the photo was so beautiful that it made me feel good.",
        "grammar_audio": "/audio/korean/grammar/s_대로_daero_According_to_as_20250209_사진에_보이는_경치대로_실제로_보니까_너무_아름다워서_기분이_좋아졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~대로 하다 [daero hada] (Do as instructed/said)",
    "short_explanation": "Used to express doing something exactly as was stated or instructed.",
    "long_explanation": "The expression '~대로 하다 [daero hada]' means to carry out an action 'according to' or 'as' someone said or as indicated by some rule, instruction, or pattern. It emphasizes following instructions or advice exactly.",
    "formation": "Noun/Verb 어/아/해 + 대로 하다",
    "examples": [
      {
        "kr": "엄마는 아침에 일어나서 꼭 밥을 먹으라고 했어요. 그래서 저는 엄마가 말씀하신 대로 하고 학교에 가요.",
        "romaji": "Eommaneun achime ileonaseo kkok babeul meogeurago haesseoyo. Geuraeseo jeoneun eommaga malsseumhasin daero hago hakgyoe gayo.",
        "en": "Mom told me to be sure to have breakfast in the morning, so I do as she said and then head to school.",
        "grammar_audio": "/audio/korean/grammar/s_대로_하다_daero_hada_Do_as_instructedsaid_20250209_엄마는_아침에_일어나서_꼭_밥을_먹으라고_했어요_그래서_저는_엄마가_말씀하신_대로_하고_학교에_가요.mp3"
      },
      {
        "kr": "요리책의 레시피대로 음식을 만들면 언제나 맛있게 완성할 수 있어요.",
        "romaji": "Yorichaeg-ui resipi daero eumsigeul mandeulmyeon eonjena masitge wanseonghal su isseoyo.",
        "en": "If you cook according to the recipe in the cookbook, you can always make it delicious.",
        "grammar_audio": "/audio/korean/grammar/s_대로_하다_daero_hada_Do_as_instructedsaid_20250209_요리책의_레시피대로_음식을_만들면_언제나_맛있게_완성할_수_있어요.mp3"
      },
      {
        "kr": "선생님이 강조하신 대로 공부하면 시험에서 좋은 점수를 받을 수 있을 거예요.",
        "romaji": "Seonsaengnimi gangjohasin daero gongbuhamyeon siheom-eseo joheun jeomsureul badeul su isseul geoyeyo.",
        "en": "If you study as the teacher emphasized, you’ll be able to get good scores on the test.",
        "grammar_audio": "/audio/korean/grammar/s_대로_하다_daero_hada_Do_as_instructedsaid_20250209_선생님이_강조하신_대로_공부하면_시험에서_좋은_점수를_받을_수_있을_거예요.mp3"
      },
      {
        "kr": "부모님이 말씀하신 대로 매일 운동하고, 영양가 있는 음식을 먹으니까 건강이 훨씬 좋아졌어요.",
        "romaji": "Bumonimi malsseumhasin daero maeil undonghago, yeongyangga itneun eumsigeul meogeunikka geongangi hwolssin joajyeosseoyo.",
        "en": "By exercising every day and eating nutritious food just as my parents told me, my health improved a lot.",
        "grammar_audio": "/audio/korean/grammar/s_대로_하다_daero_hada_Do_as_instructedsaid_20250209_부모님이_말씀하신_대로_매일_운동하고_영양가_있는_음식을_먹으니까_건강이_훨씬_좋아졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~대로이면 [daeroimyeon] (If it’s as ... said)",
    "short_explanation": "Used to express the condition ‘if it is according to ...’ or ‘if it is as stated’.",
    "long_explanation": "'~대로이면 [daeroimyeon]' is a conditional phrase meaning 'if it indeed is as stated or as told.' Often used when talking about a plan, rumor, or instruction that might or might not be accurate.",
    "formation": "Verb (plain form) + 대로이면",
    "examples": [
      {
        "kr": "치킨집 사장님이 말한 대로이면, 여기서 가장 인기 있는 메뉴는 양념치킨이래요.",
        "romaji": "Chikinjip sajangnimi malhan daeroimyeon, yeogiseo gajang ingi inneun menyuneun yangnyeom-chikiniraeyo.",
        "en": "If what the chicken shop owner said is true, then the most popular item here is the seasoned fried chicken.",
        "grammar_audio": "/audio/korean/grammar/s_대로이면_daeroimyeon_If_its_as__said_20250209_치킨집_사장님이_말한_대로이면_여기서_가장_인기_있는_메뉴는_양념치킨이래요.mp3"
      },
      {
        "kr": "네 계획대로이면, 오늘 밤에 영화를 볼 수 있겠네요.",
        "romaji": "Ne gyehoek daeroimyeon, oneul bame yeonghwareul bol su itgenneyo.",
        "en": "If it goes according to your plan, we can watch a movie tonight.",
        "grammar_audio": "/audio/korean/grammar/s_대로이면_daeroimyeon_If_its_as__said_20250209_네_계획대로이면_오늘_밤에_영화를_볼_수_있겠네요.mp3"
      },
      {
        "kr": "민수가 말한 대로이면, 이 시험은 아주 어렵다고 해요.",
        "romaji": "Minsuga malhan daeroimyeon, i siheomeun aju eoryeopdago haeyo.",
        "en": "If it’s as Minsu said, this exam is supposed to be very difficult.",
        "grammar_audio": "/audio/korean/grammar/s_대로이면_daeroimyeon_If_its_as__said_20250209_민수가_말한_대로이면_이_시험은_아주_어렵다고_해요.mp3"
      },
      {
        "kr": "흥민이가 모든 것을 솔직하게 말한 대로이면, 그는 앞으로 이런 실수를 하지 않을 거예요.",
        "romaji": "Heungminiga modeun geoseul soljikhage malhan daeroimyeon, geuneun apeuro ireon silsureul haji anheul geoyeyo.",
        "en": "If everything Heungmin said is true, he won’t make such mistakes again.",
        "grammar_audio": "/audio/korean/grammar/s_대로이면_daeroimyeon_If_its_as__said_20250209_흥민이가_모든_것을_솔직하게_말한_대로이면_그는_앞으로_이런_실수를_하지_않을_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~도록 [dorok] (So that)",
    "short_explanation": "Used to express ‘so that’ or ‘in order to’.",
    "long_explanation": "'~도록 [dorok]' is a grammatical form used in Korean to express an intended purpose or result, similar to 'so that' or 'in order to' in English. It can also indicate cause-and-effect relationships or give instructions for achieving a particular outcome.",
    "formation": "Verb stem + 도록 / Noun + 이/가 + Adjective + 도록",
    "examples": [
      {
        "kr": "야행성 동물들을 보도록 야간 사파리에 가기로 했어요.",
        "romaji": "Ya-haengseong dongmuldeureul bodorok yagan saparie gagiro haesseoyo.",
        "en": "We decided to go to a night safari so that we could see nocturnal animals.",
        "grammar_audio": "/audio/korean/grammar/s_도록_dorok_So_that_20250209_야행성_동물들을_보도록_야간_사파리에_가기로_했어요.mp3"
      },
      {
        "kr": "우리 모두가 이해할 수 있도록 강의를 천천히 해 주세요.",
        "romaji": "Uri moduga ihaehal su itdorok ganguireul cheoncheonhi hae juseyo.",
        "en": "Please give the lecture slowly so that we can all understand.",
        "grammar_audio": "/audio/korean/grammar/s_도록_dorok_So_that_20250209_우리_모두가_이해할_수_있도록_강의를_천천히_해_주세요.mp3"
      },
      {
        "kr": "낙엽이 빨리 치워지도록 주기적으로 마당을 쓸었어요.",
        "romaji": "Nagyeobi ppalli chiwojidoroк jugijeogeuro madangeul sseureosseoyo.",
        "en": "I swept the yard periodically so that the leaves would be cleared away quickly.",
        "grammar_audio": "/audio/korean/grammar/s_도록_dorok_So_that_20250209_낙엽이_빨리_치워지도록_주기적으로_마당을_쓸었어요.mp3"
      },
      {
        "kr": "비바람이 들어오지 않도록 창문을 꼭 닫아 두었어요.",
        "romaji": "Bibarami deureo-oji antorok changmuneul kkok dada dueosseoyo.",
        "en": "I shut the windows tightly so that the storm wouldn’t blow in.",
        "grammar_audio": "/audio/korean/grammar/s_도록_dorok_So_that_20250209_비바람이_들어오지_않도록_창문을_꼭_닫아_두었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~도록 하다 [dorok hada] (Make/ensure that)",
    "short_explanation": "Used to express making someone do something or ensuring that something happens.",
    "long_explanation": "'~도록 하다 [dorok hada]' is often used in Korean to mean 'make sure to...' or 'have/let someone do something.' It can also mean you are ensuring a certain condition or outcome occurs.",
    "formation": "Verb/Noun + 도록 하다",
    "examples": [
      {
        "kr": "저는 항상 학생들이 성실하게 수업을 듣도록 해요.",
        "romaji": "Jeoneun hangsang haksaengdeuri seongsilhage sueobeul deuddorok haeyo.",
        "en": "I always make sure the students listen attentively in class.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_Makeensure_that_20250209_저는_항상_학생들이_성실하게_수업을_듣도록_해요.mp3"
      },
      {
        "kr": "회사에서는 직원들이 일찍 퇴근하도록 하고 있어요.",
        "romaji": "Hoesaeseoneun jigweondeuri iljjik toegunhadorok hago isseoyo.",
        "en": "The company is ensuring that employees leave work early.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_Makeensure_that_20250209_회사에서는_직원들이_일찍_퇴근하도록_하고_있어요.mp3"
      },
      {
        "kr": "그녀는 아이들이 안전하게 집에 도착하도록 했어요.",
        "romaji": "Geunyeoneun aideuri anjeonhage jibe dochakhadorok haesseoyo.",
        "en": "She made sure the children arrived home safely.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_Makeensure_that_20250209_그녀는_아이들이_안전하게_집에_도착하도록_했어요.mp3"
      },
      {
        "kr": "엄마는 우리가 매일 채소를 먹도록 했어요.",
        "romaji": "Eommaneun uriga maeil chaesoreul meokdorok haesseoyo.",
        "en": "Mom made us eat vegetables every day.",
        "grammar_audio": "/audio/korean/grammar/s_도록_하다_dorok_hada_Makeensure_that_20250209_엄마는_우리가_매일_채소를_먹도록_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~도록이면 [dorogimyeon] (If possible)",
    "short_explanation": "Used to express a wish or desire for something to be done if possible.",
    "long_explanation": "'~도록이면 [dorogimyeon]' is used to indicate the speaker's preference or hope that something be done, assuming it’s possible. It can be interpreted as 'if possible...' or 'if you can help it...'.",
    "formation": "Verb stem + 도록이면",
    "examples": [
      {
        "kr": "도록이면 건강에 좋은 음식을 먹으려고 노력하고 있어요.",
        "romaji": "Dorogimyeon geongange joeun eumsigeul meogeuryeogo noryeokhago isseoyo.",
        "en": "I’m trying to eat healthy food if possible.",
        "grammar_audio": "/audio/korean/grammar/s_도록이면_dorogimyeon_If_possible_20250209_도록이면_건강에_좋은_음식을_먹으려고_노력하고_있어요.mp3"
      },
      {
        "kr": "도록이면 빨리 답장해 주세요.",
        "romaji": "Dorogimyeon ppalli dapjanghae juseyo.",
        "en": "Please reply as soon as possible if you can.",
        "grammar_audio": "/audio/korean/grammar/s_도록이면_dorogimyeon_If_possible_20250209_도록이면_빨리_답장해_주세요.mp3"
      },
      {
        "kr": "도록이면 매일 운동을 해야 건강을 유지할 수 있어요.",
        "romaji": "Dorogimyeon maeil undongeul haeya geongangeul yuji hal su isseoyo.",
        "en": "If possible, you should exercise daily to maintain your health.",
        "grammar_audio": "/audio/korean/grammar/s_도록이면_dorogimyeon_If_possible_20250209_도록이면_매일_운동을_해야_건강을_유지할_수_있어요.mp3"
      },
      {
        "kr": "도록이면 숙제를 미루지 않고 바로 하는 게 좋아요.",
        "romaji": "Dorogimyeon sukjereul miruji anhgo baro haneun ge joayo.",
        "en": "It’s best to do your homework right away, if possible, rather than postponing it.",
        "grammar_audio": "/audio/korean/grammar/s_도록이면_dorogimyeon_If_possible_20250209_도록이면_숙제를_미루지_않고_바로_하는_게_좋아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~든지 [deunji] (Whether ... or)",
    "short_explanation": "Used to present multiple possibilities or choices: 'whether ... or'.",
    "long_explanation": "'~든지 [deunji]' is used to offer two or more choices, similar to 'whether ... or' in English. It indicates that any of the mentioned options is acceptable or possible. It can be attached to nouns, verbs, or phrases in a flexible way.",
    "formation": "Noun + (이)든지 / Verb stem + 든지",
    "examples": [
      {
        "kr": "단체여행이든지 개인여행이든지, 저는 어떤 형태의 여행이든 좋아해요.",
        "romaji": "Danche-yeohaengideunji gaein-yeohaengideunji, jeoneun eotteon hyeongtaeui yeohaeng-ideun joahaeyo.",
        "en": "Whether it’s group travel or solo travel, I like any type of trip.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether__or_20250209_단체여행이든지_개인여행이든지_저는_어떤_형태의_여행이든_좋아해요.mp3"
      },
      {
        "kr": "이 문제를 해결하기 위해 많은 시간을 들였든지 많은 돈을 썼든지, 그 모든 노력은 가치가 있었어요.",
        "romaji": "I munjeleul haegyeolhagi wihae manheun siganeul deuryeotdeunji manheun doneul sseotdeunji, geu modeun noryeok-eun gachi-ga isseosseoyo.",
        "en": "Whether we spent a lot of time or a lot of money to solve this problem, all that effort was worthwhile.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether__or_20250209_이_문제를_해결하기_위해_많은_시간을_들였든지_많은_돈을_썼든지_그_모든_노력은_가치가_있었어요.mp3"
      },
      {
        "kr": "그가 만약 서울에 산다든지 부산에 산다든지, 그는 어디서든 행복할 거예요.",
        "romaji": "Geuga manyak Seoul-e sandae-deunji Busan-e sandae-deunji, geuneun eodiseodeun haengbokhal geoyeyo.",
        "en": "Whether he lives in Seoul or Busan, he’ll be happy anywhere.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether__or_20250209_그가_만약_서울에_산다든지_부산에_산다든지_그는_어디서든_행복할_거예요.mp3"
      },
      {
        "kr": "이 회사에서 근무한다든지 다른 회사에서 근무한다든지, 저는 어디서든지 최선을 다하겠습니다.",
        "romaji": "I hoesaeseo geunmuhanda-deunji dareun hoesaeseo geunmuhanda-deunji, jeoneun eodiseodeunji choeseoneul dahagetseumnida.",
        "en": "Whether I work at this company or another one, I will always do my best.",
        "grammar_audio": "/audio/korean/grammar/s_든지_deunji_Whether__or_20250209_이_회사에서_근무한다든지_다른_회사에서_근무한다든지_저는_어디서든지_최선을_다하겠습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~든지 ~든지 [deunji deunji] (Either ... or)",
    "short_explanation": "Used to enumerate alternatives or choices; 'either ... or'.",
    "long_explanation": "'~든지 ~든지 [deunji deunji]' is a conjunctive expression in Korean used to convey multiple choices or alternatives. Similar to 'either ... or' in English, it indicates that any of the mentioned options is acceptable, leaving the final decision to the listener or speaker.",
    "formation": "Noun + 든지 + Noun + 든지",
    "examples": [
      {
        "kr": "이번 주말에는 영화를 보러 가든지, 아니면 집에서 쉬든지 할 계획이에요.",
        "romaji": "Ibeon jumal-eneun yeonghwareul boreo gadeunji, animyeon jibeseo swideunji hal gyehoeg-ieyo.",
        "en": "This weekend, I plan to either go see a movie or rest at home.",
        "grammar_audio": "/audio/korean/grammar/s_든지_든지_deunji_deunji_Either__or_20250209_이번_주말에는_영화를_보러_가든지_아니면_집에서_쉬든지_할_계획이에요.mp3"
      },
      {
        "kr": "저녁 메뉴로 피자를 먹을 든지, 아니면 치킨을 먹을 든지 아직 결정하지 못했어요.",
        "romaji": "Jeonyeok menyuro pijareul meogeul deunji, animyeon chikineul meogeul deunji ajik gyeoljeonghaji mothaesseoyo.",
        "en": "I haven't decided yet whether to eat pizza or chicken for dinner.",
        "grammar_audio": "/audio/korean/grammar/s_든지_든지_deunji_deunji_Either__or_20250209_저녁_메뉴로_피자를_먹을_든지_아니면_치킨을_먹을_든지_아직_결정하지_못했어요.mp3"
      },
      {
        "kr": "지금 집에 가든지, 아니면 조금 더 머무르든지 마음대로 해도 괜찮아요.",
        "romaji": "Jigeum jibe gadeunji, animyeon jogeum deo meomureudeunji maeumdaero haedo gwaenchanhayo.",
        "en": "You can either go home now or stay a bit longer—do whatever you like.",
        "grammar_audio": "/audio/korean/grammar/s_든지_든지_deunji_deunji_Either__or_20250209_지금_집에_가든지_아니면_조금_더_머무르든지_마음대로_해도_괜찮아요.mp3"
      },
      {
        "kr": "그녀에게 전화하든지 아니면 메시지를 보내든지, 반드시 연락을 해야 해요.",
        "romaji": "Geunyeoege jeonhwahadeunji animyeon mesijireul bonaedeunji, bandeusi yeollageul haeya haeyo.",
        "en": "You must contact her either by calling or sending a message.",
        "grammar_audio": "/audio/korean/grammar/s_든지_든지_deunji_deunji_Either__or_20250209_그녀에게_전화하든지_아니면_메시지를_보내든지_반드시_연락을_해야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~라도 [rado] (At least, even if)",
    "short_explanation": "Used to express the minimum action or condition; 'at least', 'even if'.",
    "long_explanation": "'~라도 [rado]' indicates a minimal or lesser option that is still better than nothing. It carries the sense of 'at least' or 'even if,' showing that although the condition might not be ideal, it satisfies some minimum requirement or concession.",
    "formation": "Verb stem + 라도 / Noun + (이)라도",
    "examples": [
      {
        "kr": "이 일을 할 수 없다면, 도움이라도 주세요.",
        "romaji": "I ireul hal su eopdamyeon, doumirado juseyo.",
        "en": "If you can't do this job, at least give me some help.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_이_일을_할_수_없다면_도움이라도_주세요.mp3"
      },
      {
        "kr": "그는 수업에 참여하지 않았지만, 책이라도 읽었어야 했습니다.",
        "romaji": "Geuneun sueobe chamyeohaji anhassjiman, chaegirado ilgeosseo-ya haetsseumnida.",
        "en": "He didn't participate in class, but he should have at least read the book.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_그는_수업에_참여하지_않았지만_책이라도_읽었어야_했습니다.mp3"
      },
      {
        "kr": "시험에 떨어졌지만, 다시 시도라도 해보겠습니다.",
        "romaji": "Siheome tteoreojyeotjiman, dasi sidorado haebogessseumnida.",
        "en": "I failed the exam, but I will at least try again.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_시험에_떨어졌지만_다시_시도라도_해보겠습니다.mp3"
      },
      {
        "kr": "영화를 보러 가고 싶지 않아도, 친구들이 영화를 좋아한다면 함께라도 갈게요.",
        "romaji": "Yeonghwareul boreo gago sipji anhado, chingudeuri yeonghwareul joahandamyeon hamkkerado galgeyo.",
        "en": "Even if I don’t want to see a movie, I'll at least go with them if my friends really like it.",
        "grammar_audio": "/audio/korean/grammar/s_라도_rado_At_least_even_if_20250209_영화를_보러_가고_싶지_않아도_친구들이_영화를_좋아한다면_함께라도_갈게요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~라든지 [radeunji] (Or something)",
    "short_explanation": "Used to indicate alternatives or options; 'or something', 'for example'.",
    "long_explanation": "'~라든지 [radeunji]' is a Korean conjunctive particle used to suggest various examples or possibilities. It’s often used when the speaker is unsure or when only offering sample options among many, much like 'or something like that' or 'for example' in English.",
    "formation": "Noun/Verb stem + 라든지",
    "examples": [
      {
        "kr": "커피라든지 차라든지, 어떤 음료라도 마시겠어요?",
        "romaji": "Keopiradeunji charadeunji, eotteon eumryorado masigesseoyo?",
        "en": "Would you like something to drink, like coffee or tea or anything else?",
        "grammar_audio": "/audio/korean/grammar/s_라든지_radeunji_Or_something_20250209_커피라든지_차라든지_어떤_음료라도_마시겠어요.mp3"
      },
      {
        "kr": "도서관에서 공부하라든지 집에서 책을 읽으라든지, 저는 항상 많이 배우고 있어요.",
        "romaji": "Doseogwaneseo gongbuharadeunji jibeseo chaegeul ilgeuradeunji, jeoneun hangsang manhi baeugo isseoyo.",
        "en": "Whether I'm studying in the library or reading books at home or something else, I'm always learning a lot.",
        "grammar_audio": "/audio/korean/grammar/s_라든지_radeunji_Or_something_20250209_도서관에서_공부하라든지_집에서_책을_읽으라든지_저는_항상_많이_배우고_있어요.mp3"
      },
      {
        "kr": "여행하라든지 새로운 취미를 찾아보라든지, 즐거움을 찾기 위해 해 볼 수 있는 일이 많아요.",
        "romaji": "Yeohaengharadeunji saeroun chwimireul chajaboradeunji, jeulgeoumeul chatgi wihae haebolsu itneun iri manhayo.",
        "en": "There are plenty of things you can do to find enjoyment, like traveling or finding a new hobby.",
        "grammar_audio": "/audio/korean/grammar/s_라든지_radeunji_Or_something_20250209_여행하라든지_새로운_취미를_찾아보라든지_즐거움을_찾기_위해_해_볼_수_있는_일이_많아요.mp3"
      },
      {
        "kr": "사과라든지 배라든지, 과일 중에서 어떤 것을 제일 좋아하세요?",
        "romaji": "Sagwaradeunji baeradeunji, gwail jungeseo eotteon geoseul jeil joahaseyo?",
        "en": "Among fruits, which do you like best—apples, pears, or something else?",
        "grammar_audio": "/audio/korean/grammar/s_라든지_radeunji_Or_something_20250209_사과라든지_배라든지_과일_중에서_어떤_것을_제일_좋아하세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~라면 [ramyeon] (If it's the case that)",
    "short_explanation": "Used to express the hypothetical condition 'if it's the case that'.",
    "long_explanation": "'~라면 [ramyeon]' is a conditional suffix in Korean that corresponds to 'if' or 'if it's the case that' in English. It’s commonly used for hypothetical or conjectural statements.",
    "formation": "Verb/Adjective + (이)라면",
    "examples": [
      {
        "kr": "당신이 그 사실을 먼저 알았다면, 왜 저에게 말해주지 않았어요?",
        "romaji": "Dangshini geu sasireul meonjeo aratdamyeon, wae jeoege malhaejugi anhasseoyo?",
        "en": "If you knew that fact earlier, why didn't you tell me?",
        "grammar_audio": "/audio/korean/grammar/s_라면_ramyeon_If_its_the_case_that_20250209_당신이_그_사실을_먼저_알았다면_왜_저에게_말해주지_않았어요.mp3"
      },
      {
        "kr": "내일 비가 오라면 우산을 챙겨야겠어요.",
        "romaji": "Naeil biga oramyeon usaneul chaenggyeoyagesseoyo.",
        "en": "If it’s going to rain tomorrow, I'd better take an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_라면_ramyeon_If_its_the_case_that_20250209_내일_비가_오라면_우산을_챙겨야겠어요.mp3"
      },
      {
        "kr": "내가 천재라면 이 문제를 쉽게 해결할 수 있을 텐데요.",
        "romaji": "Naega cheonjaeramyeon i munjeleul swipge haegyeolhal su isseul tende-yo.",
        "en": "If I were a genius, I could solve this problem easily.",
        "grammar_audio": "/audio/korean/grammar/s_라면_ramyeon_If_its_the_case_that_20250209_내가_천재라면_이_문제를_쉽게_해결할_수_있을_텐데요.mp3"
      },
      {
        "kr": "영화를 보러 가고 싶다면 저녁에 같이 갈까요?",
        "romaji": "Yeonghwareul boreo gago sipdamyeon jeonyeoge gachi galkkayo?",
        "en": "If you want to see a movie, shall we go together in the evening?",
        "grammar_audio": "/audio/korean/grammar/s_라면_ramyeon_If_its_the_case_that_20250209_영화를_보러_가고_싶다면_저녁에_같이_갈까요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~라면서 [ramyeonseo] (While saying that)",
    "short_explanation": "Used when an action or state contradicts a previously stated intention or claim.",
    "long_explanation": "'~라면서 [ramyeonseo]' is used to indicate that someone acts in a way that goes against what they have said. It can also be used in contexts where you quote someone else’s words and then show a discrepancy. It loosely translates to 'while (he/she) said that...' in English.",
    "formation": "Verb/Adjective (future/past tense form) + 라면서",
    "examples": [
      {
        "kr": "그가 공부를 하겠다면서 계속 게임을 하고 있어요.",
        "romaji": "Geuga gongbureul hagetdamyeonseo gyesok geimeul hago isseoyo.",
        "en": "He keeps playing games while saying he will study.",
        "grammar_audio": "/audio/korean/grammar/s_라면서_ramyeonseo_While_saying_that_20250209_그가_공부를_하겠다면서_계속_게임을_하고_있어요.mp3"
      },
      {
        "kr": "그녀는 돈을 절약하겠다면서 지금 쇼핑을 하고 있어요.",
        "romaji": "Geunyeoneun doneul jeol-yakhagetdamyeonseo jigeum syopingeul hago isseoyo.",
        "en": "She said she'd save money, but she's out shopping now.",
        "grammar_audio": "/audio/korean/grammar/s_라면서_ramyeonseo_While_saying_that_20250209_그녀는_돈을_절약하겠다면서_지금_쇼핑을_하고_있어요.mp3"
      },
      {
        "kr": "나는 다이어트를 해야 한다면서 매일 달콤한 음식을 먹고 있어요.",
        "romaji": "Naneun daieoteureul haeya handamyeonseo maeil dalkomhan eumsigeul meokgo isseoyo.",
        "en": "I say I have to diet, yet I'm eating sweet food every day.",
        "grammar_audio": "/audio/korean/grammar/s_라면서_ramyeonseo_While_saying_that_20250209_나는_다이어트를_해야_한다면서_매일_달콤한_음식을_먹고_있어요.mp3"
      },
      {
        "kr": "우리 아버지는 흡연을 그만두겠다면서 아직도 담배를 피우고 있어요.",
        "romaji": "Uri abeojineun heubyeoneul geumandugessdamyeonseo ajikdo dambaereul piugo isseoyo.",
        "en": "My father said he would quit smoking, but he’s still smoking.",
        "grammar_audio": "/audio/korean/grammar/s_라면서_ramyeonseo_While_saying_that_20250209_우리_아버지는_흡연을_그만두겠다면서_아직도_담배를_피우고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~려고 [ryeogo] (In order to)",
    "short_explanation": "Used to show the intent or purpose of an action; 'in order to', 'to'.",
    "long_explanation": "'~려고 [ryeogo]' is used in Korean to express the intention or purpose for doing something. It is often translated as 'in order to' or simply 'to' in English, indicating the reason or goal behind an action.",
    "formation": "Verb stem + 려고",
    "examples": [
      {
        "kr": "한국어를 잘하려고 매일 한국어를 공부하고 있어요.",
        "romaji": "Hangugeoreul jal-haryeogo maeil hangugeoreul gongbuhago isseoyo.",
        "en": "I'm studying Korean every day in order to speak it well.",
        "grammar_audio": "/audio/korean/grammar/s_려고_ryeogo_In_order_to_20250209_한국어를_잘하려고_매일_한국어를_공부하고_있어요.mp3"
      },
      {
        "kr": "다이어트를 하려고 운동하고, 칼로리를 줄이려고 노력했어요.",
        "romaji": "Daieoteureul haryeogo undonghago, kallorireul juriryeogo noryeokhaesseoyo.",
        "en": "I'm exercising to go on a diet and trying to reduce my calorie intake.",
        "grammar_audio": "/audio/korean/grammar/s_려고_ryeogo_In_order_to_20250209_다이어트를_하려고_운동하고_칼로리를_줄이려고_노력했어요.mp3"
      },
      {
        "kr": "이번 시험을 잘 보려고 많이 공부했고, 일찍 자려고 노력했습니다.",
        "romaji": "Ibeon siheomeul jal boryeogo manhi gongbuhaetgo, iljjik jaryeogo noryeokhaetsseumnida.",
        "en": "I studied a lot to do well on this exam and tried to go to bed early.",
        "grammar_audio": "/audio/korean/grammar/s_려고_ryeogo_In_order_to_20250209_이번_시험을_잘_보려고_많이_공부했고_일찍_자려고_노력했습니다.mp3"
      },
      {
        "kr": "엄마를 기쁘게 해드리려고 매일 방을 치우고, 맛있는 음식을 만들어 드렸어요.",
        "romaji": "Eommareul gippeuge haedeuryeogo maeil bang-eul chiugo, masinneun eumsigeul mandeureo deuryeosseoyo.",
        "en": "I tidied my room every day and made tasty food in order to make my mom happy.",
        "grammar_audio": "/audio/korean/grammar/s_려고_ryeogo_In_order_to_20250209_엄마를_기쁘게_해드리려고_매일_방을_치우고_맛있는_음식을_만들어_드렸어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "50"
  },
  {
    "title": "~려고 하다 [ryeogo hada] (Try to)",
    "short_explanation": "Used to express one's intention or attempt to do something; 'try to', 'plan to'.",
    "long_explanation": "'~려고 하다' indicates the speaker’s intention or plan to perform an action. It can be translated as 'try to...' or 'plan to...' in English. It’s a common structure for talking about near-future actions or goals.",
    "formation": "Verb stem + 려고 하다",
    "examples": [
      {
        "kr": "저는 오늘 학교에 가려고 했는데, 비가 와서 갈 수 없었어요.",
        "romaji": "Jeoneun oneul hakgyoe garyeogo haetneunde, biga waseo gal su eopseosseoyo.",
        "en": "I intended to go to school today, but I couldn't because it was raining.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_저는_오늘_학교에_가려고_했는데_비가_와서_갈_수_없었어요.mp3"
      },
      {
        "kr": "삼촌은 내일 우리 집에 오려고 했지만, 차가 고장 나서 오지 못했어요.",
        "romaji": "Samchoneun naeil uri jibe oryeogo haetjiman, chaga gojang naseo oji moshaesseoyo.",
        "en": "My uncle planned to come to our house tomorrow, but he couldn't because his car broke down.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_삼촌은_내일_우리_집에_오려고_했지만_차가_고장_나서_오지_못했어요.mp3"
      },
      {
        "kr": "나는 당신에게 전화를 하려고 했어요, 하지만 배터리가 다 되어서 전화를 못했어요.",
        "romaji": "Naneun dangsinege jeonhwareul haryeogo haesseoyo, hajiman baeteoriga da doeeoseo jeonhwareul mothaesseoyo.",
        "en": "I tried to call you, but I couldn't because my phone battery died.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_나는_당신에게_전화를_하려고_했어요_하지만_배터리가_다_되어서_전화를_못했어요.mp3"
      },
      {
        "kr": "친구들과 함께 영화를 보려고 했지만 표가 매진되어 보지 못했습니다.",
        "romaji": "Chingudeulgwa hamkke yeonghwareul boryeogo haetjiman pyoga maejindoeeo boji mothaesseumnida.",
        "en": "My friends and I tried to watch a movie together, but we couldn't because the tickets were sold out.",
        "grammar_audio": "/audio/korean/grammar/s_려고_하다_ryeogo_hada_Try_to_20250209_친구들과_함께_영화를_보려고_했지만_표가_매진되어_보지_못했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~려는데 [ryeonde] (I'm planning to, I want to)",
    "short_explanation": "Used to express a plan or intention that has not yet been carried out.",
    "long_explanation": "'~려는데 [ryeonde]' is used when the speaker has a plan or a certain inclination to do something in the future. It often carries the nuance that the plan could be affected by circumstances, or that it’s still in the preliminary stage.",
    "formation": "Verb stem + 려는데",
    "examples": [
      {
        "kr": "책을 사러 서점에 가려는데 비가 너무 많이 와서 아마 못 갈 것 같아요.",
        "romaji": "Chaekeul sareo seojeome garyeoneunde biga neomu manhi waseo ama mot gal geot gatayo.",
        "en": "I’m planning to go to the bookstore to buy a book, but it's raining so hard that I probably can't go.",
        "grammar_audio": "/audio/korean/grammar/s_려는데_ryeonde_Im_planning_to_I_want_to_20250209_책을_사러_서점에_가려는데_비가_너무_많이_와서_아마_못_갈_것_같아요.mp3"
      },
      {
        "kr": "디너를 준비하려는데 필요한 재료가 부족해서 장을 보러 가야 할 것 같아요.",
        "romaji": "Dineoreul junbiharyeoneunde pilyohan jaeryoga bujokhaeseo jangeul boreo gaya hal geot gatayo.",
        "en": "I want to prepare dinner, but I’m short on ingredients, so I'll probably have to go grocery shopping.",
        "grammar_audio": "/audio/korean/grammar/s_려는데_ryeonde_Im_planning_to_I_want_to_20250209_디너를_준비하려는데_필요한_재료가_부족해서_장을_보러_가야_할_것_같아요.mp3"
      },
      {
        "kr": "친구에게 선물을 주려는데 무슨 선물을 줄지 아직 고민 중이에요.",
        "romaji": "Chingu-ege seonmureul juryeoneunde museun seonmureul julji ajik gomin jungieyo.",
        "en": "I plan to give a gift to my friend, but I'm still figuring out which gift to give.",
        "grammar_audio": "/audio/korean/grammar/s_려는데_ryeonde_Im_planning_to_I_want_to_20250209_친구에게_선물을_주려는데_무슨_선물을_줄지_아직_고민_중이에요.mp3"
      },
      {
        "kr": "이번 주말에 영화를 보러 가려는데 모든 표가 예약돼서 못 볼 것 같아요.",
        "romaji": "Ibeon jumale yeonghwareul boreo garyeoneunde modeun pyoga yeyakdoe-seo mot bol geot gatayo.",
        "en": "I’m planning to go see a movie this weekend, but all the tickets are booked, so I probably won’t be able to go.",
        "grammar_audio": "/audio/korean/grammar/s_려는데_ryeonde_Im_planning_to_I_want_to_20250209_이번_주말에_영화를_보러_가려는데_모든_표가_예약돼서_못_볼_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~마다 [mada] (Every)",
    "short_explanation": "Used to express 'every' or 'each'.",
    "long_explanation": "'~마다 [mada]' is a postposition in Korean used to mean 'every' or 'each,' emphasizing the recurring nature of events or items. It can apply to time expressions (e.g., 매일마다), location (집집마다), or other contexts where the idea of ‘every’ or ‘each’ is relevant.",
    "formation": "Noun + 마다",
    "examples": [
      {
        "kr": "나는 주마다 도서관에 가서 책을 빌려 읽어요. 그래서 계속 새 지식을 쌓아 가고 있어요.",
        "romaji": "Naneun jumada doseogwane gaseo chaeg-eul billyeo ilgeoyo. Geuraeseo gyesok sae jisigeul ssaha gago isseoyo.",
        "en": "I go to the library every week to borrow books and read, so I’m constantly learning new things.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20250209_나는_주마다_도서관에_가서_책을_빌려_읽어요_그래서_계속_새_지식을_쌓아_가고_있어요.mp3"
      },
      {
        "kr": "매일 아침마다 기분 좋게 하루를 시작하자. 그러면 좋은 일이 생길 거예요.",
        "romaji": "Maeil achimmada gibun johge harureul sijakhaja. Geureomyeon joheun iri saenggil geoyeyo.",
        "en": "Let’s start each day in a good mood every morning. Then good things will happen.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20250209_매일_아침마다_기분_좋게_하루를_시작하자_그러면_좋은_일이_생길_거예요.mp3"
      },
      {
        "kr": "저는 친구와 매달 말마다 영화를 보러 가요. 그래서 항상 새로운 영화를 볼 수 있어요.",
        "romaji": "Jeoneun chinguwa maedal malmada yeonghwareul boreo gayo. Geuraeseo hangsang saeroun yeonghwareul bol su isseoyo.",
        "en": "At the end of each month, I go see a movie with my friend, so I always get to watch a new release.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20250209_저는_친구와_매달_말마다_영화를_보러_가요_그래서_항상_새로운_영화를_볼_수_있어요.mp3"
      },
      {
        "kr": "우리는 여름마다 해변에 가서 신나는 시간을 보내려고 해요. 그래서 매년 여름이 기다려져요.",
        "romaji": "Urineun yeoreummada haebyeone gaseo sinnaneun siganeul bonaeryeogo haeyo. Geuraeseo maenyeon yeoreumi gidaryeojyeoyo.",
        "en": "Every summer, we go to the beach to have a great time, so we look forward to summer every year.",
        "grammar_audio": "/audio/korean/grammar/s_마다_mada_Every_20250209_우리는_여름마다_해변에_가서_신나는_시간을_보내려고_해요_그래서_매년_여름이_기다려져요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~만큼 [mankeum] (As much as)",
    "short_explanation": "This pattern is used to show the extent or degree of something, or to compare two things.",
    "long_explanation": "'~만큼 [mankeum]' is a grammar structure used to express 'as much as' or 'equivalent to' in English. It lets you denote that something has the same extent or degree as another thing. It’s often used to talk about comparisons, equivalences, or proportional relationships.",
    "formation": "Noun + 만큼 | Verb + 을 만큼",
    "examples": [
      {
        "kr": "당신이 좋아하면 그만큼 저도 좋아합니다. 감정은 항상 상호적인 것이니까요.",
        "romaji": "Dangsini joahamyeon geu mankeum jeodo joahamnida. Gamjeongeun hangsang sanghojeokin geosinikka.",
        "en": "As much as you like it, I like it too, because emotions are always reciprocal.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_당신이_좋아하면_그만큼_저도_좋아합니다_감정은_항상_상호적인_것이니까요.mp3"
      },
      {
        "kr": "우리 아버지는 젊을 때만큼 빨리 달리지는 못하지만, 여전히 체력이 좋아요.",
        "romaji": "Uri abeojineun jeolmeul ttaemankeum ppareuge dallijineun motajiman, yeojeonhi cheryeogi joayo.",
        "en": "My father can't run as fast as he did when he was young, but he still has good stamina.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_우리_아버지는_젊을_때만큼_빨리_달리지는_못하지만_여전히_체력이_좋아요.mp3"
      },
      {
        "kr": "이 책은 읽을수록 좋아요. 책의 뒷부분을 보면 앞부분만큼 흥미로워요.",
        "romaji": "I chaegeun ilgeulsurok joayo. Chaegui dwit bubeuneul bomyeon ap bubeun mankeum heungmirowoyo.",
        "en": "The more you read this book, the better it gets. The latter part is as interesting as the beginning.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_이_책은_읽을수록_좋아요_책의_뒷부분을_보면_앞부분만큼_흥미로워요.mp3"
      },
      {
        "kr": "당신이 얼마나 노력하느냐에 따라 성공 가능성이 그만큼 높아집니다.",
        "romaji": "Dangsini eolmana noryeokhaneunyaye ttara seonggong ganeungseongi geu mankeum nopajimnida.",
        "en": "The more effort you put in, the higher your chance of success.",
        "grammar_audio": "/audio/korean/grammar/s_만큼_mankeum_As_much_as_20250209_당신이_얼마나_노력하느냐에_따라_성공_가능성이_그만큼_높아집니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~면 [myeon] (If, when)",
    "short_explanation": "Used to express a conditional 'if' or to describe 'when' something happens.",
    "long_explanation": "'~면 [myeon]' is a suffix attached to a verb stem to mean 'if' or sometimes 'when' in English. It describes a hypothetical or future condition. The action or state in the main clause will naturally occur once the condition in the dependent clause is met.",
    "formation": "Verb stem + 면",
    "examples": [
      {
        "kr": "저는 밥을 먹으면 행복해지는 기분이에요. 마치 배고픔을 해결하는 것 같아요.",
        "romaji": "Jeoneun babeul meogeumyeon haengbokhaejineun gibunieyo. Machi baegopeumeul haegyeolhaneun geot gatayo.",
        "en": "I feel happy when I eat. It’s like solving hunger.",
        "grammar_audio": "/audio/korean/grammar/s_면_myeon_If_when_20250209_저는_밥을_먹으면_행복해지는_기분이에요_마치_배고픔을_해결하는_것_같아요.mp3"
      },
      {
        "kr": "수업이 끝나면 바로 집에 가려고 해요. 너무 피곤해서 공부할 의욕이 없어요.",
        "romaji": "Sueobi kkeutnamyeon baro jibe garyeogo haeyo. Neomu pigonhaeseo gongbuhal uiyogi eopseoyo.",
        "en": "If class ends, I plan to go home right away. I'm too tired to have the will to study.",
        "grammar_audio": "/audio/korean/grammar/s_면_myeon_If_when_20250209_수업이_끝나면_바로_집에_가려고_해요_너무_피곤해서_공부할_의욕이_없어요.mp3"
      },
      {
        "kr": "시험에 합격하면 친구들과 함께 파티를 열려고 생각하고 있어요.",
        "romaji": "Siheome hapgyeokhamyeon chingudeulgwa hamkke patireul yeollyeogo saenggakago isseoyo.",
        "en": "If I pass the exam, I'm thinking of throwing a party with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_면_myeon_If_when_20250209_시험에_합격하면_친구들과_함께_파티를_열려고_생각하고_있어요.mp3"
      },
      {
        "kr": "저를 더 이상 짓누르면, 결국 저는 앞으로 나아갈 용기를 잃을 것 같아요.",
        "romaji": "Jeoreul deo isang jitnureumyeon, gyeolguk jeoneun apeuro naagal yonggireul ilheul geot gatayo.",
        "en": "If you keep pressing me down, I think I’ll eventually lose the courage to move forward.",
        "grammar_audio": "/audio/korean/grammar/s_면_myeon_If_when_20250209_저를_더_이상_짓누르면_결국_저는_앞으로_나아갈_용기를_잃을_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~면서 [myeonseo] (While)",
    "short_explanation": "A conjunction used to connect two actions happening at the same time.",
    "long_explanation": "'~면서 [myeonseo]' indicates two actions or states occurring simultaneously with the same subject. It often translates to 'while' or 'as' in English. It’s used when both actions happen concurrently rather than in sequence.",
    "formation": "Verb stem + 면서",
    "examples": [
      {
        "kr": "나는 음악을 들으면서 공부를 해요. 그러면 훨씬 더 집중이 잘 돼요.",
        "romaji": "Naneun eumageul deuleumyeonseo gongbureul haeyo. Geureomyeon hwolssin deo jipjungi jal dwaeyo.",
        "en": "I study while listening to music. It helps me concentrate much better.",
        "grammar_audio": "/audio/korean/grammar/s_면서_myeonseo_While_20250209_나는_음악을_들으면서_공부를_해요_그러면_훨씬_더_집중이_잘_돼요.mp3"
      },
      {
        "kr": "우리 엄마는 요리를 하면서 노래를 불러요. 그 모습이 너무 사랑스러워요.",
        "romaji": "Uri eommaneun yorireul hamyeonseo noraereul bulleoyo. Geu moseubi neomu sarangseureowoyo.",
        "en": "My mom cooks while singing, and it’s so lovely to see.",
        "grammar_audio": "/audio/korean/grammar/s_면서_myeonseo_While_20250209_우리_엄마는_요리를_하면서_노래를_불러요_그_모습이_너무_사랑스러워요.mp3"
      },
      {
        "kr": "저는 자전거를 타면서 책을 읽을 수는 없어요. 너무 위험하니까요.",
        "romaji": "Jeoneun jajeongeoreul tamyeonseo chaegeul ilgeul suneun eopseoyo. Neomu wiheomhani kkayo.",
        "en": "I can't read a book while riding a bike because it’s too dangerous.",
        "grammar_audio": "/audio/korean/grammar/s_면서_myeonseo_While_20250209_저는_자전거를_타면서_책을_읽을_수는_없어요_너무_위험하니까요.mp3"
      },
      {
        "kr": "친구와 이야기하면서 커피를 마셔요. 그래서 카페를 자주 가요.",
        "romaji": "Chinguwa iyagihamyeonseo keopireul masyeoyo. Geuraeseo kape-reul jaju gayo.",
        "en": "I chat with my friend while having coffee. That’s why I often go to cafés.",
        "grammar_audio": "/audio/korean/grammar/s_면서_myeonseo_While_20250209_친구와_이야기하면서_커피를_마셔요_그래서_카페를_자주_가요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~밖에 [bakke] (Nothing but, only)",
    "short_explanation": "Expresses 'nothing but' or 'only', indicating limited choices or possibilities (usually in negative sentences).",
    "long_explanation": "'~밖에 [bakke]' is a particle that emphasizes the exclusivity of something—only that item or option exists or applies. It generally appears in negative sentences to highlight that there is nothing else but whatever is mentioned.",
    "formation": "Noun + 밖에 + Negative verb",
    "examples": [
      {
        "kr": "나는 한국어밖에 몰라서 다른 나라에서 생활하기가 너무 어려워요.",
        "romaji": "Naneun hangugeo bakke mollaseo dareun naraseo saenghwalhagiga neomu eoryeowoyo.",
        "en": "It’s hard for me to live in other countries because I know nothing but Korean.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Nothing_but_only_20250209_나는_한국어밖에_몰라서_다른_나라에서_생활하기가_너무_어려워요.mp3"
      },
      {
        "kr": "이 가게에서는 감자튀김밖에 팔지 않아서 선택의 폭이 좁아요.",
        "romaji": "I gagee-seoneun gamjatwigim bakke palji anhaseo seontaekui pogi jobayo.",
        "en": "This shop only sells French fries, so there aren't many options.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Nothing_but_only_20250209_이_가게에서는_감자튀김밖에_팔지_않아서_선택의_폭이_좁아요.mp3"
      },
      {
        "kr": "그녀는 카페에서 머핀밖에 사지 않아서 다른 메뉴는 전혀 몰라요.",
        "romaji": "Geunyeoneun kape-eseo meopin bakke saji anhaseo dareun menyuneun jeonhyeo mollayo.",
        "en": "She buys nothing but muffins at the café, so she doesn’t know any other menu items.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Nothing_but_only_20250209_그녀는_카페에서_머핀밖에_사지_않아서_다른_메뉴는_전혀_몰라요.mp3"
      },
      {
        "kr": "이번 주말은 집에서 쉬는 것밖에 할 수 없어요. 친구들이 모두 바빠서 만날 수가 없어요.",
        "romaji": "Ibeon jumareun jibeseo swineun geot bakke hal su eopseoyo. Chingudeuri modu bappaseo mannal suga eopseoyo.",
        "en": "I can’t do anything except rest at home this weekend, because all my friends are too busy to meet.",
        "grammar_audio": "/audio/korean/grammar/s_밖에_bakke_Nothing_but_only_20250209_이번_주말은_집에서_쉬는_것밖에_할_수_없어요_친구들이_모두_바빠서_만날_수가_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~보다 [boda] (More than)",
    "short_explanation": "Used to form comparative expressions equivalent to 'more than' in English.",
    "long_explanation": "'~보다 [boda]' is a particle that marks what something is being compared to, functioning like 'than' in English. The item before '보다' is the reference of comparison, indicating that something else is bigger, better, or more than it.",
    "formation": "Noun/Verb stem + 보다 + Adjective",
    "examples": [
      {
        "kr": "저는 커피보다 차를 더 좋아해요.",
        "romaji": "Jeoneun keopiboda chareul deo joahaeyo.",
        "en": "I like tea more than coffee.",
        "grammar_audio": "/audio/korean/grammar/s_보다_boda_More_than_20250209_저는_커피보다_차를_더_좋아해요.mp3"
      },
      {
        "kr": "이번 여름은 작년 여름보다 더 더웠어요.",
        "romaji": "Ibeon yeoreumeun jaknyeon yeoreumboda deo deowosseoyo.",
        "en": "This summer was hotter than last summer.",
        "grammar_audio": "/audio/korean/grammar/s_보다_boda_More_than_20250209_이번_여름은_작년_여름보다_더_더웠어요.mp3"
      },
      {
        "kr": "나는 평소보다 더 많이 밥을 먹었어요.",
        "romaji": "Naneun pyeongso-boda deo manhi babeul meogeosseoyo.",
        "en": "I ate more rice than I usually do.",
        "grammar_audio": "/audio/korean/grammar/s_보다_boda_More_than_20250209_나는_평소보다_더_많이_밥을_먹었어요.mp3"
      },
      {
        "kr": "지금 시간은 밤 10시보다 더 늦었어요.",
        "romaji": "Jigeum siganeun bam yeolshi-shiboda deo neujeosseoyo.",
        "en": "The current time is later than 10 p.m.",
        "grammar_audio": "/audio/korean/grammar/s_보다_boda_More_than_20250209_지금_시간은_밤_10시보다_더_늦었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~부터 [buteo] (From, starting from)",
    "short_explanation": "Indicates the starting point of an action, location, or time.",
    "long_explanation": "'~부터 [buteo]' is a common grammar particle used to show when or where something begins. It corresponds to 'from' in English, marking the starting moment, place, or status for an event or situation.",
    "formation": "Noun + 부터",
    "examples": [
      {
        "kr": "내일은 아침 일곱 시부터 수업이 시작되니까 늦지 않게 준비해야 해요.",
        "romaji": "Naeireun achim ilgop si-buteo sueobi sijakdoenikka neutji anke junbihaeya haeyo.",
        "en": "Class starts from 7 a.m. tomorrow, so we need to prepare to avoid being late.",
        "grammar_audio": "/audio/korean/grammar/s_부터_buteo_From_starting_from_20250209_내일은_아침_일곱_시부터_수업이_시작되니까_늦지_않게_준비해야_해요.mp3"
      },
      {
        "kr": "여행 가방을 정리할 때 옷부터 꺼냈고, 그 다음에 액세서리를 챙겼어요.",
        "romaji": "Yeohaeng gabangeul jeongrihal ttae ot-buteo kkeonaetgo, geu daume aeksesarireul chaenggyeosseoyo.",
        "en": "When I organized my travel bag, I took out my clothes first, then packed my accessories.",
        "grammar_audio": "/audio/korean/grammar/s_부터_buteo_From_starting_from_20250209_여행_가방을_정리할_때_옷부터_꺼냈고_그_다음에_액세서리를_챙겼어요.mp3"
      },
      {
        "kr": "이 식당에서는 점심을 열두 시부터 오후 세 시까지 판매해요.",
        "romaji": "I sikdang-eseoneun jeomsimeul yeoldu si-buteo ohu se si-kkaji panmaehaeyo.",
        "en": "At this restaurant, they serve lunch from 12 p.m. to 3 p.m.",
        "grammar_audio": "/audio/korean/grammar/s_부터_buteo_From_starting_from_20250209_이_식당에서는_점심을_열두_시부터_오후_세_시까지_판매해요.mp3"
      },
      {
        "kr": "이번 달부터 다음 해 초까지 이 프로젝트를 완성해야 해요.",
        "romaji": "Ibeon dal-buteo daeum hae cho-kkaji i peurojekteureul wanseonghaeya haeyo.",
        "en": "We need to finish this project from this month until early next year.",
        "grammar_audio": "/audio/korean/grammar/s_부터_buteo_From_starting_from_20250209_이번_달부터_다음_해_초까지_이_프로젝트를_완성해야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~서는 [seoneun] (But in)",
    "short_explanation": "Used to indicate contrast or contradiction in two different contexts.",
    "long_explanation": "'~서는 [seoneun]' can appear in contexts where there is a mismatch between an expectation or statement and the actual situation. It's somewhat similar to saying 'but in (that regard)' or 'but as for...' in English. It often conveys disappointment, contradiction, or surprise.",
    "formation": "Verb stem + 서는",
    "examples": [
      {
        "kr": "그 친구는 일본어도 잘하고 중국어도 잘하는데, 한국어는 전혀 못해서는 좀 아쉽더라고요.",
        "romaji": "Geu chinguneun ilboneodo jalhago junggugeodo jalhaneunde, hangugeoneun jeonhyeo mothaeseoneun jom aswittdoragoyo.",
        "en": "That friend speaks Japanese and Chinese well, but in Korean, he can’t speak at all, which is a bit unfortunate.",
        "grammar_audio": "/audio/korean/grammar/s_서는_seoneun_But_in_20250209_그_친구는_일본어도_잘하고_중국어도_잘하는데_한국어는_전혀_못해서는_좀_아쉽더라고요.mp3"
      },
      {
        "kr": "저는 요리를 꽤 잘하지만, 디저트를 만드는 데서는 자신이 없어요.",
        "romaji": "Jeoneun yorireul kkwae jalhajiman, dijeoteureul mandeuneun deseo-neun jasini eopseoyo.",
        "en": "I cook pretty well, but in making desserts, I’m not confident.",
        "grammar_audio": "/audio/korean/grammar/s_서는_seoneun_But_in_20250209_저는_요리를_꽤_잘하지만_디저트를_만드는_데서는_자신이_없어요.mp3"
      },
      {
        "kr": "그는 시험을 잘 봤다고 했는데, 결과에서는 정말 망해서 놀랐어요.",
        "romaji": "Geuneun siheomeul jal bwattdago haetneunde, gyeolgwa-eseoneun jeongmal manghaeseo nollaesseoyo.",
        "en": "He said he did well on the test, but in the actual results, he failed badly, so I was surprised.",
        "grammar_audio": "/audio/korean/grammar/s_서는_seoneun_But_in_20250209_그는_시험을_잘_봤다고_했는데_결과에서는_정말_망해서_놀랐어요.mp3"
      },
      {
        "kr": "동생은 항상 방을 잘 정리한다고 했는데, 막상 보면 방 청소에서는 완전히 엉망이라 실망했어요.",
        "romaji": "Dongsaeng-eun hangsang bang-eul jal jeongrihandago haetneunde, makssang bomyeon bang cheongso-eseoneun wanjeonhi eongmangira shilmanghaesseoyo.",
        "en": "My younger sibling always says they keep their room tidy, but when I actually look, in terms of cleaning the room, it’s a total mess, so I was disappointed.",
        "grammar_audio": "/audio/korean/grammar/s_서는_seoneun_But_in_20250209_동생은_항상_방을_잘_정리한다고_했는데_막상_보면_방_청소에서는_완전히_엉망이라_실망했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어 보이다 [a/eo boida] (Looks/seems like)",
    "short_explanation": "Used to make a subjective judgment about someone or something based on appearance or situation.",
    "long_explanation": "'~아/어 보이다 [a/eo boida]' is used to convey that something or someone ‘looks like’ or ‘seems like’ a certain way, based on the speaker's subjective perspective. It can express guesses or first impressions about a person’s feelings, health, weather, etc.",
    "formation": "Verb/Adjective stem + 아/어 보이다",
    "examples": [
      {
        "kr": "내일은 날씨가 좋아 보이네요. 외출하면 좋을 것 같아요.",
        "romaji": "Naeireun nalssiga joa boineyo. Oechulhamyeon joeul geot gatayo.",
        "en": "It looks like the weather will be nice tomorrow; going out might be good.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_Looksseems_like_20250209_내일은_날씨가_좋아_보이네요_외출하면_좋을_것_같아요.mp3"
      },
      {
        "kr": "그 친구는 종종 외로워 보이더라고요. 도와주면 좋을 것 같아요.",
        "romaji": "Geu chinguneun jongjong oerowo boideoragoyo. Dowajumyeon joeul geot gatayo.",
        "en": "That friend often seems lonely; I think it’d be good to help them.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_Looksseems_like_20250209_그_친구는_종종_외로워_보이더라고요_도와주면_좋을_것_같아요.mp3"
      },
      {
        "kr": "진희 씨는 요즘 정말 바빠 보여요. 부지런히 일하는 모습에 장래가 기대돼요.",
        "romaji": "Jinhee-ssineun yojeum jeongmal bappa boyeoyo. Bujireonhi ilhaneun moseube jangnaega gidae dwaeyo.",
        "en": "Jinhee seems really busy these days; seeing her work so diligently makes me look forward to her future.",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_Looksseems_like_20250209_진희_씨는_요즘_정말_바빠_보여요_부지런히_일하는_모습에_장래가_기대돼요.mp3"
      },
      {
        "kr": "이렇게 많이 먹었는데도 배가 고파 보이는 건 어떻게 설명할 수 있을까요?",
        "romaji": "Ireoke manhi meogeotneundedo baega gopa boineun geon eotteoke seolmyeonghal su isseulkkayo?",
        "en": "How can we explain that you still look hungry, even after eating so much?",
        "grammar_audio": "/audio/korean/grammar/s_아어_보이다_aeo_boida_Looksseems_like_20250209_이렇게_많이_먹었는데도_배가_고파_보이는_건_어떻게_설명할_수_있을까요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어 버리다 [a/eo beorida] (Completely do, or unfortunately do)",
    "short_explanation": "Used to indicate completing an action fully, or doing something that leads to an unfortunate result.",
    "long_explanation": "The structure '~아/어 버리다 [a/eo beorida]' attaches to a verb stem to emphasize that the action is done completely or that the outcome is regrettable/unwanted. It can imply relief at finishing something, or express the speaker’s sense of regret or finality about the action.",
    "formation": "Verb stem + 아/어 버리다",
    "examples": [
      {
        "kr": "처음 만나는 여자친구를 기다리다가 너무 늦어서 잠이 들어 버렸어요.",
        "romaji": "Cheoeum mannaneun yeoja chingureul gidaridaga neomu neujeoseo jami deureo beoryeosseoyo.",
        "en": "I was waiting for my girlfriend (who I was meeting for the first time), but it got so late that I ended up falling asleep.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_Completely_do_or_unfortunately_do_20250209_처음_만나는_여자친구를_기다리다가_너무_늦어서_잠이_들어_버렸어요.mp3"
      },
      {
        "kr": "과제가 너무 어려워서 그냥 포기해 버렸어요.",
        "romaji": "Gwajega neomu eoryeowoseo geunyang pogihae beoryeosseoyo.",
        "en": "The assignment was so difficult that I just gave up completely.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_Completely_do_or_unfortunately_do_20250209_과제가_너무_어려워서_그냥_포기해_버렸어요.mp3"
      },
      {
        "kr": "가방을 버스에 두고 내려서 깜빡 잊어버렸어요.",
        "romaji": "Gabangeul beoseue dugo naeryeoseo kkambak ijeobeoryeosseoyo.",
        "en": "I left my bag on the bus when I got off and forgot about it.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_Completely_do_or_unfortunately_do_20250209_가방을_버스에_두고_내려서_깜빡_잊어버렸어요.mp3"
      },
      {
        "kr": "야구 경기에서 우리 팀이 너무 안 좋아서 점수를 다 잃어버렸어요.",
        "romaji": "Yagu gyeonggieseo uri timi neomu an joaseo jeomsureul da ilheobeoryeosseoyo.",
        "en": "Our team played so poorly in the baseball game that we ended up losing all our points.",
        "grammar_audio": "/audio/korean/grammar/s_아어_버리다_aeo_beorida_Completely_do_or_unfortunately_do_20250209_야구_경기에서_우리_팀이_너무_안_좋아서_점수를_다_잃어버렸어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어 두다 [a/eo duda] (Keep, leave)",
    "short_explanation": "Used to express leaving or keeping something in a certain state or condition.",
    "long_explanation": "'~아/어 두다 [a/eo duda]' is used in Korean to indicate that one is leaving something in a particular state or maintaining it for a future use or reference. It implies an intentional act of preservation or preparation. Depending on the verb’s final vowel/consonant, use '아 두다' or '어 두다'.",
    "formation": "Verb stem + 아/어 + 두다",
    "examples": [
      {
        "kr": "사랑하는 사람을 위해 좋은 추억을 만들어 두는 것이 중요해요.",
        "romaji": "Saranghaneun sarameul wihae joheun chueogeul mandeureo duneun geosi jungyohaeyo.",
        "en": "It's important to create and keep good memories for the person you love.",
        "grammar_audio": "/audio/korean/grammar/s_아어_두다_aeo_duda_Keep_leave_20250209_사랑하는_사람을_위해_좋은_추억을_만들어_두는_것이_중요해요.mp3"
      },
      {
        "kr": "요리를 너무 많이 만들었어요. 나중에 먹기 위해 냉장고에 저장해 두었어요.",
        "romaji": "Yorireul neomu manhi mandeureosseoyo. Najunge meokgi wihae naengjanggoe jeojanghae dueosseoyo.",
        "en": "I made too much food, so I stored it in the refrigerator for later.",
        "grammar_audio": "/audio/korean/grammar/s_아어_두다_aeo_duda_Keep_leave_20250209_요리를_너무_많이_만들었어요_나중에_먹기_위해_냉장고에_저장해_두었어요.mp3"
      },
      {
        "kr": "공부하다가 모르는 단어를 찾으면 노트에 적어 두는 것이 좋아요.",
        "romaji": "Gongbuhadaga moreuneun daneoreul chajeumyeon note-e jeogeo duneun geosi joayo.",
        "en": "When studying, if you come across a word you don't know, it's good to write it down and keep it.",
        "grammar_audio": "/audio/korean/grammar/s_아어_두다_aeo_duda_Keep_leave_20250209_공부하다가_모르는_단어를_찾으면_노트에_적어_두는_것이_좋아요.mp3"
      },
      {
        "kr": "나는 나의 꿈을 이루기 위해 항상 여러 계획을 세워 두었어요.",
        "romaji": "Naneun naye kkumeul irugi wihae hangsang yeoreo gyaehoeg-eul seewo dueosseoyo.",
        "en": "I always mapped out several plans in advance to achieve my dream.",
        "grammar_audio": "/audio/korean/grammar/s_아어_두다_aeo_duda_Keep_leave_20250209_나는_나의_꿈을_이루기_위해_항상_여러_계획을_세워_두었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어 가다 [a/eo gada] (Go on doing)",
    "short_explanation": "Expresses the continuous or ongoing nature of an action over time.",
    "long_explanation": "'~아/어 가다 [a/eo gada]' is used to show that an action continues steadily or gradually forward, often implying persistence or progress. It can be similar to 'go on doing something' in English.",
    "formation": "Verb stem + 아/어 가다",
    "examples": [
      {
        "kr": "그는 매일 아침 운동을 해 가면서 건강을 유지하려고 노력합니다.",
        "romaji": "Geuneun maeil achim undongeul hae gamyeonseo geongangeul yuji-haryeogo noryeokhamnida.",
        "en": "He goes on exercising every morning to maintain his health.",
        "grammar_audio": "/audio/korean/grammar/s_아어_가다_aeo_gada_Go_on_doing_20250209_그는_매일_아침_운동을_해_가면서_건강을_유지하려고_노력합니다.mp3"
      },
      {
        "kr": "그녀는 학교에 다니면서 일을 해 가고 있어요.",
        "romaji": "Geunyeoneun hakgyoe danimyeonseo ireul hae gago isseoyo.",
        "en": "She keeps on working while attending school.",
        "grammar_audio": "/audio/korean/grammar/s_아어_가다_aeo_gada_Go_on_doing_20250209_그녀는_학교에_다니면서_일을_해_가고_있어요.mp3"
      },
      {
        "kr": "우리는 큰 어려움에도 불구하고 프로젝트를 계속 해 가고 있습니다.",
        "romaji": "Urineun keun eoryeoumedo bulguhago peurojekteureul gyesok hae gago itsseumnida.",
        "en": "Despite great difficulties, we continue on with the project.",
        "grammar_audio": "/audio/korean/grammar/s_아어_가다_aeo_gada_Go_on_doing_20250209_우리는_큰_어려움에도_불구하고_프로젝트를_계속_해_가고_있습니다.mp3"
      },
      {
        "kr": "친구들이 포기했음에도 불구하고, 저는 연습을 계속 해 가고 있어요.",
        "romaji": "Chingudeuri pogihaesseumedo bulguhago, jeoneun yeonseubeul gyesok hae gago isseoyo.",
        "en": "Even though my friends gave up, I keep on practicing.",
        "grammar_audio": "/audio/korean/grammar/s_아어_가다_aeo_gada_Go_on_doing_20250209_친구들이_포기했음에도_불구하고_저는_연습을_계속_해_가고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어 오다 [a/eo oda] (Come to do)",
    "short_explanation": "Expresses an action developing over time or a gradual change leading up to the present.",
    "long_explanation": "'~아/어 오다 [a/eo oda]' is used to show that an action has been in progress or gradually developed until now. It can translate to 'have been doing' or 'come to do' in English, depending on context.",
    "formation": "Verb stem + 아/어 오다",
    "examples": [
      {
        "kr": "그는 한 달 동안 매일 한국어를 공부해 오다 보니 이제 유창하게 말할 수 있어요.",
        "romaji": "Geuneun han dal dongan maeil hangugeoreul gongbuhae oda boni ije yuchanghage malhal su isseoyo.",
        "en": "He has been studying Korean every day for a month, so now he can speak it fluently.",
        "grammar_audio": "/audio/korean/grammar/s_아어_오다_aeo_oda_Come_to_do_20250209_그는_한_달_동안_매일_한국어를_공부해_오다_보니_이제_유창하게_말할_수_있어요.mp3"
      },
      {
        "kr": "우리는 같이 매일 운동해 오다 보니 어느새 체력이 많이 좋아졌어요.",
        "romaji": "Urineun gachi maeil undonghae oda boni eoneusae cheryeogi manhi joajeosseoyo.",
        "en": "We have been working out together daily, and before we knew it, our stamina improved a lot.",
        "grammar_audio": "/audio/korean/grammar/s_아어_오다_aeo_oda_Come_to_do_20250209_우리는_같이_매일_운동해_오다_보니_어느새_체력이_많이_좋아졌어요.mp3"
      },
      {
        "kr": "미나는 그림을 꾸준히 그려 오다 보니 점점 더 잘 그리게 되었어요.",
        "romaji": "Mina-neun geurimeul kkujunhi geuryeo oda boni jeomjeom deo jal geurigedoeosseoyo.",
        "en": "Since Mina has steadily been drawing, she has gradually gotten better at it.",
        "grammar_audio": "/audio/korean/grammar/s_아어_오다_aeo_oda_Come_to_do_20250209_미나는_그림을_꾸준히_그려_오다_보니_점점_더_잘_그리게_되었어요.mp3"
      },
      {
        "kr": "해가 저물어 오다 보니 금세 어두워졌어요.",
        "romaji": "Haega jeomureo oda boni geumse eoduwanjeosseoyo.",
        "en": "As the sun set, it quickly became dark.",
        "grammar_audio": "/audio/korean/grammar/s_아어_오다_aeo_oda_Come_to_do_20250209_해가_저물어_오다_보니_금세_어두워졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어야 하다 [a/eoya hada] (Have to, must)",
    "short_explanation": "Expresses obligation or necessity: 'have to,' 'must'.",
    "long_explanation": "'~아/어야 하다 [a/eoya hada]' indicates that something needs to be done or is mandatory. It corresponds to 'have to' or 'must' in English. '아야 하다' is used if the verb ends in ㅏ/ㅗ, and '어야 하다' is used otherwise.",
    "formation": "Verb stem + 아/어야 하다",
    "examples": [
      {
        "kr": "내일 시험이 있으니까 오늘 밤에 공부해야 해요.",
        "romaji": "Naeil siheomi isseunikka oneul bame gongbuhaeya haeyo.",
        "en": "I must study tonight because I have an exam tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_아어야_하다_aeoya_hada_Have_to_must_20250209_내일_시험이_있으니까_오늘_밤에_공부해야_해요.mp3"
      },
      {
        "kr": "회사에 늦지 않으려면 7시에 집을 나가야 해요.",
        "romaji": "Hoesae neujji an-euryeomyeon chil si-e jibeul nagaya haeyo.",
        "en": "I must leave the house at 7 if I don’t want to be late for work.",
        "grammar_audio": "/audio/korean/grammar/s_아어야_하다_aeoya_hada_Have_to_must_20250209_회사에_늦지_않으려면_7시에_집을_나가야_해요.mp3"
      },
      {
        "kr": "야외 활동할 때는 태양으로부터 피부를 보호해야 해요.",
        "romaji": "Yawoe hwaldonghal ttaeneun taeyangeurobuteo pibureul bohohaeya haeyo.",
        "en": "You must protect your skin from the sun when doing outdoor activities.",
        "grammar_audio": "/audio/korean/grammar/s_아어야_하다_aeoya_hada_Have_to_must_20250209_야외_활동할_때는_태양으로부터_피부를_보호해야_해요.mp3"
      },
      {
        "kr": "좋은 점수를 받으려면 더 열심히 공부해야 해요.",
        "romaji": "Joeun jeomsureul badeuryeomyeon deo yeolsimhi gongbuhaeya haeyo.",
        "en": "I must study harder if I want a good grade.",
        "grammar_audio": "/audio/korean/grammar/s_아어야_하다_aeoya_hada_Have_to_must_20250209_좋은_점수를_받으려면_더_열심히_공부해야_해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어야지 [a/eoyaji] (I'm going to)",
    "short_explanation": "Expresses the speaker's strong intention or determination to do something.",
    "long_explanation": "The grammar '~아/어야지 [a/eoyaji]' conveys a strong resolve or plan to carry out an action, much like saying 'I really should...' or 'I’m definitely going to...' in English. It’s often used in first-person contexts.",
    "formation": "Verb stem + 아/어야지",
    "examples": [
      {
        "kr": "진짜 공부를 더 열심히 해야지. 이번에는 꼭 성적을 올릴 거예요.",
        "romaji": "Jinjja gongbureul deo yeolsimhi haeyaji. Ibeoneneun kkok seongjeogeul ollil geoyeyo.",
        "en": "I really should study harder. This time, I'm definitely going to raise my grades.",
        "grammar_audio": "/audio/korean/grammar/s_아어야지_aeoyaji_Im_going_to_20250209_진짜_공부를_더_열심히_해야지_이번에는_꼭_성적을_올릴_거예요.mp3"
      },
      {
        "kr": "내일 아침에 일어나서 운동해야지. 건강을 위해 더 신경 써야겠어.",
        "romaji": "Naeil achime ireonaseo undonghaeyaji. Geongangeul wihae deo singyeong sseoyagesseo.",
        "en": "I’m going to wake up tomorrow morning and exercise. I need to take better care of my health.",
        "grammar_audio": "/audio/korean/grammar/s_아어야지_aeoyaji_Im_going_to_20250209_내일_아침에_일어나서_운동해야지_건강을_위해_더_신경_써야겠어.mp3"
      },
      {
        "kr": "이제는 진짜로 담배를 끊어야지. 건강이 너무 걱정돼서 결심했어요.",
        "romaji": "Ijeneun jinjjaro dambaereul kkeuneoyaji. Geongangi neomu geokjeongdoe-seo gyeolsimhaesseoyo.",
        "en": "Now I really have to quit smoking. I decided because I’m worried about my health.",
        "grammar_audio": "/audio/korean/grammar/s_아어야지_aeoyaji_Im_going_to_20250209_이제는_진짜로_담배를_끊어야지_건강이_너무_걱정돼서_결심했어요.mp3"
      },
      {
        "kr": "엄마에게 전화를 해야지. 꽤 오래 연락하지 못했네.",
        "romaji": "Eommaege jeonhwareul haeyaji. Kkwae oraee yeollak-haji mothaetne.",
        "en": "I should call my mom. It’s been quite a while since we last talked.",
        "grammar_audio": "/audio/korean/grammar/s_아어야지_aeoyaji_Im_going_to_20250209_엄마에게_전화를_해야지_꽤_오래_연락하지_못했네.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어도 [a/eodo] (Even if)",
    "short_explanation": "Used to express 'even if' or 'although'.",
    "long_explanation": "'~아/어도 [a/eodo]' conveys a condition that won’t change the outcome or the speaker's viewpoint. Similar to 'even if' or 'no matter how' in English, it shows that whatever happens in the first clause does not alter the second clause.",
    "formation": "Verb stem + 아/어도",
    "examples": [
      {
        "kr": "여기 음식은 아무리 비싸도 맛있어서 자주 먹어요.",
        "romaji": "Yeogi eumsigeun amuri bissado masisseoseo jaju meogeoyo.",
        "en": "No matter how expensive the food here is, it's delicious, so I eat it often.",
        "grammar_audio": "/audio/korean/grammar/s_아어도_aeodo_Even_if_20250209_여기_음식은_아무리_비싸도_맛있어서_자주_먹어요.mp3"
      },
      {
        "kr": "아무리 빨리 달려도 학교에 늦을 것 같아요.",
        "romaji": "Amuri ppalli dallyeodo hakgyoe neujeul geot gatayo.",
        "en": "Even if I run as fast as I can, I think I'll still be late for school.",
        "grammar_audio": "/audio/korean/grammar/s_아어도_aeodo_Even_if_20250209_아무리_빨리_달려도_학교에_늦을_것_같아요.mp3"
      },
      {
        "kr": "내가 아무리 노력해도 그 프로젝트를 끝내기 힘들 것 같아.",
        "romaji": "Naega amuri noryeokhaedo geu peurojekteureul kkeutnaegi himdeul geot gata.",
        "en": "No matter how much I try, I don’t think I can finish that project.",
        "grammar_audio": "/audio/korean/grammar/s_아어도_aeodo_Even_if_20250209_내가_아무리_노력해도_그_프로젝트를_끝내기_힘들_것_같아.mp3"
      },
      {
        "kr": "운동을 아무리 해도 제 몸에 만족이 안 돼요.",
        "romaji": "Undongeul amuri haedo je mome manjoki an dwaeyo.",
        "en": "No matter how much I exercise, I'm not satisfied with my body.",
        "grammar_audio": "/audio/korean/grammar/s_아어도_aeodo_Even_if_20250209_운동을_아무리_해도_제_몸에_만족이_안_돼요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~아/어서 [a/eoseo] (Because, so)",
    "short_explanation": "Used to express reason or cause: 'because', 'so'.",
    "long_explanation": "'~아/어서 [a/eoseo]' is a common conjunctive ending indicating that the first clause is the reason or cause for the second clause. It corresponds to 'because' or 'so' in English and is used in everyday speech and writing.",
    "formation": "Verb stem + 아/어서",
    "examples": [
      {
        "kr": "머리가 아파서 학교에 갈 수 없었어요.",
        "romaji": "Meoriga apaseo hakgyoe gal su eopseosseoyo.",
        "en": "I couldn't go to school because I had a headache.",
        "grammar_audio": "/audio/korean/grammar/s_아어서_aeoseo_Because_so_20250209_머리가_아파서_학교에_갈_수_없었어요.mp3"
      },
      {
        "kr": "오늘 날씨가 좋아서 산책하러 갔어요.",
        "romaji": "Oneul nalssiga johaseo sanchaekhareo gasseoyo.",
        "en": "I went for a walk because the weather was nice today.",
        "grammar_audio": "/audio/korean/grammar/s_아어서_aeoseo_Because_so_20250209_오늘_날씨가_좋아서_산책하러_갔어요.mp3"
      },
      {
        "kr": "이 영화가 재미있어서 두 번 봤어요.",
        "romaji": "I yeonghwaga jaemiisseoseo du beon bwasseoyo.",
        "en": "I watched this movie twice because it was interesting.",
        "grammar_audio": "/audio/korean/grammar/s_아어서_aeoseo_Because_so_20250209_이_영화가_재미있어서_두_번_봤어요.mp3"
      },
      {
        "kr": "그녀는 책을 잃어버려서 슬퍼하고 있어요.",
        "romaji": "Geunyeoneun chaegeul ilheobeoryeoseo seulpeohago isseoyo.",
        "en": "She’s sad because she lost her book.",
        "grammar_audio": "/audio/korean/grammar/s_아어서_aeoseo_Because_so_20250209_그녀는_책을_잃어버려서_슬퍼하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었던 [ass/eossdeon] (Was)",
    "short_explanation": "Used to express a past state or condition: 'was'.",
    "long_explanation": "The past modifier '~았/었던 [ass/eossdeon]' is used to describe a noun that had a certain state or performed an action in the past. It's similar to saying 'that was...' or 'who was...' in English. The choice of 았/었 depends on the final vowel of the verb stem.",
    "formation": "Verb + 았/었던 + Noun",
    "examples": [
      {
        "kr": "저는 학교에서 천재였던 학생이었어요. 국어, 수학, 과학, 사회에서 모두 최고 성적을 받았어요.",
        "romaji": "Jeoneun hakgyoeseo cheonjaeyeossdeon hagsaengieosseoyo. Gugeo, suhag, gwahak, sahoe-eseo modu choego seongjeogeul badasseoyo.",
        "en": "I was a genius student at school, receiving top marks in Korean, math, science, and social studies.",
        "grammar_audio": "/audio/korean/grammar/s_았었던_asseossdeon_Was_20250209_저는_학교에서_천재였던_학생이었어요_국어_수학_과학_사회에서_모두_최고_성적을_받았어요.mp3"
      },
      {
        "kr": "내가 어릴 때 좋아했던 가수는 신화였어요. 그들의 음악은 항상 제 기억에 남아요.",
        "romaji": "Naega eoril ttae johahaessdeon gasuneun Sinhwayeosseoyo. Geudeurui eumageun hangsang je gieoge namayo.",
        "en": "The singer I liked when I was young was Shinhwa; their music always remains in my memory.",
        "grammar_audio": "/audio/korean/grammar/s_았었던_asseossdeon_Was_20250209_내가_어릴_때_좋아했던_가수는_신화였어요_그들의_음악은_항상_제_기억에_남아요.mp3"
      },
      {
        "kr": "우리 아버지는 어렸을 때 가난했던 사람이었는데, 지금은 잘 살고 있어요.",
        "romaji": "Uri abeojineun eoryeosseul ttae gananhaessdeon saramieonneunde, jigeumeun jal salgo isseoyo.",
        "en": "My father was poor when he was young, but now he is doing well.",
        "grammar_audio": "/audio/korean/grammar/s_았었던_asseossdeon_Was_20250209_우리_아버지는_어렸을_때_가난했던_사람이었는데_지금은_잘_살고_있어요.mp3"
      },
      {
        "kr": "그녀는 학교 시절에는 조용했던 사람이었는데, 지금은 아주 활발해졌어요.",
        "romaji": "Geunyeoneun hakgyo sijeol-eneun joyonghaessdeon saramieonneunde, jigeumeun aju hwalbalhaejyeosseoyo.",
        "en": "She used to be very quiet in school, but now she's become really outgoing.",
        "grammar_audio": "/audio/korean/grammar/s_았었던_asseossdeon_Was_20250209_그녀는_학교_시절에는_조용했던_사람이었는데_지금은_아주_활발해졌어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었어야 했다 [ass/eosseoya haessda] (Should have done)",
    "short_explanation": "Used to express regret about something that should have been done in the past but was not.",
    "long_explanation": "'~았/었어야 했다 [ass/eosseoya haessda]' shows regret for not doing something that one should have done in the past. It translates to 'should have done' in English. It highlights a missed obligation or opportunity.",
    "formation": "Verb + 았/었어야 했다",
    "examples": [
      {
        "kr": "저는 어제 그 일을 했어야 했는데 시간이 없어서 못 했어요. 많이 후회하고 있어요.",
        "romaji": "Jeoneun eoje geu ireul haesseoya haenneunde sigani eopseoseo mot haesseoyo. Manhi huhoehago isseoyo.",
        "en": "I should have done that work yesterday, but I couldn't because I didn’t have time. I really regret it.",
        "grammar_audio": "/audio/korean/grammar/s_았었어야_했다_asseosseoya_haessda_Should_have_done_20250209_저는_어제_그_일을_했어야_했는데_시간이_없어서_못_했어요_많이_후회하고_있어요.mp3"
      },
      {
        "kr": "오늘 아침에 운동을 했어야 했지만 게을러서 안 했어요.",
        "romaji": "Oneul achime undongeul haesseoya haetjiman geeulleoseo an haesseoyo.",
        "en": "I should have exercised this morning, but I was too lazy and didn't do it.",
        "grammar_audio": "/audio/korean/grammar/s_았었어야_했다_asseosseoya_haessda_Should_have_done_20250209_오늘_아침에_운동을_했어야_했지만_게을러서_안_했어요.mp3"
      },
      {
        "kr": "당신은 그런 상황에서 따뜻하게 대했어야 했는데 차갑게 굴더군요.",
        "romaji": "Dangsineun geureon sanghwangeseo ttatteuthage daehaesseoya haenneunde chagapge guldeogunyo.",
        "en": "You should have responded warmly in that situation, but you acted coldly.",
        "grammar_audio": "/audio/korean/grammar/s_았었어야_했다_asseosseoya_haessda_Should_have_done_20250209_당신은_그런_상황에서_따뜻하게_대했어야_했는데_차갑게_굴더군요.mp3"
      },
      {
        "kr": "저는 그날 싸움을 어떻게든 피했어야 했는데 결국 못 피했어요.",
        "romaji": "Jeoneun geunal ssaumeul eotteokedeun pihaesseoya haenneunde gyeolguk mot pihaesseoyo.",
        "en": "I should have avoided the fight that day somehow, but I ended up not being able to.",
        "grammar_audio": "/audio/korean/grammar/s_았었어야_했다_asseosseoya_haessda_Should_have_done_20250209_저는_그날_싸움을_어떻게든_피했어야_했는데_결국_못_피했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었으면 [ass/eosseumyeon] (I wish it were)",
    "short_explanation": "'~았/었으면' is used to express a wish or desire for a situation to be different from what it is now.",
    "long_explanation": "'~았/었으면 [ass/eosseumyeon]' is a grammar point commonly used to express hypothetical or unreal situations, much like 'I wish...' or 'if only...' in English. It conveys regret or unfulfilled wishes. Formally, it’s the past tense stem plus ‘(으)면’, indicating a desire for something that did not happen.",
    "formation": "Past verb stem + (으)면",
    "examples": [
      {
        "kr": "저는 어릴 때부터 음악가가 되고 싶었어요. 진짜 음악가가 되었으면 좋겠어요.",
        "romaji": "Jeoneun eoril ttaebuteo eumakga-ga doego sipeosseoyo. Jinjja eumakgaga doeeosseumyeon jokesseoyo.",
        "en": "Since I was young, I wanted to become a musician. I wish I really became a musician.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_asseosseumyeon_I_wish_it_were_20250209_저는_어릴_때부터_음악가가_되고_싶었어요_진짜_음악가가_되었으면_좋겠어요.mp3"
      },
      {
        "kr": "날씨가 좋았으면 좋겠어요. 그럼 우리가 함께 산책하러 갈 수 있을 텐데요.",
        "romaji": "Nalssiga johasseumyeon jokesseoyo. Geureom uriga hamkke sanchaekhareo gal su isseul tende-yo.",
        "en": "I wish the weather was good. Then, we could go for a walk together.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_asseosseumyeon_I_wish_it_were_20250209_날씨가_좋았으면_좋겠어요_그럼_우리가_함께_산책하러_갈_수_있을_텐데요.mp3"
      },
      {
        "kr": "마지막으로 그와 만났을 때 좋은 이야기를 들려줬으면 좋겠어요.",
        "romaji": "Majimakeuro geuwa mannasseul ttae joheun iyagireul deullyeojwosseumyeon jokesseoyo.",
        "en": "I wish I had told him something good when I met him last time.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_asseosseumyeon_I_wish_it_were_20250209_마지막으로_그와_만났을_때_좋은_이야기를_들려줬으면_좋겠어요.mp3"
      },
      {
        "kr": "약속을 지켰으면 좋겠어요. 그럼 다른 사람들이 저를 더 신뢰할 수 있었을 거예요.",
        "romaji": "Yagsogeul jikyeosseumyeon jokesseoyo. Geureom dareun saramdeuri jeoreul deo sinroehal su isseosseul geoyeyo.",
        "en": "I wish I had kept my promise. Then other people could have trusted me more.",
        "grammar_audio": "/audio/korean/grammar/s_았었으면_asseosseumyeon_I_wish_it_were_20250209_약속을_지켰으면_좋겠어요_그럼_다른_사람들이_저를_더_신뢰할_수_있었을_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었을 텐데 [ass/eosseul tende] (I assume it must have been)",
    "short_explanation": "Used to express assumption or expectation based on past events.",
    "long_explanation": "'~았/었을 텐데 [ass/eosseul tende]' expresses the speaker's speculation or presumption about a past situation. It combines the past tense marker '~았/었' with '을 텐데,' which shows the speaker’s expectation or guess about what must have happened.",
    "formation": "Verb stem + 았/었을 텐데",
    "examples": [
      {
        "kr": "너무 바빴을 텐데 그 일을 다 하지 못했을 것 같아요.",
        "romaji": "Neomu bappasseul tende geu ireul da haji mothaesseul geot gatayo.",
        "en": "You must have been really busy, so I assume you didn't manage to finish all that work.",
        "grammar_audio": "/audio/korean/grammar/s_았었을_텐데_asseosseul_tende_I_assume_it_must_have_been_20250209_너무_바빴을_텐데_그_일을_다_하지_못했을_것_같아요.mp3"
      },
      {
        "kr": "당신이 그렇게 많이 공부했을 텐데 문제를 풀 수 있었나요?",
        "romaji": "Dangsini geureohge manhi gongbuhaesseul tende munjereul pul su isseonnayo?",
        "en": "Considering you studied so much, I assume you were able to solve the problems?",
        "grammar_audio": "/audio/korean/grammar/s_았었을_텐데_asseosseul_tende_I_assume_it_must_have_been_20250209_당신이_그렇게_많이_공부했을_텐데_문제를_풀_수_있었나요.mp3"
      },
      {
        "kr": "그녀가 너무 행복했을 텐데 왜 눈물을 흘렸을까요?",
        "romaji": "Geunyeoga neomu haengbokhaesseul tende wae nunmureul heullyeosseulkkayo?",
        "en": "She must have been so happy—why do you think she shed tears?",
        "grammar_audio": "/audio/korean/grammar/s_았었을_텐데_asseosseul_tende_I_assume_it_must_have_been_20250209_그녀가_너무_행복했을_텐데_왜_눈물을_흘렸을까요.mp3"
      },
      {
        "kr": "날씨가 화창했을 텐데 여행이 재미있었을 것 같아요.",
        "romaji": "Nalssiga hwachanghaesseul tende yeohaengi jaemiisseosseul geot gatayo.",
        "en": "Given the nice weather, I assume the trip was fun.",
        "grammar_audio": "/audio/korean/grammar/s_았었을_텐데_asseosseul_tende_I_assume_it_must_have_been_20250209_날씨가_화창했을_텐데_여행이_재미있었을_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었다가 [ass/eossdaga] (Was and then)",
    "short_explanation": "Expresses that a past situation happened and then changed or was followed by another occurrence.",
    "long_explanation": "'~았/었다가 [ass/eossdaga]' denotes a change in state or a sequence of events in the past. It’s often used with action verbs to show one event happened and then a subsequent action followed.",
    "formation": "Verb + 았/었다가",
    "examples": [
      {
        "kr": "저는 학교에 갔다가 도서관에서 공부하러 갔어요.",
        "romaji": "Jeoneun hakgyoe gassdaga doseogwaneseo gongbuhareo gasseoyo.",
        "en": "I went to school, then I headed to the library to study.",
        "grammar_audio": "/audio/korean/grammar/s_았었다가_asseossdaga_Was_and_then_20250209_저는_학교에_갔다가_도서관에서_공부하러_갔어요.mp3"
      },
      {
        "kr": "그는 일을 했다가 집으로 돌아갔어요.",
        "romaji": "Geuneun ireul haessdaga jibeuro doragasseoyo.",
        "en": "He worked, and then he went home.",
        "grammar_audio": "/audio/korean/grammar/s_았었다가_asseossdaga_Was_and_then_20250209_그는_일을_했다가_집으로_돌아갔어요.mp3"
      },
      {
        "kr": "나는 친구를 만났다가 영화를 보러 갔어요.",
        "romaji": "Naneun chingureul mannassdaga yeonghwareul boreo gasseoyo.",
        "en": "I met a friend, and then went to see a movie.",
        "grammar_audio": "/audio/korean/grammar/s_았었다가_asseossdaga_Was_and_then_20250209_나는_친구를_만났다가_영화를_보러_갔어요.mp3"
      },
      {
        "kr": "우리는 점심을 먹었다가 공원에서 산책을 했어요.",
        "romaji": "Urineun jeomsimeul meogeossdaga gongwoneseo sanchaekeul haesseoyo.",
        "en": "We ate lunch, and then took a walk in the park.",
        "grammar_audio": "/audio/korean/grammar/s_았었다가_asseossdaga_Was_and_then_20250209_우리는_점심을_먹었다가_공원에서_산책을_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~았/었다면 [ass/eossdamyeon] (If it had been)",
    "short_explanation": "Used for hypothetical past situations: 'If it had been'.",
    "long_explanation": "'~았/었다면' imagines a different outcome for a past situation. '다면' after the past tense indicates an unreal or counterfactual condition, often expressing regret or speculation about what could have happened.",
    "formation": "Past tense verb/adjective + 다면",
    "examples": [
      {
        "kr": "그때 그의 조언을 들었다면 지금 상황이 달라졌을 거예요.",
        "romaji": "Geuttae geuui jo-eoneul deureossdamyeon jigeum sanghwangi dallajyeosseul geoyeyo.",
        "en": "If I had listened to his advice then, the situation now would be different.",
        "grammar_audio": "/audio/korean/grammar/s_았었다면_asseossdamyeon_If_it_had_been_20250209_그때_그의_조언을_들었다면_지금_상황이_달라졌을_거예요.mp3"
      },
      {
        "kr": "자기의 실수를 인정했다면 큰 난관에 봉착하지 않았을 텐데.",
        "romaji": "Jagiui silsureul injeonghaessdamyeon keun nangwane bongchak-haji anhasseul tende.",
        "en": "If he had acknowledged his mistake, he wouldn't have ended up facing such a big difficulty.",
        "grammar_audio": "/audio/korean/grammar/s_았었다면_asseossdamyeon_If_it_had_been_20250209_자기의_실수를_인정했다면_큰_난관에_봉착하지_않았을_텐데.mp3"
      },
      {
        "kr": "어제 비가 왔다면 축구 경기가 취소되었을까요?",
        "romaji": "Eoje biga watdamyeon chukgu gyeonggiga chwisodoeeosseulkkayo?",
        "en": "If it had rained yesterday, would the soccer match have been cancelled?",
        "grammar_audio": "/audio/korean/grammar/s_았었다면_asseossdamyeon_If_it_had_been_20250209_어제_비가_왔다면_축구_경기가_취소되었을까요.mp3"
      },
      {
        "kr": "더 빨리 도착했다면 그녀를 만날 수 있었을 텐데.",
        "romaji": "Deo ppalli dochakhaessdamyeon geunyeoreul mannal su isseosseul tende.",
        "en": "If I had arrived earlier, I could've met her.",
        "grammar_audio": "/audio/korean/grammar/s_았었다면_asseossdamyeon_If_it_had_been_20250209_더_빨리_도착했다면_그녀를_만날_수_있었을_텐데.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "75"
  },
  {
    "title": "~으면 좋겠다 [eumyeon joketda] (I hope, it would be good if)",
    "short_explanation": "Expresses a wish or hope for a certain situation or result.",
    "long_explanation": "'~으면 좋겠다 [eumyeon joketda]' is a common structure for stating what the speaker hopes will happen or would be nice if it happened. It often translates to 'I hope...' or 'It would be good if...' in English.",
    "formation": "Verb + (으)면 좋겠다",
    "examples": [
      {
        "kr": "날씨가 좋으면 좋겠다. 그래야 꽃놀이가 더 즐거울 것 같아.",
        "romaji": "Nalssiga joeumyeon joketda. Geuraeya kkotnoliga deo jeulgeoul geot gata.",
        "en": "I hope the weather is good, so that the flower viewing will be more enjoyable.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_joketda_I_hope_it_would_be_good_if_20250209_날씨가_좋으면_좋겠다_그래야_꽃놀이가_더_즐거울_것_같아.mp3"
      },
      {
        "kr": "시험을 잘 보면 좋겠다. 그럼 학기가 끝나면 여행을 갈 수 있을 것 같아.",
        "romaji": "Siheomeul jal bomyeon joketda. Geureom hakgiga kkeutnamyeon yeohaengeul gal su isseul geot gata.",
        "en": "I hope I do well on the exam, so I can take a trip when the semester ends.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_joketda_I_hope_it_would_be_good_if_20250209_시험을_잘_보면_좋겠다_그럼_학기가_끝나면_여행을_갈_수_있을_것_같아.mp3"
      },
      {
        "kr": "아픈 친구가 빨리 나으면 좋겠다. 그럼 같이 놀러 갈 수 있겠지.",
        "romaji": "Apeun chinguga ppalli naeumyeon joketda. Geureom gachi nolreo gal su igetji.",
        "en": "I hope my friend recovers quickly, then we can go out together.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_joketda_I_hope_it_would_be_good_if_20250209_아픈_친구가_빨리_나으면_좋겠다_그럼_같이_놀러_갈_수_있겠지.mp3"
      },
      {
        "kr": "코로나가 끝나면 좋겠다. 그럼 다시 일상으로 돌아갈 수 있을 것 같아.",
        "romaji": "Koronaga kkeutnamyeon joketda. Geureom dasi ilsangeuro doragal su isseul geot gata.",
        "en": "I hope COVID ends soon, so we can return to normal life.",
        "grammar_audio": "/audio/korean/grammar/s_으면_좋겠다_eumyeon_joketda_I_hope_it_would_be_good_if_20250209_코로나가_끝나면_좋겠다_그럼_다시_일상으로_돌아갈_수_있을_것_같아.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~으면서도 [eumyeonseodo] (While, but still)",
    "short_explanation": "Expresses a contradiction: 'while', 'but still', 'even though'.",
    "long_explanation": "'~으면서도 [eumyeonseodo]' is used to link two contrasting facts. It shows that although the first situation is true, there is another fact that runs counter to it, akin to 'even though' or 'but still' in English.",
    "formation": "Verb stem + (으)면서도",
    "examples": [
      {
        "kr": "그는 건강에 좋지 않으면서도 매일 패스트푸드를 먹어요.",
        "romaji": "Geuneun geongange jotji anheumyeonseodo maeil paeseuteu-pudeureul meogoyo.",
        "en": "He keeps eating fast food every day, while knowing it's not good for his health.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_but_still_20250209_그는_건강에_좋지_않으면서도_매일_패스트푸드를_먹어요.mp3"
      },
      {
        "kr": "너무 바쁘면서도 친구들과 시간을 내서 만나곤 해요.",
        "romaji": "Neomu bappeumyeonseodo chingudeulgwa siganeul naeseo mannagon haeyo.",
        "en": "She’s extremely busy, yet she still manages to make time to meet her friends.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_but_still_20250209_너무_바쁘면서도_친구들과_시간을_내서_만나곤_해요.mp3"
      },
      {
        "kr": "아파트 값이 비싸면서도 계속 오르고 있어요.",
        "romaji": "Apateu gabs-i bissamyeonseodo gyesok orago isseoyo.",
        "en": "Apartment prices keep rising even though they're already expensive.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_but_still_20250209_아파트_값이_비싸면서도_계속_오르고_있어요.mp3"
      },
      {
        "kr": "인터넷이 느리면서도 필요한 정보는 얻을 수 있어서 잘 이용하고 있어요.",
        "romaji": "Inteonesi neurimyeonseodo pilyohan jeongboneun eodeul su isseoseo jal iyonghago isseoyo.",
        "en": "Even though the internet is slow, I can still get the information I need, so I keep using it.",
        "grammar_audio": "/audio/korean/grammar/s_으면서도_eumyeonseodo_While_but_still_20250209_인터넷이_느리면서도_필요한_정보는_얻을_수_있어서_잘_이용하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 거예요 [eul/l geoyeyo] (Going to, will)",
    "short_explanation": "Expresses a future plan or intention—similar to 'going to' or 'will' in English.",
    "long_explanation": "'~을/ㄹ 거예요 [eul/l geoyeyo]' is used to indicate that something will happen or that the speaker plans or expects something in the future. It can also express the speaker's assumption about the future. If the verb stem ends in a consonant, use '을 거예요'; if it ends in a vowel, use 'ㄹ 거예요.'",
    "formation": "Verb stem + 을 거예요 (consonant-ending) / ㄹ 거예요 (vowel-ending)",
    "examples": [
      {
        "kr": "저는 이번 주말에 쇼핑을 갈 거예요.",
        "romaji": "Jeoneun ibeon jumale syopingeul gal geoyeyo.",
        "en": "I'm going to go shopping this weekend.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_거예요_eull_geoyeyo_Going_to_will_20250209_저는_이번_주말에_쇼핑을_갈_거예요.mp3"
      },
      {
        "kr": "내일 비가 올 거예요.",
        "romaji": "Naeil biga ol geoyeyo.",
        "en": "It will probably rain tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_거예요_eull_geoyeyo_Going_to_will_20250209_내일_비가_올_거예요.mp3"
      },
      {
        "kr": "엄마는 저녁으로 김치찌개를 만들 거예요.",
        "romaji": "Eommaneun jeonyeogeuro gimchijjigaereul mandeul geoyeyo.",
        "en": "Mom will make kimchi stew for dinner.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_거예요_eull_geoyeyo_Going_to_will_20250209_엄마는_저녁으로_김치찌개를_만들_거예요.mp3"
      },
      {
        "kr": "우리 팀은 다음 대회에서 반드시 이길 거예요.",
        "romaji": "Uri timeun daeum daehwoeseo bandeusi igil geoyeyo.",
        "en": "Our team will definitely win at the next competition.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_거예요_eull_geoyeyo_Going_to_will_20250209_우리_팀은_다음_대회에서_반드시_이길_거예요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ게요 [eul/l geyo] (I will)",
    "short_explanation": "Used to express a future intention, promise, or decision (often more immediate/personal than '~을/ㄹ 거예요').",
    "long_explanation": "'~을/ㄹ게요 [eul/l geyo]' is a verb ending in Korean that conveys the speaker’s **willingness**, **promise**, or **decision** to do something (often in response to the listener or a situation). Compared to '~을/ㄹ 거예요,' which can simply state a future plan, '~을/ㄹ게요' more strongly implies the speaker’s **own resolve** or reaction to the listener. The form '을게요' is used after stems ending in a **consonant**, and 'ㄹ게요' is used after stems ending in a **vowel**.",
    "formation": "Verb stem + 을게요 (after consonant) / ㄹ게요 (after vowel)",
    "examples": [
      {
        "kr": "저는 내일 학교에 가서 친구를 만날게요. 오랜만에 보는 친구라 정말 기대돼요.",
        "romaji": "Jeoneun naeil hakgyoe gaseo chingureul mannalgeyo. Oranmane boneun chingura jeongmal gidadwaeyo.",
        "en": "I will go to school tomorrow and meet my friend. I’m really looking forward to seeing them after so long.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_저는_내일_학교에_가서_친구를_만날게요_오랜만에_보는_친구라_정말_기대돼요.mp3"
      },
      {
        "kr": "매일 밤 10시에 자러 갈게요. 건강을 위해 더 일찍 자야 할 것 같아요.",
        "romaji": "Maeil bam yeolshi-si-e jareo galgeyo. Geongangeul wihae deo iljjik jaya hal geot gatayo.",
        "en": "I’ll go to bed at 10 p.m. every night. I think I need to sleep earlier for my health.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_매일_밤_10시에_자러_갈게요_건강을_위해_더_일찍_자야_할_것_같아요.mp3"
      },
      {
        "kr": "주말에는 운동을 할게요. 운동하면 확실히 몸이 좋아지니까요.",
        "romaji": "Jumalen undongeul halgeyo. Undonghamyeon hwaksilhi momi joajinikayo.",
        "en": "I’ll exercise on the weekend. Working out definitely makes my body healthier.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_주말에는_운동을_할게요_운동하면_확실히_몸이_좋아지니까요.mp3"
      },
      {
        "kr": "내일 밥을 사러 갈게요. 집에 먹을 게 별로 없네요.",
        "romaji": "Naeil babeul sareo galgeyo. Jibe meogeul ge byeollo eopneyo.",
        "en": "I’ll go buy some food tomorrow. There’s hardly anything to eat at home.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_내일_밥을_사러_갈게요_집에_먹을_게_별로_없네요.mp3"
      },
      {
        "kr": "음악에 푹 빠져서 피아노 배울게요. 시간이 좀 걸려도 열심히 해 보려고요.",
        "romaji": "Eumage pook ppajyeoseo piano baeulgeyo. Sigani jom geollyeodo yeolsimhi hae boryeogoyeyo.",
        "en": "I’m really into music, so I’ll learn piano. It might take some time, but I plan to work hard at it.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_음악에_푹_빠져서_피아노_배울게요_시간이_좀_걸려도_열심히_해_보려고요.mp3"
      },
      {
        "kr": "새로운 언어 공부할게요. 시간이 걸리겠지만 꼭 도전해 보고 싶어요.",
        "romaji": "Saeroun eoneo gongbuhalgeyo. Sigani geolligetjiman kkok dojeonhae bogo sipeoyo.",
        "en": "I’ll study a new language. It might take a while, but I really want to try.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_새로운_언어_공부할게요_시간이_걸리겠지만_꼭_도전해_보고_싶어요.mp3"
      },
      {
        "kr": "맛있는 음식을 만들고 싶어서 요리 클래스를 들을게요.",
        "romaji": "Masinneun eumsigeul mandeulgo sip-eoseo yori keullaeseureul deureulgeyo.",
        "en": "I want to make delicious food, so I’ll take a cooking class.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_맛있는_음식을_만들고_싶어서_요리_클래스를_들을게요.mp3"
      },
      {
        "kr": "다음 주 시간 내서 친구들이랑 영화 볼게요.",
        "romaji": "Da-eum ju sigan naeseo chingudeul-irang yeonghwa bolgeyo.",
        "en": "I’ll make time next week to watch a movie with my friends.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ게요_eull_geyo_I_will_20250209_다음_주_시간_내서_친구들이랑_영화_볼게요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ까요? [eul/l kkayo?] (Shall we?)",
    "short_explanation": "Used to suggest or propose an action to do together or to ask for the listener's opinion.",
    "long_explanation": "'~을/ㄹ까요? [eul/l kkayo?]' is a Korean ending used to propose an activity (often including the listener) or to ask for the listener's suggestion. It translates roughly as 'Shall we...?' or 'Should we...?' in English. It is typically used in polite, but not extremely formal, conversations.",
    "formation": "If the verb stem ends in a consonant: Verb stem + 을까요?\nIf the verb stem ends in a vowel: Verb stem + ㄹ까요?",
    "examples": [
      {
        "kr": "함께 저녁을 먹을까요? 맛있는 음식을 파는 식당을 알아요.",
        "romaji": "Hamkke jeonyeogeul meogeulkkayo? Masinneun eumsigeul paneun sikdangeul arayo.",
        "en": "Shall we have dinner together? I know a restaurant that serves delicious food.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ까요_eull_kkayo_Shall_we_20250209_함께_저녁을_먹을까요_맛있는_음식을_파는_식당을_알아요.mp3"
      },
      {
        "kr": "영화를 볼까요? 오늘 좋은 영화가 상영 중이래요.",
        "romaji": "Yeonghwareul bolkkayo? Oneul joheun yeonghwaga sangyeong jungiraeyo.",
        "en": "Shall we watch a movie? A good one is showing today.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ까요_eull_kkayo_Shall_we_20250209_영화를_볼까요_오늘_좋은_영화가_상영_중이래요.mp3"
      },
      {
        "kr": "주말에 여행을 갈까요? 분위기 전환이 필요해 보이는데요.",
        "romaji": "Jumale yeohaengeul galkkayo? Bunwigi jeonhwani piryohae boineundeyo.",
        "en": "Shall we go on a trip this weekend? It seems we need a change of scene.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ까요_eull_kkayo_Shall_we_20250209_주말에_여행을_갈까요_분위기_전환이_필요해_보이는데요.mp3"
      },
      {
        "kr": "우리 산책할까요? 날씨가 정말 좋아 보이네요.",
        "romaji": "Uri sanchaekhalkkayo? Nalssiga jeongmal joa boineyo.",
        "en": "Shall we go for a walk? The weather looks really nice.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ까요_eull_kkayo_Shall_we_20250209_우리_산책할까요_날씨가_정말_좋아_보이네요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 때 [eul/l ttae] (When)",
    "short_explanation": "Used to indicate the point in time or occasion when something occurs.",
    "long_explanation": "'~을/ㄹ 때 [eul/l ttae]' means 'when' in English. You attach it to a verb stem to specify the time or context in which an action happens. '을 때' is used after a consonant-ending stem; 'ㄹ 때' after a vowel-ending stem.",
    "formation": "Verb stem + 을 때 (if ending in consonant) / Verb stem + ㄹ 때 (if ending in vowel)",
    "examples": [
      {
        "kr": "책을 읽을 때는 조용한 곳에서 읽는 게 좋아요.",
        "romaji": "Chaekeul ilgeul ttaeneun joyonghan gos-eseo ilgneun ge johayo.",
        "en": "When reading a book, I prefer a quiet place.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_때_eull_ttae_When_20250209_책을_읽을_때는_조용한_곳에서_읽는_게_좋아요.mp3"
      },
      {
        "kr": "친구를 만날 때 항상 많이 웃어요.",
        "romaji": "Chingureul mannal ttae hangsang manhi useoyo.",
        "en": "I always laugh a lot when I meet my friend.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_때_eull_ttae_When_20250209_친구를_만날_때_항상_많이_웃어요.mp3"
      },
      {
        "kr": "시험 볼 때 늘 긴장돼요.",
        "romaji": "Siheom bol ttae neul ginjangdwaeyo.",
        "en": "I always get nervous when I take a test.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_때_eull_ttae_When_20250209_시험_볼_때_늘_긴장돼요.mp3"
      },
      {
        "kr": "비가 올 때는 우산을 꼭 챙기세요.",
        "romaji": "Biga ol ttaeneun usaneul kkok chaenggiseyo.",
        "en": "Take an umbrella when it rains.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_때_eull_ttae_When_20250209_비가_올_때는_우산을_꼭_챙기세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 듯하다 [eul/l deuthada] (Seems like)",
    "short_explanation": "Used to express the idea that something appears or feels like something else, or that one is guessing based on observation.",
    "long_explanation": "'~을/ㄹ 듯하다 [eul/l deuthada]' is used to convey that something seems or feels a certain way, based on the speaker’s inference or impression. It's similar to 'it seems that...' or 'it looks like...' in English.",
    "formation": "Action/Descriptive verb stem + 을/ㄹ 듯하다",
    "examples": [
      {
        "kr": "그는 변한 것 같아 보이지만, 사실 옛날 그대로인 듯해요.",
        "romaji": "Geuneun byeonhan geot gata boijiman, sashil yetnal geudaeroin deuthaeyo.",
        "en": "He seems to have changed, but in fact, he appears just the same as before.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_듯하다_eull_deuthada_Seems_like_20250209_그는_변한_것_같아_보이지만_사실_옛날_그대로인_듯해요.mp3"
      },
      {
        "kr": "오늘은 겨울인 것처럼 춥네요. 가을이라고 해도 겨울 같은 느낌이 드는 듯해요.",
        "romaji": "Oneureun gyeoulin geotcheoreom chumneyo. Gaeurirago haedo gyeoul gateun neukkimi deuneun deuthaeyo.",
        "en": "It's cold today like winter. Even though it's autumn, it feels like winter.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_듯하다_eull_deuthada_Seems_like_20250209_오늘은_겨울인_것처럼_춥네요_가을이라고_해도_겨울_같은_느낌이_드는_듯해요.mp3"
      },
      {
        "kr": "그의 표정을 보니 깊은 생각에 잠긴 듯해요.",
        "romaji": "Geuui pyojeongeul boni gip-eun saenggage jamgin deuthaeyo.",
        "en": "Judging by his expression, it seems he’s deep in thought.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_듯하다_eull_deuthada_Seems_like_20250209_그의_표정을_보니_깊은_생각에_잠긴_듯해요.mp3"
      },
      {
        "kr": "그녀는 웃을 것처럼 보였지만, 뭔가 고민이 있는 듯했어요.",
        "romaji": "Geunyeoneun useul geotcheoreom boyeotjiman, mwonga gomini inneun deuthaesseoyo.",
        "en": "She looked like she was about to smile, but it seemed like something was on her mind.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_듯하다_eull_deuthada_Seems_like_20250209_그녀는_웃을_것처럼_보였지만_뭔가_고민이_있는_듯했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 만하다 [eul/l manhada] (Worth doing)",
    "short_explanation": "Expresses that something is worthwhile or justifiable to do or experience.",
    "long_explanation": "'~을/ㄹ 만하다' is used to say that a certain action or experience is valuable enough to be done, or 'worth it.' It implies the speaker's judgment that the effort, cost, or time involved is justified.",
    "formation": "Verb stem + 을/ㄹ 만하다",
    "examples": [
      {
        "kr": "이 케이크는 비싸지만 맛있어서 사 먹을 만해요.",
        "romaji": "I keikeuneun bissajiman masisseoseo sa meogeul manhaeyo.",
        "en": "This cake is expensive, but it's so delicious that it's worth buying.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_만하다_eull_manhada_Worth_doing_20250209_이_케이크는_비싸지만_맛있어서_사_먹을_만해요.mp3"
      },
      {
        "kr": "이 영화는 상영 시간이 길지만 정말 재미있어서 볼 만해요.",
        "romaji": "I yeonghwaneun sangyeong sigani giljiman jeongmal jaemiisseoseo bol manhaeyo.",
        "en": "This movie has a long running time, but it's really fun, so it's worth watching.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_만하다_eull_manhada_Worth_doing_20250209_이_영화는_상영_시간이_길지만_정말_재미있어서_볼_만해요.mp3"
      },
      {
        "kr": "그 밴드 공연 티켓은 비싸지만 그들의 음악은 꼭 들어볼 만해요.",
        "romaji": "Geu baendeu gongyeon tikeseun bissajiman geudeurui eumageun kkok deureobol manhaeyo.",
        "en": "The band’s concert tickets are expensive, but their music is definitely worth hearing.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_만하다_eull_manhada_Worth_doing_20250209_그_밴드_공연_티켓은_비싸지만_그들의_음악은_꼭_들어볼_만해요.mp3"
      },
      {
        "kr": "이 게임은 설치하는 데 오래 걸려도 해볼 만해요.",
        "romaji": "I geimeun seolchihaneun de orae geollyeodo haebol manhaeyo.",
        "en": "Even though this game takes a long time to install, it's worth trying.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_만하다_eull_manhada_Worth_doing_20250209_이_게임은_설치하는_데_오래_걸려도_해볼_만해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 수록 [eul/l surok] (The more...)",
    "short_explanation": "Shows that as one condition increases or continues, another condition also changes proportionally.",
    "long_explanation": "'~을/ㄹ 수록 [eul/l surok]' is used to express the idea that the more the first action or state intensifies, the more the second action or state does too. It corresponds to 'the more... the more...' in English.",
    "formation": "Verb stem + 을/ㄹ 수록",
    "examples": [
      {
        "kr": "한국어를 많이 공부할수록 한국 문화를 더 잘 이해하게 돼요.",
        "romaji": "Hangukeoreul manhi gongbuhalsurok hanguk munhwareul deo jal ihaehage dwaeyo.",
        "en": "The more you study Korean, the better you understand Korean culture.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_수록_eull_surok_The_more_20250209_한국어를_많이_공부할수록_한국_문화를_더_잘_이해하게_돼요.mp3"
      },
      {
        "kr": "여기에 오래 있을수록 이 도시가 점점 더 좋아져요.",
        "romaji": "Yeogie orae isseulsurok i dosiga jeomjeom deo joajyeoyo.",
        "en": "The longer I stay here, the more I like this city.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_수록_eull_surok_The_more_20250209_여기에_오래_있을수록_이_도시가_점점_더_좋아져요.mp3"
      },
      {
        "kr": "매일 걸을수록 건강이 좋아져요.",
        "romaji": "Maeil georeulsurok geongangi joajyeoyo.",
        "en": "The more I walk every day, the healthier I become.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_수록_eull_surok_The_more_20250209_매일_걸을수록_건강이_좋아져요.mp3"
      },
      {
        "kr": "커피를 많이 마실수록 잠이 덜 오는 것 같아요.",
        "romaji": "Keopireul manhi masilsurok jami deol oneun geot gatayo.",
        "en": "The more coffee I drink, the less sleepy I feel.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_수록_eull_surok_The_more_20250209_커피를_많이_마실수록_잠이_덜_오는_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ 줄 알다 [eul/l jul alda] (Know how to)",
    "short_explanation": "Used to indicate that someone knows how to perform an action or is aware of a fact.",
    "long_explanation": "'~을/ㄹ 줄 알다 [eul/l jul alda]' often translates to 'know how to do something' or 'know that...' in English. It indicates knowledge, skill, or awareness of a particular action or fact.",
    "formation": "Verb in dictionary form + 을/ㄹ 줄 알다",
    "examples": [
      {
        "kr": "저는 한글을 읽을 줄 알아서 한국 드라마를 자막 없이 볼 수 있어요.",
        "romaji": "Jeoneun hangeureul ilgeul jul araseo hanguk deuramareul jamak eopsi bol su isseoyo.",
        "en": "I know how to read Hangul, so I can watch Korean dramas without subtitles.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_줄_알다_eull_jul_alda_Know_how_to_20250209_저는_한글을_읽을_줄_알아서_한국_드라마를_자막_없이_볼_수_있어요.mp3"
      },
      {
        "kr": "아빠가 요리를 잘할 줄 알았는데 어제 저녁 준비할 때 많은 문제가 생겼어요.",
        "romaji": "Appaga yorireul jalhal jul aratneunde eoje jeonyeok junbihal ttae manheun munjega saenggyeosseoyo.",
        "en": "I thought Dad knew how to cook well, but there were many problems when he made dinner last night.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_줄_알다_eull_jul_alda_Know_how_to_20250209_아빠가_요리를_잘할_줄_알았는데_어제_저녁_준비할_때_많은_문제가_생겼어요.mp3"
      },
      {
        "kr": "저는 그녀가 한국인인 줄 알고 한국어로 말했어요.",
        "romaji": "Jeoneun geunyeoga hangugin-in jul algo hangugeoro malhaesseoyo.",
        "en": "I knew she was Korean, so I spoke to her in Korean.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_줄_알다_eull_jul_alda_Know_how_to_20250209_저는_그녀가_한국인인_줄_알고_한국어로_말했어요.mp3"
      },
      {
        "kr": "우리 강아지는 명령을 따를 줄 알아서 아주 잘 훈련되어 있어요.",
        "romaji": "Uri gangajineun myeongnyeongeul ttareul jul araseo aju jal hunryeondoeeo isseoyo.",
        "en": "Our puppy knows how to follow commands, so it's well trained.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ_줄_알다_eull_jul_alda_Know_how_to_20250209_우리_강아지는_명령을_따를_줄_알아서_아주_잘_훈련되어_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ지 [eul/lji] (Whether or not)",
    "short_explanation": "Used to express uncertainty or doubt: 'whether or not'.",
    "long_explanation": "'~을/ㄹ지 [eul/lji]' indicates the speaker is unsure about an event or outcome, similar to 'whether' or 'whether or not' in English. It often appears in indirect questions or conditional statements involving doubt or possibility.",
    "formation": "Verb stem + 을/ㄹ지",
    "examples": [
      {
        "kr": "아빠가 오늘 저녁에 집에 올지 모르겠어요.",
        "romaji": "Appaga oneul jeonyeoge jibe olji moreugesseoyo.",
        "en": "I’m not sure whether Dad will come home tonight.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_eullji_Whether_or_not_20250209_아빠가_오늘_저녁에_집에_올지_모르겠어요.mp3"
      },
      {
        "kr": "그녀가 내일 파티에 올지 안 올지 궁금해요.",
        "romaji": "Geunyeoga naeil patie olji an olji gunggeumhaeyo.",
        "en": "I’m curious whether she’ll come to the party tomorrow or not.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_eullji_Whether_or_not_20250209_그녀가_내일_파티에_올지_안_올지_궁금해요.mp3"
      },
      {
        "kr": "날이 따뜻해질지 아직 확신이 없어요.",
        "romaji": "Nari ttatteuthaejilji ajik hwaksini eopseoyo.",
        "en": "I’m not sure yet whether it’ll get warmer.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_eullji_Whether_or_not_20250209_날이_따뜻해질지_아직_확신이_없어요.mp3"
      },
      {
        "kr": "당신이 제안을 받아들일지 안 받아들일지 알 수 없어요.",
        "romaji": "Dangsini jean-eul badadeurilji an badadeurilji al su eopseoyo.",
        "en": "I don’t know whether you will accept the proposal or not.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_eullji_Whether_or_not_20250209_당신이_제안을_받아들일지_안_받아들일지_알_수_없어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ지도 모르다 [eul/ljido moreuda] (Might)",
    "short_explanation": "This is used to express uncertainty or possibility.",
    "long_explanation": "'~을/ㄹ지도 모르다 [eul/ljido moreuda]', or simply 'might' in English, is a grammar pattern used to represent the speaker's uncertainty or to express the possibility of a future event or condition. Depending on context, it can imply that something might or might not happen. The verb is conjugated according to the level of formality and respect required.",
    "formation": "(Verb stem + 을/ㄹ지도 모르다)",
    "examples": [
      {
        "kr": "내일 비가 올지도 모르니까 우산을 가져가세요.",
        "romaji": "Naeil biga oljido moreunikka usaneul gajyeogaseyo.",
        "en": "It might rain tomorrow, so take an umbrella.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지도_모르다_eulljido_moreuda_Might_20250209_내일_비가_올지도_모르니까_우산을_가져가세요.mp3"
      },
      {
        "kr": "그는 다음 회의에 참석할지도 모릅니다.",
        "romaji": "Geuneun daeum hoeuie chamseokhaljido moreumnida.",
        "en": "He might attend the next meeting.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지도_모르다_eulljido_moreuda_Might_20250209_그는_다음_회의에_참석할지도_모릅니다.mp3"
      },
      {
        "kr": "저는 아마 내년에 한국으로 이사할지도 몰라요.",
        "romaji": "Jeoneun ama naenyeon-e hangug-euro isahaljido mollayo.",
        "en": "I might move to Korea next year.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지도_모르다_eulljido_moreuda_Might_20250209_저는_아마_내년에_한국으로_이사할지도_몰라요.mp3"
      },
      {
        "kr": "그녀가 그 소식을 알고 있을지도 모르죠.",
        "romaji": "Geunyeoga geu sosigeul algo isseuljido moreujyo.",
        "en": "She might know that news.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지도_모르다_eulljido_moreuda_Might_20250209_그녀가_그_소식을_알고_있을지도_모르죠.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ지라도 [eul/ljirado] (Even if)",
    "short_explanation": "Used to say 'even if'; 'no matter how/if'; nonetheless.",
    "long_explanation": "'~을/ㄹ지라도 [eul/ljirado]' is a conditional form used in Korean to express the meaning of 'even if', 'no matter how', or 'nonetheless'. It indicates that the expected result will remain unchanged regardless of the given condition.",
    "formation": "Verb stem + 을/ㄹ지라도",
    "examples": [
      {
        "kr": "문제가 어렵지라도 포기하지 않고 계속 풀어볼게요.",
        "romaji": "Munjega eoryeobjirado pogihaji anhgo gyesok pulleobolgeyo.",
        "en": "Even if the problem is difficult, I won't give up and I'll keep trying to solve it.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지라도_eulljirado_Even_if_20250209_문제가_어렵지라도_포기하지_않고_계속_풀어볼게요.mp3"
      },
      {
        "kr": "비가 오지라도 갈 생각이에요, 제가 중요한 미팅이 있어요.",
        "romaji": "Biga ojirado gal saenggakieyo, jaega jungyohan mitingi isseoyo.",
        "en": "Even if it's raining, I'm planning to go because I have an important meeting.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지라도_eulljirado_Even_if_20250209_비가_오지라도_갈_생각이에요_제가_중요한_미팅이_있어요.mp3"
      },
      {
        "kr": "버스가 빨리 오지라도, 무리해서 뛰지 않을 거예요.",
        "romaji": "Beoseuga pparei ojirado, murihaseo ttwiji aneul geoyeyo.",
        "en": "Even if the bus comes quickly, I won't run excessively.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지라도_eulljirado_Even_if_20250209_버스가_빨리_오지라도_무리해서_뛰지_않을_거예요.mp3"
      },
      {
        "kr": "비용이 많이 들지라도 좋은 품질의 제품을 만들고 싶어요.",
        "romaji": "Biyongi manhi deuljirado joheun pumjilui jepumeul mandeulgo sippeoyo.",
        "en": "Even if it costs a lot, I want to make a product of good quality.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지라도_eulljirado_Even_if_20250209_비용이_많이_들지라도_좋은_품질의_제품을_만들고_싶어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을/ㄹ지 몰라 [eul/lji molla] (Maybe)",
    "short_explanation": "Used to express uncertainty or doubt; 'maybe', 'might', 'I don't know if'.",
    "long_explanation": "'~을/ㄹ지 몰라 [eul/lji molla]' is a grammar form used to indicate doubts, uncertainties, or suppositions. It can be translated as 'maybe', 'might', or 'I don’t know if' in English. This form is typically used when the speaker is unsure of something or wishes to present a speculative premise.",
    "formation": "Verb/Adjective + 을/ㄹ지 몰라",
    "examples": [
      {
        "kr": "그녀가 내일 학교에 올지 몰라, 요즘 아프다니까.",
        "romaji": "Geunyeoga naeil haggyoe olji molla, yojeum apeudanikka.",
        "en": "Maybe she will come to school tomorrow; she said she's been sick lately.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_몰라_eullji_molla_Maybe_20250209_그녀가_내일_학교에_올지_몰라_요즘_아프다니까.mp3"
      },
      {
        "kr": "이 물건을 사려고 했는데, 아직 돈이 충분할지 몰라요.",
        "romaji": "I mulgeoneul saryeogo haetneunde, ajik doni chungbunhalji mollayo.",
        "en": "I was planning to buy this item, but I don't know if I have enough money.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_몰라_eullji_molla_Maybe_20250209_이_물건을_사려고_했는데_아직_돈이_충분할지_몰라요.mp3"
      },
      {
        "kr": "내일 비가 올지 몰라서 우산을 준비해야겠어요.",
        "romaji": "Naeil biga olji mollaseo usaneul junbihaeyagesseoyo.",
        "en": "I should prepare an umbrella because it might rain tomorrow.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_몰라_eullji_molla_Maybe_20250209_내일_비가_올지_몰라서_우산을_준비해야겠어요.mp3"
      },
      {
        "kr": "어떤 옷을 입을지 몰라서 세 가지를 준비했어요.",
        "romaji": "Eoddeon oseul ibeulji mollaseo se gajireul junbihaesseoyo.",
        "en": "I prepared three different options because I'm not sure which clothes to wear.",
        "grammar_audio": "/audio/korean/grammar/s_을ㄹ지_몰라_eullji_molla_Maybe_20250209_어떤_옷을_입을지_몰라서_세_가지를_준비했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을래요 [eullaeyo] (Want to)",
    "short_explanation": "Used to express the speaker's desire or intention to do something.",
    "long_explanation": "'~을래요 [eullaeyo]' is a verb ending used in Korean to express an intention, suggestion, or polite proposal from the speaker's perspective. It denotes that the speaker wants or would like to do something and is often used when making plans or suggestions. Note that it is typically used for the speaker’s own actions.",
    "formation": "Verb Stem + 을래요",
    "examples": [
      {
        "kr": "저는 오늘 집에서 영화를 볼래요, 밖으로 나가기는 너무 추워요.",
        "romaji": "Jeoneun oneul jibeseo yeonghwareul bollae, bakkeuro nagagineun neomu chuwoyo.",
        "en": "I want to watch a movie at home today because it's too cold to go out.",
        "grammar_audio": "/audio/korean/grammar/s_을래요_eullaeyo_Want_to_20250209_저는_오늘_집에서_영화를_볼래요_밖으로_나가기는_너무_추워요.mp3"
      },
      {
        "kr": "우리 이번 주말에 캠핑장에 가서 텐트를 칠래요, 어떻게 생각해요?",
        "romaji": "Uri ibeon jumal-e keampingjang-e gaseo tent-eul chillae, eotteoke saengkaekhae?",
        "en": "How about we go to the campground this weekend and pitch a tent?",
        "grammar_audio": "/audio/korean/grammar/s_을래요_eullaeyo_Want_to_20250209_우리_이번_주말에_캠핑장에_가서_텐트를_칠래요_어떻게_생각해요.mp3"
      },
      {
        "kr": "나는 저녁으로 한 끼만 먹을래요, 이미 배가 불러서 더 먹지 않을래요.",
        "romaji": "Naneun jeonyeoge han kkiman meogeullae, imi baega bulleoseo deo meokji anheullae.",
        "en": "I want to have just one meal for dinner because I'm already full and don't want to eat more.",
        "grammar_audio": "/audio/korean/grammar/s_을래요_eullaeyo_Want_to_20250209_나는_저녁으로_한_끼만_먹을래요_이미_배가_불러서_더_먹지_않을래요.mp3"
      },
      {
        "kr": "나는 이번 주말에 연극 보러 갈래요, 한국 문화를 좋아해서 결심했어요.",
        "romaji": "Naneun ibeon jumal-e yeongeuk boreo gallae, hanguk munhwareul joahaseo gyeolsimhaesseoyo.",
        "en": "I've decided to go see a play this weekend because I like Korean culture.",
        "grammar_audio": "/audio/korean/grammar/s_을래요_eullaeyo_Want_to_20250209_나는_이번_주말에_연극_보러_갈래요_한국_문화를_좋아해서_결심했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을 리가 없다 [eulliga eopda] (It's unlikely that)",
    "short_explanation": "This expression is used to indicate that a certain situation is unlikely or impossible to happen.",
    "long_explanation": "'~을 리가 없다 [eulliga eopda]' is a speculative expression used in Korean to indicate that something is improbable or implausible based on the speaker's judgment. It expresses disbelief or doubt about the possibility of an event occurring and is often used to contrast a hypothetical situation with reality.",
    "formation": "Verb + ~을 리가 없다",
    "examples": [
      {
        "kr": "이것이 사실일 리가 없어요, 그가 그런 일을 저지를 사람이 아니에요.",
        "romaji": "Igeosi sasilliga eobs-eoyo, geuga geuleon il-eul jeojileul salam-i ani-eyo.",
        "en": "It's unlikely that this is true; he's not the type of person to do such a thing.",
        "grammar_audio": "/audio/korean/grammar/s_을_리가_없다_eulliga_eopda_Its_unlikely_that_20250209_이것이_사실일_리가_없어요_그가_그런_일을_저지를_사람이_아니에요.mp3"
      },
      {
        "kr": "그녀가 날 잊어버릴 리가 없어요, 우리 너무 오래 같이 지냈거든요.",
        "romaji": "Geunyeoga nal ijeobeoriliga eobs-eoyo, uli neomu olae gati jinaessgeodeunyo.",
        "en": "It's unlikely that she would forget me; we've been together for so long.",
        "grammar_audio": "/audio/korean/grammar/s_을_리가_없다_eulliga_eopda_Its_unlikely_that_20250209_그녀가_날_잊어버릴_리가_없어요_우리_너무_오래_같이_지냈거든요.mp3"
      },
      {
        "kr": "저는 이 계약서를 사인할 리가 없어요, 제가 아직 조건들을 모두 이해하지 못했어요.",
        "romaji": "Jeoneun i gyeagseoreul sainhal liga eobseoyo, jega ajik jogeondeul-eul modu ihaehaji moshaesseoyo.",
        "en": "It's unlikely that I will sign this contract because I still do not fully understand the terms.",
        "grammar_audio": "/audio/korean/grammar/s_을_리가_없다_eulliga_eopda_Its_unlikely_that_20250209_저는_이_계약서를_사인할_리가_없어요_제가_아직_조건들을_모두_이해하지_못했어요.mp3"
      },
      {
        "kr": "그가 오늘 올 리가 없어요, 그거 알고 있어요, 그가 아픈 걸.",
        "romaji": "Geuga oneul ol riga eopseoyo, geugeo algo isseoyo, geuga apeun geol.",
        "en": "It's unlikely that he will come today; everyone knows that he's sick.",
        "grammar_audio": "/audio/korean/grammar/s_을_리가_없다_eulliga_eopda_Its_unlikely_that_20250209_그가_오늘_올_리가_없어요_그거_알고_있어요_그가_아픈_걸.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을수록 [eulsurok] (The more)",
    "short_explanation": "Used to express 'the more...the more', indicating an increasing degree or intensity.",
    "long_explanation": "The grammar point '~을수록 [eulsurok]' is used in Korean to indicate that as one condition intensifies, another condition increases proportionately. It is equivalent to the English phrase 'the more...the more', showing a direct proportional relationship between two events or states.",
    "formation": "Verb-을수록 / Adjective-을수록",
    "examples": [
      {
        "kr": "한국어를 공부할수록, 한국 문화에 대해 더 많이 이해할 수 있어요.",
        "romaji": "Hanguk-eoreul gongbu halsurok, hanguk munhwa-e daehae deo mani ihaehal su isseoyo.",
        "en": "The more I study Korean, the more I can understand Korean culture.",
        "grammar_audio": "/audio/korean/grammar/s_을수록_eulsurok_The_more_20250209_한국어를_공부할수록_한국_문화에_대해_더_많이_이해할_수_있어요.mp3"
      },
      {
        "kr": "이 노래를 많이 들을수록, 더 좋아지는 것 같아요.",
        "romaji": "I noraereul mani deureulsurok, deo joajineun geot gatayo.",
        "en": "The more I listen to this song, the more I seem to like it.",
        "grammar_audio": "/audio/korean/grammar/s_을수록_eulsurok_The_more_20250209_이_노래를_많이_들을수록_더_좋아지는_것_같아요.mp3"
      },
      {
        "kr": "날이 점점 더워질수록, 아이스크림이 더 많이 팔려요.",
        "romaji": "Nal-i jeomjeom deoweojilsurok, aiseukeurimi deo manhi pallyeoyo.",
        "en": "The hotter the day gets, the more ice cream is sold.",
        "grammar_audio": "/audio/korean/grammar/s_을수록_eulsurok_The_more_20250209_날이_점점_더워질수록_아이스크림이_더_많이_팔려요.mp3"
      },
      {
        "kr": "사람들이 친환경 제품을 사용할수록, 환경보호에 더 많은 기여를 할 수 있습니다.",
        "romaji": "Saramdeuri chinhwangyeong jepumeul sayonghalsurok, hwangyeong bohoe deo manheun giyeoreul hal su itsseumnida.",
        "en": "The more people use eco-friendly products, the more they can contribute to environmental protection.",
        "grammar_audio": "/audio/korean/grammar/s_을수록_eulsurok_The_more_20250209_사람들이_친환경_제품을_사용할수록_환경보호에_더_많은_기여를_할_수_있습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~을지언정 [euljieonjeong] (Even though)",
    "short_explanation": "This phrase is used to indicate 'even though' or 'despite'.",
    "long_explanation": "'~을지언정 [euljieonjeong]' is a conjunction in Korean that conveys the meaning of 'even though', 'even if', or 'despite'. It is used to present a contrasting situation or fact that exists despite the previous condition. While more common in formal or written language, it is also useful in everyday contexts and for tests like TOPIK.",
    "formation": "Verb + 을지언정",
    "examples": [
      {
        "kr": "그것이 그에게 굉장히 중요한 일일지언정, 그는 결코 그것에 손을 대지 않았다.",
        "romaji": "Geugeosi geuege goengjanghi jungyohan iriljieonjeong, geuneun gyeolko geugeos-e son-eul daeji anh-assda.",
        "en": "Even though that was very important to him, he never laid a hand on it.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Even_though_20250209_그것이_그에게_굉장히_중요한_일일지언정_그는_결코_그것에_손을_대지_않았다.mp3"
      },
      {
        "kr": "그가 부자일지언정, 평소에 아주 절약하는 습관이 있다.",
        "romaji": "Geuga bujailjieonjeong, pyeongso-e aju jeolyaghamyeon seubgwan-i issda.",
        "en": "Even though he is rich, he has a habit of being very thrifty.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Even_though_20250209_그가_부자일지언정_평소에_아주_절약하는_습관이_있다.mp3"
      },
      {
        "kr": "시험이 어려울지언정, 학생들은 열심히 공부했어요.",
        "romaji": "Siheom-i eoryeouljieonjeong, haksaengdeureun yeolshimhi gongbuhaesseoyo.",
        "en": "Even though the exam was difficult, the students studied hard.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Even_though_20250209_시험이_어려울지언정_학생들은_열심히_공부했어요.mp3"
      },
      {
        "kr": "그 공원이 아름다울지언정, 저녁에는 위험이 많으니 조심하세요.",
        "romaji": "Geu gong-woni aleumdauljieonjeong, jeonyeogeneun wihemi manh-euni joshimhaseyo.",
        "en": "Even though that park is beautiful, it becomes dangerous in the evening, so be careful.",
        "grammar_audio": "/audio/korean/grammar/s_을지언정_euljieonjeong_Even_though_20250209_그_공원이_아름다울지언정_저녁에는_위험이_많으니_조심하세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이나 [ina] (Or, whether)",
    "short_explanation": "Used to indicate choice or alternatives, typically attached to nouns.",
    "long_explanation": "'~이나 [ina]' is a particle in Korean attached to nouns to indicate alternatives or choices. It functions similarly to 'or' in English and is used to present different options or possibilities. The proper formation is with a noun followed by (이)나.",
    "formation": "Noun + (이)나",
    "examples": [
      {
        "kr": "사과나 오렌지, 그 중 하나만 골라주세요.",
        "romaji": "Sagwana orenji, geu jung hanaman gollajuseyo.",
        "en": "Please choose either an apple or an orange.",
        "grammar_audio": "/audio/korean/grammar/s_이나_ina_Or_whether_20250209_사과나_오렌지_그_중_하나만_골라주세요.mp3"
      },
      {
        "kr": "영화나 드라마를 볼까요?",
        "romaji": "Yeonghwa na deuramareul bolkkayo?",
        "en": "Shall we watch a movie or a drama?",
        "grammar_audio": "/audio/korean/grammar/s_이나_ina_Or_whether_20250209_영화나_드라마를_볼까요.mp3"
      },
      {
        "kr": "버스나 택시를 타세요.",
        "romaji": "Beoseu na taegsi-reul taseyo.",
        "en": "Take either a bus or a taxi.",
        "grammar_audio": "/audio/korean/grammar/s_이나_ina_Or_whether_20250209_버스나_택시를_타세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이든 [ideun] (Either or)",
    "short_explanation": "Used to present two or more choices; 'either', 'or'.",
    "long_explanation": "'~이든 [ideun]' is a connecting ending used in Korean to present two or more alternatives or choices. It is analogous to 'either' or 'or' in English and is commonly used when the speaker considers all options equally acceptable.",
    "formation": "(Noun/Adjective/Verb) + 이든",
    "examples": [
      {
        "kr": "피자든 파스타든 무엇을 먹어도 좋아요, 둘 다 맛있으니까요.",
        "romaji": "Pijadeun pasteudeun mueoseul meogeodo joayo, dul da masisseunikka yo.",
        "en": "Whether it's pizza or pasta, either is fine because both are delicious.",
        "grammar_audio": "/audio/korean/grammar/s_이든_ideun_Either_or_20250209_피자든_파스타든_무엇을_먹어도_좋아요_둘_다_맛있으니까요.mp3"
      },
      {
        "kr": "운동이든 요가든 모든 활동이 건강에 좋아요.",
        "romaji": "Undongideun yogadeun modeun hwaldongi geongang-e joayo.",
        "en": "Whether it’s exercise or yoga, all activities are good for your health.",
        "grammar_audio": "/audio/korean/grammar/s_이든_ideun_Either_or_20250209_운동이든_요가든_모든_활동이_건강에_좋아요.mp3"
      },
      {
        "kr": "친구들하고 영화보기이든, 책을 읽는 것이든 저는 행복해요.",
        "romaji": "Chingudeulhago yeonghwabogideun, chaeg-eul ilgneun geosideun jeoneun haengbokhaeyo.",
        "en": "Whether it's watching movies with friends or reading a book, I am happy.",
        "grammar_audio": "/audio/korean/grammar/s_이든_ideun_Either_or_20250209_친구들하고_영화보기이든_책을_읽는_것이든_저는_행복해요.mp3"
      },
      {
        "kr": "떡볶이이든, 부대찌개든 저는 둘 다 좋아하는 음식입니다.",
        "romaji": "Tteokbokkiideun, budaejjigaedeun jeoneun dul da joahaneun eumsigibnida.",
        "en": "Whether it's tteokbokki or budae jjigae, I like both foods.",
        "grammar_audio": "/audio/korean/grammar/s_이든_ideun_Either_or_20250209_떡볶이이든_부대찌개든_저는_둘_다_좋아하는_음식입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이라도 [irado] (At least, even if)",
    "short_explanation": "Used to express 'at least' or 'even if'; refers to a minimum or lesser expectation.",
    "long_explanation": "The '~이라도 [irado]' grammar point is used in Korean to express a minimum expectation or to settle for a lesser alternative when the preferred option isn’t available. It conveys the idea of conceding to a less ideal scenario and is often used when faced with challenges or limited choices.",
    "formation": "Noun + 이라도",
    "examples": [
      {
        "kr": "이 작은 선물이라도 받아주세요. 저는 더 좋은 선물을 줄 수 없어요.",
        "romaji": "I jageun seonmurirado badajuseyo. Jeoneun deo joheun seonmureul jul su eobseoyo.",
        "en": "Please accept this small gift at least. I can’t give a better gift.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_even_if_20250209_이_작은_선물이라도_받아주세요_저는_더_좋은_선물을_줄_수_없어요.mp3"
      },
      {
        "kr": "미안하다고 말이라도 해 줬으면 좋겠어요.",
        "romaji": "Mianhadago marirado hae jwosseumyeon johgesseoyo.",
        "en": "I wish you would at least say you’re sorry.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_even_if_20250209_미안하다고_말이라도_해_줬으면_좋겠어요.mp3"
      },
      {
        "kr": "비록 그녀가 나를 싫어한다고 해도, 친구로서라도 계속 만나고 싶어요.",
        "romaji": "Birok geunyeoga nareul sirheohanda고 haedo, chinguroseorado gyesok mannago sippeoyo.",
        "en": "Even if she dislikes me, I want to keep seeing her, at least as friends.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_even_if_20250209_비록_그녀가_나를_싫어한다고_해도_친구로서라도_계속_만나고_싶어요.mp3"
      },
      {
        "kr": "신발은 원하는 색깔이 없으니까, 흰색이라도 사겠어요.",
        "romaji": "Sinbal-eun wonhaneun saekkkal-i eobseunikka, huinsaekirado sa gesseoyo.",
        "en": "Since the shoes don’t come in the color I want, I’ll buy the white ones at least.",
        "grammar_audio": "/audio/korean/grammar/s_이라도_irado_At_least_even_if_20250209_신발은_원하는_색깔이_없으니까_흰색이라도_사겠어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이라는 것 [iraneun geot] (The thing called)",
    "short_explanation": "This phrase is used to refer to or define something that was mentioned earlier.",
    "long_explanation": "'~이라는 것 [iraneun geot]' is a sentence structure used in Korean to refer to or define a particular thing or idea. It is often used in explanations to elaborate on a concept or to highlight specific characteristics.",
    "formation": "Noun + 이라는 것 + Sentence",
    "examples": [
      {
        "kr": "사랑이라는 것이 어떤 것인지, 많은 사람들이 꼭 알고 싶어 하는 것 같아요.",
        "romaji": "Sarangiraneun geosi eotteon geotinji, maneun saramdeul-i kkok algo sip-eo haneun geot gatayo.",
        "en": "It seems like many people really want to know what this thing called love is.",
        "grammar_audio": "/audio/korean/grammar/s_이라는_것_iraneun_geot_The_thing_called_20250209_사랑이라는_것이_어떤_것인지_많은_사람들이_꼭_알고_싶어_하는_것_같아요.mp3"
      },
      {
        "kr": "성공이라는 것은 많은 노력과 헌신 없이는 이루어질 수 없는 것입니다.",
        "romaji": "Seonggongiraneun geoseun maneun noryeokgwa heonsin eobsineun irueojil su eobseun geosibnida.",
        "en": "Success cannot be achieved without a lot of effort and dedication.",
        "grammar_audio": "/audio/korean/grammar/s_이라는_것_iraneun_geot_The_thing_called_20250209_성공이라는_것은_많은_노력과_헌신_없이는_이루어질_수_없는_것입니다.mp3"
      },
      {
        "kr": "행복이라는 것은 개인마다 다른 의미를 갖고 있기 때문에 정의하기가 어렵습니다.",
        "romaji": "Haengbogiraneun geoseun gaenmada dareun uimireul gajgo issgie ttaemune jeonguihagiga eoryeopseumnida.",
        "en": "It’s difficult to define happiness because it holds different meanings for each person.",
        "grammar_audio": "/audio/korean/grammar/s_이라는_것_iraneun_geot_The_thing_called_20250209_행복이라는_것은_개인마다_다른_의미를_갖고_있기_때문에_정의하기가_어렵습니다.mp3"
      },
      {
        "kr": "배려라는 것은 자신의 행동이 다른 사람에게 어떤 영향을 미치는지 고려하는 것입니다.",
        "romaji": "Baerylaneun geoseun jasinui haengdong-i daleun saram-ege eotteon yeonghyang-eul michineunji golyeohaneun geosibnida.",
        "en": "Consideration means taking into account how one’s actions affect others.",
        "grammar_audio": "/audio/korean/grammar/s_이라는_것_iraneun_geot_The_thing_called_20250209_배려라는_것은_자신의_행동이_다른_사람에게_어떤_영향을_미치는지_고려하는_것입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이라면 [iramyeon] (If it’s the case that)",
    "short_explanation": "Used to imagine a certain situation; 'if it’s the case that'.",
    "long_explanation": "'~이라면 [iramyeon]' is used in Korean to pose a hypothetical scenario or situation. It is akin to saying 'if it’s the case that' in English and is used to speculate about consequences or outcomes.",
    "formation": "Verb stem + -이라면",
    "examples": [
      {
        "kr": "여기가 정말로 유명한 관광 명소라면, 왜 이렇게 사람이 없나요?",
        "romaji": "Yeogiga jeongmallo yumyeonghan gwangwangmyeongso-iramyeon, wae ireohge saram-i eomnayo?",
        "en": "If this is really a famous tourist spot, why are there so few people?",
        "grammar_audio": "/audio/korean/grammar/s_이라면_iramyeon_If_its_the_case_that_20250209_여기가_정말로_유명한_관광_명소라면_왜_이렇게_사람이_없나요.mp3"
      },
      {
        "kr": "정말로 그런 일이 있다면, 어떻게 대처해야 할지 고민해봐야겠어요.",
        "romaji": "Jeongmallo geureon iri itdamyeon, eotteohge daecheohaeya halji gominhae bwayagesseoyo.",
        "en": "If such a thing really happens, I’ll have to think about how to deal with it.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_iramyeon_If_its_the_case_that_20250209_정말로_그런_일이_있다면_어떻게_대처해야_할지_고민해봐야겠어요.mp3"
      },
      {
        "kr": "학교를 그만두고 싶다면, 미래를 어떻게 설계할지 생각해봐야 할 거예요.",
        "romaji": "Hakgyoreul geumandugo sipdamyeon, miraereul eotteohge seolgyehalji saenggakhae bwayahal geoyeyo.",
        "en": "If you want to quit school, you should think about how to plan your future.",
        "grammar_audio": "/audio/korean/grammar/s_이라면_iramyeon_If_its_the_case_that_20250209_학교를_그만두고_싶다면_미래를_어떻게_설계할지_생각해봐야_할_거예요.mp3"
      },
      {
        "kr": "니가 내 친구라면, 왜 나를 배신하고 다른 친구들에게 나쁜 이야기를 퍼뜨렸나요?",
        "romaji": "Niga nae chingura myeon, wae nareul baesinhago dareun chingudeul-ege nappeun iyagireul peotteuryeossnayo?",
        "en": "If you are my friend, why did you betray me and spread bad stories about me to other friends?",
        "grammar_audio": "/audio/korean/grammar/s_이라면_iramyeon_If_its_the_case_that_20250209_니가_내_친구라면_왜_나를_배신하고_다른_친구들에게_나쁜_이야기를_퍼뜨렸나요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이래 [irae] (Like this, in this manner)",
    "short_explanation": "Used to express 'like this' or 'in this manner', referring to a current state or condition.",
    "long_explanation": "'~이래 [irae]' is used in Korean to describe the state, condition, or manner in which something exists or is done. It emphasizes the way in which a situation is and is often used when commenting on the current status or behavior.",
    "formation": "Noun + 이래",
    "examples": [
      {
        "kr": "날씨가 이래서는 놀러갈 수가 없어요.",
        "romaji": "Nalssiga iraeseoneun nolleogal suga eobseoyo.",
        "en": "We can’t go out to play when the weather is like this.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Like_this_in_this_manner_20250209_날씨가_이래서는_놀러갈_수가_없어요.mp3"
      },
      {
        "kr": "내가 이래 있으면, 유명해질 것 같아요.",
        "romaji": "Naega irae isseumyeon, yumyeonghaejil geot gatayo.",
        "en": "If I remain like this, I think I’ll become famous.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Like_this_in_this_manner_20250209_내가_이래_있으면_유명해질_것_같아요.mp3"
      },
      {
        "kr": "이 집이 이래서는 팔 수가 없어.",
        "romaji": "I jibi iraeseoneun pal suga eobseo.",
        "en": "We can’t sell the house when it’s like this.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Like_this_in_this_manner_20250209_이_집이_이래서는_팔_수가_없어.mp3"
      },
      {
        "kr": "자네가 이래서는 운동선수로 출중한 성과를 이룰 수 있을 것 같군.",
        "romaji": "Janaega iraeseoneun undongseonsu-ro chuljunghan seonggwareul irul su isseul geot gatgun.",
        "en": "If you keep it up like this, you can achieve outstanding results as an athlete.",
        "grammar_audio": "/audio/korean/grammar/s_이래_irae_Like_this_in_this_manner_20250209_자네가_이래서는_운동선수로_출중한_성과를_이룰_수_있을_것_같군.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이랑 [irang] (And, with)",
    "short_explanation": "Used to connect two nouns, expressing 'and' or 'with'.",
    "long_explanation": "'~이랑 [irang]' is a common connector in Korean that joins two nouns together to show a relationship or connection. It is used informally in various sentence types regardless of the politeness level.",
    "formation": "Noun + 이랑 + Noun",
    "examples": [
      {
        "kr": "저는 친구이랑 같이 영화를 보러 갈 계획이에요.",
        "romaji": "Jeoneun chinguirang gachi yeonghwaleul boreo gal gyehoegieyo.",
        "en": "I plan to go see a movie with my friend.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20250209_저는_친구이랑_같이_영화를_보러_갈_계획이에요.mp3"
      },
      {
        "kr": "우리는 피자이랑 치킨을 주문했어요.",
        "romaji": "Urineun pijairang chikin-eul jumunhaesseoyo.",
        "en": "We ordered pizza and chicken.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20250209_우리는_피자이랑_치킨을_주문했어요.mp3"
      },
      {
        "kr": "저는 언니이랑 쇼핑몰에서 옷을 샀어요.",
        "romaji": "Jeoneun eonniirang syopingmol-eseo oseul sasseoyo.",
        "en": "I bought clothes at the shopping mall with my sister.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20250209_저는_언니이랑_쇼핑몰에서_옷을_샀어요.mp3"
      },
      {
        "kr": "나는 고양이랑 개랑 키우고 있어요.",
        "romaji": "Naneun goyangi-rang gae-rang kiugo isseoyo.",
        "en": "I am raising both a cat and a dog.",
        "grammar_audio": "/audio/korean/grammar/s_이랑_irang_And_with_20250209_나는_고양이랑_개랑_키우고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "100"
  },
  {
    "title": "~이러하다 [ireohada] (Like this)",
    "short_explanation": "Used to describe the state or condition of a subject as 'like this'.",
    "long_explanation": "'~이러하다 [ireohada]' is a descriptive verb used in Korean to indicate that someone or something is in a particular state or condition. It emphasizes the current manner or appearance of the subject.",
    "formation": "Adjective/Verb base + -이러하다",
    "examples": [
      {
        "kr": "친구의 태도가 너무 이러하더니, 모두가 당황했어요.",
        "romaji": "Chingui taedoga neomu ireohadeoni, moduga danghwanghaesseoyo.",
        "en": "My friend’s attitude was like this, so everyone was taken aback.",
        "grammar_audio": "/audio/korean/grammar/s_이러하다_ireohada_Like_this_20250209_친구의_태도가_너무_이러하더니_모두가_당황했어요.mp3"
      },
      {
        "kr": "요즘 세상이 이러하다니, 믿기 어렵네요.",
        "romaji": "Yojum sesangi ireohadani, midgi eoryeobneyo.",
        "en": "It’s hard to believe that the world is like this these days.",
        "grammar_audio": "/audio/korean/grammar/s_이러하다_ireohada_Like_this_20250209_요즘_세상이_이러하다니_믿기_어렵네요.mp3"
      },
      {
        "kr": "그녀의 행동이 이러하다 보니, 사람들의 신뢰를 잃었어요.",
        "romaji": "Geunyeoui haengdong-i ireohada boni, saramdeul-ui sinroereul ilheosseoyo.",
        "en": "Because her behavior was like this, she lost people’s trust.",
        "grammar_audio": "/audio/korean/grammar/s_이러하다_ireohada_Like_this_20250209_그녀의_행동이_이러하다_보니_사람들의_신뢰를_잃었어요.mp3"
      },
      {
        "kr": "그가 이러하다고 하니, 정말 실망스러워요.",
        "romaji": "Geuga ireohadago hani, jeongmal silmangseureowoyo.",
        "en": "When he says he’s like this, it’s really disappointing.",
        "grammar_audio": "/audio/korean/grammar/s_이러하다_ireohada_Like_this_20250209_그가_이러하다고_하니_정말_실망스러워요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~이런/그런/저런 [ireon/geureon/jeoreon] (This kind of/That kind of/That kind over there)",
    "short_explanation": "Used to describe the type or category of something; 'this kind of', 'that kind of', or 'that kind over there'.",
    "long_explanation": "~이런/그런/저런 [ireon/geureon/jeoreon] are demonstrative adjectives used in Korean to classify or describe things by their type or category. '이런' refers to something near the speaker, '그런' to something near the listener or already mentioned, and '저런' to something distant.",
    "formation": "('이런' + Noun) or ('그런' + Noun) or ('저런' + Noun)",
    "examples": [
      {
        "kr": "이런 상황에서는 어떻게 대처해야 할 지 모르겠어요.",
        "romaji": "Ireon sanghwang-eseoneun eotteohge daecheohaeya halji moreugesseoyo.",
        "en": "I don’t know how to deal with this kind of situation.",
        "grammar_audio": "/audio/korean/grammar/s_이런그런저런_ireongeureonjeoreon_This_kind_ofThat_kind_ofThat_kind_over_there_20250209_이런_상황에서는_어떻게_대처해야_할_지_모르겠어요.mp3"
      },
      {
        "kr": "그런 분위기를 좋아하지 않아요.",
        "romaji": "Geureon bunwigireul johahaji anhayo.",
        "en": "I don’t like that kind of atmosphere.",
        "grammar_audio": "/audio/korean/grammar/s_이런그런저런_ireongeureonjeoreon_This_kind_ofThat_kind_ofThat_kind_over_there_20250209_그런_분위기를_좋아하지_않아요.mp3"
      },
      {
        "kr": "저런 옷을 입으면 어떻게 생각할까요?",
        "romaji": "Jeoreon ot-eul ib-eumyeon eotteohge saenggakhalkkayo?",
        "en": "What would you think if I wore that kind of clothes over there?",
        "grammar_audio": "/audio/korean/grammar/s_이런그런저런_ireongeureonjeoreon_This_kind_ofThat_kind_ofThat_kind_over_there_20250209_저런_옷을_입으면_어떻게_생각할까요.mp3"
      },
      {
        "kr": "이런 생각을 하지 말아야겠어요.",
        "romaji": "Ireon saenggageul haji marayagesseoyo.",
        "en": "I shouldn’t have such thoughts.",
        "grammar_audio": "/audio/korean/grammar/s_이런그런저런_ireongeureonjeoreon_This_kind_ofThat_kind_ofThat_kind_over_there_20250209_이런_생각을_하지_말아야겠어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~이므로 [imuro] (Because, since)",
    "short_explanation": "Used to express a reason or cause; 'because', 'since'.",
    "long_explanation": "'~이므로 [imuro]' is a conjunction used in Korean to indicate a reason or cause, corresponding to 'because' or 'since' in English. It typically introduces the cause for a conclusion or result. This form is formal and is often used in written Korean, such as in official documents, academic writing, or news reports.",
    "formation": "Verb/Adjective/Noun + ~이므로",
    "examples": [
      {
        "kr": "내일은 월요일이므로, 오늘 밤에 일찍 잠에 들어야 합니다.",
        "romaji": "Naeil-eun woryoil-imuro, oneul bam-e iljjik jam-e deul-eoya hamnida.",
        "en": "Because tomorrow is Monday, we have to go to bed early tonight.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imuro_Because_since_20250209_내일은_월요일이므로_오늘_밤에_일찍_잠에_들어야_합니다.mp3"
      },
      {
        "kr": "그는 학점이 낮아서 교수님께 장학금을 받을 수 없었기 때문에 금전적인 문제가 있었어요.",
        "romaji": "Geuneun hakjeom-i naj-aseo gyosunimkke janghakgeum-eul bad-eul su eobs-eossgi ttaemune geumjeonjeog-in munje-ga iss-eoss-eoyo.",
        "en": "He had financial difficulties because his grades were low and he couldn’t receive a scholarship from his professor.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imuro_Because_since_20250209_그는_학점이_낮아서_교수님께_장학금을_받을_수_없었기_때문에_금전적인_문제가_있었어요.mp3"
      },
      {
        "kr": "우리는 시간이 없기 때문에, 저녁 식사를 축소해야 합니다.",
        "romaji": "Urineun sigan-i eobs-gi ttaemune, jeonyeog siksa-reul chugsohaeya hamnida.",
        "en": "Because we are short on time, we have to cut down on dinner.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imuro_Because_since_20250209_우리는_시간이_없기_때문에_저녁_식사를_축소해야_합니다.mp3"
      },
      {
        "kr": "그 직원은 업무능력이 매우 불량이므로, 우리는 그에게 경고를 발했습니다.",
        "romaji": "Geu jigwon-eun eobmu neunglyeog-i maeu bullyang-imuro, urineun geu-ege gyeonggo-reul balhaessseubnida.",
        "en": "We issued a warning to the employee because his job performance was very poor.",
        "grammar_audio": "/audio/korean/grammar/s_이므로_imuro_Because_since_20250209_그_직원은_업무능력이_매우_불량이므로_우리는_그에게_경고를_발했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~이야 [iya] (Is, informal declaration)",
    "short_explanation": "'~이야' is used as an informal, casual way to state or declare something.",
    "long_explanation": "'~이야' is a verb modifier in Korean used to assert, declare, or express a fact, situation, or feeling in an informal context. It attaches to the stem of a noun, verb, or adjective and is common in daily conversation among close friends or people of similar age. It is not recommended to use this form with elders or superiors as it may sound rude.",
    "formation": "Adjective/Verb stem + 이야",
    "examples": [
      {
        "kr": "나는 배가 고프다고 생각했더니 아니었어, 김밥을 사 왔어, 이제 배가 고프지 않아.",
        "romaji": "Naneun baega gopeudago saenggakhaetdeoni anieosseo, gimbabeul sa wass-eo, ije baega gopeuji anha.",
        "en": "I thought I was hungry, but I wasn’t—I bought gimbap, and now I’m not hungry.",
        "grammar_audio": "/audio/korean/grammar/s_이야_iya_Is_informal_declaration_20250209_나는_배가_고프다고_생각했더니_아니었어_김밥을_사_왔어_이제_배가_고프지_않아.mp3"
      },
      {
        "kr": "오늘 날씨가 참 좋아, 하늘이 맑고 파란 하늘이 보여.",
        "romaji": "Oneul nalssiga cham joa, haneul-i malgo paran haneul-i boyeo.",
        "en": "The weather is really nice today; you can see the clear, blue sky.",
        "grammar_audio": "/audio/korean/grammar/s_이야_iya_Is_informal_declaration_20250209_오늘_날씨가_참_좋아_하늘이_맑고_파란_하늘이_보여.mp3"
      },
      {
        "kr": "여기가 내 집이야, 조금 작지만 아늑하고 편안해.",
        "romaji": "Yeogiga nae jib-iya, jogeum jagjiman aneugago pyeonanhae.",
        "en": "This is my house—it's small but cozy and comfortable.",
        "grammar_audio": "/audio/korean/grammar/s_이야_iya_Is_informal_declaration_20250209_여기가_내_집이야_조금_작지만_아늑하고_편안해.mp3"
      },
      {
        "kr": "너가 진짜로 좋아하는 거야, 말해 줘서 고마워.",
        "romaji": "Neoga jinjja-ro joahaneun geoya, malhae jwoseo gomawo.",
        "en": "You really like it, thanks for telling me.",
        "grammar_audio": "/audio/korean/grammar/s_이야_iya_Is_informal_declaration_20250209_너가_진짜로_좋아하는_거야_말해_줘서_고마워.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~이지만 [ijiman] (But, although)",
    "short_explanation": "Used to convey a contrast or contradiction; 'but', 'although'.",
    "long_explanation": "'~이지만 [ijiman]' is used in Korean to indicate a contrast or contradiction between two statements or facts. It is similar to 'but' or 'although' in English: despite what is stated in the first clause, the information in the second clause still holds true. In casual contexts, the shortened form '-지만' may be used on its own.",
    "formation": "Clause 1 + 지만 + Clause 2",
    "examples": [
      {
        "kr": "평소에 드라마를 잘 안 보는 편이지만 이 드라마는 흥미로워서 꼭 봐야겠어요.",
        "romaji": "Pyeongsoe deurameureul jal an boneun pyeonijiman i deurameuneun heungmirowoseo ggok bwayagesseoyo.",
        "en": "I usually don’t watch dramas, but this drama is so interesting that I must watch it.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_although_20250209_평소에_드라마를_잘_안_보는_편이지만_이_드라마는_흥미로워서_꼭_봐야겠어요.mp3"
      },
      {
        "kr": "오늘 날씨가 좋지만 바빠서 나가지 못할 것 같아요.",
        "romaji": "Oneul nalssiga joijiman bappa-seo nagaji mothael geot gatayo.",
        "en": "The weather is good today, but I don’t think I can go out because I’m busy.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_although_20250209_오늘_날씨가_좋지만_바빠서_나가지_못할_것_같아요.mp3"
      },
      {
        "kr": "당신은 젊지만 이미 많은 경험을 가지고 있네요.",
        "romaji": "Dangsineun jeolmjiman imi maneun gyeongheom-eul gajigo itneyo.",
        "en": "You are young, but you already have a lot of experience.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_although_20250209_당신은_젊지만_이미_많은_경험을_가지고_있네요.mp3"
      },
      {
        "kr": "제가 팀장이지만 모든 결정을 혼자서 하지는 않아요.",
        "romaji": "Jega timjangijiman modeun gyeoljeongeul honjaseo hajineun anhayo.",
        "en": "I am the team leader, but I don’t make all the decisions by myself.",
        "grammar_audio": "/audio/korean/grammar/s_이지만_ijiman_But_although_20250209_제가_팀장이지만_모든_결정을_혼자서_하지는_않아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~이후 [ihu] (After, since)",
    "short_explanation": "Used to express the meaning of 'after' or 'since'.",
    "long_explanation": "'~이후 [ihu]' is a postposition used in Korean to indicate the time after a specific point or event. It corresponds to 'after' or 'since' in English and is often used to refer to the period following a particular event.",
    "formation": "Noun + 이후",
    "examples": [
      {
        "kr": "중학교 졸업 이후로 처음으로 친구들과 모였어요.",
        "romaji": "Jung hakgyo joreop ihu-ro cheoeum-euro chingu-deul gwa moyeosseoyo.",
        "en": "I got together with my friends for the first time since graduating from middle school.",
        "grammar_audio": "/audio/korean/grammar/s_이후_ihu_After_since_20250209_중학교_졸업_이후로_처음으로_친구들과_모였어요.mp3"
      },
      {
        "kr": "그녀가 도시에 이사 간 이후로 그녀를 본 적이 없어요.",
        "romaji": "Geunyeoga dosi-e isa gan ihu-ro, geunyeoreul bon jeok-i eobs-eoyo.",
        "en": "I haven’t seen her since she moved to the city.",
        "grammar_audio": "/audio/korean/grammar/s_이후_ihu_After_since_20250209_그녀가_도시에_이사_간_이후로_그녀를_본_적이_없어요.mp3"
      },
      {
        "kr": "아침 식사 이후로 아무것도 먹지 않았어요.",
        "romaji": "Achim siksa ihu-ro amugeosdo meogeoss-eoyo.",
        "en": "I haven’t eaten anything since breakfast.",
        "grammar_audio": "/audio/korean/grammar/s_이후_ihu_After_since_20250209_아침_식사_이후로_아무것도_먹지_않았어요.mp3"
      },
      {
        "kr": "회의 이후로 사무실에서 일을 계속하고 있어요.",
        "romaji": "Hoeui ihu-ro samusil-eseo ireul gyesokhago isseoyo.",
        "en": "I’ve been continuing my work in the office since the meeting.",
        "grammar_audio": "/audio/korean/grammar/s_이후_ihu_After_since_20250209_회의_이후로_사무실에서_일을_계속하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~인즉 [injeuk] (In other words, that is to say)",
    "short_explanation": "Used to rephrase or further explain a preceding statement; 'in other words', 'that is to say'.",
    "long_explanation": "'~인즉 [injeuk]' is a connective ending used in Korean to rephrase or further explain a preceding statement or idea. It is similar to saying 'in other words' or 'that is to say' in English, and it helps the speaker clarify their point.",
    "formation": "Clause + 인즉",
    "examples": [
      {
        "kr": "이 작업이 정말 어려워요, 인즉, 전문가가 아니면 제대로 해낼 수 없습니다.",
        "romaji": "I jak-eob-i jeongmal eoryeowoyo, injeuk, jeonmunga-ga animyeon jedaelo hael su eobs-eossseubnida.",
        "en": "This task is really hard—in other words, if you’re not an expert, you can’t do it properly.",
        "grammar_audio": "/audio/korean/grammar/s_인즉_injeuk_In_other_words_that_is_to_say_20250209_이_작업이_정말_어려워요_인즉_전문가가_아니면_제대로_해낼_수_없습니다.mp3"
      },
      {
        "kr": "그녀는 내일 결혼합니다, 인즉, 그녀는 더 이상 독신이 아닙니다.",
        "romaji": "Geunyeoneun naeil gyeolhonhamnida, injeuk, geunyeoneun deo isang dokshin-i anida.",
        "en": "She is getting married tomorrow; that is to say, she is no longer single.",
        "grammar_audio": "/audio/korean/grammar/s_인즉_injeuk_In_other_words_that_is_to_say_20250209_그녀는_내일_결혼합니다_인즉_그녀는_더_이상_독신이_아닙니다.mp3"
      },
      {
        "kr": "박물관 직원은 저를 입장하게 허락하지 않았습니다. 인즉, 저는 규정을 위반했습니다.",
        "romaji": "Bakmulgwan jigwon-eun jeoreul ipjanghage heorak haji anhassseubnida. injeuk, jeoneun gyujeong-eul wibanhaessseubnida.",
        "en": "The museum staff did not allow me to enter—in other words, I violated the rules.",
        "grammar_audio": "/audio/korean/grammar/s_인즉_injeuk_In_other_words_that_is_to_say_20250209_박물관_직원은_저를_입장하게_허락하지_않았습니다_인즉_저는_규정을_위반했습니다.mp3"
      },
      {
        "kr": "우리는 연구에 참여하였습니다, 인즉, 우리는 어떤 학문적인 기여를 했습니다.",
        "romaji": "Ulineun yeongu-e chamyeohayeossseubnida, injeuk, ulineun eotteon hakmunjeog-in giyeoleul hayeossseubnida.",
        "en": "We participated in the research—in other words, we made an academic contribution.",
        "grammar_audio": "/audio/korean/grammar/s_인즉_injeuk_In_other_words_that_is_to_say_20250209_우리는_연구에_참여하였습니다_인즉_우리는_어떤_학문적인_기여를_했습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~자 [ja] (Let's)",
    "short_explanation": "Used to propose doing something; 'Let's'.",
    "long_explanation": "'~자 [ja]' is an ending particle in Korean used to suggest or propose doing an action together. It corresponds loosely to 'Let's' in English and is used in informal or casual contexts among friends, colleagues, or family members. The subject is usually omitted, and the verb appears in its dictionary (base) form.",
    "formation": "Dictionary form of verb + 자",
    "examples": [
      {
        "kr": "날씨가 너무 좋으니까, 우리 산에 등산하러 가자.",
        "romaji": "Nalssiga neomu jo-eunikka, uri sane deungsanhareo gaja.",
        "en": "The weather is so good, let's go mountain climbing.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20250209_날씨가_너무_좋으니까_우리_산에_등산하러_가자.mp3"
      },
      {
        "kr": "오늘이 일요일이므로, 교회에 가서 기도하자.",
        "romaji": "Oneul-i illyoil-imyeo, gyohoe-e gaseo gidohaja.",
        "en": "Since today is Sunday, let's go to church and pray.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20250209_오늘이_일요일이므로_교회에_가서_기도하자.mp3"
      },
      {
        "kr": "밥은 다 먹었으니, 이제 커피 한 잔 마시러 카페에 가자.",
        "romaji": "Babeun dameogeoss-euni, ije keopi han jan masireo kape-e gaja.",
        "en": "Now that we’ve finished eating, let's go to the cafe and have a cup of coffee.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20250209_밥은_다_먹었으니_이제_커피_한_잔_마시러_카페에_가자.mp3"
      },
      {
        "kr": "길고 지루한 하루였으니, 이제 보드게임 하나 플레이하며 편히 쉬자.",
        "romaji": "Gilgo jiruhan haru-yeoss-euni, ije bodeugeim hana peulleihamyeo pyeonhi swija.",
        "en": "It’s been a long and boring day; let's relax by playing a board game.",
        "grammar_audio": "/audio/korean/grammar/s_자_ja_Lets_20250209_길고_지루한_하루였으니_이제_보드게임_하나_플레이하며_편히_쉬자.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~자마자 [jamaja] (As soon as)",
    "short_explanation": "Used to express that one action occurs immediately after another.",
    "long_explanation": "The '~자마자 [jamaja]' grammar point emphasizes that an action or event occurs immediately after a preceding one. It is equivalent to 'as soon as' in English and implies a very short time gap between the two actions.",
    "formation": "Verb stem + 자마자",
    "examples": [
      {
        "kr": "저는 집에 돌아오자마자 식사를 준비했어요, 왜냐하면 너무 배고파서 바로 음식을 먹고 싶었기 때문이에요.",
        "romaji": "Jeoneun jibe doraojamaja siksa-reul junbihaesseoyo, waenyahamyeon neomu baegopaseo baro eumsigeul meokgo sipheossgi ttaemunieyo.",
        "en": "As soon as I returned home, I prepared a meal because I was so hungry and wanted to eat right away.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20250209_저는_집에_돌아오자마자_식사를_준비했어요_왜냐하면_너무_배고파서_바로_음식을_먹고_싶었기_때문이에요.mp3"
      },
      {
        "kr": "엄마가 전화를 끊자마자 잠을 청하러 갔어요, 어제는 너무 늦게 잠들었기 때문에 기분이 피곤했어요.",
        "romaji": "Eommaga jeonhwareul kkeunjamaja jameul cheonghareo gasseoyo, eojeoneun neomu neutge jamdeureossgi ttaemunieyo, gibun-i pigonhaesseoyo.",
        "en": "As soon as Mom hung up the phone, I went to sleep because I was tired from going to bed too late yesterday.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20250209_엄마가_전화를_끊자마자_잠을_청하러_갔어요_어제는_너무_늦게_잠들었기_때문에_기분이_피곤했어요.mp3"
      },
      {
        "kr": "그는 일어나자마자 커피를 마셔요, 그는 아침에 커피 없이 일을 시작할 수 없다고 말해요.",
        "romaji": "Geuneun ireonajamaja keopireul masyeoyo, geuneun achime keopi eobsi ireul sijakhal su eobsdago malhaeyo.",
        "en": "As soon as he wakes up, he drinks coffee—he says he can’t start work without it in the morning.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20250209_그는_일어나자마자_커피를_마셔요_그는_아침에_커피_없이_일을_시작할_수_없다고_말해요.mp3"
      },
      {
        "kr": "비가 오자마자 우산을 들고 도서관에 갔어요, 왜냐하면 수업 자료를 찾기로 결정했기 때문이에요.",
        "romaji": "Biga ojamaja usaneul deulgo doseogwan-e gasseoyo, waenyahamyeon sueop jaryoreul chajgiro gyeoljeonghaetgi ttaemunieyo.",
        "en": "As soon as it started raining, I grabbed an umbrella and went to the library because I decided to look for class materials.",
        "grammar_audio": "/audio/korean/grammar/s_자마자_jamaja_As_soon_as_20250209_비가_오자마자_우산을_들고_도서관에_갔어요_왜냐하면_수업_자료를_찾기로_결정했기_때문이에요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~전에/전까지 [jeone/jeonkkaji] (Before/by the time of)",
    "short_explanation": "Used to indicate that an action or state is completed or occurs before a specific time.",
    "long_explanation": "'~전에 [jeone]' and '전까지 [jeonkkaji]' are used to denote that an action or state is completed before a certain time or event. '~전에' is used when the action stops before that time, while '전까지' indicates that the action continues up to that point.",
    "formation": "Verb + (ㄴ/는다) + 전에/전까지",
    "examples": [
      {
        "kr": "저는 학교에 가기 전에 아침을 먹어요.",
        "romaji": "Jeoneun hakgyo-e gagi jeone achimeul meogeoyo.",
        "en": "I eat breakfast before going to school.",
        "grammar_audio": "/audio/korean/grammar/s_전에전까지_jeonejeonkkaji_Beforeby_the_time_of_20250209_저는_학교에_가기_전에_아침을_먹어요.mp3"
      },
      {
        "kr": "그녀는 출근하기 전까지 연락할게요. 아마 연락 올 때까지 기다리세요.",
        "romaji": "Geunyeoneun chulgeunhagi jeonkkaji yeollakhalgeyo. Ama yeollak ol ttaekkaji gidariseyo.",
        "en": "She will contact you before going to work. Please wait until she contacts you.",
        "grammar_audio": "/audio/korean/grammar/s_전에전까지_jeonejeonkkaji_Beforeby_the_time_of_20250209_그녀는_출근하기_전까지_연락할게요_아마_연락_올_때까지_기다리세요.mp3"
      },
      {
        "kr": "기차가 도착하기 전에 짐을 싸야 해요.",
        "romaji": "Gichaga dochakhagi jeone jimeul ssayahae.",
        "en": "We have to pack our luggage before the train arrives.",
        "grammar_audio": "/audio/korean/grammar/s_전에전까지_jeonejeonkkaji_Beforeby_the_time_of_20250209_기차가_도착하기_전에_짐을_싸야_해요.mp3"
      },
      {
        "kr": "우리가 집에 돌아오기 전까지 조심하세요.",
        "romaji": "Uriga jibe doraogi jeonkkaji josimhaseyo.",
        "en": "Take care until we return home.",
        "grammar_audio": "/audio/korean/grammar/s_전에전까지_jeonejeonkkaji_Beforeby_the_time_of_20250209_우리가_집에_돌아오기_전까지_조심하세요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~정도 [jeongdo] (About, Approximately)",
    "short_explanation": "Used to express an approximate quantity, degree, or extent; 'about', 'approximately'.",
    "long_explanation": "'~정도 [jeongdo]' is a particle used in Korean to indicate an approximation of a quantity, amount, degree, or level. It conveys a sense of estimation similar to 'about' or 'approximately' in English, and it is commonly used when the exact figure is unknown or when giving a rough idea.",
    "formation": "Noun + (Approximate Quantity/Amount) + 정도",
    "examples": [
      {
        "kr": "이 문제를 해결하는 데는 한 시간쯤 정도 걸릴 것 같아요.",
        "romaji": "I munje-reul haegyeolhaneun de-neun han sigan jjeum jeongdo geollil geot gatayo.",
        "en": "It will probably take about an hour or so to solve this problem.",
        "grammar_audio": "/audio/korean/grammar/s_정도_jeongdo_About_Approximately_20250209_이_문제를_해결하는_데는_한_시간쯤_정도_걸릴_것_같아요.mp3"
      },
      {
        "kr": "진짜로 영화를 봤다면 네 시간 정도가 걸렸을 것이에요.",
        "romaji": "Jinjja-ro yeonghwaleul bwatdamyeon ne sigan jeongdo-ga geollyeosseul geosieyo.",
        "en": "If you really watched the movie, it would have taken about four hours.",
        "grammar_audio": "/audio/korean/grammar/s_정도_jeongdo_About_Approximately_20250209_진짜로_영화를_봤다면_네_시간_정도가_걸렸을_것이에요.mp3"
      },
      {
        "kr": "이 과제를 완료하려면 한 달 정도의 시간이 필요합니다.",
        "romaji": "I gwaje-reul wanlyohamyeon han dal jeongdoeui sigan-i pilyohabnida.",
        "en": "Completing this assignment requires about a month’s time.",
        "grammar_audio": "/audio/korean/grammar/s_정도_jeongdo_About_Approximately_20250209_이_과제를_완료하려면_한_달_정도의_시간이_필요합니다.mp3"
      },
      {
        "kr": "그의 성과를 평가하려면 최소한 10가지 이상의 요소를 고려해야 하고, 이것은 대략 한 시간 정도의 시간을 요구합니다.",
        "romaji": "Geuui seonggwareul pyeonggahamyen choesohan 10gaji isang-ui yosoreul goreohaya hago, igeoseun daerak han sigan jeongdoeui sigan-eul yoguhabnida.",
        "en": "Evaluating his performance requires considering at least 10 or more factors, and this takes approximately an hour.",
        "grammar_audio": "/audio/korean/grammar/s_정도_jeongdo_About_Approximately_20250209_그의_성과를_평가하려면_최소한_10가지_이상의_요소를_고려해야_하고_이것은_대략_한_시간_정도의_시간을_요구합니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~제 [je] (Although, even if)",
    "short_explanation": "Used to express 'although' or 'even if'. It signifies that despite the preceding condition, the outcome differs from what is expected.",
    "long_explanation": "'~제 [je]' is a conjunction used in Korean to express contrasting or unexpected outcomes. It is similar in meaning to 'although,' 'even if,' or 'even though' in English and functions much like '-지만' but is used in more formal or polite contexts.",
    "formation": "Noun/Adjective + ~제",
    "examples": [
      {
        "kr": "그녀가 아프제 일을 계속했어요.",
        "romaji": "Geunyeoga apeuje ireul gyesokhaesseoyo.",
        "en": "Although she was sick, she continued to work.",
        "grammar_audio": "/audio/korean/grammar/s_제_je_Although_even_if_20250209_그녀가_아프제_일을_계속했어요.mp3"
      },
      {
        "kr": "동생이 어리제 그에게 맡길 수 있는 일이 많아요.",
        "romaji": "Dongsaengi eorije geuege matgil su issneun iri manhayo.",
        "en": "Even though my younger sibling is young, there are many tasks that can be entrusted to him.",
        "grammar_audio": "/audio/korean/grammar/s_제_je_Although_even_if_20250209_동생이_어리제_그에게_맡길_수_있는_일이_많아요.mp3"
      },
      {
        "kr": "비가 내리제 나는 외출했어요.",
        "romaji": "Biga naerije naneun weochulhaesseoyo.",
        "en": "Even though it was raining, I went out.",
        "grammar_audio": "/audio/korean/grammar/s_제_je_Although_even_if_20250209_비가_내리제_나는_외출했어요.mp3"
      },
      {
        "kr": "시험 문제가 어렵제, 제가 좋아하는 과목이었기 때문에 재미있게 풀었어요.",
        "romaji": "Siheom munjega eoryeopje, jega joahaneun gwamogiyeotgi ttaemune jaemiissge pulleosseoyo.",
        "en": "Even though the test questions were difficult, I enjoyed solving them because it was a subject I liked.",
        "grammar_audio": "/audio/korean/grammar/s_제_je_Although_even_if_20250209_시험_문제가_어렵제_제가_좋아하는_과목이었기_때문에_재미있게_풀었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~조차 [jocha] (Even)",
    "short_explanation": "Expresses 'even' or 'to the extent that', reinforcing a strong emphasis or unexpected inclusion.",
    "long_explanation": "'~조차 [jocha]' is used in Korean to stress that something is included to an extreme degree or under surprising circumstances. It often conveys a sense of unexpectedness or limits reached.",
    "formation": "Noun + 조차",
    "examples": [
      {
        "kr": "그는 돈조차 너무 좋아해서 친구들에게 돈을 빌려주지 않아요.",
        "romaji": "Geuneun donjocha neomu joahaseo chingudeurege doneul billyeojugi anhayo.",
        "en": "He likes money so much that he doesn't even lend money to his friends.",
        "grammar_audio": "/audio/korean/grammar/s_조차_jocha_Even_20250209_그는_돈조차_너무_좋아해서_친구들에게_돈을_빌려주지_않아요.mp3"
      },
      {
        "kr": "저는 이번 주말에는 집에서 나가는 것조차 귀찮아요.",
        "romaji": "Jeoneun ibeon jumaleneun jibeseo naganeun geotjocha gwicheonhayo.",
        "en": "This weekend, I even find going out of the house annoying.",
        "grammar_audio": "/audio/korean/grammar/s_조차_jocha_Even_20250209_저는_이번_주말에는_집에서_나가는_것조차_귀찮아요.mp3"
      },
      {
        "kr": "이번 시험은 너무 어려워서 문제를 읽는 것조차 어려웠어요.",
        "romaji": "Ibeon siheomeun neomu eoryeowoseo munjeleul ilgneun geotjocha eoryeowosseoyo.",
        "en": "This exam was so hard that even reading the problems was difficult.",
        "grammar_audio": "/audio/korean/grammar/s_조차_jocha_Even_20250209_이번_시험은_너무_어려워서_문제를_읽는_것조차_어려웠어요.mp3"
      },
      {
        "kr": "가게에 사람이 너무 많아서 메뉴를 선택하는 것조차 힘들었어요.",
        "romaji": "Gagee sarami neomu manaseo menyureul seontaekhaneun geotjocha himdeureosseoyo.",
        "en": "There were so many people in the store that even choosing the menu was difficult.",
        "grammar_audio": "/audio/korean/grammar/s_조차_jocha_Even_20250209_가게에_사람이_너무_많아서_메뉴를_선택하는_것조차_힘들었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~존재하다 [jonjaehada] (To exist)",
    "short_explanation": "'존재하다' is used to express the existence or presence of someone or something.",
    "long_explanation": "'존재하다 [jonjaehada]' is a Korean verb that indicates that someone or something exists or is present. It can be used for concrete objects, people, or even abstract concepts like hope, ideas, or problems. In its present form, it becomes '존재해요.'",
    "formation": "(Noun/Subject) + 존재하다",
    "examples": [
      {
        "kr": "영화 속에 존재하는 그런 판타지 세계가 현실에서도 존재하길 바래요.",
        "romaji": "Yeonghwa soge jonjaehaneun geureon pantaji segye-ga hyeonsil-eseodo jonjaehagil baraeyo.",
        "en": "I hope that such a fantasy world that exists in the movie also exists in reality.",
        "grammar_audio": "/audio/korean/grammar/s_존재하다_jonjaehada_To_exist_20250209_영화_속에_존재하는_그런_판타지_세계가_현실에서도_존재하길_바래요.mp3"
      },
      {
        "kr": "사랑이 과연 영원히 존재하는 건지 모르겠어요.",
        "romaji": "Sarangi gwayeon yeongwonhi jonjaehaneun geonji moreugesseoyo.",
        "en": "I am not sure if love really exists forever.",
        "grammar_audio": "/audio/korean/grammar/s_존재하다_jonjaehada_To_exist_20250209_사랑이_과연_영원히_존재하는_건지_모르겠어요.mp3"
      },
      {
        "kr": "이 세상에 완벽한 사람이 존재하는지 의심스러워요.",
        "romaji": "I sesang-e wanbyeokhan sarami jonjaehaneunji uisimseureowoyo.",
        "en": "I doubt that a perfect person exists in this world.",
        "grammar_audio": "/audio/korean/grammar/s_존재하다_jonjaehada_To_exist_20250209_이_세상에_완벽한_사람이_존재하는지_의심스러워요.mp3"
      },
      {
        "kr": "이 방에는 저 말고 다른 사람들이 존재하지 않아요.",
        "romaji": "I bange-neun jeo malgo dareun saramdeuri jonjaehaji anhayo.",
        "en": "Except for me, no other people exist in this room.",
        "grammar_audio": "/audio/korean/grammar/s_존재하다_jonjaehada_To_exist_20250209_이_방에는_저_말고_다른_사람들이_존재하지_않아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~줄 알다 [jul alda] (Thought that)",
    "short_explanation": "'~줄 알다' is used to express an assumption or expectation that turns out to be incorrect.",
    "long_explanation": "'~줄 알다' is a Korean grammar pattern used when the speaker assumed or expected something to be a certain way, only to find that the reality was different. It is often translated as 'I thought that...' and conveys a sense of surprise or disappointment when the expectation does not match the outcome.",
    "formation": "Verb/Adjective + 줄 알다",
    "examples": [
      {
        "kr": "날씨가 좋을 줄 알았는데, 갑자기 비가 와서 실망했어요.",
        "romaji": "Nalssiga joheul jul alatneunde, gapjagi biga waseo silmanghaesseoyo.",
        "en": "I thought the weather would be nice, but it suddenly started raining and I was disappointed.",
        "grammar_audio": "/audio/korean/grammar/s_줄_알다_jul_alda_Thought_that_20250209_날씨가_좋을_줄_알았는데_갑자기_비가_와서_실망했어요.mp3"
      },
      {
        "kr": "그 사람이 나를 좋아할 줄 알았는데, 아니었어요.",
        "romaji": "Geu sarami nareul joahal jul alatneunde, anieosseoyo.",
        "en": "I thought that person liked me, but that was not the case.",
        "grammar_audio": "/audio/korean/grammar/s_줄_알다_jul_alda_Thought_that_20250209_그_사람이_나를_좋아할_줄_알았는데_아니었어요.mp3"
      },
      {
        "kr": "시험 문제가 어려울 줄 알았는데, 생각보다 쉬웠어요.",
        "romaji": "Siheom munjega eoryeoul jul alatneunde, saenggakboda swiweosseoyo.",
        "en": "I thought the test questions would be difficult, but they were easier than I expected.",
        "grammar_audio": "/audio/korean/grammar/s_줄_알다_jul_alda_Thought_that_20250209_시험_문제가_어려울_줄_알았는데_생각보다_쉬웠어요.mp3"
      },
      {
        "kr": "진행이 늦을 줄 알았는데, 빨리 끝났어요.",
        "romaji": "Jinhaengi neujeul jul alatneunde, ppalli kkeutnasseoyo.",
        "en": "I thought the proceedings would be slow, but they ended quickly.",
        "grammar_audio": "/audio/korean/grammar/s_줄_알다_jul_alda_Thought_that_20250209_진행이_늦을_줄_알았는데_빨리_끝났어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~즉시 [jeukshi] (Immediately, at once)",
    "short_explanation": "Used to indicate that something happens immediately or without delay.",
    "long_explanation": "'~즉시 [jeukshi]' is an adverb in Korean used to express that an action occurs immediately after a preceding event. It emphasizes the immediacy of the subsequent action, similar to 'as soon as' or 'the moment' in English.",
    "formation": "Verb + (으)ㄹ/ㄴ + 즉시",
    "examples": [
      {
        "kr": "그녀가 방에 들어온 즉시, 저는 선물을 주려고 했어요.",
        "romaji": "Geunyeoga bange deureoon jeukshi, jeoneun seonmureul juryeogo haesseoyo.",
        "en": "As soon as she entered the room, I intended to give her a gift.",
        "grammar_audio": "/audio/korean/grammar/s_즉시_jeukshi_Immediately_at_once_20250209_그녀가_방에_들어온_즉시_저는_선물을_주려고_했어요.mp3"
      },
      {
        "kr": "메시지를 받으면 즉시 반응해야 합니다, 그렇지 않으면 그 사람은 기다리게 됩니다.",
        "romaji": "Mesijireul bateumyeon jeukshi baneunghaeya hamnida, geureohji anheumyeon geu sarameun gidarige doebnida.",
        "en": "You should respond immediately upon receiving a message, otherwise that person will be left waiting.",
        "grammar_audio": "/audio/korean/grammar/s_즉시_jeukshi_Immediately_at_once_20250209_메시지를_받으면_즉시_반응해야_합니다_그렇지_않으면_그_사람은_기다리게_됩니다.mp3"
      },
      {
        "kr": "그날 밤, 그녀가 보고서를 완료할 즉시 확인했어요.",
        "romaji": "Geunal bam, geunyeoga bogoseoreul wanryohal jeukshi hwaginhaesseoyo.",
        "en": "That night, I confirmed it as soon as she finished her report.",
        "grammar_audio": "/audio/korean/grammar/s_즉시_jeukshi_Immediately_at_once_20250209_그날_밤_그녀가_보고서를_완료할_즉시_확인했어요.mp3"
      },
      {
        "kr": "회의가 끝난 즉시, 사진을 찍으러 갔어요.",
        "romaji": "Hoeuiga kkeutnan jeukshi, sajineul jjigeureo gasseoyo.",
        "en": "I went to take a picture immediately as soon as the meeting ended.",
        "grammar_audio": "/audio/korean/grammar/s_즉시_jeukshi_Immediately_at_once_20250209_회의가_끝난_즉시_사진을_찍으러_갔어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~지 않다 [ji anta] (Negative form)",
    "short_explanation": "Negates the action implied by the verb; equivalent to 'not' in English.",
    "long_explanation": "The grammar point '~지 않다 [ji anta]' is the standard and polite way to convert a verb into its negative form in Korean. By attaching '지 않다' to the verb stem, it changes the meaning to indicate that the action is not performed. This form is commonly used in both formal and casual contexts.",
    "formation": "Verb-stem + 지 않다",
    "examples": [
      {
        "kr": "나는 오늘 학교에 가지 않았어요, 왜냐하면 비가 너무 많이 와서 출근이 불가능했어요.",
        "romaji": "Naneun oneul hakgyo-e gaji anhasseoyo, waenyahamyeon biga neomu mani wasseo chulgeuni bulganeunghaesseoyo.",
        "en": "I did not go to school today because it rained so much that going was impossible.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Negative_form_20250209_나는_오늘_학교에_가지_않았어요_왜냐하면_비가_너무_많이_와서_출근이_불가능했어요.mp3"
      },
      {
        "kr": "저는 일반적으로 고기를 먹지 않아요, 왜냐하면 나는 채식주의자이기 때문입니다.",
        "romaji": "Jeoneun ilbanjeogeuro gogireul meokji anhayo, waenyahamyeon naneun chaesikjuuijaigi ttaemunibnida.",
        "en": "I generally do not eat meat because I am a vegetarian.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Negative_form_20250209_저는_일반적으로_고기를_먹지_않아요_왜냐하면_나는_채식주의자이기_때문입니다.mp3"
      },
      {
        "kr": "민지는 그 영화를 보지 않았어요, 왜냐하면 그녀는 그것이 너무 무서워하기 때문입니다.",
        "romaji": "Minjineun geu yeonghwareul boji anhasseoyo, waenyahamyeon geunyeoneun geugeosi neomu museowohagi ttaemunibnida.",
        "en": "Minji did not watch that movie because she finds it too scary.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Negative_form_20250209_민지는_그_영화를_보지_않았어요_왜냐하면_그녀는_그것이_너무_무서워하기_때문입니다.mp3"
      },
      {
        "kr": "그들은 내 생일 파티에 오지 않았어요, 왜냐하면 그들은 바빴기 때문입니다.",
        "romaji": "Geudeureun nae saengil patie oji anhasseoyo, waenyahamyeon geudeureun bappatgi ttaemunibnida.",
        "en": "They did not come to my birthday party because they were busy.",
        "grammar_audio": "/audio/korean/grammar/s_지_않다_ji_anta_Negative_form_20250209_그들은_내_생일_파티에_오지_않았어요_왜냐하면_그들은_바빴기_때문입니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~지 않아도 되다 [ji anado dweda] (Do not have to)",
    "short_explanation": "Indicates that something does not have to be done or is not necessary.",
    "long_explanation": "'~지 않아도 되다 [ji anado dweda]' is used when you want to express that there is no obligation or necessity to do something. It emphasizes the optional nature of an action or state.",
    "formation": "Verb stem + 지 않아도 되다",
    "examples": [
      {
        "kr": "너무 걱정하지 않아도 돼, 모든 것이 잘 될 거야.",
        "romaji": "Neomu geokjeonghaji anado dwae, modeun geosi jal doel geoya.",
        "en": "You don't have to worry too much; everything will be fine.",
        "grammar_audio": "/audio/korean/grammar/s_지_않아도_되다_ji_anado_dweda_Do_not_have_to_20250209_너무_걱정하지_않아도_돼_모든_것이_잘_될_거야.mp3"
      },
      {
        "kr": "지금 당장 먹지 않아도 돼, 나중에 먹어도 괜찮아.",
        "romaji": "Jigeum dangjang meokji anado dwae, najunge meogeodo gwaenchanha.",
        "en": "You don't have to eat right now; you can eat later.",
        "grammar_audio": "/audio/korean/grammar/s_지_않아도_되다_ji_anado_dweda_Do_not_have_to_20250209_지금_당장_먹지_않아도_돼_나중에_먹어도_괜찮아.mp3"
      },
      {
        "kr": "다른 사람들이 하는 것을 따라하지 않아도 돼, 너 자신을 믿어.",
        "romaji": "Dareun saramdeuli haneun geoseul ttarahaji anado dwae, neo jasineul mideo.",
        "en": "You don't have to follow what others are doing; believe in yourself.",
        "grammar_audio": "/audio/korean/grammar/s_지_않아도_되다_ji_anado_dweda_Do_not_have_to_20250209_다른_사람들이_하는_것을_따라하지_않아도_돼_너_자신을_믿어.mp3"
      },
      {
        "kr": "어디로 가지 않아도 돼, 집에서 편하게 쉬어.",
        "romaji": "Eodiro gaji anado dwae, jibeseo pyeonhage swieo.",
        "en": "You don't have to go anywhere; just rest comfortably at home.",
        "grammar_audio": "/audio/korean/grammar/s_지_않아도_되다_ji_anado_dweda_Do_not_have_to_20250209_어디로_가지_않아도_돼_집에서_편하게_쉬어.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~지 않을까 [ji anheulkka] (Perhaps)",
    "short_explanation": "Used to express a guess, supposition, or conjecture; 'perhaps', 'maybe'.",
    "long_explanation": "'~지 않을까 [ji anheulkka]' is a common ending in Korean used to express an educated guess or prediction. It is similar to saying 'perhaps,' 'maybe,' or 'I wonder if...' in English, based on the speaker's available information.",
    "formation": "Verb stem + 지 않을까",
    "examples": [
      {
        "kr": "오늘 밤에 비가 오지 않을까 싶어요, 하늘이 완전히 회색이니까.",
        "romaji": "Oneul bame biga oji anheulkka sip-eoyo, haneul-i wanjeonhi hoesaeg-inikka.",
        "en": "I think it might rain tonight since the sky is completely gray.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_ji_anheulkka_Perhaps_20250209_오늘_밤에_비가_오지_않을까_싶어요_하늘이_완전히_회색이니까.mp3"
      },
      {
        "kr": "그녀가 내 생각을 하고 있지 않을까 궁금해요, 오랜만에 만났으니까.",
        "romaji": "Geunyeoga nae saenggag-eul hago itji anheulkka gung-geumhaeyo, oraenman-e mannat-eunikka.",
        "en": "I wonder if she is thinking about me since we met after a long time.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_ji_anheulkka_Perhaps_20250209_그녀가_내_생각을_하고_있지_않을까_궁금해요_오랜만에_만났으니까.mp3"
      },
      {
        "kr": "내일 시험이 취소되지 않을까 기대해요, 어제는 너무 늦게 공부했으니까.",
        "romaji": "Naeil siheom-i chwisodoejji anh-eulkka gidaehaeyo, eojeneun neomu neutge gongbuhaess-eunikka.",
        "en": "I wonder if tomorrow's exam might get canceled because I stayed up too late studying yesterday.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_ji_anheulkka_Perhaps_20250209_내일_시험이_취소되지_않을까_기대해요_어제는_너무_늦게_공부했으니까.mp3"
      },
      {
        "kr": "지금 집에 가면 아빠가 저녁을 만들어 놓지 않을까 생각해요, 오늘은 제 생일이니까.",
        "romaji": "Jigeum jib-e gamyeon appa-ga jeonyeog-eul mandeul-eo nohji anheulkka saenggaghaeyo, oneul-eun je saeng-il-inikka.",
        "en": "I wonder if my dad might have prepared dinner if I go home now, since it's my birthday today.",
        "grammar_audio": "/audio/korean/grammar/s_지_않을까_ji_anheulkka_Perhaps_20250209_지금_집에_가면_아빠가_저녁을_만들어_놓지_않을까_생각해요_오늘은_제_생일이니까.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~지만 [jimyeon] (But, however)",
    "short_explanation": "Used to express contrast or contradiction; 'but', 'however'.",
    "long_explanation": "'~지만 [jimyeon]' is a conjunction used in Korean to connect two clauses where the second clause presents a contrast or unexpected result compared to the first. It is similar to 'but' or 'however' in English.",
    "formation": "Verb stem + 지만",
    "examples": [
      {
        "kr": "오늘의 날씨는 흐리지만, 기분은 매우 좋아요.",
        "romaji": "Oneul-ui nalssineun heulijiman, gibuneun maeu joayo.",
        "en": "Even though today's weather is cloudy, I feel very good.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jimyeon_But_however_20250209_오늘의_날씨는_흐리지만_기분은_매우_좋아요.mp3"
      },
      {
        "kr": "그 영화는 재미없었지만, 그 배우의 연기는 훌륭했어요.",
        "romaji": "Geu yeonghwaneun jaemiopseotjiman, geu baeuui yeongineun hulryunghaesseoyo.",
        "en": "Although the movie wasn't interesting, the actor's performance was great.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jimyeon_But_however_20250209_그_영화는_재미없었지만_그_배우의_연기는_훌륭했어요.mp3"
      },
      {
        "kr": "고기를 좋아하지만, 가끔 비건 음식을 먹습니다.",
        "romaji": "Gogireul johahajiman, gaggeum bigeon eumsigeul meogseumnida.",
        "en": "I like meat, but sometimes I eat vegan food.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jimyeon_But_however_20250209_고기를_좋아하지만_가끔_비건_음식을_먹습니다.mp3"
      },
      {
        "kr": "아들은 친절하지만, 때때로 소심해집니다.",
        "romaji": "Adeureun chinjeolhajiman, ttaettaero sosimhaejibnida.",
        "en": "My son is kind, but sometimes he becomes timid.",
        "grammar_audio": "/audio/korean/grammar/s_지만_jimyeon_But_however_20250209_아들은_친절하지만_때때로_소심해집니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~지요 [jiyo] (~right?, isn't it?)",
    "short_explanation": "Used to echo or affirm the argument; '~right?', 'isn't it?'.",
    "long_explanation": "The ending '~지요 [jiyo]' is used in Korean to echo or affirm the statement preceding it. This is similar to English phrases like 'right?' or 'isn't it?'. The speaker uses this ending to seek agreement or affirmation from the listener. It is usually used in declarative or interrogative sentences and can be used in both formal and informal contexts.",
    "formation": "Stem verb/adjective + 지요",
    "examples": [
      {
        "kr": "오늘 날씨가 정말 좋지요, 태양이 환하게 빛나고, 바람도 시원하니까요.",
        "romaji": "Oneul nalssiga jeongmal jotjiyo, taeyangi hwanhage bitnago, baramdo siwonhanikkayo.",
        "en": "The weather today is really nice, right? The sun is shining brightly, and the wind is refreshing.",
        "grammar_audio": "/audio/korean/grammar/s_지요_jiyo_right_isnt_it_20250209_오늘_날씨가_정말_좋지요_태양이_환하게_빛나고_바람도_시원하니까요.mp3"
      },
      {
        "kr": "새로 오픈한 그 카페의 커피가 맛있지요, 한 번 가 볼 만하다고 생각해요.",
        "romaji": "Saero openhan geu kapeui keopi-ga matitjiyo, hanbeon ga bol mandahago saenggakhaeyo.",
        "en": "The coffee at the newly opened café is delicious, right? I think it's worth a visit.",
        "grammar_audio": "/audio/korean/grammar/s_지요_jiyo_right_isnt_it_20250209_새로_오픈한_그_카페의_커피가_맛있지요_한_번_가_볼_만하다고_생각해요.mp3"
      },
      {
        "kr": "강아지가 정말 귀엽지요, 매일 보고 싶어져요.",
        "romaji": "Gangajiga jeongmal gwiyeopjiyo, maeil bogo sipheojyeoyo.",
        "en": "The puppy is really cute, right? I want to see it every day.",
        "grammar_audio": "/audio/korean/grammar/s_지요_jiyo_right_isnt_it_20250209_강아지가_정말_귀엽지요_매일_보고_싶어져요.mp3"
      },
      {
        "kr": "우리 아이가 키가 크지요, 아빠를 닮아서 그런 것 같아요.",
        "romaji": "Uri aiga kiga keutjiyo, appa-reul dalma-seo geureon geot gatayo.",
        "en": "Our child is really tall, right? I think it is because he looks like his father.",
        "grammar_audio": "/audio/korean/grammar/s_지요_jiyo_right_isnt_it_20250209_우리_아이가_키가_크지요_아빠를_닮아서_그런_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~진 않다 [jin anta] (Not really)",
    "short_explanation": "This pattern is used when something is not exactly or not demonstrably true.",
    "long_explanation": "The ~진 않다 [jin anta] form is used when describing a condition or situation that is not fully or exactly as described by the preceding adjective or verb. It is equivalent to the English expressions 'not really', 'not quite', 'not necessarily', or 'not exactly'. The level of negation is softer than the standard negative form and is often used when the speaker does not want to fully agree or disagree.",
    "formation": "Adjective/Verb stem + 진 않다",
    "examples": [
      {
        "kr": "그 곳은 많이 더워지진 않지만, 여름에는 항상 습해요.",
        "romaji": "Geu goseun mani deowojijin antjiman, yeoreumeun hangsang seubhaeyo.",
        "en": "It doesn't get very hot there, but it is always humid in summer.",
        "grammar_audio": "/audio/korean/grammar/s_진_않다_jin_anta_Not_really_20250209_그_곳은_많이_더워지진_않지만_여름에는_항상_습해요.mp3"
      },
      {
        "kr": "나는 그녀를 좋아하진 않아도 그녀의 사고 방식을 존경해요.",
        "romaji": "Naneun geunyeoreul johahajin anado, geunyeoui sago bangsigeul jongyeonghaeyo.",
        "en": "I don't particularly like her, but I respect her way of thinking.",
        "grammar_audio": "/audio/korean/grammar/s_진_않다_jin_anta_Not_really_20250209_나는_그녀를_좋아하진_않아도_그녀의_사고_방식을_존경해요.mp3"
      },
      {
        "kr": "요즘 너무 바빠서 체육관에 자주 가지 않아도, 집에서 운동은 해요.",
        "romaji": "Yojeum neomu bappaseo cheyukgane jaju gaji anado, jibeseo undongeun haeyo.",
        "en": "I am too busy these days to go to the gym regularly, but I do exercise at home.",
        "grammar_audio": "/audio/korean/grammar/s_진_않다_jin_anta_Not_really_20250209_요즘_너무_바빠서_체육관에_자주_가지_않아도_집에서_운동은_해요.mp3"
      },
      {
        "kr": "이 식당은 꼭 기억에 남을 정도는 아니지만, 음식은 맛있어요.",
        "romaji": "I sikdangeun kkok gieoge nameul jeongdoneun anijiman, eumsigeun masisseoyo.",
        "en": "This restaurant may not be particularly memorable, but the food is delicious.",
        "grammar_audio": "/audio/korean/grammar/s_진_않다_jin_anta_Not_really_20250209_이_식당은_꼭_기억에_남을_정도는_아니지만_음식은_맛있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~처럼 [cheoreom] (Like, as if)",
    "short_explanation": "Used to express similarities or comparisons; 'like', 'as if'.",
    "long_explanation": "'~처럼 [cheoreom]' is a postposition used to indicate that something is similar to or behaves in the same manner as the mentioned subject or object. It conveys a sense of comparison or simile, similar to 'like' or 'as if' in English.",
    "formation": "Noun/Verb + 처럼",
    "examples": [
      {
        "kr": "그녀는 나비처럼 춤을 춰요, 그녀의 리듬감과 움직임은 정말 아름다워요.",
        "romaji": "Geunyeoneun nabicheoreom chumeul chwoyo, geunyeoui rideumgamgwa umjigimeun jeongmal areumdawoyo.",
        "en": "She dances like a butterfly; her sense of rhythm and movements are really beautiful.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_if_20250209_그녀는_나비처럼_춤을_춰요_그녀의_리듬감과_움직임은_정말_아름다워요.mp3"
      },
      {
        "kr": "아버지는 항상 든든한 나무처럼 가족을 지켜줘요.",
        "romaji": "Abeojineun hangsang deundeunhan namucheoreom gajogeul jikyeojwoyo.",
        "en": "My father always protects the family like a sturdy tree.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_if_20250209_아버지는_항상_든든한_나무처럼_가족을_지켜줘요.mp3"
      },
      {
        "kr": "그는 배가 고파서 사자처럼 고기를 먹었어요.",
        "romaji": "Geuneun baega gopaseo sajacheoreom gogireul meogeosseoyo.",
        "en": "He was so hungry, he ate the meat like a lion.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_if_20250209_그는_배가_고파서_사자처럼_고기를_먹었어요.mp3"
      },
      {
        "kr": "진실이 들키자, 그가 마치 쥐를 잡은 고양이처럼 미소를 지었어.",
        "romaji": "Jinsili deultkija, geuga machi jwireul jabeun goyangicheoreom misoreul jieosseo.",
        "en": "When the truth was exposed, he smiled as if he were a cat that had caught a mouse.",
        "grammar_audio": "/audio/korean/grammar/s_처럼_cheoreom_Like_as_if_20250209_진실이_들키자_그가_마치_쥐를_잡은_고양이처럼_미소를_지었어.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~아서/어서 [aseo/eoseo] (So, therefore)",
    "short_explanation": "Used to connect two clauses and show that the second clause is the result of the first; 'so', 'therefore'.",
    "long_explanation": "The ending '-아서/어서' is used in Korean to express cause and effect. It connects two clauses in a sentence where the second clause is the result or effect of what is described in the first clause. It is often translated as 'so' or 'therefore' in English, conveying a sense of consequence or reason.",
    "formation": "Verb stem + 아/어서",
    "examples": [
      {
        "kr": "저는 배가 너무 고파서 밥을 두 그릇이나 먹었어요.",
        "romaji": "Jeoneun baega neomu gopaseo babeul du geureusina meogeosseoyo.",
        "en": "I was so hungry that I ate two bowls of rice.",
        "grammar_audio": "/audio/korean/grammar/s_아서어서_aseoeoseo_So_therefore_20250209_저는_배가_너무_고파서_밥을_두_그릇이나_먹었어요.mp3"
      },
      {
        "kr": "친구가 너무 늦게 와서 영화가 이미 시작했어요.",
        "romaji": "Chinguga neomu neutge wasseo, yeonghwaga imi sijakhaesseoyo.",
        "en": "Because my friend came too late, the movie had already started.",
        "grammar_audio": "/audio/korean/grammar/s_아서어서_aseoeoseo_So_therefore_20250209_친구가_너무_늦게_와서_영화가_이미_시작했어요.mp3"
      },
      {
        "kr": "수업이 너무 어려워서 공부를 많이 했어요.",
        "romaji": "Sueobi neomu eoryeowoseo, gongbureul mani haesseoyo.",
        "en": "The class was so difficult that I studied a lot.",
        "grammar_audio": "/audio/korean/grammar/s_아서어서_aseoeoseo_So_therefore_20250209_수업이_너무_어려워서_공부를_많이_했어요.mp3"
      },
      {
        "kr": "날씨가 너무 추워서 집에만 있었어요.",
        "romaji": "Nalssiga neomu chuweoseo, jibeoman isseosseoyo.",
        "en": "The weather was so cold that I just stayed at home.",
        "grammar_audio": "/audio/korean/grammar/s_아서어서_aseoeoseo_So_therefore_20250209_날씨가_너무_추워서_집에만_있었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~것 같다 [geot gatda] (Seems like)",
    "short_explanation": "Expresses the speaker's guess or inference about a situation based on some evidence.",
    "long_explanation": "The construction '~것 같다' is used in Korean to express a guess or inference about a situation. The speaker uses it when they have some evidence or basis for their inference, even if the situation is not directly observable. It is equivalent to saying 'seems like' or 'appears to be' in English.",
    "formation": "Verb/Adjective stem + (으)ㄴ/는 + 것 같(아요)",
    "examples": [
      {
        "kr": "나는 오늘 아침부터 배가 아파. 아마 매운 음식을 먹어서 아픈 것 같아요.",
        "romaji": "Naneun oneul achimbuteo baega apa. Ama maeun eumsigeul meogeoseo apeun geot gatayo.",
        "en": "I've had a stomachache since this morning. It seems like it's because I ate spicy food.",
        "grammar_audio": "/audio/korean/grammar/s_것_같다_geot_gatda_Seems_like_20250209_나는_오늘_아침부터_배가_아파_아마_매운_음식을_먹어서_아픈_것_같아요.mp3"
      },
      {
        "kr": "그녀가 갑자기 분위기가 달라진 것 같아요. 무슨 일이 있었는지 아는 사람이 없어요.",
        "romaji": "Geunyeoga gapjagi bunwigiga dallajin geot gatayo. Museun iri isseossneunji aneun sarami eopseoyo.",
        "en": "She seems to have suddenly changed her mood. No one knows what happened.",
        "grammar_audio": "/audio/korean/grammar/s_것_같다_geot_gatda_Seems_like_20250209_그녀가_갑자기_분위기가_달라진_것_같아요_무슨_일이_있었는지_아는_사람이_없어요.mp3"
      },
      {
        "kr": "어제 비가 왔는데 오늘은 반짝반짝한 것 같아요.",
        "romaji": "Eoje biga watneunde oneureun banjjak banjjakhan geot gatayo.",
        "en": "It rained yesterday, but today it seems to be sparkling.",
        "grammar_audio": "/audio/korean/grammar/s_것_같다_geot_gatda_Seems_like_20250209_어제_비가_왔는데_오늘은_반짝반짝한_것_같아요.mp3"
      },
      {
        "kr": "밖에 사람들이 없는 것 같아요. 모두 어디로 갔는지 모르겠어요.",
        "romaji": "Bakke saramdeuli eomneun geot gatayo. Modu eodiro gassneunji moreugesseoyo.",
        "en": "It seems like there's no one outside. I don't know where everyone has gone.",
        "grammar_audio": "/audio/korean/grammar/s_것_같다_geot_gatda_Seems_like_20250209_밖에_사람들이_없는_것_같아요_모두_어디로_갔는지_모르겠어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "125"
  },
  {
    "title": "~커녕 [keonyeong] (Let alone, far from)",
    "short_explanation": "Used to express an idea contrary to expectation; 'let alone', 'far from'.",
    "long_explanation": "'~커녕 [keonyeong]' is a connector used in Korean to indicate that a certain expectation is not met—in fact, the reality is far from that expectation. It is often translated as 'let alone' or 'far from' in English and is used when one thing is not done, let alone something even more unlikely or difficult.",
    "formation": "Noun or clause + 커녕",
    "examples": [
      {
        "kr": "지영이는 한국어를 통해 간단한 대화를 나누는 것 커녕, '안녕하세요' 정도밖에 하지 못해요.",
        "romaji": "Jiyeongineun hangugeo-reul tonghae gandanhan daehwareul nanuneun geot keonyeong, 'annyeonghaseyo' jeongdo bakke haji mot haeyo.",
        "en": "Far from having a simple conversation in Korean, Jiyoung can barely say 'hello'.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Let_alone_far_from_20250209_지영이는_한국어를_통해_간단한_대화를_나누는_것_커녕_안녕하세요_정도밖에_하지_못해요.mp3"
      },
      {
        "kr": "나는 주말에 책을 읽을 시간이 있다 커녕, 집안일에 치여서 어려워요.",
        "romaji": "Naneun jumare chaekeul ilgeul sigani itda keonyeong, jibanire chiyeoseo eoryeowoyo.",
        "en": "Far from having time to read a book on the weekend, I'm overwhelmed by housework.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Let_alone_far_from_20250209_나는_주말에_책을_읽을_시간이_있다_커녕_집안일에_치여서_어려워요.mp3"
      },
      {
        "kr": "성진이는 시험 공부를 마치고 잔다 커녕, 게임을 하다가 밤새우기도 해요.",
        "romaji": "Seongjineun siheom gongbureul machigo janda keonyeong, geimeul hadaga bamsaeugido haeyo.",
        "en": "Far from going to sleep after studying for the exam, Seongjin often stays up all night playing games.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Let_alone_far_from_20250209_성진이는_시험_공부를_마치고_잔다_커녕_게임을_하다가_밤새우기도_해요.mp3"
      },
      {
        "kr": "그녀는 살을 빼려는 것 커녕, 매일 밤마다 간식을 먹어요.",
        "romaji": "Geunyeoneun sareul bbaeryeoneun geot keonyeong, maeil bammada gansigeul meogeoyo.",
        "en": "Far from trying to lose weight, she eats snacks every night.",
        "grammar_audio": "/audio/korean/grammar/s_커녕_keonyeong_Let_alone_far_from_20250209_그녀는_살을_빼려는_것_커녕_매일_밤마다_간식을_먹어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~게 되다 [ge gatda] (Become, end up)",
    "short_explanation": "Means 'to become' or 'to end up' and is used to express the result of a change or transformation.",
    "long_explanation": "The construction '~게 되다' is used in Korean to indicate the end result of a change or transformation, often due to certain circumstances beyond the speaker's control. It is comparable to saying 'to become', 'to get', or 'to end up' in English.",
    "formation": "Verb or adjective stem + 게 되다",
    "examples": [
      {
        "kr": "어제 친구들과 멀리서 축구를 했는데, 너무 피곤해져서 지금은 잠밖에 잘 수 없겠어요.",
        "romaji": "Eoje chingudeulgwa meolliseo chuggureul haenneunde, neomu pigonhaejyeoseo jigeumeun jambakke jal su eopgesseoyo.",
        "en": "I played soccer with my friends yesterday and became so tired that now I think I can only sleep.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_gatda_Become_end_up_20250209_어제_친구들과_멀리서_축구를_했는데_너무_피곤해져서_지금은_잠밖에_잘_수_없겠어요.mp3"
      },
      {
        "kr": "그는 열심히 공부해서 성공적으로 비즈니스맨이 되었어요.",
        "romaji": "Geuneun yeolsimhi gongbuhaseo seonggongjeok-euro bijeuniseumani doeosseoyo.",
        "en": "He studied hard and successfully became a businessman.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_gatda_Become_end_up_20250209_그는_열심히_공부해서_성공적으로_비즈니스맨이_되었어요.mp3"
      },
      {
        "kr": "그 책을 읽고 나서 고뇌에 빠지게 되었어요.",
        "romaji": "Geu chaegeul ikgo naseo gonoe-e ppajige doeosseoyo.",
        "en": "After reading that book, I ended up falling into deep distress.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_gatda_Become_end_up_20250209_그_책을_읽고_나서_고뇌에_빠지게_되었어요.mp3"
      },
      {
        "kr": "긴 시간 동안 추위에 노출되어 우리의 건강이 나빠지게 되었어요.",
        "romaji": "Gin sigan dongan chuwie nochuldoeeo uriui geongangi nappajige doeosseoyo.",
        "en": "We were exposed to the cold for so long that our health ended up deteriorating.",
        "grammar_audio": "/audio/korean/grammar/s_게_되다_ge_gatda_Become_end_up_20250209_긴_시간_동안_추위에_노출되어_우리의_건강이_나빠지게_되었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~게 하다 [ge hada] (Make)",
    "short_explanation": "Used to express causing someone or something to be in a certain state.",
    "long_explanation": "'~게 하다' is a grammatical construction in Korean that means to make or cause someone or something to be in a particular state. It is used with descriptive verbs (or adjectives) to indicate a change in state. This is similar to the English verb 'make' or the phrase 'cause to be.'",
    "formation": "Descriptive verb (or adjective) stem + 하게 하다",
    "examples": [
      {
        "kr": "그녀는 저를 행복하게 해요.",
        "romaji": "Geunyeoneun jeoreul haengbokhage haeyo.",
        "en": "She makes me happy.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make_20250209_그녀는_저를_행복하게_해요.mp3"
      },
      {
        "kr": "셰프가 이 감자 스프를 맛있게 해요.",
        "romaji": "Syepeuga i gamja seupeureul masitge haeyo.",
        "en": "The chef makes this potato soup taste delicious.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make_20250209_셰프가_이_감자_스프를_맛있게_해요.mp3"
      },
      {
        "kr": "엄마가 저를 준비하게 했기 때문에, 시험에 통과할 수 있었어요.",
        "romaji": "Eommaga jeoreul junbi hage haetgi ttaemune, siheome tonggwahal su isseosseoyo.",
        "en": "Because my mom made me prepare, I was able to pass the exam.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make_20250209_엄마가_저를_준비하게_했기_때문에_시험에_통과할_수_있었어요.mp3"
      },
      {
        "kr": "교수님이 저를 집중하게 했기 때문에, 저는 모든 정보를 기억할 수 있었습니다.",
        "romaji": "Gyosunimi jeoreul jipjunghage haetgi ttaemune, jeoneun modeun jeongboreul gieokhal su isseotseumnida.",
        "en": "Because the professor made me focus, I was able to remember all the information.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_Make_20250209_교수님이_저를_집중하게_했기_때문에_저는_모든_정보를_기억할_수_있었습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~게 하다 [ge hada] (To make someone do something)",
    "short_explanation": "Used to indicate causing someone or something to perform an action.",
    "long_explanation": "'~게 하다' is used to express the act of making or causing someone to do something. It is typically used with nouns or action verb stems to show that one party induces or forces another to take an action. This is similar to saying 'make (someone) do' in English.",
    "formation": "Noun/Action Verb stem + (으)게 하다",
    "examples": [
      {
        "kr": "여자친구가 커피를 좋아하니까, 매일 아침 커피를 마시게 했어요.",
        "romaji": "Yeojachinguga keopireul joahnikka, maeil achim keopireul masike haesseoyo.",
        "en": "Because my girlfriend likes coffee, I made her drink coffee every morning.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_someone_do_something_20250209_여자친구가_커피를_좋아하니까_매일_아침_커피를_마시게_했어요.mp3"
      },
      {
        "kr": "부모님이 학벌이 중요하다고 생각해서, 아이들을 혼자 공부하게 했어요.",
        "romaji": "Bumonimi hakbeoli jungyohadago saenggakhaeseo, aideureul honja gongbuhage haesseoyo.",
        "en": "Because the parents think that education is important, they made their children study alone.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_someone_do_something_20250209_부모님이_학벌이_중요하다고_생각해서_아이들을_혼자_공부하게_했어요.mp3"
      },
      {
        "kr": "친구가 해외여행을 하고 싶어서, 저는 그를 도와 비행기표를 예약하게 했습니다.",
        "romaji": "Chinguga haeoeyeohaeng-eul hago sip-eoseo, jeoneun geureul dowahwa bihaenggipyo-reul yeyaghage haesseumnida.",
        "en": "Because my friend wanted to travel abroad, I helped him make a reservation for an airline ticket.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_someone_do_something_20250209_친구가_해외여행을_하고_싶어서_저는_그를_도와_비행기표를_예약하게_했습니다.mp3"
      },
      {
        "kr": "선생님이 학생들을 일찍 일어나게 했어요.",
        "romaji": "Seonsaengnimi haksaengdeureul iljjik ireonage haesseoyo.",
        "en": "The teacher made the students wake up early.",
        "grammar_audio": "/audio/korean/grammar/s_게_하다_ge_hada_To_make_someone_do_something_20250209_선생님이_학생들을_일찍_일어나게_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~키가 크다/작다 [kiga keuda/jakda] (To be tall/short)",
    "short_explanation": "Expressions used to describe a person’s height, literally meaning 'big in size' (tall) and 'small in size' (short).",
    "long_explanation": "'키가 크다 [kiga keuda]' and '키가 작다 [kiga jakda]' are simple expressions in Korean used to indicate the height of a person. '키가 크다' describes someone as tall, while '키가 작다' indicates someone is short. These expressions directly refer to physical characteristics, specifically height.",
    "formation": "Noun + 키가 크다 / 키가 작다",
    "examples": [
      {
        "kr": "우리 학교에서 제일 키가 큰 사람은 우리 반의 철수야.",
        "romaji": "Uri hakgyoeseo jeil kiga keun saram-eun uri banui Cheolsu-ya.",
        "en": "The tallest person in our school is Cheolsu from our class.",
        "grammar_audio": "/audio/korean/grammar/s_키가_크다작다_kiga_keudajakda_To_be_tallshort_20250209_우리_학교에서_제일_키가_큰_사람은_우리_반의_철수야.mp3"
      },
      {
        "kr": "그녀는 키가 커서 모델처럼 보여요.",
        "romaji": "Geunyeoneun kiga keoseo modelcheoreom boyeoyo.",
        "en": "She is tall, so she looks like a model.",
        "grammar_audio": "/audio/korean/grammar/s_키가_크다작다_kiga_keudajakda_To_be_tallshort_20250209_그녀는_키가_커서_모델처럼_보여요.mp3"
      },
      {
        "kr": "나는 키가 작아서 아직도 어린이 좌석을 이용할 수 있어요.",
        "romaji": "Naneun kiga jakaseo ajikdo eorini jwaseogeul iyonghal su isseoyo.",
        "en": "I am short, so I can still use the children's seat.",
        "grammar_audio": "/audio/korean/grammar/s_키가_크다작다_kiga_keudajakda_To_be_tallshort_20250209_나는_키가_작아서_아직도_어린이_좌석을_이용할_수_있어요.mp3"
      },
      {
        "kr": "그는 키가 작아도 그의 인간성은 큰 것 같아요.",
        "romaji": "Geuneun kiga jakado geuui inganseong-eun keun geot gatayo.",
        "en": "Even though he is short, his character seems big.",
        "grammar_audio": "/audio/korean/grammar/s_키가_크다작다_kiga_keudajakda_To_be_tallshort_20250209_그는_키가_작아도_그의_인간성은_큰_것_같아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~키로 [kiro] (By means of, with)",
    "short_explanation": "Used to express the method, means, or instrument by which an action is performed.",
    "long_explanation": "'~키로' is a grammatical marker in Korean that indicates the tool, means, or method by which an action is carried out. It is similar to the English phrases 'by means of' or 'with' and provides additional information about how something is done.",
    "formation": "Verb stem (without ‘다’) + 키로",
    "examples": [
      {
        "kr": "저는 매일 아침 한 번 피아노를 치기로 해서 음악 실력을 향상시켰습니다.",
        "romaji": "Jeoneun maeil achim han beon pianoreul chikiro haeseo eumak silryeogeul hyangsangshyeotseumnida.",
        "en": "I decided to play the piano once every morning to improve my musical skills.",
        "grammar_audio": "/audio/korean/grammar/s_키로_kiro_By_means_of_with_20250209_저는_매일_아침_한_번_피아노를_치기로_해서_음악_실력을_향상시켰습니다.mp3"
      },
      {
        "kr": "우리는 이 사건을 해결하기 위해 대화하기로 결정했습니다.",
        "romaji": "Urineun i sageoneul haegyeolhagi wihae daehwagikiro gyeoljeonghaetseumnida.",
        "en": "We decided to resolve this issue by means of conversation.",
        "grammar_audio": "/audio/korean/grammar/s_키로_kiro_By_means_of_with_20250209_우리는_이_사건을_해결하기_위해_대화하기로_결정했습니다.mp3"
      },
      {
        "kr": "그녀는 매주 월요일 글을 쓰기로 시작해서 글쓰기 실력을 키웠습니다.",
        "romaji": "Geunyeoneun maeju woryoil geuleul sseugikiro sijakhaeseo geulsseugi silryeogeul kiwotseumnida.",
        "en": "She began writing every Monday, thereby improving her writing skills.",
        "grammar_audio": "/audio/korean/grammar/s_키로_kiro_By_means_of_with_20250209_그녀는_매주_월요일_글을_쓰기로_시작해서_글쓰기_실력을_키웠습니다.mp3"
      },
      {
        "kr": "난 작년부터 매일 운동하기로 했고, 건강이 크게 개선되었습니다.",
        "romaji": "Nan jaknyeonbuteo maeil undonghagikiro haetgo, geongangi keuge gaeseondwoetseumnida.",
        "en": "I decided to exercise daily from last year, and my health has greatly improved.",
        "grammar_audio": "/audio/korean/grammar/s_키로_kiro_By_means_of_with_20250209_난_작년부터_매일_운동하기로_했고_건강이_크게_개선되었습니다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~타다 [tada] (To take, ride)",
    "short_explanation": "Used to express the action of taking or riding a mode of transportation.",
    "long_explanation": "'~타다' is a verb used in Korean to indicate the action of taking or riding transportation (such as a bus, train, taxi, or bicycle) or using mechanical/electronic devices. It is typically attached to a noun that indicates the type of transport or device.",
    "formation": "Noun indicating transport or mechanical device + ~타다",
    "examples": [
      {
        "kr": "저는 일주일에 비행기를 두 번 타다 보니까 비행기에 익숙해진 것 같아요. 아무래도 직장이 멀어서 비행기를 종종 타야 합니다.",
        "romaji": "Jeoneun iljuile bihaenggireul du beon tada bomyeon, bihaenggie igsukhajin geot gatayo. Amuraedo jikjangi meolseo bihaenggireul jongjong taya hamnida.",
        "en": "Since I take a plane twice a week, I think I have become familiar with flying. Because my workplace is far, I often have to take planes.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_저는_일주일에_비행기를_두_번_타다_보니까_비행기에_익숙해진_것_같아요_아무래도_직장이_멀어서_비행기를_종종_타야_합니다.mp3"
      },
      {
        "kr": "아무래도 자전거를 타다 보면 체력도 좋아지고, 건강에도 좋으니까 자전거를 자주 타보세요. 그리고 자전거를 타는 것이 운동으로도 좋습니다.",
        "romaji": "Amuraedo jajeongeoreul tada bomyeon cheryeokdo joajigo, geongaedo joheunikka jajeongeoreul jaju taboseyo. Geurigo jajeongeoreul taneun geosi undongeurodo joheumnida.",
        "en": "Riding a bicycle improves your stamina and is good for your health, so try riding one often. Also, riding a bicycle is excellent exercise.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_아무래도_자전거를_타다_보면_체력도_좋아지고_건강에도_좋으니까_자전거를_자주_타보세요_그리고_자전거를_타는_것이_운동으로도_좋습니다.mp3"
      },
      {
        "kr": "택시를 이렇게 자주 타다 보면 돈이 많이 드는 것 같아요. 그러니까 가능하면 지하철을 타거나 도보로 가시는 것이 좋을 것 같습니다.",
        "romaji": "Taeksireul ireohge jaju tada bomyeon doni manhi deuneun geot gatayo. Geureonikka ganeunghamyeon jihacheoreul tageona doboreo gasineun geosi joheul geot gatseumnida.",
        "en": "If you take a taxi this often, it seems like it costs a lot. So, if possible, it would be better to take the subway or walk.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_택시를_이렇게_자주_타다_보면_돈이_많이_드는_것_같아요_그러니까_가능하면_지하철을_타거나_도보로_가시는_것이_좋을_것_같습니다.mp3"
      },
      {
        "kr": "이렇게 늦은 밤에 버스에 혼자 타다 보면 아무래도 좀 불안하겠죠? 그러니 이런 늦은 시간에는 가능하면 택시를 타는 것이 더 좋아요.",
        "romaji": "Ireohge neutun bame beoseue honja tada bomyeon amuraedo jom buranhagessjyo? Geureoni ireon neutun sigueneun ganeunghamyeon taeksireul taneun geosi deo joayo.",
        "en": "If you ride a bus alone this late at night, it probably feels a bit unsafe. So at such a late hour, it’s better to take a taxi if possible.",
        "grammar_audio": "/audio/korean/grammar/s_타다_tada_To_take_ride_20250209_이렇게_늦은_밤에_버스에_혼자_타다_보면_아무래도_좀_불안하겠죠_그러니_이런_늦은_시간에는_가능하면_택시를_타는_것이_더_좋아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~테니까 [tenikka] (Because)",
    "short_explanation": "Used to explain the reason or cause of an action or state.",
    "long_explanation": "The form '~테니까' is used in Korean to express 'because.' It clarifies the reason for a situation, behavior, or outcome. The clause before '~테니까' usually contains known or unimportant information, while the important or new information follows. This pattern emphasizes a strong cause–effect relationship compared to the simpler '~서' pattern.",
    "formation": "Verb Stem + 테니까",
    "examples": [
      {
        "kr": "밖이 추우니까 옷을 더 입고 가세요.",
        "romaji": "Bakk-i chuuni-kka ot-eul deo ibgo gaseyo.",
        "en": "Because it's cold outside, wear more clothes.",
        "grammar_audio": "/audio/korean/grammar/s_테니까_tenikka_Because_20250209_밖이_추우니까_옷을_더_입고_가세요.mp3"
      },
      {
        "kr": "너무 늦게 잤으니까 아침에 일어나기 힘들었어요.",
        "romaji": "Neomu neutge jasseuni-kka achim-e ireonagi himdeureosseoyo.",
        "en": "Because I slept too late, it was hard to get up in the morning.",
        "grammar_audio": "/audio/korean/grammar/s_테니까_tenikka_Because_20250209_너무_늦게_잤으니까_아침에_일어나기_힘들었어요.mp3"
      },
      {
        "kr": "서울에서 살고 있으니까 가끔 한강에 산책하러 가요.",
        "romaji": "Seoureseo salgo isseuni-kka gakkeum Hangang-e sanchaekhareo gayo.",
        "en": "Because I live in Seoul, I occasionally go for a walk by the Han River.",
        "grammar_audio": "/audio/korean/grammar/s_테니까_tenikka_Because_20250209_서울에서_살고_있으니까_가끔_한강에_산책하러_가요.mp3"
      },
      {
        "kr": "한국어 공부가 즐거우니까 매일 열심히 공부하고 있어요.",
        "romaji": "Hangugeo gongbuga jeulgeounikka maeil yeolsimhi gongbuhago isseoyo.",
        "en": "Because studying Korean is enjoyable, I study hard every day.",
        "grammar_audio": "/audio/korean/grammar/s_테니까_tenikka_Because_20250209_한국어_공부가_즐거우니까_매일_열심히_공부하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~토록 [torok] (So that, to the extent that)",
    "short_explanation": "Used to express 'so that' or 'to the extent that'.",
    "long_explanation": "'~토록' is a postposition used to indicate a degree or condition that compels a certain result or action. It is synonymous with 'so that' or 'to the extent that' in English and is often used to emphasize a high degree or strong cause–effect relationship.",
    "formation": "Verb/Adjective + 토록 (inserted within the sentence)",
    "examples": [
      {
        "kr": "그는 프로젝트를 성공시키고 싶어서, 자신의 건강까지 희생하토록 노력했어요.",
        "romaji": "Geuneun peurojegteureul seonggongsikigo sip-eoseo, jasinui geongangkkaji huisaenghatorok noryeokhaesseoyo.",
        "en": "He wanted the project to succeed so much that he worked hard to the extent of sacrificing even his health.",
        "grammar_audio": "/audio/korean/grammar/s_토록_torok_So_that_to_the_extent_that_20250209_그는_프로젝트를_성공시키고_싶어서_자신의_건강까지_희생하토록_노력했어요.mp3"
      },
      {
        "kr": "그녀는 회사에 늦지 않토록, 일찍 일어나기로 결정했어요.",
        "romaji": "Geunyeoneun hoesa-e neotji antorok, iljjik ireonagiro gyeoljeonghaesseoyo.",
        "en": "She loves her company so much that she decided to wake up early so as not to be late.",
        "grammar_audio": "/audio/korean/grammar/s_토록_torok_So_that_to_the_extent_that_20250209_그녀는_회사에_늦지_않토록_일찍_일어나기로_결정했어요.mp3"
      },
      {
        "kr": "인구가 심각하게 증가해서, 여기서 살 자리가 줄어들토록 되었어요.",
        "romaji": "Inguga simgakage jeungaheseo, yeogiseo sal jariga jur-eodeultorok doeeosseoyo.",
        "en": "The population increased so dramatically that the available living space here was reduced.",
        "grammar_audio": "/audio/korean/grammar/s_토록_torok_So_that_to_the_extent_that_20250209_인구가_심각하게_증가해서_여기서_살_자리가_줄어들토록_되었어요.mp3"
      },
      {
        "kr": "가난이 심해져서, 밥 한 그릇도 먹기 어려우토록 힘들었어요.",
        "romaji": "Ganani simhaejyeoseo, bab han geureutdo meoggi eoryeoutorok himdeureosseoyo.",
        "en": "Poverty was so severe that it became difficult to even eat a bowl of rice.",
        "grammar_audio": "/audio/korean/grammar/s_토록_torok_So_that_to_the_extent_that_20250209_가난이_심해져서_밥_한_그릇도_먹기_어려우토록_힘들었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하게 되다 [hage dweda] (End up doing)",
    "short_explanation": "Used to express that something happens as a result of circumstances, often beyond one’s control.",
    "long_explanation": "'~하게 되다' is a verb ending in Korean that indicates an action or state that comes about unexpectedly or unintentionally as a result of circumstances. It often implies that the result was not planned and may evoke a sense of surprise or resignation.",
    "formation": "Verb-아/어/해 + 하게 되다",
    "examples": [
      {
        "kr": "그렇게 많은 숙제가 쌓여서 나는 결국 주말 내내 숙제를 하게 되었어.",
        "romaji": "Geureohge manheun sukmjaega ssahyeoseo naneun gyeolguk jumal naenae sukmjaereul hage doeeosseeo.",
        "en": "So much homework piled up that I ended up doing homework all weekend.",
        "grammar_audio": "/audio/korean/grammar/s_하게_되다_hage_dweda_End_up_doing_20250209_그렇게_많은_숙제가_쌓여서_나는_결국_주말_내내_숙제를_하게_되었어.mp3"
      },
      {
        "kr": "보통은 말하지 않겠지만, 어제는 상황이 그래서 너에게 모든 걸 말하게 되었어.",
        "romaji": "Botong-eun malhaji anhgetjiman, eoje-neun sanghwang-i geuraeseo neo-ege modeun geol malhage doeeosseeo.",
        "en": "Normally I wouldn't say it, but yesterday the situation was such that I ended up telling you everything.",
        "grammar_audio": "/audio/korean/grammar/s_하게_되다_hage_dweda_End_up_doing_20250209_보통은_말하지_않겠지만_어제는_상황이_그래서_너에게_모든_걸_말하게_되었어.mp3"
      },
      {
        "kr": "처음에는 운동하기 싫었지만, 친구가 자꾸 권해서 헬스클럽 회원이 되게 되었어.",
        "romaji": "Cheoeum-eneun undonghagi silh-eossejiman, chinguga jakku gwonhaeseo hellseukeulleob hwe-won-i doegae doeeosseeo.",
        "en": "At first, I didn't want to exercise, but my friend kept encouraging me, so I ended up becoming a health club member.",
        "grammar_audio": "/audio/korean/grammar/s_하게_되다_hage_dweda_End_up_doing_20250209_처음에는_운동하기_싫었지만_친구가_자꾸_권해서_헬스클럽_회원이_되게_되었어.mp3"
      },
      {
        "kr": "시험을 공부하려고 했는데, 재미있는 드라마를 보게 되었어.",
        "romaji": "Siheom-eul gongbuharyeogo haessneunde, jaemiissneun deurama-reul boga doeeosseeo.",
        "en": "I was going to study for the exam, but I ended up watching an interesting drama.",
        "grammar_audio": "/audio/korean/grammar/s_하게_되다_hage_dweda_End_up_doing_20250209_시험을_공부하려고_했는데_재미있는_드라마를_보게_되었어.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하고 있다 [hago itda] (Is doing)",
    "short_explanation": "Used to describe a continuous or ongoing action.",
    "long_explanation": "'~하고 있다' is a grammar pattern used in Korean to express an ongoing action or a state that continues to exist. It is equivalent to the English 'is doing' or 'am/are doing'. This form focuses on the progression of the action, not on its result or completion.",
    "formation": "Verb stem + ~하고 있다",
    "examples": [
      {
        "kr": "요즘 한국어를 배우고 있어요, 그래서 아직 완벽하게 말할 수는 없어요.",
        "romaji": "Yojeum hangugeoreul baeugo isseoyo, geuraeseo ajik wanbyeokhage malhal suneun eopseoyo.",
        "en": "I am learning Korean these days, so I cannot speak it perfectly yet.",
        "grammar_audio": "/audio/korean/grammar/s_하고_있다_hago_itda_Is_doing_20250209_요즘_한국어를_배우고_있어요_그래서_아직_완벽하게_말할_수는_없어요.mp3"
      },
      {
        "kr": "지금 점심을 먹고 있어요, 바쁜 하루 중에 잠시 쉬는 시간이에요.",
        "romaji": "Jigeum jeomsimeul meokgo isseoyo, bappun haru junge jamsi swineun siganieyo.",
        "en": "I am eating lunch now; it's a short break during a busy day.",
        "grammar_audio": "/audio/korean/grammar/s_하고_있다_hago_itda_Is_doing_20250209_지금_점심을_먹고_있어요_바쁜_하루_중에_잠시_쉬는_시간이에요.mp3"
      },
      {
        "kr": "어머니는 저녁 요리를 준비하고 있어요, 맛있는 음식을 기대하고 있어요.",
        "romaji": "Eomeonineun jeonyeok yorireul junbihago isseoyo, masitneun eumsigeul gidaehago isseoyo.",
        "en": "My mother is preparing dinner, and I am looking forward to delicious food.",
        "grammar_audio": "/audio/korean/grammar/s_하고_있다_hago_itda_Is_doing_20250209_어머니는_저녁_요리를_준비하고_있어요_맛있는_음식을_기대하고_있어요.mp3"
      },
      {
        "kr": "우리 강아지는 밖에서 산책하고 있어요, 이렇게 해서 운동을 통해 건강을 유지하죠.",
        "romaji": "Uri gangajineun bakkeseo sancaekhago isseoyo, ireohge haeseo undongeul tonghae geongangeul yujijyo.",
        "en": "Our puppy is taking a walk outside; in doing so, it keeps healthy through exercise.",
        "grammar_audio": "/audio/korean/grammar/s_하고_있다_hago_itda_Is_doing_20250209_우리_강아지는_밖에서_산책하고_있어요_이렇게_해서_운동을_통해_건강을_유지하죠.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하고 나서 [hago naseo] (After doing)",
    "short_explanation": "Used to express sequence of actions; 'after doing'.",
    "long_explanation": "'~하고 나서 [hago naseo]' is a sentence pattern in Korean that means 'after doing something'. It is used to indicate that one action is completed before the next action takes place. The sequence is crucial, as the latter action happens only after the first is finished.",
    "formation": "Verb stem + 하고 나서 + (subsequent clause)",
    "examples": [
      {
        "kr": "공부하고 나서 놀러 갈 거예요, 그래서 시간을 잘 관리해야 해요.",
        "romaji": "Gongbuhago naseo nolreo gal geoyeyo, geuraeseo siganeul jal gwanrihaeya haeyo.",
        "en": "I will go out to play after studying, so I have to manage my time well.",
        "grammar_audio": "/audio/korean/grammar/s_하고_나서_hago_naseo_After_doing_20250209_공부하고_나서_놀러_갈_거예요_그래서_시간을_잘_관리해야_해요.mp3"
      },
      {
        "kr": "아침 식사를 하고 나서 운동을 합니다, 그렇게 하면 하루를 활기차게 시작할 수 있어요.",
        "romaji": "Achim sikshareul hago naseo undongeul hamnida, geureohge hamyeon harureul hwalgichage sijakhal su isseoyo.",
        "en": "I exercise after having breakfast; by doing so, I can start the day energetically.",
        "grammar_audio": "/audio/korean/grammar/s_하고_나서_hago_naseo_After_doing_20250209_아침_식사를_하고_나서_운동을_합니다_그렇게_하면_하루를_활기차게_시작할_수_있어요.mp3"
      },
      {
        "kr": "숙제를 다 하고 나서 친구들과 영화를 봤어요, 그래서 즐거운 시간을 보냈습니다.",
        "romaji": "Sukjereul da hago naseo chingudeulgwa yeonghwaleul bwasseoyo, geuraeseo jeulgeoun siganeul bonaessseubnida.",
        "en": "I watched a movie with friends after finishing all my homework, so we had a good time.",
        "grammar_audio": "/audio/korean/grammar/s_하고_나서_hago_naseo_After_doing_20250209_숙제를_다_하고_나서_친구들과_영화를_봤어요_그래서_즐거운_시간을_보냈습니다.mp3"
      },
      {
        "kr": "회의를 마치고 나서 점심을 먹었어요, 그런데 배가 너무 고파서 힘들었어요.",
        "romaji": "Hoeireul machigo naseo jeomsimeul meogeosseoyo, geureonde baega neomu gopaseo himdeureosseoyo.",
        "en": "I had lunch after finishing the meeting, but it was hard because I was so hungry.",
        "grammar_audio": "/audio/korean/grammar/s_하고_나서_hago_naseo_After_doing_20250209_회의를_마치고_나서_점심을_먹었어요_그런데_배가_너무_고파서_힘들었어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하고 싶다 [hago sipda] (Want to do)",
    "short_explanation": "Expresses a desire to perform a certain action.",
    "long_explanation": "'~하고 싶다 [hago sipda]' is a verb ending in Korean that indicates the speaker's desire or wish to perform a certain action. It is equivalent to 'want to do something' in English and is commonly used to express personal wishes or plans.",
    "formation": "Verb stem + 하고 싶다",
    "examples": [
      {
        "kr": "저는 한국어를 유창하게 말하고 싶어요, 그래서 매일 열심히 공부하고 있어요.",
        "romaji": "Jeoneun hangug-eoreul yuchanghage malhago sip-eoyo, geuraeseo maeil yeolsimhi gongbuhago isseoyo.",
        "en": "I want to speak Korean fluently, so I'm studying hard every day.",
        "grammar_audio": "/audio/korean/grammar/s_하고_싶다_hago_sipda_Want_to_do_20250209_저는_한국어를_유창하게_말하고_싶어요_그래서_매일_열심히_공부하고_있어요.mp3"
      },
      {
        "kr": "내가 가장 좋아하는 가수의 콘서트에 가고 싶어요, 하지만 티켓을 구하기가 어려워요.",
        "romaji": "Naega gajang joahaneun gasuui konseoteue gago sip-eoyo, hajiman tikeseul guhagiga eolyeowoyo.",
        "en": "I want to go to my favorite singer's concert, but it's hard to get tickets.",
        "grammar_audio": "/audio/korean/grammar/s_하고_싶다_hago_sipda_Want_to_do_20250209_내가_가장_좋아하는_가수의_콘서트에_가고_싶어요_하지만_티켓을_구하기가_어려워요.mp3"
      },
      {
        "kr": "나는 운동을 많이 하고 싶지만, 너무 바빠서 시간이 없어요.",
        "romaji": "Naneun undong-eul mani hago sipjiman, neomu bappaseo sigan-i eobs-eoyo.",
        "en": "I want to exercise a lot, but I'm too busy and don't have time.",
        "grammar_audio": "/audio/korean/grammar/s_하고_싶다_hago_sipda_Want_to_do_20250209_나는_운동을_많이_하고_싶지만_너무_바빠서_시간이_없어요.mp3"
      },
      {
        "kr": "요리를 배우고 싶어요, 그래서 요리 수업에 등록을 생각하고 있어요.",
        "romaji": "Yorireul baeugo sip-eoyo, geuraeseo yori sueobe deungrogeul saenggaghago isseoyo.",
        "en": "I want to learn cooking, so I am thinking of registering for a cooking class.",
        "grammar_audio": "/audio/korean/grammar/s_하고_싶다_hago_sipda_Want_to_do_20250209_요리를_배우고_싶어요_그래서_요리_수업에_등록을_생각하고_있어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하기로 하다 [hakiro hada] (Decide to do)",
    "short_explanation": "Used to indicate that a decision about doing something has been made.",
    "long_explanation": "'하기로 하다' is used when you want to express that a decision to do something has been made. It can be a personal decision or a mutual decision made by a group. It translates to 'decide to do' in English, with the action indicated by the attached verb.",
    "formation": "Verb (stem) + 기로 하다",
    "examples": [
      {
        "kr": "우리는 휴가를 가기로 결정했습니다. 주말에 휴식을 취하러 해변에 가기로 했어요.",
        "romaji": "Urineun hyugareul gagiro gyeoljeonghaessseubnida. Jumalen hyusigeul chwihareo haebyeone gagiro haess-eoyo.",
        "en": "We decided to go on vacation. We decided to go to the beach for a rest on the weekend.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_하다_hakiro_hada_Decide_to_do_20250209_우리는_휴가를_가기로_결정했습니다_주말에_휴식을_취하러_해변에_가기로_했어요.mp3"
      },
      {
        "kr": "나는 영화를 보기로 결정했어. 오늘 밤에 집에서 미드를 보기로 했어.",
        "romaji": "Naneun yeonghwareul bogiro gyeoljeonghaesseo. Oneul bam-e jib-eseo mideureul bogilo haesseo.",
        "en": "I decided to watch a movie. I decided to watch a drama at home tonight.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_하다_hakiro_hada_Decide_to_do_20250209_나는_영화를_보기로_결정했어_오늘_밤에_집에서_미드를_보기로_했어.mp3"
      },
      {
        "kr": "그녀는 한국어를 배우기로 결정했습니다. 그녀는 올해 한국어 수업을 듣기로 했습니다.",
        "romaji": "Geunyeoneun hangugeoreul baeugiro gyeoljeonghaessseubnida. Geunyeoneun olhae hangugeo sueobeul deutgiro haessseubnida.",
        "en": "She decided to learn Korean. She decided to take Korean lessons this year.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_하다_hakiro_hada_Decide_to_do_20250209_그녀는_한국어를_배우기로_결정했습니다_그녀는_올해_한국어_수업을_듣기로_했습니다.mp3"
      },
      {
        "kr": "회사는 직원들에게 보너스를 주기로 결정했다. 고용주들은 내년에 직원들에게 연봉 인상을 주기로 결정했다.",
        "romaji": "Hoesaneun jikweondeul-ege bonuseu-reul jugiro gyeoljeonghaessda. Goyongjudeul-eun naenyeon-e jikwon-deul-ege yeonbong insang-eul jugiro gyeoljeonghaessda.",
        "en": "The company decided to give the employees a bonus. Employers decided to give employees a raise next year.",
        "grammar_audio": "/audio/korean/grammar/s_하기로_하다_hakiro_hada_Decide_to_do_20250209_회사는_직원들에게_보너스를_주기로_결정했다_고용주들은_내년에_직원들에게_연봉_인상을_주기로_결정했다.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하기는 하다 [hakineun hada] (Do to some extent)",
    "short_explanation": "Used to admit that something is done to some degree, but not fully or enthusiastically.",
    "long_explanation": "~하기는 하다 is a Korean grammar point used when someone does do something, but not completely, regularly, or with enthusiasm. It shows that an action occurs but implies some limit or deficiency in how ideally it is done.",
    "formation": "Verb-기 + 는 + 하다",
    "examples": [
      {
        "kr": "나는 요리하기는 하는데 맛있게 하는 건 아니예요.",
        "romaji": "Naneun yorihagineun haneunde masitge haneun geon aniyeyo.",
        "en": "I do cook, but it's not that I cook deliciously.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hakineun_hada_Do_to_some_extent_20250209_나는_요리하기는_하는데_맛있게_하는_건_아니예요.mp3"
      },
      {
        "kr": "그는 운전하기는 하는데 안전하게는 운전하지 않아요.",
        "romaji": "Geuneun unjeonhagineun haneunde anjeonhage-neun unjeonhaji anhayo.",
        "en": "He does drive, but he does not drive safely.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hakineun_hada_Do_to_some_extent_20250209_그는_운전하기는_하는데_안전하게는_운전하지_않아요.mp3"
      },
      {
        "kr": "어머니는 영어를 이해하기는 하지만 말하기는 좀 힘들어하세요.",
        "romaji": "Eomeonineun yeongeoreul ihaehagineun hajiman malhagineun jom himdeureohaseyo.",
        "en": "My mother does understand English, but she finds speaking it somewhat difficult.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hakineun_hada_Do_to_some_extent_20250209_어머니는_영어를_이해하기는_하지만_말하기는_좀_힘들어하세요.mp3"
      },
      {
        "kr": "나는 운동하기는 하는데 정기적으로 하지는 않아요.",
        "romaji": "Naneun undonghagineun haneunde jeongigjeogeuro hajineun anhayo.",
        "en": "I do exercise, but I don't do it regularly.",
        "grammar_audio": "/audio/korean/grammar/s_하기는_하다_hakineun_hada_Do_to_some_extent_20250209_나는_운동하기는_하는데_정기적으로_하지는_않아요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하기보다 [hakiboda] (Rather than doing)",
    "short_explanation": "Used to express preference or a better option; 'rather than'.",
    "long_explanation": "'~하기보다' is a grammar point used to indicate that one option is preferred over another. It is equivalent to 'rather than' in English and compares two alternatives to express the speaker's preference.",
    "formation": "Verb + 기보다 + (alternative action)",
    "examples": [
      {
        "kr": "강아지를 사 주는 것보다 입양하는 것을 추천드려요.",
        "romaji": "Gangajireul sa juneun geosboda ibyanghaneun geoseul chucheon deuryeoyo.",
        "en": "I recommend adopting a puppy rather than buying one.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hakiboda_Rather_than_doing_20250209_강아지를_사_주는_것보다_입양하는_것을_추천드려요.mp3"
      },
      {
        "kr": "택시를 타기보다는 버스를 타는 게 더 싸요.",
        "romaji": "Taeksireul tagibodaneun beoseureul taneun ge deo ssayo.",
        "en": "It's cheaper to take the bus rather than a taxi.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hakiboda_Rather_than_doing_20250209_택시를_타기보다는_버스를_타는_게_더_싸요.mp3"
      },
      {
        "kr": "많이 먹기보다는 품질 좋은 음식을 먹는 것이 더 중요해요.",
        "romaji": "Mani meokgibodaneun pumjil joheun eumsigeul meokneun geosi deo jungyohaeyo.",
        "en": "It's more important to eat good quality food rather than just eating a lot.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hakiboda_Rather_than_doing_20250209_많이_먹기보다는_품질_좋은_음식을_먹는_것이_더_중요해요.mp3"
      },
      {
        "kr": "친구에게 거짓말하기보다는 진실을 말하는 것이 낫다고 생각해요.",
        "romaji": "Chinguege geojismalhagibodaneun jinsireul malhaneun geosi nasdagosaenggakhaeyo.",
        "en": "I think it's better to tell the truth to a friend rather than lie.",
        "grammar_audio": "/audio/korean/grammar/s_하기보다_hakiboda_Rather_than_doing_20250209_친구에게_거짓말하기보다는_진실을_말하는_것이_낫다고_생각해요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하나 [hana] (But, however)",
    "short_explanation": "Used to express contrast or contradiction, similar to 'but' or 'however' in English.",
    "long_explanation": "'~하나' is a conjunction often used in Korean to indicate a contrast or contradiction between two ideas or situations. It introduces a contrary point of view or an exception to a previous statement, much like 'but' or 'however' in English.",
    "formation": "Clause + 하나 + Contrasting clause",
    "examples": [
      {
        "kr": "나는 그 일을 마친 줄 알았는데, 하나 사람들은 아직 끝내지 않았어요.",
        "romaji": "Naneun geu ireul machin jul aratneunde, hana saramdeureun ajik kkeutnaeji anatseoyo.",
        "en": "I thought I had finished the work; however, the people had not finished it yet.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_But_however_20250209_나는_그_일을_마친_줄_알았는데_하나_사람들은_아직_끝내지_않았어요.mp3"
      },
      {
        "kr": "그녀는 예쁜 것 같아요. 하나, 성격이 너무 나빠요.",
        "romaji": "Geunyeoneun yeppeun geot gatayo. Hana, seonggyeogi neomu nappayo.",
        "en": "She seems pretty, but her personality is very bad.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_But_however_20250209_그녀는_예쁜_것_같아요_하나_성격이_너무_나빠요.mp3"
      },
      {
        "kr": "이것은 어렵게 느껴질 수 있으나, 하나 연습하면 쉬워질 거예요.",
        "romaji": "Igeoseun eoryeopge neukkyeojil su isseuna, hana yeonseubhamyeon swiweojil geoyeyo.",
        "en": "This might seem difficult, however, it will become easier with practice.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_But_however_20250209_이것은_어렵게_느껴질_수_있으나_하나_연습하면_쉬워질_거예요.mp3"
      },
      {
        "kr": "우리는 집에 돌아가야 하는데, 하나 차가 없어서 걸어야 했어요.",
        "romaji": "Urineun jibe doragaya haneunde, hana chaga eopseoseo georeoya haesseoyo.",
        "en": "We needed to go home, but we had no car so we had to walk.",
        "grammar_audio": "/audio/korean/grammar/s_하나_hana_But_however_20250209_우리는_집에_돌아가야_하는데_하나_차가_없어서_걸어야_했어요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  },
  {
    "title": "~하면 할수록 [hamyeon halsurok] (The more... the more)",
    "short_explanation": "Used to express a proportional increase or decrease; 'the more... the more'.",
    "long_explanation": "'~하면 할수록' is a grammar structure used in Korean to illustrate that as one action or state increases (or decreases), another does so in proportion. It is similar to the English expression 'the more... the more'.",
    "formation": "Verb (or adjective) + 하면 할수록",
    "examples": [
      {
        "kr": "저는 한국어를 공부하면 할수록 더 재미있어지는 것 같아요, 한국의 문화와 역사를 더 이해할 수 있게 되니까.",
        "romaji": "Jeoneun hangugeoreul gongbuhamyeon halsurok deo jaemiisseojineun geot gatayo, hangukui munhwa wa yeoksareul deo ihaehal su itge doenikka.",
        "en": "The more I study Korean, the more fun it becomes, as I gain a deeper understanding of Korean culture and history.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_저는_한국어를_공부하면_할수록_더_재미있어지는_것_같아요_한국의_문화와_역사를_더_이해할_수_있게_되니까.mp3"
      },
      {
        "kr": "이 집안에서 책을 읽으면 읽을수록 더 많은 지식을 얻을 수 있어서 저는 항상 책을 읽는 것을 즐깁니다.",
        "romaji": "I jiban-eseo chaeg-eul ilgeumyeon ilgeulsurok deo manh-eun jisig-eul eod-eul su iss-eoseo jeoneun hangsang chaeg-eul ilgneun geos-eul jeulgibnida.",
        "en": "The more I read books in this house, the more knowledge I gain, which is why I always enjoy reading.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_이_집안에서_책을_읽으면_읽을수록_더_많은_지식을_얻을_수_있어서_저는_항상_책을_읽는_것을_즐깁니다.mp3"
      },
      {
        "kr": "요리를 하면 할수록 자신감이 더 생긴다, 그래서 나는 항상 새로운 레시피를 시도해본다.",
        "romaji": "Yorireul hamyeon halsurok jasin-gam-i deo saeng-ginda, geulaeseo naneun hangsang saeloun lesipileul sidohae-bonda.",
        "en": "The more I cook, the more confident I become, so I always try new recipes.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_요리를_하면_할수록_자신감이_더_생긴다_그래서_나는_항상_새로운_레시피를_시도해본다.mp3"
      },
      {
        "kr": "그녀와 함께 시간을 보내면 볼수록 그녀를 더 사랑하게 되는 거 같아요, 그녀의 성격이 정말 매력적이니까요.",
        "romaji": "Geunyeo-wa hamkke sigan-eul bonae-myeon bolsurok geunyeo-reul deo salang-hage doeneun geo gat-ayo, geunyeoui seonggyeog-i jeongmal maelyeogjeog-inikka-yo.",
        "en": "The more time I spend with her, the more I fall in love with her, because her personality is truly charming.",
        "grammar_audio": "/audio/korean/grammar/s_하면_할수록_hamyeon_halsurok_The_more_the_more_20250209_그녀와_함께_시간을_보내면_볼수록_그녀를_더_사랑하게_되는_거_같아요_그녀의_성격이_정말_매력적이니까요.mp3"
      }
    ],
    "p_tag": "KOREAN_4",
    "s_tag": "150"
  }
]